

#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПубликацияВебКабинета = Справочники.ПубликацииВебКабинетаСУ.ОсновнаяПубликация();	
	Файл = Параметры.Файл;
	
	Если ЗначениеЗаполнено(ПубликацияВебКабинета) И ЗначениеЗаполнено(Файл) Тогда
		СформироватьАдресСсылкиНаФайл();
	КонецЕсли;	
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ПубликацияВебКабинетаПриИзменении(Элемент)
	СформироватьАдресСсылкиНаФайл();
КонецПроцедуры

&НаКлиенте
Процедура ФайлПриИзменении(Элемент)
	СформироватьАдресСсылкиНаФайл();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура СформироватьАдресСсылкиНаФайл()
	
	АдресФайла = "";
	
	Если НЕ ЗначениеЗаполнено(ПубликацияВебКабинета) ИЛИ НЕ ЗначениеЗаполнено(Файл) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите публикацию веб-кабинета и файл, на который требуется получить ссылку'"));
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеПубликации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПубликацияВебКабинета, "АдресВебСервера, АдресКаталогаФайлов");
	
	ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайла(Файл);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВерсииФайлов.ПутьКФайлу КАК ПутьКФайлу,
	|	ВерсииФайлов.Том КАК Том
	|ИЗ
	|	Справочник.ВерсииФайлов КАК ВерсииФайлов
	|ГДЕ
	|	ВерсииФайлов.Ссылка = &Версия";
	
	Запрос.Параметры.Вставить("Версия", ДанныеФайла.Версия);
	
	ДанныеФайлаПутьКФайлу = "";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДанныеФайлаПутьКФайлу = Выборка.ПутьКФайлу;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеФайлаПутьКФайлу) Тогда 
	
		АдресФайла = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ДанныеПубликации.АдресВебСервера + ДанныеПубликации.АдресКаталогаФайлов);
		АдресФайла = АдресФайла + ДанныеФайлаПутьКФайлу;
		
		АдресФайла = ОбщегоНазначенияСУКлиентСервер.ПривестиСлэши(АдресФайла); 
		
	КонецЕсли;	
	
КонецПроцедуры



#КонецОбласти