
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("УпрощенныйРежим") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;

		Элемент = ДанныеВыбора.Добавить();
		Элемент.Значение = Перечисления.ВариантыЗагрузкиКартинокФайловСУЗ.Стандартные;
		Элемент.Представление = "Стандартные";
		
		Элемент = ДанныеВыбора.Добавить();
		Элемент.Значение = Перечисления.ВариантыЗагрузкиКартинокФайловСУЗ.Исходные;
		Элемент.Представление = "Исходные";
		
		Элемент = ДанныеВыбора.Добавить();
		Элемент.Значение = Перечисления.ВариантыЗагрузкиКартинокФайловСУЗ.УвеличиватьСтандартные;
		Элемент.Представление = "Увеличивать стандартные";
		
		Элемент = ДанныеВыбора.Добавить();
		Элемент.Значение = Перечисления.ВариантыЗагрузкиКартинокФайловСУЗ.РасширятьСтандартные;
		Элемент.Представление = "Расширять стандартные";
		
	КонецЕсли;
	
КонецПроцедуры
