#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбновитьДанныеВебКабинета(Пользователь, ДополнительныеДанные=Неопределено) Экспорт
	
	// Данная процедура вызывается из других объектов (не самостоятельно),
	// И не относится к конкретному объекту данных.
	
	УстановитьПривилегированныйРежим(Истина);
		
	ТаблицаПреподавателей = ВсеПреподавателиПользователя(Пользователь);
	ПреподавателиПользователя = Новый Массив;
	Для каждого СтрокаТП Из ТаблицаПреподавателей Цикл
		ПреподавателиПользователя.Добавить(ВебКабинетСУО.ПользовательСтруктура(СтрокаТП.Преподаватель, СтрокаТП.Наименование));
	КонецЦикла;
	
	// Записываем данные
	//
	
	РегистрыСведений.ДанныеВебКабинетаСУО_ПН.ДобавитьДанные(
		Пользователь,
		Перечисления.ТипыДанныхВебКабинетаСУО.ПреподавателиПользователя,
		Перечисления.ТипыДанныхВебКабинетаСУО.ПреподавателиПользователя,
		ОбщегоНазначенияСУ.ДанныеВJSON(ПреподавателиПользователя),
		Перечисления.ФорматыВебДанныхСУ.json);		
		
	
КонецПроцедуры

Функция ВсеПреподавателиПользователя(Пользователь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПреподавателиОбученияСУО.Преподаватель КАК Преподаватель,
		|	ПреподавателиОбученияСУО.Преподаватель.Наименование КАК Наименование
		|ИЗ
		|	РегистрСведений.УчастникиОбученияСУО КАК УчастникиОбученияСУО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПреподавателиОбученияСУО КАК ПреподавателиОбученияСУО
		|		ПО УчастникиОбученияСУО.ПроведениеОбучения = ПреподавателиОбученияСУО.ПроведениеОбучения
		|			И УчастникиОбученияСУО.Сценарий = ПреподавателиОбученияСУО.Сценарий
		|ГДЕ
		|	УчастникиОбученияСУО.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

#КонецЕсли	
