
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ОбменДанными.Загрузка Тогда
		
		Если НЕ ЗначениеЗаполнено(ТерминГлоссария) Тогда
			Текст = НСтр("ru = 'Не выбран термин глоссария'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
			Возврат;
		КонецЕсли;
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	СодержаниеГлоссарияСУЗ.Ссылка
		|ИЗ
		|	Справочник.СодержаниеГлоссарияСУЗ КАК СодержаниеГлоссарияСУЗ
		|ГДЕ
		|	СодержаниеГлоссарияСУЗ.ТерминГлоссария = &Термин И ";
		
		Если НЕ ЭтоНовый() Тогда
			ТекстЗапроса = ТекстЗапроса + "СодержаниеГлоссарияСУЗ.Ссылка <> &ЭтотЭлемент И ";
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + "СодержаниеГлоссарияСУЗ.Владелец = &Владелец";
		
		Запрос = Новый Запрос(ТекстЗапроса);

		Если НЕ ЭтоНовый() Тогда
			Запрос.УстановитьПараметр("ЭтотЭлемент", ЭтотОбъект.Ссылка); 
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Термин", ТерминГлоссария); 
		Запрос.УстановитьПараметр("Владелец", Владелец); 
		
		КоличествоТерминов = Запрос.Выполнить().Выбрать().Количество();
		
		Если КоличествоТерминов > 0 Тогда
			Текст = НСтр("ru = 'Добавляемый термин уже содержится в глоссарии'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
