Функция Ведомость(ПроведениеОбучения, Сценарий) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчастникиОбученияСУО.Статус КАК Статус,
		|	УчастникиОбученияСУО.Баллы КАК Баллы,
		|	ВЫБОР
		|		КОГДА УчастникиОбученияСУО.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПрохожденияОбъектовСУО.Завершил)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Пройдено,
		|	УчастникиОбученияСУО.Пользователь КАК Пользователь,
		|	УчастникиОбученияСУО.ШкалаОценки КАК ШкалаОценки,
		|	ВЫБОР
		|		КОГДА ИСТИНА
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ЭлементыШкалыОценокСУО.ПустаяСсылка)
		|	КОНЕЦ КАК ИтоговаяОценка,
		|	УчастникиОбученияСУО.Регистратор КАК Прохождение,
		|	УчастникиОбученияСУО.КомментарийПреподавателя,
		|	ВЫБОР
		|		КОГДА УчастникиОбученияСУО.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПрохожденияОбъектовСУО.Завершил)
		|			ТОГДА 1
		|		КОГДА УчастникиОбученияСУО.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПрохожденияОбъектовСУО.Автомат)
		|			ТОГДА 1
		|		КОГДА УчастникиОбученияСУО.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПрохожденияОбъектовСУО.НеЗавершил)
		|			ТОГДА 0
		|		КОГДА УчастникиОбученияСУО.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПрохожденияОбъектовСУО.НеДопущен)
		|			ТОГДА 0
		|		КОГДА УчастникиОбученияСУО.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПрохожденияОбъектовСУО.Проходит)
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК Картинка,
		|	УчастникиОбученияСУО.Пользователь.Наименование КАК ПолноеИмяПользователя,
		|	УчастникиОбученияСУО.ПроверяетсяПреподавателем,
		|	УчастникиОбученияСУО.ПроверенПреподавателем
		|ИЗ
		|	РегистрСведений.УчастникиОбученияСУО КАК УчастникиОбученияСУО
		|ГДЕ
		|	УчастникиОбученияСУО.ПроведениеОбучения = &ПроведениеОбучения
		|	И УчастникиОбученияСУО.Сценарий = &Мероприятие
		|
		|УПОРЯДОЧИТЬ ПО
		|	Пользователь";
		
	Запрос.УстановитьПараметр("Мероприятие", Сценарий);
	Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);

	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить(); 
	
КонецФункции

