
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтоЭкзаменатор = ПолучитьФункциональнуюОпцию("ЭкзаменаторЭР");
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Найти(НавигационнаяСсылкаФорматированнойСтроки, "#НастройкиВебСервера") > 0 Тогда
		ОткрытьФорму("ОбщаяФорма.НастройкиВебСервераСУ");
	КонецЕсли;
	Если Найти(НавигационнаяСсылкаФорматированнойСтроки, "#РасширениеКадры") > 0 Тогда
		ПолучитьФайл(ПолучитьАдресХраненияРасширения("РасширениеКадры3"), "КадрыИЭлектронноеОбучение.cfe", Истина);
	КонецЕсли;	
	Если Найти(НавигационнаяСсылкаФорматированнойСтроки, "#РасширениеУправлениеПерсоналом") > 0 Тогда
		ПолучитьФайл(ПолучитьАдресХраненияРасширения("РасширениеУправлениеПерсоналом3"), "УправлениеПерсоналомИЭлектронноеОбучение.cfe", Истина);
	КонецЕсли;		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ВыбратьERP(Команда)
	ПерейтиКИнструкции("ERP Управление предприятием, редакция 2", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗУП(Команда)
	ПерейтиКИнструкции("Зарплата и управление персоналом, редакция 3", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗУП_КОРП(Команда)
	ПерейтиКИнструкции("Зарплата и управление персоналом КОРП, редакция 3", Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗКГУ_КОРП(Команда)
	ПерейтиКИнструкции("Зарплата и кадры государственного учреждения КОРП, редакция 3", Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗКГУ(Команда)
	ПерейтиКИнструкции("Зарплата и кадры государственного учреждения, редакция 3", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеВручную(Команда)
				
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьДанныеВручнуюПродолжение", ЭтотОбъект);
	НачатьПомещениеФайла(ОписаниеОповещения,,, Истина, УникальныйИдентификатор);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеВручнуюПродолжение(Результат, АдресФайла, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт

	Если НЕ Результат Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураИмениФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ВыбранноеИмяФайла);	
	Если НРег(СтруктураИмениФайла.Расширение) <> ".bin" Тогда
		ВызватьИсключение НСтр("ru = 'Загрузите файл с расширением bin'");
	КонецЕсли;	
	
	ЗагрузитьДанныеВручнуюНаСервере(АдресФайла);
	
	ПоказатьПредупреждение(,НСтр("ru = 'Данные успешно загружены'"));
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ПерейтиКИнструкции(ИмяКонфигурации, ЕстьУправлениеПерсоналом)
	УстановитьИменаКонфигураций(ИмяКонфигурации, ЕстьУправлениеПерсоналом);
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаИнструкция;
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресХраненияРасширения(ИмяМакета)	
	ДвоичныеДанные = Обработки.ИмпортСотрудниковСУО.ПолучитьМакет(ИмяМакета);	
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);	
КонецФункции

&НаСервере
Процедура УстановитьИменаКонфигураций(Знач ИмяВыбраннойКонфигурации, Знач ЕстьУправлениеПерсоналом)
	
	Строка1_1 = "1. Опубликуйте на веб-сервере информационную базу «";
	Строка1_2 = Метаданные.Синоним;
	Строка1_3 = "», в которой сейчас находитесь, с HTTP-сервисом «Пользователи» и ";
	Строка1_4 = Новый ФорматированнаяСтрока("проверьте",,,,"#НастройкиВебСервера");
	Строка1_5 = " правильность настройки.";
	
	Элементы.Декорация1.Заголовок = Новый ФорматированнаяСтрока(Строка1_1, Строка1_2, Строка1_3, Строка1_4, Строка1_5);
	
	Строка2_1 = "2. ";
	Строка2_2 = Новый ФорматированнаяСтрока("Загрузите",,,,"#РасширениеКадры");
	Строка2_3 = " и подключите расширение конфигурации в информационной базе «";
	Строка2_4 = ИмяВыбраннойКонфигурации;
	Строка2_5 = "». Перезапустите программу. Перейдите в панель настройки при помощи команды «Администрирование -> Обмен с 1С:Электронное обучение». Настройте соединение и расписание обмена с базой «";
	Строка2_6 = Метаданные.Синоним;
	Строка2_7 = "», которую вы опубликовали на первом шаге. Скопируйте ключ доступа в буфер обмена.";

	Элементы.Декорация2.Заголовок = Новый ФорматированнаяСтрока(
		Строка2_1, Строка2_2, Строка2_3, Строка2_4, Строка2_5, Строка2_6, Строка2_7);
	
	Строка3_1 = "3. ";
	Строка3_2 = Новый ФорматированнаяСтрока("Укажите",,,,"#НастройкиВебСервера");
	Строка3_3 = " ключ доступа, который скопировали на предыдущем шаге, на форме «Настройки веб-сервера» информационной базы «";
	Строка3_4 = Метаданные.Синоним;
	Строка3_5 = "» при помощи команды «Установить ключ доступа для загрузки пользователей».";

	Элементы.Декорация3.Заголовок = Новый ФорматированнаяСтрока(Строка3_1, Строка3_2, Строка3_3, Строка3_4, Строка3_5);		
	
	Строка4_1 = "4. Необязательный шаг. Если объем данных для обмена достаточно велик, то первый раз выполните их перенос вручную посредством файла. Войдите в форму настройки соединения и при помощи команды «Выгрузить данные в файл» сформируйте файл с данными. Воспользуйтесь командой «Загрузить начальные данные из файла» в этой форме для загрузки данных.";
	
	Элементы.Декорация4.Заголовок = Новый ФорматированнаяСтрока(Строка4_1);	
	
	Если ЕстьУправлениеПерсоналом И НЕ ЭтоЭкзаменатор Тогда
		
		Элементы.Декорация5.Видимость = Истина;
		
		Строка5_1 = "5. Необязательный шаг. Для интеграции настроек обучения ";
		Строка5_2 = Новый ФорматированнаяСтрока("загрузите",,,,"#РасширениеУправлениеПерсоналом");
		Строка5_3 = " и подключите второе расширение конфигурации в информационной базе «";
		Строка5_4 = ИмяВыбраннойКонфигурации;
		Строка5_5 = "». Перезапустите программу. ";
		Строка5_6 = Новый ФорматированнаяСтрока("Укажите",,,,"#НастройкиВебСервера");
		Строка5_7 = " ключ доступа, который скопировали на шаге 2, на форме «Настройки веб-сервера» информационной базы «";
		Строка5_8 = Метаданные.Синоним;
		Строка5_9 = "» при помощи команды «Установить ключ доступа для выгрузки результатов обучения».";		

		Элементы.Декорация5.Заголовок = Новый ФорматированнаяСтрока(
			Строка5_1, Строка5_2, Строка5_3, Строка5_4, Строка5_5, Строка5_6, Строка5_7, Строка5_8, Строка5_9);
		
	Иначе
		
		Элементы.Декорация5.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеВручнуюНаСервере(АдресФайлаВоВременномХранилище)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
	ДанныеСтрока = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанные);	
	УправлениеОбучениемСУО.ЗагрузитьПользователей(ДанныеСтрока);	
	
КонецПроцедуры


#КонецОбласти


