////////////////////////////////////////////////////////////////////////////////
// ОБЩЕЕ ДЛЯ ФОРМ

// Вызывает диалог перед добавлением элемента подчиненного справочника,
// если основной элемент не записан.
//
Процедура ПередДобавлениемЭлементаПодчиненногоСправочника(Форма, Отказ, ПроверитьМодифицированность = Ложь) Экспорт
	
	Если Форма.Объект.Ссылка.Пустая() ИЛИ (ПроверитьМодифицированность И Форма.Модифицированность) Тогда
		
		Отказ = Истина;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПередДобавлениемЭлементаПодчиненногоСправочникаПродолжение", ЭтотОбъект, Форма);
		
		ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
		|Действие можно выполнить только после записи данных.
		|Выполнить запись?'", "ru");
		
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередДобавлениемЭлементаПодчиненногоСправочникаПродолжение(Результат, Форма) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Форма.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Обрабатывает событие выбора элемента подчиненного справочника
//
Процедура ПередВыборомЭлементаПодчиненногоСправочника(Форма, СтандартнаяОбработка) Экспорт
	
	Отказ = Ложь;
	
	ПередДобавлениемЭлементаПодчиненногоСправочника(Форма, Отказ, Истина);
	
	Если Отказ Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает форму из которой была открыта форма (владельца).
//
Функция	НайтиВладельцаУправляемойФормы(ВладелецФормы, ИмяФормы = Неопределено) Экспорт
	
	Если ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = Тип("УправляемаяФорма") Тогда
		Если (ЗначениеЗаполнено(ИмяФормы) И ИмяФормы = ВладелецФормы.ИмяФормы) ИЛИ НЕ ЗначениеЗаполнено(ИмяФормы) Тогда
			Возврат ВладелецФормы;
		Иначе
			Возврат НайтиВладельцаУправляемойФормы(ВладелецФормы.ВладелецФормы, ИмяФормы); // Рекурсивный вызов
		КонецЕсли;
	Иначе
		Возврат НайтиВладельцаУправляемойФормы(ВладелецФормы.Родитель, ИмяФормы); // Рекурсивный вызов
	КонецЕсли;
	
КонецФункции

// Определяет, можно ли обращаться к данным текущей строки таблицы.
//
Функция ТекущиеДанныеТаблицыДоступны(ТекущиеДанные) Экспорт
	
	Если ТекущиеДанные = Неопределено
		ИЛИ ТекущиеДанные.Свойство("ГруппировкаСтроки") Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ОткрытьЗначениеВФорме(Знач Значение, Знач ПараметрыФормы = Неопределено, Знач Владелец = Неопределено, Знач ОписаниеОповещения = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТаблицы = ОбщегоНазначенияСУВызовСервера.ИмяТаблицыПоСсылке(Значение);
	
	Если ПараметрыФормы = Неопределено Тогда
		ПараметрыФормы = Новый Структура();
	КонецЕсли;
	
	ПараметрыФормы.Вставить("Ключ", Значение);
	
	ОткрытьФорму(ИмяТаблицы + ".ФормаОбъекта", ПараметрыФормы, Владелец,,,, ОписаниеОповещения);
	
КонецПроцедуры

Функция ВыделеннаяГруппаТаблицы(ТаблицаФормы) Экспорт
	
	ТекущиеДанные = ТаблицаФормы.ТекущиеДанные; 
	
	Если ОбщегоНазначенияСУКлиент.ТекущиеДанныеТаблицыДоступны(ТекущиеДанные) И ТекущиеДанные.Свойство("ЭтоГруппа") Тогда
		
		Если ТекущиеДанные.ЭтоГруппа Тогда 
			Группа = ТекущиеДанные.Ссылка;
		Иначе 
			Группа = ТекущиеДанные.Родитель;
		КонецЕсли;
		
	Иначе
		
		Группа = Неопределено
		
	КонецЕсли;
	
	Возврат Группа;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБЩЕЕ ДЛЯ ФОРМ РЕАЛИЗУЮЩИХ ЗАГРУЗКУ ВНЕШНИХ HTML ДАННЫХ

// Исполняет скрипт в браузере.
//
Функция ВыполнитьСкрипт(Документ, ТекстСкрипта, Браузер) Экспорт
	
		Если Документ = NULL ИЛИ Документ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Браузер) Тогда
		Текст = НСтр("ru = 'Браузер не определен'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЭтоВстроенныйWeKit(Браузер) Тогда
		
		Скрипт = Документ.createElement("script");
		Скрипт.setAttribute("type", "text/javascript");
		TextNode = Документ.createTextNode(ТекстСкрипта);
		Скрипт.appendChild(TextNode);
			
		head = Документ.getElementsByTagName("head");
		head["0"].appendChild(Скрипт);		
		
	Иначе
		
		Если Браузер = "msie" Тогда
			ИмяОкна = "parentWindow";
		Иначе
			ИмяОкна = "defaultView";
		КонецЕсли;
		
		Возврат Документ[ИмяОкна].eval(ТекстСкрипта);		
		
	КонецЕсли;
	
КонецФункции

Функция ЭтоВстроенныйWeKit(Браузер) Экспорт
	
	#Если НЕ ВебКлиент Тогда
	Если Браузер = "other" Тогда
		Возврат Истина;
	КонецЕсли;
	#КонецЕсли
	
	Возврат Ложь;
	
КонецФункции

Функция ИмяДокумента(Документ, Браузер) Экспорт
	
	Если Документ = NULL ИЛИ Документ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Браузер) Тогда
		Текст = НСтр("ru = 'Браузер не определен'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат Неопределено;
	КонецЕсли;
	
	Если Браузер = "msie" Тогда
		ИмяОкна = "parentWindow";
	Иначе
		ИмяОкна = "defaultView";
	КонецЕсли;
	
	ИмяДокумента = Неопределено;
	
	Попытка
		ИмяДокумента = Документ[ИмяОкна].eval("name");
	Исключение
	КонецПопытки;
	
	Если ИмяДокумента = Неопределено Тогда
		ИмяДокумента = Документ[ИмяОкна].name;	
	КонецЕсли;
	
	Если ИмяДокумента = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Невозможно определить имя окна HTML страницы'");
	КонецЕсли;
	
	Возврат ИмяДокумента;
	
КонецФункции

// Возвращает данные команды, выполненной пользователем в браузере.
//
Функция ПолучитьДанныеКоманды(Документ, Браузер) Экспорт
	
	Если Документ = NULL ИЛИ Документ = Неопределено ИЛИ Документ.location.href = "about:blank" Тогда
		Возврат Неопределено;
	КонецЕсли;	

	ИмяФрейма = ""; // Для обратной совместимости (Не используется)
		
	Если ЭтоВстроенныйWeKit(Браузер) Тогда
		
		oClient = Документ.defaultView["oClient"];

		Если oClient = Неопределено И 
			Документ.defaultView.parent <> Неопределено 
			И Документ.defaultView.parent <> NULL Тогда

			oClient = Документ.defaultView.parent["oClient"];			

		КонецЕсли;

		Если oClient = Неопределено ИЛИ oClient = NULL Тогда
			Возврат Неопределено;
		КонецЕсли;		

		Если oClient.oDataEvent.execute Тогда
			Возврат Неопределено;
		КонецЕсли;

		ИмяСобытия = oClient.oDataEvent.name;
		ПараметрыСобытия = oClient.oDataEvent.param;
		oClient.oDataEvent.execute = Истина; // Предотвращает повторную обработку команды.
		
	Иначе		
		
		ИмяКонтейнераДанных = ?(НЕ ПустаяСтрока(ИмяФрейма), ИмяФрейма+".", "")+"oClient.oDataEvent";
		
		СобытиеВыполнено = ВыполнитьСкрипт(Документ, ИмяКонтейнераДанных+".execute", Браузер);
		
		Если ТипЗнч(СобытиеВыполнено) <> Тип("Булево") ИЛИ СобытиеВыполнено Тогда
			Возврат Неопределено;
		Иначе
			ТекстСкрипта  = ИмяКонтейнераДанных + ".execute = true;";
			ВыполнитьСкрипт(Документ, ТекстСкрипта, Браузер); // Предотвращает повторную обработку команды.
		КонецЕсли;
		
		ИмяСобытия       = ВыполнитьСкрипт(Документ, ИмяКонтейнераДанных + ".name", Браузер);
		ПараметрыСобытия = ВыполнитьСкрипт(Документ, ИмяКонтейнераДанных + ".param", Браузер);
		
	КонецЕсли;

	СтруктураДанных = Новый Структура("Команда, Параметры, ИмяФрейма, Браузер", ИмяСобытия, ПараметрыСобытия, ИмяФрейма, Браузер);
	
	Возврат СтруктураДанных;
	
КонецФункции
 
// Определяет браузер пользователя
//
Процедура ОпределитьБраузер(Форма, Документ) Экспорт
		
	Если Документ = NULL ИЛИ Документ = Неопределено ИЛИ Документ.location.href = "about:blank" Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Форма.Браузер) Тогда // Определяем только один раз
			
		Попытка
			
			Документ.parentWindow.eval("void(0);");
			Форма.Браузер = "msie";
			
		Исключение
			
			Форма.Браузер = "other";
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

// Вставляет HTML данные в тело документа
//
Процедура ВставитьДанныеВТелоДокумента(Документ, Браузер, Данные) Экспорт
	
	Если Документ = NULL ИЛИ Документ = Неопределено ИЛИ Документ.location.href = "about:blank" Тогда
		Возврат;
	КонецЕсли;
	
	ДокументКонтейнер = Документ;
	
	Если ДокументКонтейнер <> Неопределено И ДокументКонтейнер.body <> Неопределено Тогда
		ДокументКонтейнер.body.innerHTML = Данные;
	КонецЕсли;
	
КонецПроцедуры

// Позволяет переопределить обработчики событий во всех ссылках документа
// для успешной их обработки при нажатии пользователя.
//
Процедура ОбработатьСсылкиДокумента(Документ, Браузер) Экспорт
	
	Если Документ = NULL ИЛИ Документ = Неопределено ИЛИ Документ.location.href = "about:blank" Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФрейма = ""; // Не используется

    ТекстСкрипта = "if (typeof("+?(НЕ ПустаяСтрока(ИмяФрейма), ИмяФрейма+".", "")+"oClient) == 'object') {
	               |"+?(НЕ ПустаяСтрока(ИмяФрейма), ИмяФрейма+".", "")+"oClient.processLinks();
	               |};";

	ВыполнитьСкрипт(Документ, ТекстСкрипта, Браузер);
	
КонецПроцедуры

// Вставляет стили в страницу.
//
Процедура ВставитьСтили(Документ, Браузер, ТекстСтилей) Экспорт
	
	Если Документ = NULL ИЛИ Документ = Неопределено ИЛИ Документ.location.href = "about:blank" Тогда
		Возврат;
	КонецЕсли;
	
	// Вставляем стили 
	
	ДокументКонтейнер = Документ;	
	
	Если Браузер = "msie" Тогда
		
		РазместитьСтилиПоСтандарту = Ложь;
		
		Стили = ДокументКонтейнер.getElementById("stylesObject");
		
		Попытка
			Стили.styleSheet.cssText = ТекстСтилей;
		Исключение
			
			РазместитьСтилиПоСтандарту = Истина;
			
		КонецПопытки;
		
	Иначе
		
		РазместитьСтилиПоСтандарту = Истина;
		
	КонецЕсли;
		
	Если РазместитьСтилиПоСтандарту Тогда
		
		ИмяФрейма = ""; // Не используется
		
		// Очищаем следы ранее установленных стилей.
			
		ТекстСкрипта = ?(НЕ ПустаяСтрока(ИмяФрейма), ИмяФрейма+".", "")+"oClient.removeStyles();";
		ВыполнитьСкрипт(Документ, ТекстСкрипта, Браузер);
		
		Стили = ДокументКонтейнер.createElement("style");
		Стили.setAttribute("type", "text/css");
		TextNode = ДокументКонтейнер.createTextNode(ТекстСтилей);
		Стили.appendChild(TextNode);
			
		head = ДокументКонтейнер.getElementsByTagName("head");
		head["0"].appendChild(Стили);
		
	КонецЕсли;

	
КонецПроцедуры

// Выполняет скрипт на странице.
//
Процедура ВставитьСкрипты(Документ, Браузер, ТекстСкрипта) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТекстСкрипта) ИЛИ Документ = NULL ИЛИ Документ = Неопределено ИЛИ Документ.location.href = "about:blank" Тогда
		Возврат;
	КонецЕсли;
	
	ДокументКонтейнер = Документ;
	
	Если ДокументКонтейнер.body.firstChild = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Скрипт = ДокументКонтейнер.createElement("script");
	Скрипт.type = "text/javascript";
	
	Если Браузер = "msie" Тогда
		Скрипт.text = ТекстСкрипта;	
	Иначе
		TextNode = ДокументКонтейнер.createTextNode(ТекстСкрипта);
		Скрипт.appendChild(TextNode);
	КонецЕсли;
	
	// Use insertBefore instead of appendChild  to circumvent an IE6 bug.
	// This arises when a base node is used (#2709).
	ДокументКонтейнер.body.insertBefore(Скрипт, ДокументКонтейнер.body.firstChild);
	ДокументКонтейнер.body.removeChild(Скрипт);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБЩЕЕ ДЛЯ ПЛАТФОРМЫ

// Определение каталога AppData текущего пользователя Windows.
//
Функция КаталогAppData() Экспорт 
	
	КаталогаAppData = "";
	
	#Если НЕ ВебКлиент Тогда
		
	СистемнаяИнформация = Новый СистемнаяИнформация();
		
	Если (СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86) Или (СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64) Тогда
			
		Попытка 
			WSHShell = new COMОбъект("WScript.Shell");
			КаталогаAppData = WshShell.SpecialFolders.Item("AppData");
		Исключение
			Возврат Неопределено;
		КонецПопытки;
		
		Возврат ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(КаталогаAppData);	
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;	
		
	#Иначе
		
	Возврат Неопределено;
		
	#КонецЕсли
	
КонецФункции 

Функция КаталогиШаблоновКонфигураций(Знач КаталогаAppData=Неопределено) Экспорт
	
	МассивПутей = Новый Массив;
	
	Если КаталогаAppData = Неопределено Тогда
		
		КаталогаAppData = КаталогAppData();
		
		Если КаталогаAppData = Неопределено Тогда
			Возврат МассивПутей;
		КонецЕсли;		
		
	КонецЕсли;	
	
	#Если НЕ ВебКлиент Тогда
	
	// Добавляем каталоги с курсами из шаблонов конфигураций
	
	ПутьКФайлуV8Cfg = КаталогаAppData + "1C\1CEStart\1CEStart.cfg";
	
	ФайлV8Cfg = Новый Файл(ПутьКФайлуV8Cfg);
	
	Если НЕ ФайлV8Cfg.Существует() Тогда
		Возврат МассивПутей;
	КонецЕсли;

	ДокументV8Cfg = Новый ТекстовыйДокумент;
	ДокументV8Cfg.Прочитать(ФайлV8Cfg.ПолноеИмя);
	КоличествоСтрок = ДокументV8Cfg.КоличествоСтрок();
	
	Для НомерСтроки=1 По КоличествоСтрок Цикл
		
		ТекущаяСтрока = ДокументV8Cfg.ПолучитьСтроку(НомерСтроки);
		
		ТекСтрокаМассив = ОбщегоНазначенияСУКлиентСервер.РасщепитьСтроку(ТекущаяСтрока, "=");
		
		Если ТекСтрокаМассив.Количество() <> 2 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекСтрокаМассив[0] = "ConfigurationTemplatesLocation" Тогда
						
			ПутьККаталогуШаблонов = ТекСтрокаМассив[1];
			ПутьККаталогуШаблонов = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуШаблонов);
			ПутьККаталогуШаблонов = СтрЗаменить(ПутьККаталогуШаблонов, "file://", "");

			ФайлКаталогШаблонов = Новый Файл(ПутьККаталогуШаблонов);
			
			Если ФайлКаталогШаблонов.Существует() и ФайлКаталогШаблонов.ЭтоКаталог() Тогда
				МассивПутей.Добавить(ПутьККаталогуШаблонов);
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат МассивПутей;
	
	#Иначе
		
	Возврат МассивПутей;
		
	#КонецЕсли

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// РАБОТА С COM

Функция ПриложениеCOMДоступно(ПриложениеCOM) Экспорт
	
	Если ПриложениеCOM = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	ВерсияПриложения = Неопределено;
	
	Попытка
		ВерсияПриложения = ПриложениеCOM.Version;
	Исключение			
	КонецПопытки;
	
	Возврат ?(ВерсияПриложения = Неопределено, Ложь, Истина);
	
КонецФункции
