
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Интерактивное создание документа не поддерживается'"),,,,Отказ);
	КонецЕсли;
	
	ВидОбучения = Документы.ПроведениеОбученияСУО.ВидОбучения(Объект.ПроведениеОбучения, Объект.Сценарий);
	
	СтатусПроцессаОбучения = Документы.ПрохождениеОбученияСУО.СтатусПроцессаОбучения(Объект.Ссылка);
	
	Элементы.УчебнаяГруппа.Видимость = ЗначениеЗаполнено(Объект.УчебнаяГруппа);
	Элементы.Заявка.Видимость = ЗначениеЗаполнено(Объект.Заявка);
	Элементы.ПрохождениеПрограммыОбучения.Видимость = ЗначениеЗаполнено(Объект.ПрохождениеПрограммыОбучения);	
	Элементы.СтраницаПреподаватель.Видимость = ВидОбучения.ТребуетсяПреподаватель;
	Элементы.ГруппаДатаПрохождения.Видимость = ?(ЗначениеЗаполнено(Объект.ДатаНачалаПрохождения) И ЗначениеЗаполнено(Объект.ДатаОкончанияПрохождения), Истина, Ложь);
	Элементы.ГруппаРезультат.Видимость = Объект.ВыставляетсяОценка;
	Элементы.Баллы.Видимость = ?(СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.Окончено
		ИЛИ СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.ОконченоАвтоматом, Истина, Ложь);	
	Элементы.Оценка.Видимость = ?(СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.Окончено
		ИЛИ СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.ОконченоАвтоматом, Истина, Ложь);	
	
	Оценка = УправлениеОбучениемСУОПовтИсп.ОценкаИзБаллов(Объект.Баллы, Документы.ПроведениеОбученияСУО.ШкалаОценки(Объект.ПроведениеОбучения));
	
	ЭтоПолныйИнтерфейс = ПолучитьФункциональнуюОпцию("ПолныйИнтерфейсСУО");
	
	Если НЕ ЭтоПолныйИнтерфейс Тогда
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(ЭтотОбъект, "ГруппаПроверка", Ложь);
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
	    ОбновитьЭлементыДополнительныхРеквизитов();
	    УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
 
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства
#КонецОбласти
