#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
	Если Общее И Электронное Тогда
		
		Текст = НСтр("ru = 'Флажок ""Используются электронные задания"" не может быть установлена для общего обучения'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);			
		
	КонецЕсли;
		
	Если НЕ Общее И НЕ Электронное И ВыставляетсяОценка И НЕ ТребуетсяПреподаватель Тогда
		
		Текст = НСтр("ru = 'Установите флажок ""Требуется преподаватель"". Выставить оценку за подобное обучение сможет только преподаватель'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);			
		
	КонецЕсли;
	
	Если НЕ ТребуетсяПреподаватель И НЕ ЗавершатьАвтоматически И НЕ ЗавершаетУчащийся Тогда
		
		Текст = НСтр("ru = 'Если не требуется преподаватель, то установите флажок ""Завершать автоматически"" или ""Завершает участник""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);			
		
	КонецЕсли;	
	
	Если НЕ ТребуетсяПреподаватель И ЗаданияПроверяютсяВыборочно Тогда
		
		Текст = НСтр("ru = 'Если не требуется преподаватель, то снимите флажок ""Задания проверяются выборочно""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);			
		
	КонецЕсли;
	
	Если ЗавершаетУчащийся И ЗавершатьАвтоматически Тогда
		
		Текст = НСтр("ru = 'Нельзя одновременно установить флажки ""Завершать автоматически"" и ""Завершает участник""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);			
		
	КонецЕсли;	
	
	Если ЗавершатьАвтоматически И НЕ Электронное И НЕ Общее Тогда
		
		Текст = НСтр("ru = 'Нельзя установить флажок ""Завершать автоматически"", если не установлен флажок ""Используются электронные задания""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);			
		
	КонецЕсли;	
		
	Если ЗавершаетУчащийся И ЗначениеЗаполнено(МинимальныйПрогрессЗавершенияУчащимся) И НЕ Электронное Тогда
		
		Текст = НСтр("ru = 'Нельзя указать ""Минимальный прогресс"", если не установлен флажок ""Используются электронные задания""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);		
		
	КонецЕсли;
	
	Если ЗавершаетУчащийся И ЗначениеЗаполнено(МинимальныйБаллЗавершенияУчащимся) И НЕ Электронное Тогда
		
		Текст = НСтр("ru = ''Нельзя указать ""Минимальный балл"", если не установлен флажок ""Используются электронные задания""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);		
		
	КонецЕсли;
	
	
	Если КоличествоФайловДляЗавершенияУчастником > 0 И НЕ РазрешитьУчащимсяПрикреплятьФайлы Тогда
		
		Текст = НСтр("ru = 'Нельзя указать ""Количество файлов"", если не установлен флажок ""Разрешить прикреплять файлы""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);		
		
	КонецЕсли;
		
	Если Электронное И РазрешитьУчащимсяПрикреплятьФайлы Тогда
		Текст = НСтр("ru = 'Нельзя установить флажок ""Разрешить прикреплять файлы"", если установлен флажок ""Используются электронные задания"". Обучающийся сможет прикреплять файлы к заданиям, а не к обучению в целом'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);				
	КонецЕсли;	
	
	Если НЕ Электронное И ПоказыватьПодробныеСведенияОЗадании Тогда
		Текст = НСтр("ru = 'Нельзя установить флажок ""Показывать подробные сведения о задании"", если не установлен флажок ""Используются электронные задания""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);				
	КонецЕсли;	
	
	Если НЕ ВыставляетсяОценка И ПоказыватьТекущуюОценку Тогда
		Текст = НСтр("ru = 'Нельзя установить флажок ""Показывать текущую оценку"", если не установлен флажок ""Выставляется оценка""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);				
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюВидаОбъекта(ЭтотОбъект, "Документ_ПрохождениеОбученияСУО");
	// Конец СтандартныеПодсистемы.Свойства
	
	Если НЕ ВыставляетсяОценка Тогда
		ШкалаОценки = Неопределено;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ИзмениласьШкалаОценки", Ложь);
	
	Если НЕ Ссылка.Пустая() Тогда
		СтараяШкала = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ШкалаОценки");
		Если СтараяШкала <> ШкалаОценки Тогда
			ДополнительныеСвойства.Вставить("ИзмениласьШкалаОценки", Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ИзмениласьШкалаОценки")
		И ДополнительныеСвойства.ИзмениласьШкалаОценки Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПроведениеОбученияСУО.Ссылка
			|ИЗ
			|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
			|ГДЕ
			|	ПроведениеОбученияСУО.Проведен = &Проведен
			|	И ПроведениеОбученияСУО.ВидОбучения = &ВидОбучения";
		
		Запрос.УстановитьПараметр("ВидОбучения", Ссылка);
		Запрос.УстановитьПараметр("Проведен", Истина);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокументы(ВыборкаДетальныеЗаписи,,Истина,2); // Для обновления шкал
		
	КонецЕсли;
		
КонецПроцедуры


#КонецЕсли

