
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)  
	
	Если ЗначениеЗаполнено(ПараметрКоманды)
		И ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ВопросыСУЗ") Тогда
	
		ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Новый Структура("Вопрос", ПараметрКоманды), Истина);
		
		ОткрытьФорму("Отчет.ОтветыНаВопросыСУО.Форма", ПараметрыФормы);
		
	Иначе
		
		ПоказатьПредупреждение(,НСтр("ru = 'Вопрос не выбран или не записан. Действие отменено'"));
		
	КонецЕсли;
	
КонецПроцедуры
