///////////////////////////////////////////////////////////////////////////////
// РАСШИФРОВКА ПОСТФИКСОВ ОБЪЕКТОВ КОНФИГУРАЦИИ

//  - СУ (Система управления). Постфикс для общих объектов, которые не имеют прикладного
//    значения, а реализуют стандартные механизмы.

// 	- СУЗ (Система управления знаниями). Постфикс указывается для тех объектов, которые
//    отвечают за работу с электронными ресурсами (курсы и тесты).

//  - SCORM (Sharable Content Object Reference Model). Постфикс используется для объектов,
//    обеспечивающих поддержку формата электронных ресурсов SCORM.

//    Объекты с постфиксом СУЗ и SCORM переносятся в конфигурацию "Конструктор курсов".

//  - СУО (Система управления обучением). Постфикс указывается для объектов, которые
//    отвечают за реализацию функций управления обучением (LMS).

//  - Объекты без постфикса наследуются из библиотеки стандартных подсистем.

//  Примечание: для подчиненных объектов, например форм или подчиненных подсистем
//  постфикс не используются.


Перем ПараметрыПриложения Экспорт; // Параметры приложения (БСП)

#Область ОбработчикиСобытий

Процедура ПередНачаломРаботыСистемы()
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередНачаломРаботыСистемы();
	// Конец СтандартныеПодсистемы
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПриНачалеРаботыСистемы();
	// Конец СтандартныеПодсистемы
	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения);
	// Конец СтандартныеПодсистемы
	
КонецПроцедуры

#КонецОбласти

