#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
// Обработчик события УстановкаПараметровСеанса()
//
Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	 
	Если ИменаПараметровСеанса = Неопределено Тогда
		
		// Раздел установки параметров сеанса при начале сеанса (ИменаПараметровСеанса = Неопределено)
		// Выполняется установка параметров сеанса, которые можно инициализировать 
		// при начале работы системы. Эти параметры сеанса используются в фоновых заданиях.
		
		ПараметрыСеанса.ИспользуетсяЛокальныйКэшНаКлиентеСУЗ = Ложь;
		
		
		// Устанавливаем настройки, если они не определены для текущего пользователя
		
		Если ТекущийРежимЗапуска() = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение Тогда
			
			БазовыеРоли = Неопределено;
			
			СистемныеНастройкиНачальнойСтраницы = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиНачальнойСтраницы");
			
			Если СистемныеНастройкиНачальнойСтраницы = Неопределено Тогда
				
				НачальнаяСтраница = Новый НастройкиНачальнойСтраницы;
				
				Если БазовыеРоли = Неопределено Тогда
					БазовыеРоли = ОбучениеСУОПовтИсп.СписокБазовыхПравПользователя();
				КонецЕсли;
				
				Если (БазовыеРоли.Количество() = 1 И БазовыеРоли[0] = Перечисления.БазовыйРолиПользователейСУО.Учащийся)
					ИЛИ (БазовыеРоли.Количество() = 1 И БазовыеРоли[0] = Перечисления.БазовыйРолиПользователейСУО.Преподаватель)
					ИЛИ (БазовыеРоли.Количество() = 2 И БазовыеРоли.Найти(Перечисления.БазовыйРолиПользователейСУО.Преподаватель) <> Неопределено
					И БазовыеРоли.Найти(Перечисления.БазовыйРолиПользователейСУО.Учащийся) <> Неопределено) Тогда 
					
					// Только учащийся, только преподаватель или учащийся  преподаватель одновременно
					
					СоставФорм = Новый СоставФормНачальнойСтраницы;
					СоставФорм.ЛеваяКолонка.Добавить("ОбщаяФорма.МоеОбучениеСУО");
					СоставФорм.ПраваяКолонка.Добавить("ОбщаяФорма.ИнформационнаяЛентаСУО");
					НачальнаяСтраница.УстановитьСоставФорм(СоставФорм);
					
				ИначеЕсли (БазовыеРоли.Найти(Перечисления.БазовыйРолиПользователейСУО.Менеджер) <> Неопределено 
					И БазовыеРоли.Найти(Перечисления.БазовыйРолиПользователейСУО.Администратор) = Неопределено) Тогда
					
					// Только для менеджеров, которые не имеют полных прав
					
					СоставФорм = Новый СоставФормНачальнойСтраницы;
					СоставФорм.ЛеваяКолонка.Добавить("Документ.ПроведениеОбученияСУО.ФормаСписка");
					СоставФорм.ПраваяКолонка.Добавить("ОбщаяФорма.ИнформационнаяЛентаСУО");
					НачальнаяСтраница.УстановитьСоставФорм(СоставФорм);					
									
				ИначеЕсли (БазовыеРоли.Найти(Перечисления.БазовыйРолиПользователейСУО.Разработчик) <> Неопределено 
					И БазовыеРоли.Найти(Перечисления.БазовыйРолиПользователейСУО.Администратор) = Неопределено) Тогда
					
					// Только для менеджеров, которые не имеют полных прав
					
					СоставФорм = Новый СоставФормНачальнойСтраницы;
					СоставФорм.ЛеваяКолонка.Добавить("Справочник.СводыЗнанийСУЗ.ФормаСписка");
					СоставФорм.ПраваяКолонка.Добавить("ОбщаяФорма.ИнформационнаяЛентаСУО");
					НачальнаяСтраница.УстановитьСоставФорм(СоставФорм);					
					
				КонецЕсли;
				
				ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы", "", НачальнаяСтраница);
								
			КонецЕсли;

			СистемныеНастройкиИнтерфейса = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения");
			
			Если СистемныеНастройкиИнтерфейса = Неопределено Тогда 
				
				Если БазовыеРоли = Неопределено Тогда
					БазовыеРоли = ОбучениеСУОПовтИсп.СписокБазовыхПравПользователя();
				КонецЕсли;
				
				Если (БазовыеРоли.Количество() = 1 И БазовыеРоли[0] = Перечисления.БазовыйРолиПользователейСУО.Учащийся)
					ИЛИ (БазовыеРоли.Количество() = 1 И БазовыеРоли[0] = Перечисления.БазовыйРолиПользователейСУО.Преподаватель)
					ИЛИ (БазовыеРоли.Количество() = 2 И БазовыеРоли.Найти(Перечисления.БазовыйРолиПользователейСУО.Преподаватель) <> Неопределено
					И БазовыеРоли.Найти(Перечисления.БазовыйРолиПользователейСУО.Учащийся) <> Неопределено) Тогда
					
					// Только учащийся, только преподаватель или учащийся  преподаватель одновременно
					
					НастройкиИнтерфейса = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
					
					НастройкиСоставаПанель = Новый НастройкиСоставаИнтерфейсаКлиентскогоПриложения;
					НастройкиСоставаПанель.Верх.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельФункцийТекущегоРаздела"));			
					
					НастройкиСостава = Новый НастройкиСоставаИнтерфейсаКлиентскогоПриложения;
					НастройкиСостава.Верх.Добавить(НастройкиСоставаПанель.Верх);
					
					НастройкиИнтерфейса.УстановитьСостав(НастройкиСостава);
					
					ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", , НастройкиИнтерфейса);
					
				КонецЕсли;
				
			КонецЕсли;			
			
		КонецЕсли;
		
	Иначе
		
		//********* ИЗ БИБЛИОТЕКИ СТАНДАРТНЫХ ПОДСИСТЕМ **********//
		
		// Установка параметров сеанса "по требованию"
		
		// Параметры сеанса, инициализация которых требует обращения к одним и тем же данным
		// следует инициализировать сразу группой. Для того, чтобы избежать их повторной инициализации,
		// имена уже установленных параметров сеанса сохраняются в массиве УстановленныеПараметры
		
		СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
		
	КонецЕсли;
		
КонецПроцедуры // УстановкаПараметровСеанса

#КонецЕсли