&НаСервере
Функция КлючПубликации()
	Если НЕ ВебКабинетСУ.ИспользуетсяАвтоматическаяНастройка() Тогда
		ВызватьИсключение НСтр("ru = 'Невозможно начать автоматическую настройку'");
	КонецЕсли;
	Возврат Справочники.ПубликацииВебКабинетаСУ.ЕдинственнаяПубликацияВОбщемКаталоге();
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	КлючПубликации = КлючПубликации();
	Если ЗначениеЗаполнено(КлючПубликации) Тогда
		ПараметрыФормы = Новый Структура("Ключ, АвтоматическаяНастройка", КлючПубликации, Истина);
		ОткрытьФорму("Справочник.ПубликацииВебКабинетаСУ.Форма.ФормаЭлемента", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	Иначе
		ПоказатьПредупреждение(,НСтр("ru = 'Перед настройкой установите веб-кабинет'"));
	КонецЕсли;
КонецПроцедуры
