

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ОбменДанными.Загрузка
		И ЭтотОбъект.Количество() = 1 Тогда
		
		Мероприятие = ЭтотОбъект[0].Мероприятие;
		
		Если Мероприятие.МестоПроведения = Перечисления.МестаПроведенияМероприятийСУО.Аудитория
			И НЕ ЗначениеЗаполнено(ЭтотОбъект[0].Аудитория) Тогда
			
			Текст = НСтр("ru = 'Укажите аудиторию проведения занятия ""%1"" мероприятия ""%2"".'");
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, Мероприятие, ЭтотОбъект[0].ПроведениеОбучения.Мероприятие);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
			
		КонецЕсли;
		
		Если (Мероприятие.МестоПроведения = Перечисления.МестаПроведенияМероприятийСУО.Аудитория ИЛИ НЕ Мероприятие.Вид.Электронное)
			И НЕ ЗначениеЗаполнено(ЭтотОбъект[0].ДатаПроведения) Тогда
			
			Текст = НСтр("ru = 'Укажите дату проведения мероприятия'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
			
		КонецЕсли;
		
		
	КонецЕсли;

КонецПроцедуры

