#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Функция КнигаОписаниеXML(Книга, ВыделенныйФрагмент=Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	КнигаXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/Book", "Книга");
	КнигаXDTO     = ФабрикаXDTO.Создать(КнигаXDTOТип);
	
	// Простые свойства
	
	КнигаXDTO.Идентификатор = Книга.УникальныйИдентификатор();
	
	КнигаXDTO.Наименование = Книга.Наименование;
	
	Если ЗначениеЗаполнено(Книга.УДК) Тогда
		КнигаXDTO.УДК = Книга.УДК;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Книга.ББК) Тогда
		КнигаXDTO.ББК = Книга.ББК;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Книга.ISBN) Тогда
		КнигаXDTO.ISBN = Книга.ISBN;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Книга.ВебСсылка) Тогда
		КнигаXDTO.ВебСсылка = Книга.ВебСсылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Книга.Описание) Тогда
		КнигаXDTO.Описание = Книга.Описание;
	КонецЕсли;	
	
	// Содержание

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СодержаниеКнигиСУО.Ссылка КАК Ссылка,
		|	СодержаниеКнигиСУО.Наименование,
		|	СодержаниеКнигиСУО.Код КАК Номер
		|ИЗ
		|	Справочник.СодержаниеКнигиСУО КАК СодержаниеКнигиСУО
		|ГДЕ
		|	СодержаниеКнигиСУО.Владелец = &Владелец
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка ИЕРАРХИЯ,
		|	Номер";

	Запрос.УстановитьПараметр("Владелец", Книга);

	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() Тогда
	
	    ДеревоСодержания = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		СодержаниеXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/Book", "Содержание");
		СодержаниеXDTO    = ФабрикаXDTO.Создать(СодержаниеXDTOТип);
		
		СодержаниеКнигиСформироватьXDTO(СодержаниеXDTO, ДеревоСодержания.Строки, ВыделенныйФрагмент);
		
		КнигаXDTO.Содержание = СодержаниеXDTO;
		
	КонецЕсли;
		
	// Авторы
	
	Если Книга.АвторыКниги.Количество() > 0 Тогда
	
		АвторыXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/Book", "Авторы");
		
		АвторыXDTO = ФабрикаXDTO.Создать(АвторыXDTOТип);
		
		АвторXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/Book", "Автор");
		
		Для каждого Автор Из Книга.АвторыКниги Цикл
			
			АвторXDTO = ФабрикаXDTO.Создать(АвторXDTOТип);
			
			АвторXDTO.ФИО   = Автор.ФИО;
			АвторXDTO.Номер = Автор.НомерСтроки;
			
			АвторыXDTO.Автор.Добавить(АвторXDTO);
		
		КонецЦикла;
		
		КнигаXDTO.Авторы = АвторыXDTO;
		
	КонецЕсли;
		
	// Ключевые слова
	
	Если Книга.КлючевыеСлова.Количество() > 0 Тогда
	
		КлючевыеСловаXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/Book", "КлючевыеСлова");
		
		КлючевыеСловаXDTO = ФабрикаXDTO.Создать(КлючевыеСловаXDTOТип);
		
		Для каждого КлючевоеСлово Из Книга.КлючевыеСлова Цикл
			КлючевыеСловаXDTO.Слово.Добавить(КлючевоеСлово.КлючевоеСлово);
		КонецЦикла;
		
		КнигаXDTO.КлючевыеСлова = КлючевыеСловаXDTO;
		
	КонецЕсли;
		
	// Дополнительные реквизиты
	
	Если Книга.ДополнительныеРеквизиты.Количество() > 0 Тогда
	
		ДополнительныеРеквизитыXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/Book", "ДополнительныеРеквизиты");
		
		ДополнительныеРеквизитыXDTO = ФабрикаXDTO.Создать(ДополнительныеРеквизитыXDTOТип);
		
		ДополнительныйРеквизитXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/Book", "ДополнительныйРеквизит");
		
		Для каждого ДополнительныйРеквизит Из Книга.ДополнительныеРеквизиты Цикл
			
			ДополнительныйРеквизитXDTO = ФабрикаXDTO.Создать(ДополнительныйРеквизитXDTOТип);
			
			ДополнительныйРеквизитXDTO.Имя      = Строка(ДополнительныйРеквизит.Свойство);
			ДополнительныйРеквизитXDTO.Значение = Строка(ДополнительныйРеквизит.Значение);
			ДополнительныйРеквизитXDTO.Номер    = ДополнительныйРеквизит.НомерСтроки;
			
			ДополнительныеРеквизитыXDTO.Реквизит.Добавить(ДополнительныйРеквизитXDTO);
		
		КонецЦикла;
		
		КнигаXDTO.ДополнительныеРеквизиты = ДополнительныеРеквизитыXDTO;
		
	КонецЕсли;
	
	// Файлы
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.Ссылка
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.ВладелецФайла = &Книга
		|	И Файлы.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Книга", Книга);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ФайлыXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/Book", "Файлы"));
		
		ФайлXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/Book", "Файл");
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайла(ВыборкаДетальныеЗаписи.Ссылка);
			
			ФайлXDTO = ФабрикаXDTO.Создать(ФайлXDTOТип);
			
			ФайлXDTO.Идентификатор = Строка(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор());
			ФайлXDTO.Наименование = ДанныеФайла.ПолноеНаименованиеВерсии;
			ФайлXDTO.Расширение = ДанныеФайла.Расширение;
			ФайлXDTO.Размер = ДанныеФайла.Размер;
			
			ФайлыXDTO.Файл.Добавить(ФайлXDTO);
			
		КонецЦикла;
		
		КнигаXDTO.Файлы = ФайлыXDTO;
		
	КонецЕсли;
		
	// Получаем XML
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, КнигаXDTO);
	
	Возврат ЗаписьXML.Закрыть();
	
	
КонецФункции

Процедура СодержаниеКнигиСформироватьXDTO(XDTOОбъект, СтрокиДерева, ВыделенныйФрагмент)
	
	ЭлементСодержанияXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/Book", "ЭлементСодержания");	
	
	Для каждого Строка Из СтрокиДерева Цикл

		ЭлементСодержанияXDTO = ФабрикаXDTO.Создать(ЭлементСодержанияXDTOТип);
		
		ЭлементСодержанияXDTO.Наименование = Строка.Наименование;
		ЭлементСодержанияXDTO.Номер        = Строка.Номер;
		
		Если Строка.Ссылка = ВыделенныйФрагмент Тогда
			ЭлементСодержанияXDTO.Выделен = Истина;
		Иначе
			ЭлементСодержанияXDTO.Выделен = Ложь;
		КонецЕсли;
		
		СодержаниеКнигиСформироватьXDTO(ЭлементСодержанияXDTO, Строка.Строки, ВыделенныйФрагмент);
		
		XDTOОбъект.ЭлементСодержания.Добавить(ЭлементСодержанияXDTO);
		
	КонецЦикла;
	
КонецПроцедуры

// Веб-кабинет

Процедура ОбновитьДанныеВебКабинета(Книга, ДополнительныеДанные=Неопределено) Экспорт
	

	
	УстановитьПривилегированныйРежим(Истина);
	
	// Примечание: получаем целый объект Книга, так как нужны все реквизиты
	
	РегистрыСведений.ДанныеВебКабинетаСУО_ОН.УдалитьДанные(Книга, Перечисления.ТипыДанныхВебКабинетаСУО.КнигаОписание);
	
	Если НЕ Книга.ПометкаУдаления Тогда
	
		КнигаXML = КнигаОписаниеXML(Книга);
		
		РегистрыСведений.ДанныеВебКабинетаСУО_ОН.ДобавитьДанные(Перечисления.ТипыДанныхВебКабинетаСУО.КнигаОписание, Книга, КнигаXML, Перечисления.ФорматыВебДанныхСУ.xml);

	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли