
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура СформироватьСписокУчебныхГрупп()
	
	УчебныеГруппыОО.Очистить();
	
	Ведомость = РегистрыСведений.УчастникиОбученияСУО.Ведомость(ПроведениеОбучения, Сценарий);
	
	МассивПользователей = Ведомость.ВыгрузитьКолонку("Пользователь");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтудентыООСрезПоследних.Пользователь,
		|	СтудентыООСрезПоследних.УчебнаяГруппа,
		|	СтудентыООСрезПоследних.УчебнаяГруппа.Наименование КАК НаименованиеУчебнойГруппы
		|ИЗ
		|	РегистрСведений.СтудентыОО.СрезПоследних КАК СтудентыООСрезПоследних
		|ГДЕ
		|	СтудентыООСрезПоследних.Пользователь В(&МассивПользователей)";

	Запрос.УстановитьПараметр("МассивПользователей", МассивПользователей);

	Результат = Запрос.Выполнить();

	ВыборкаСтудентов = Результат.Выбрать();
	
	// Заполняем таблицы
	//
	
	Пока ВыборкаСтудентов.Следующий() Цикл
		
		// Ведомость
		
		НайденныеСтроки = Ведомость.НайтиСтроки(Новый Структура("Пользователь", ВыборкаСтудентов.Пользователь));
		СтрокаВедомости = НайденныеСтроки[0]; // Есть всегда
		
		// Учебные группы
		
		НайденныеСтроки = УчебныеГруппыОО.НайтиСтроки(Новый Структура("УчебнаяГруппа", ВыборкаСтудентов.УчебнаяГруппа));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			СтрокаУчебнойГруппы = УчебныеГруппыОО.Добавить();                                 
			СтрокаУчебнойГруппы.УчебнаяГруппа = ВыборкаСтудентов.УчебнаяГруппа;
			СтрокаУчебнойГруппы.Наименование  = ВыборкаСтудентов.НаименованиеУчебнойГруппы;
			
		Иначе
			
			СтрокаУчебнойГруппы = НайденныеСтроки[0];
			
		КонецЕсли;
		
		СтрокаУчебнойГруппы.КоличествоСтудентов  = СтрокаУчебнойГруппы.КоличествоСтудентов + 1;
		СтрокаУчебнойГруппы.СуммаБалловСтудентов = СтрокаУчебнойГруппы.СуммаБалловСтудентов + СтрокаВедомости.Баллы;
		
		Если СтрокаВедомости.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Зачислен Тогда
			СтрокаУчебнойГруппы.КоличествоЗачисленныхСтудентов = СтрокаУчебнойГруппы.КоличествоЗачисленныхСтудентов + 1;
		КонецЕсли;
		
		Если СтрокаВедомости.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Проходит Тогда
			СтрокаУчебнойГруппы.КоличествоВыполняющихСтудентов = СтрокаУчебнойГруппы.КоличествоВыполняющихСтудентов + 1;
		КонецЕсли;
		
		Если СтрокаВедомости.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил
			ИЛИ СтрокаВедомости.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат Тогда
			СтрокаУчебнойГруппы.КоличествоЗавершившихСтудентов = СтрокаУчебнойГруппы.КоличествоЗавершившихСтудентов + 1;
		КонецЕсли;
		
		Если СтрокаВедомости.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.НеЗавершил Тогда
			СтрокаУчебнойГруппы.КоличествоНеЗавершившихСтудентов = СтрокаУчебнойГруппы.КоличествоНеЗавершившихСтудентов + 1;
		КонецЕсли;
		
		Если СтрокаВедомости.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.НеДопущен Тогда
			СтрокаУчебнойГруппы.КоличествоНеДопущенныхСтудентов = СтрокаУчебнойГруппы.КоличествоНеДопущенныхСтудентов + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	// Сортируем таблицу студентов
	//
	
	УчебныеГруппыОО.Сортировать("Наименование");
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Устанавливаем переменные
	
	ПроведениеОбучения = Параметры.ПроведениеОбучения;
	
	Если ЗначениеЗаполнено(Параметры.Мероприятие) Тогда
		
		Сценарий = Параметры.Мероприятие;
		
	Иначе
		
		ДанныеПроведения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеОбучения, "Мероприятие, ЭлектронныйРесурс, НаОсновеЭлектронногоРесурса");
		
		Сценарий = Документы.ПроведениеОбученияСУО.СценарийОбучения(ПроведениеОбучения);
		
	КонецЕсли;
	
	// Формируем список учебных групп
	
	СформироватьСписокУчебныхГрупп();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	СформироватьСписокУчебныхГрупп();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ УчебныеГруппыОО

&НаКлиенте
Процедура УчебныеГруппыООВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = УчебныеГруппыОО.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	ОткрытьФорму("Документ.ПроведениеОбученияСУО.Форма.ФормаСтуденты", Новый Структура("ПроведениеОбучения, Мероприятие, УчебнаяГруппаОО", Параметры.ПроведениеОбучения, Параметры.Мероприятие, ТекущаяСтрока.УчебнаяГруппа));

КонецПроцедуры




