
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ФайлыМероприятий.Параметры.УстановитьЗначениеПараметра("Пользователь", Пользователи.ТекущийПользователь());
	ФайлыМероприятий.Параметры.УстановитьЗначениеПараметра("ПроведенияМероприятий", Параметры.ПроведенияМероприятий);
	
	
	Если ПолучитьФункциональнуюОпцию("ОбразовательнаяОрганизацияОО") Тогда
		Элементы.ФайлыМероприятийУчащийся.Заголовок = НСтр("ru = 'Студенты'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФайлыМероприятий

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ФайлыМероприятий

&НаКлиенте
Процедура ФайлыМероприятийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Проверить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Проверить(Команда=Неопределено)
	
	МассивФайлов = Новый Массив();
	
	Для каждого ИндексСтроки Из Элементы.ФайлыМероприятий.ВыделенныеСтроки Цикл
		ДанныеСтроки = Элементы.ФайлыМероприятий.ДанныеСтроки(ИндексСтроки);
		МассивФайлов.Добавить(ДанныеСтроки.Ссылка);	
	КонецЦикла;
	
	Если МассивФайлов.Количество() > 0  Тогда
		
		ДанныеВыделенныхФайлов = ПолучитьДанныеВыделенныхФайлов(Новый ФиксированныйМассив(МассивФайлов), УникальныйИдентификатор);
		
		Если ДанныеВыделенныхФайлов <> Неопределено Тогда
			РезультатСохранения = ПолучитьФайл(ДанныеВыделенныхФайлов.СсылкаНаДвоичныеДанныеФайла, ДанныеВыделенныхФайлов.ИмяФайла, Истина);
		КонецЕсли;
		
		Если РезультатСохранения = Неопределено ИЛИ РезультатСохранения = ИСТИНА Тогда
			ЗапомнитьЗагруженныеНаПроверкуФайлы(МассивФайлов);
		КонецЕсли;
		
		Элементы.ФайлыМероприятий.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Прохождение(Команда)
	
	ТекущиеДанные = Элементы.ФайлыМероприятий.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(,ТекущиеДанные.ПрохождениеУчащимсяМероприятия);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПроверку(Команда)
	
	МассивФайлов = Новый Массив();
	
	Для каждого ИндексСтроки Из Элементы.ФайлыМероприятий.ВыделенныеСтроки Цикл
		ДанныеСтроки = Элементы.ФайлыМероприятий.ДанныеСтроки(ИндексСтроки);
		МассивФайлов.Добавить(ДанныеСтроки.Ссылка);			
	КонецЦикла;

	Если МассивФайлов.Количество() > 0  Тогда

		ОтменитьПроверкуФайлов(МассивФайлов);
		
		Элементы.ФайлыМероприятий.Обновить();
		
	КонецЕсли;
		
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервереБезКонтекста
Функция ПолучитьДанныеВыделенныхФайлов(МассивФайлов, Идентификатор)

	ФайлыПрохождениеОбучения = Новый Массив; 
	ФайлыПрохождениеПопыткаВыполненияЗадания = Новый Массив;
	
	Для каждого Файл Из МассивФайлов Цикл
	
		Если НЕ ЗначениеЗаполнено(Файл) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Файл) = Тип("СправочникСсылка.ПопыткаВыполненияЗаданияСУОПрисоединенныеФайлы") Тогда
			ФайлыПрохождениеПопыткаВыполненияЗадания.Добавить(Файл);
		КонецЕсли;
		
		Если ТипЗнч(Файл) = Тип("СправочникСсылка.ПрохождениеОбученияСУОПрисоединенныеФайлы") Тогда
			ФайлыПрохождениеОбучения.Добавить(Файл);
		КонецЕсли;		
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрохождениеОбученияСУОПрисоединенныеФайлы.Ссылка,
		|	ПрохождениеОбученияСУОПрисоединенныеФайлы.ВладелецФайла.Сценарий.Наименование КАК НаименованиеМероприятия,
		|	ПрохождениеОбученияСУОПрисоединенныеФайлы.ВладелецФайла.Пользователь.Наименование КАК НаименованиеПользователя
		|ИЗ
		|	Справочник.ПрохождениеОбученияСУОПрисоединенныеФайлы КАК ПрохождениеОбученияСУОПрисоединенныеФайлы
		|ГДЕ
		|	ПрохождениеОбученияСУОПрисоединенныеФайлы.Ссылка В(&ФайлыПрохождениеОбучения)
		|	И ПрохождениеОбученияСУОПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПопыткаВыполненияЗаданияСУОПрисоединенныеФайлы.Ссылка,
		|	ПопыткаВыполненияЗаданияСУОПрисоединенныеФайлы.ВладелецФайла.ПрохождениеОбучения.Сценарий.Наименование,
		|	ПопыткаВыполненияЗаданияСУОПрисоединенныеФайлы.ВладелецФайла.ПрохождениеОбучения.Пользователь.Наименование
		|ИЗ
		|	Справочник.ПопыткаВыполненияЗаданияСУОПрисоединенныеФайлы КАК ПопыткаВыполненияЗаданияСУОПрисоединенныеФайлы
		|ГДЕ
		|	ПопыткаВыполненияЗаданияСУОПрисоединенныеФайлы.Ссылка В(&ФайлыПрохождениеПопыткаВыполненияЗадания)
		|	И ПопыткаВыполненияЗаданияСУОПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("ФайлыПрохождениеОбучения", ФайлыПрохождениеОбучения);
	Запрос.УстановитьПараметр("ФайлыПрохождениеПопыткаВыполненияЗадания", ФайлыПрохождениеПопыткаВыполненияЗадания);

	Результат = Запрос.Выполнить();

	ТаблицаФайлов = Результат.Выгрузить();

    // Создаем временный каталог
	
	ПутьККаталогуФайлов = ПолучитьИмяВременногоФайла("");
	ПутьККаталогуФайлов = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуФайлов);
	
    СоздатьКаталог(ПутьККаталогуФайлов);
		
	// Создаем каталоги файлов и размещаем файлы
	
	Для каждого Строка Из ТаблицаФайлов Цикл
	
		ПутьККаталогуМероприятия = ПутьККаталогуФайлов + ОбщегоНазначенияСУКлиентСервер.ЗаменитьЗапрещенныеСимволыВИмениФайла(СокрЛП(Строка.НаименованиеМероприятия), "");
		ПутьККаталогуМероприятия = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуМероприятия); 
		
		КаталогМероприятия = Новый Файл(ПутьККаталогуМероприятия);
		
		Если НЕ КаталогМероприятия.Существует() Тогда
			 СоздатьКаталог(КаталогМероприятия.ПолноеИмя);	
		КонецЕсли;
		
		ПутьККаталогуПользователя = ПутьККаталогуМероприятия + ОбщегоНазначенияСУКлиентСервер.ЗаменитьЗапрещенныеСимволыВИмениФайла(СокрЛП(Строка.НаименованиеПользователя), "");
		ПутьККаталогуПользователя = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуПользователя); 
		
		КаталогПользователя = Новый Файл(ПутьККаталогуПользователя);
		
		Если НЕ КаталогПользователя.Существует() Тогда
			СоздатьКаталог(КаталогПользователя.ПолноеИмя);	
		КонецЕсли;
		
		ДанныеФайла = ПрисоединенныеФайлы.ПолучитьДанныеФайла(Строка.Ссылка);
		
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
		
		ПолноеИмяФайла = ПутьККаталогуПользователя + ДанныеФайла.ИмяФайла;
		
		ДвоичныеДанныеФайла.Записать(ПолноеИмяФайла);
		
	КонецЦикла;
	
	// Создаем ZIP архив со всеми файлами и помещаем его в хранилище
	
	ПолноеИмяАрхиваZIP = ПолучитьИмяВременногоФайла("zip");
	
	ФайлZIP = Новый ЗаписьZipФайла(ПолноеИмяАрхиваZIP);
	
	ФайлZIP.Добавить(ПутьККаталогуФайлов + "*.*", РежимСохраненияПутейZIP.СохранятьОтносительныеПути,  РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	
	ФайлZIP.Записать();
	
	ДвоичныеДанныеZIP = Новый ДвоичныеДанные(ПолноеИмяАрхиваZIP);
	
	СсылкаНаДвоичныеДанныеФайлаZIP = ПоместитьВоВременноеХранилище(ДвоичныеДанныеZIP, Идентификатор);
	
	// Возвращаем данные о файле
	
	ДанныеОФайлеZIP = Новый Структура;
	ДанныеОФайлеZIP.Вставить("СсылкаНаДвоичныеДанныеФайла", СсылкаНаДвоичныеДанныеФайлаZIP);
	ДанныеОФайлеZIP.Вставить("ИмяФайла", НСтр("ru = 'Файлы на проверку от '") + Формат(ТекущаяДатаСеанса(), "ДФ=dd_MM_yyyy_hh_mm_ss") + " (" +ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(МассивФайлов.Количество()) + ").zip");
	
	Возврат ДанныеОФайлеZIP;
	
КонецФункции

&НаСервере
Процедура ЗапомнитьЗагруженныеНаПроверкуФайлы(МассивФайлов)
	
	РегистрыСведений.ФайлыПроверенныеПреподавателямиСУО.ЗапомнитьПроверенныеФайлы(МассивФайлов);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтменитьПроверкуФайлов(МассивФайлов)

	РегистрыСведений.ФайлыПроверенныеПреподавателямиСУО.ОчиститьПроверенныеФайлы(МассивФайлов);
	
КонецФункции


#КонецОбласти