
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЭлементыФормы = ПараметрыВыполненияКоманды.Источник.Элементы;
	
	ПараметрыФормы = Новый Структура();
	
	ТекущиеДанные = ЭлементыФормы.Список.ТекущиеДанные;
	
	Если ОбщегоНазначенияСУКлиент.ТекущиеДанныеТаблицыДоступны(ТекущиеДанные) Тогда
		ПараметрыФормы.Вставить("ГруппаЭлектронногоРесурса", ТекущиеДанные.Ссылка);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.СводыЗнанийСУЗ.Форма.ФормаСозданияИзФайлов", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
