#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция Участники(УчебнаяГруппа) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчебныеГруппыСУОСостав.Пользователь,
		|	УчебныеГруппыСУОСостав.Пользователь.Наименование КАК Наименование
		|ИЗ
		|	Справочник.УчебныеГруппыСУО.Состав КАК УчебныеГруппыСУОСостав
		|ГДЕ
		|	УчебныеГруппыСУОСостав.Ссылка = &УчебнаяГруппа";

	Запрос.УстановитьПараметр("УчебнаяГруппа", УчебнаяГруппа);

	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
	
КонецФункции

// Веб-кабинет

Процедура ОбновитьДанныеВебКабинета(УчебнаяГруппа, ДополнительныеДанные=Неопределено) Экспорт


	
	УстановитьПривилегированныйРежим(Истина);
	
	// Примечание: Переменная УчебнаяГруппа может быть двух типов:
	//	- УчебныеГруппыОО
	//  - УчебныеГруппыСУО
	
	// Получаем данные группы
	
	ДанныеГруппы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УчебнаяГруппа, "Наименование, ПометкаУдаления");
	
	// Удаляем данные
	
	РегистрыСведений.ДанныеВебКабинетаСУО_ОН.УдалитьДанные(УчебнаяГруппа, Перечисления.ТипыДанныхВебКабинетаСУО.УчебнаяГруппа);
	РегистрыСведений.ДанныеВебКабинетаСУО_ОН.УдалитьДанные(УчебнаяГруппа, Перечисления.ТипыДанныхВебКабинетаСУО.УчебнаяГруппаОписание);
	РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.УдалитьОтбор(УчебнаяГруппа);
	РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.УдалитьДанные(УчебнаяГруппа, "Справочник.УчебныеГруппыСУО");
	
	Если НЕ ДанныеГруппы.ПометкаУдаления Тогда
	
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(УчебнаяГруппа);
		УчастникиГруппы = МенеджерОбъекта.Участники(УчебнаяГруппа);
		
		// Сохраняем данные веб-кабинета
		
		Зависимости = Новый Массив;
		
		УчебнаяГруппаJSON = УчебнаяГруппаJSON(УчебнаяГруппа, ДанныеГруппы.Наименование);
		ОписаниеУчебнойГруппыJSON = УчебнаяГруппаОписаниеJSON(УчебнаяГруппа, ДанныеГруппы.Наименование, УчастникиГруппы, Зависимости);
		
		
		РегистрыСведений.ДанныеВебКабинетаСУО_ОН.ДобавитьДанные(Перечисления.ТипыДанныхВебКабинетаСУО.УчебнаяГруппа, УчебнаяГруппа, УчебнаяГруппаJSON, Перечисления.ФорматыВебДанныхСУ.json);
		РегистрыСведений.ДанныеВебКабинетаСУО_ОН.ДобавитьДанные(Перечисления.ТипыДанныхВебКабинетаСУО.УчебнаяГруппаОписание, УчебнаяГруппа, ОписаниеУчебнойГруппыJSON, Перечисления.ФорматыВебДанныхСУ.json);
		
		// Зависимости
		
		РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.ДобавитьДанные(УчебнаяГруппа, "Справочник.УчебныеГруппыСУО", Зависимости);
		
		// Отборы
		
		Для каждого Участник Из УчастникиГруппы Цикл
			РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.ДобавитьОтбор(УчебнаяГруппа, Участник.Пользователь);
		КонецЦикла;		
		
	КонецЕсли;
		
	
		
КонецПроцедуры

Функция УчебнаяГруппаJSON(Знач УчебнаяГруппа, НаименованиеГруппы="") Экспорт
	
	Если НЕ ЗначениеЗаполнено(НаименованиеГруппы) Тогда
		НаименованиеГруппы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчебнаяГруппа, "Наименование");
	КонецЕсли;
	
	Возврат ОбщегоНазначенияСУ.ДанныеВJSON(Новый Структура("Наименование, Идентификатор, Тип", НаименованиеГруппы, Строка(УчебнаяГруппа.УникальныйИдентификатор()), ТипУчебнойГруппыJS(УчебнаяГруппа)));
	
КонецФункции

Функция УчебнаяГруппаОписаниеJSON(Знач УчебнаяГруппа, Знач Наименование, Знач Участники, Зависимости) Экспорт
		
	ОписаниеУчебнойГруппы = Новый Структура("Наименование, Участники, Тип, Идентификатор");
	
	ОписаниеУчебнойГруппы.Наименование = Наименование;
	ОписаниеУчебнойГруппы.Участники = Новый Массив;
	ОписаниеУчебнойГруппы.Тип = ТипУчебнойГруппыJS(УчебнаяГруппа);	
	
	ОписаниеУчебнойГруппы.Идентификатор = Строка(УчебнаяГруппа.УникальныйИдентификатор());
	
	Для каждого Участник Из Участники Цикл
	
		ОписаниеУчастника = ВебКабинетСУО.ПользовательСтруктура(Участник.Пользователь, Участник.Наименование);
		
		ОписаниеУчебнойГруппы.Участники.Добавить(ОписаниеУчастника);
		
		Если Зависимости.Найти(Участник.Пользователь) = Неопределено Тогда
			Зависимости.Добавить(Участник.Пользователь);
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеУчебнойГруппы);
	
КонецФункции

Функция ТипУчебнойГруппыJS(УчебнаяГруппа)
	
	Если ТипЗнч(УчебнаяГруппа) = Тип("СправочникСсылка.УчебныеГруппыСУО") Тогда
		Возврат "corp";
	КонецЕсли;
	
	Если ТипЗнч(УчебнаяГруппа) = Тип("СправочникСсылка.УчебныеГруппыОО") Тогда
		Возврат "edu";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция МенеджерСправочникаПоТипу(ТипУчебнойГруппы) Экспорт
	
	Если ТипУчебнойГруппы = "corp" Тогда
		Возврат Справочники.УчебныеГруппыСУО;
	КонецЕсли;
	
	Если ТипУчебнойГруппы = "edu" Тогда
		Возврат Справочники.УчебныеГруппыОО;
	КонецЕсли;
	
	Возврат Справочники.УчебныеГруппыСУО;
	
КонецФункции


#КонецЕсли
