#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Состав
	
	Если ОбщегоНазначенияСУКлиентСервер.ЕстьСовпаденияВКоллекцииЗначений(Состав, "Пользователь") Тогда
		Текст = НСтр("ru = ''Укажите различных пользователей учебной группы'");
		Поле = "Состав";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);			
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// Обновляем Проведения обучения и программ обучения, где
	// Указана данная учебная группа, как группа, которой разрешена запись.
	
	УстановитьПривилегированныйРежим(Истина); 
	
	Запрос = Новый Запрос;

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроведениеОбученияСУОУчебныеГруппы.Ссылка
		|ИЗ
		|	Документ.ПроведениеОбученияСУО.УчебныеГруппы КАК ПроведениеОбученияСУОУчебныеГруппы
		|ГДЕ
		|	ПроведениеОбученияСУОУчебныеГруппы.Ссылка.Проведен = ИСТИНА
		|	И ПроведениеОбученияСУОУчебныеГруппы.УчебнаяГруппа = &УчебнаяГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПроведениеПрограммыОбученияСУОУчебныеГруппы.Ссылка
		|ИЗ
		|	Документ.ПроведениеПрограммыОбученияСУО.УчебныеГруппы КАК ПроведениеПрограммыОбученияСУОУчебныеГруппы
		|ГДЕ
		|	ПроведениеПрограммыОбученияСУОУчебныеГруппы.Ссылка.Проведен = ИСТИНА
		|	И ПроведениеПрограммыОбученияСУОУчебныеГруппы.УчебнаяГруппа = &УчебнаяГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СообщениеСУО.Ссылка
		|ИЗ
		|	Документ.СообщениеСУО КАК СообщениеСУО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТемыСообщенийСУО КАК ТемыСообщенийСУО
		|		ПО СообщениеСУО.Тема = ТемыСообщенийСУО.Ссылка
		|ГДЕ
		|	ТемыСообщенийСУО.Контекст = &УчебнаяГруппа
		|	И СообщениеСУО.ПервоеСообщениеВТеме = ИСТИНА";

	Запрос.УстановитьПараметр("УчебнаяГруппа", Ссылка); 
		
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Для каждого Результат Из МассивРезультатов Цикл
	
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокументы(ВыборкаДетальныеЗаписи,,,3);
	
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли