
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Делаем проверки
	//
	
	Обучение = Параметры.Обучение; // Реквизит
	
	Если НЕ ЗначениеЗаполнено(Обучение) Тогда
		Текст = НСтр("ru = 'Элемент обучения не задан'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		Возврат;
	КонецЕсли;	
	
	МенеджерОбучения = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Обучение);
	
	ОбучениеОтменено = МенеджерОбучения.Отменено(Обучение);
	
	Если ОбучениеОтменено Тогда
		Текст = НСтр("ru = 'Обучение отменено и не может быть открыто'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	// Получаем общие данные
	//
	
	ЭтоОбразовательнаяОрганизация = ПолучитьФункциональнуюОпцию("ОбразовательнаяОрганизацияОО");
	ИспользоватьСтудентов = ПолучитьФункциональнуюОпцию("ИспользоватьСтудентовСУО");
	ЭтоПолныйИнтерфейс = ПолучитьФункциональнуюОпцию("ПолныйИнтерфейсСУО");	
	
	ПроведениеОбучения     = МенеджерОбучения.ПроведениеОбучения(Обучение);
	Сценарий               = МенеджерОбучения.СценарийОбучения(Обучение);
	Заголовок              = МенеджерОбучения.Представление(Обучение);
	Актуально              = МенеджерОбучения.Актуально(Обучение);
	РодительскоеПроведение = МенеджерОбучения.РодительскоеОбучение(Обучение);	
	
	Пользователь = Пользователи.ТекущийПользователь();
	
	ВидОбучения         = Документы.ПроведениеОбученияСУО.ВидОбучения(ПроведениеОбучения, Сценарий);
	ЭтоЭлектронноеОбучение = Документы.ПроведениеОбученияСУО.ЭтоЭлектронноеОбучение(ПроведениеОбучения, ВидОбучения, Сценарий);
	ЗавершаетУчащийся   = ВидОбучения.ЗавершаетУчащийся;
	
	Если ТипЗнч(Обучение) = Тип("ДокументСсылка.ПроведениеПреподавателемОбученияСУО") Тогда		
		ТипАктивности = "Преподавание";		
	Иначе		
		Если Пользователь = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Обучение, "Пользователь") Тогда			
			ТипАктивности = "Обучение";			
		Иначе			
			ТипАктивности = "Проверка";			
		КонецЕсли;
	КонецЕсли;	
	
	// Описание
	//
	
	СформироватьОписание(МенеджерОбучения);
	
	// Участники
	//
	
	Если ТипАктивности = "Обучение" Тогда
		Элементы.СтраницаУчастники.Видимость = МенеджерОбучения.ДоступноОбщение(Обучение);
	Иначе
		Элементы.СтраницаУчастники.Видимость = Ложь;
	КонецЕсли;	
	
	Если ЭтоОбразовательнаяОрганизация Тогда
		Элементы.СтраницаУчастники.Заголовок = НСтр("ru = 'Студенты'");
	КонецЕсли;
	
	Участники.Параметры.УстановитьЗначениеПараметра("ПроведениеОбучения", ПроведениеОбучения);
	Участники.Параметры.УстановитьЗначениеПараметра("Сценарий", Сценарий);	
	
	// Преподаватели
	//
	
	Если ТипАктивности = "Обучение" Тогда		
		Элементы.СтраницаПреподаватели.Видимость = Документы.ПрохождениеОбученияСУО.ДоступенСписокПреподавателей(Обучение);		
	КонецЕсли;	
	
	Элементы.ПреподавателиНаименованиеРоли.Видимость = ЭтоПолныйИнтерфейс;
	
	// Мои файлы
	//
	
	ПрисоединенныеФайлыСписок.Параметры.УстановитьЗначениеПараметра("ПрохождениеОбучения", Обучение);
	
	Если ТипАктивности = "Обучение" Тогда
		Элементы.СтраницаМоиФайлы.Видимость = Документы.ПрохождениеОбученияСУО.ДоступноПрикреплениеФайлов(Обучение);
	Иначе
		Элементы.СтраницаМоиФайлы.Видимость = Ложь;
	КонецЕсли;
	
	// Список преподавателей
	//
	
	Если Элементы.СтраницаПреподаватели.Видимость Тогда
		
		ТаблицаПреподавателей = Документы.ПроведениеОбученияСУО.Преподаватели(ПроведениеОбучения, Сценарий, ?(ТипЗнч(Обучение) = Тип("ДокументСсылка.ПрохождениеОбученияСУО"), Истина, Ложь));
		
		Для каждого СтрокаТП Из ТаблицаПреподавателей Цикл
			
			НоваяСтрока = Преподаватели.Добавить();
			НоваяСтрока.Преподаватель                    = СтрокаТП.Преподаватель;
			НоваяСтрока.ИмяПреподавателя                 = СтрокаТП.ИмяПреподавателя;
			НоваяСтрока.ПроведениеПреподавателемОбучения = СтрокаТП.ПроведениеПреподавателемОбучения;
			НоваяСтрока.НаименованиеРоли                 = СтрокаТП.НаименованиеРоли;
			НоваяСтрока.Картинка                         = 0;
		
		КонецЦикла;
		
		Преподаватели.Сортировать("ИмяПреподавателя");
		
	КонецЕсли;
	
	// Задания
	//
	
	Если ТипАктивности = "Обучение" ИЛИ ТипАктивности = "Проверка" Тогда
	
		ЗагрузитьТаблицуЗаданий();
		
		Если ТипАктивности = "Обучение" Тогда
			Если Задания.Количество() < 2 Тогда
				// Ученик откроет задание по команде Открыть
				Элементы.СтраницаЗадания.Видимость = Ложь;
			КонецЕсли;			
		Иначе
			Если Задания.Количество() = 0 Тогда
				Элементы.СтраницаЗадания.Видимость = Ложь;
			КонецЕсли;			
		КонецЕсли;
		
		ПоказатьКолонкуЗначимость = Ложь;
		
		Если ВидОбучения.ПоказыватьПодробныеСведенияОЗадании Тогда
		
			Для каждого Строка Из Задания Цикл		
				Если Строка.Значимость <> 1 Тогда
					ПоказатьКолонкуЗначимость = Истина;
					Прервать;
				КонецЕсли;				
			КонецЦикла;
			
		КонецЕсли;
			
		Элементы.ЗаданияЗначимость.Видимость = ПоказатьКолонкуЗначимость;
		
	Иначе
		
		Элементы.СтраницаЗадания.Видимость = Ложь;
		
	КонецЕсли;
	
	// Задания преподавателя
	
	Если ТипАктивности = "Преподавание" Тогда
		
		Если Документы.ПроведениеОбученияСУО.ЗаданияОбучения(ПроведениеОбучения).Количество() > 0 Тогда
			
			Если ТипЗнч(Сценарий) = Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда
				ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(ЗаданияСценария, Сценарий, "Владелец");
				Элементы.ЗаданияСценария.Видимость = Истина;
			Иначе
				Элементы.ЗаданияСценария.Видимость = Ложь;
			КонецЕсли;
			
		Иначе
			
			Элементы.СтраницаЗаданияПреподавателя.Видимость = Ложь;	
			
		КонецЕсли;
		
		
	Иначе
		
		Элементы.СтраницаЗаданияПреподавателя.Видимость = Ложь;
		
	КонецЕсли;
	
	
	// Ведомость
	//
	
	Если ТипАктивности = "Преподавание" Тогда
	
		ЗагрузитьВедомость();
			
		Элементы.СтраницаВедомость.Видимость = Истина;		
		
		УстановитьДоступностьЭлементовВедомости();
		
		Если ЭтоОбразовательнаяОрганизация Тогда
			Элементы.СтраницаВедомость.Заголовок = НСтр("ru = 'Студенты'");
			Элементы.ВедомостьПользователь.Заголовок = НСтр("ru = 'Студент'");
		КонецЕсли;
		
		Элементы.ВопросыНаПроверкуУчебнаяГруппа.Видимость = ЭтоОбразовательнаяОрганизация ИЛИ ИспользоватьСтудентов;
		
		Элементы.ФайлыУчастников.Видимость = Документы.ПроведениеОбученияСУО.ДоступноПрикреплениеФайлов(ПроведениеОбучения, Сценарий);
		
		Если ЭтоОбразовательнаяОрганизация Тогда
			Элементы.ФайлыУчастников.Заголовок = НСтр("ru = 'Файлы студентов'");
		КонецЕсли;		
		
	Иначе
		
		Элементы.СтраницаВедомость.Видимость = Ложь;
		
	КонецЕсли;		
	
	
	// Учебные группы для ОО
	//
	
	Если ТипАктивности = "Преподавание" Тогда
		Элементы.СтраницаУчебныеГруппыОО.Видимость = ЭтоОбразовательнаяОрганизация ИЛИ ИспользоватьСтудентов;		
	Иначе
		Элементы.СтраницаУчебныеГруппыОО.Видимость = Ложь;
	КонецЕсли;
	
	// Вопросы на проверку
	// 
	
	Если ТипАктивности <> "Преподавание" Тогда
		Элементы.СтраницаВопросыНаПроверку.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если ЗавершениеРаботы = Неопределено Тогда
		ЗавершениеРаботы = Ложь;
	КонецЕсли;
	
	Если ЗавершениеРаботы Тогда			
		Отказ = Истина;			
		ТекстПредупреждения = НСтр("ru = 'Прохождение обучения будет прервано без сохранения последних результатов.
		|Перед выходом из программы закройте все открытые обучения для правильного сохранения данных.'");			
		Возврат;
	КонецЕсли;	
	
	Если ЗавершаетУчащийся И ТипЗнч(Обучение) = Тип("ДокументСсылка.ПрохождениеОбученияСУО") Тогда

		ВозможныйРезультат = ОбучениеСУО.ПриПрохожденииМероприятия(Обучение,,,,,Ложь);

		Если ВозможныйРезультат.СтатусРасчетныйСтрока = "Завершил"
			И ВозможныйРезультат.СтатусСтрока <> ВозможныйРезультат.СтатусРасчетныйСтрока Тогда
			ПредложитьЗавершитьОбучение();
		КонецЕсли;
		
	Иначе
		
		Если НЕ ЗакрытьБезПредупреждения
			И Модифицированность Тогда
			
			// Только для преподавателя
			
			СтандартнаяОбработка = Ложь;
			Отказ = Истина;
			ОписаниеОповещения = Новый ОписаниеОповещения("ПредложитьСохранитьИзмененияПродолжение", ЭтотОбъект);				
			ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Данные ведомости были изменены. Сохранить изменения?'"), РежимДиалогаВопрос.ДаНетОтмена, 0);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьСохранитьИзмененияПродолжение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаписатьИтоговыеОценкиВедомостиНаСервере();
		ЗакрытьБезПредупреждения = Истина;
		Закрыть();		
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		ЗакрытьБезПредупреждения = Истина;
		Закрыть();
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
	Если ИмяСобытия = "ОбновитьПрохождениеОбучения" ИЛИ ИмяСобытия = "ОбновитьМоеОбучение" ИЛИ ИмяСобытия = "ПриЗакрытииЭлектронногоКурса" Тогда
		
		СформироватьОписание();
		
		Если ВопросыНаПроверку.НайтиСтроки(Новый Структура("ПрохождениеОбучения", Параметр)).Количество() > 0 Тогда
			ЗаполнитьВопросыНаПроверку();
		КонецЕсли;
		
		Если Ведомость.НайтиСтроки(Новый Структура("Прохождение", Параметр)).Количество() > 0 Тогда
			ЗагрузитьВедомость();
		КонецЕсли;		
		
		Если Элементы.СтраницаЗадания.Видимость Тогда
			ЗагрузитьТаблицуЗаданий();
		КонецЕсли;
		
		Если Параметр = Обучение
			И ЗначениеЗаполнено(РодительскоеОбучение) Тогда

			Оповестить("ОбновитьПрохождениеОбучения", РодительскоеОбучение, ЭтотОбъект)

		КонецЕсли;
		
	КонецЕсли;
	 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОписаниеПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если НЕ ДанныеСобытия.Свойство("Href") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураСсылки = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(ДанныеСобытия.Href);
	
	ИмяОбъекта = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "object");
	ИмяДействия = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "action");
	
	Если ЗначениеЗаполнено(ИмяДействия) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ИмяДействия = "openOneTask" Тогда
			
			Если ТипЗнч(Обучение) = Тип("ДокументСсылка.ПрохождениеОбученияСУО") Тогда
				
				ОписаниеМероприятияСОднимЭлектроннымЗаданием = ОбучениеСУОВызовСервера.ОписаниеЕдинственногоЗаданияПрохождения(Обучение);
				
				Если ОписаниеМероприятияСОднимЭлектроннымЗаданием <> Неопределено Тогда
					ОбучениеСУОКлиент.ОткрытьЗадание(ОписаниеМероприятияСОднимЭлектроннымЗаданием, Обучение, Параметры.ОткрытоВнешнимПользователем);
				КонецЕсли;
				
			КонецЕсли;
			
			Если ТипЗнч(Обучение) = Тип("ДокументСсылка.ПроведениеПреподавателемОбученияСУО") Тогда
				
				ОписаниеМероприятияСОднимЭлектроннымЗаданием = ОбучениеСУОВызовСервера.ОписаниеЕдинственногоЗаданияОбучения(ПроведениеОбучения);
				
				Если ОписаниеМероприятияСОднимЭлектроннымЗаданием <> Неопределено И ОписаниеМероприятияСОднимЭлектроннымЗаданием.НаОсновеЭлектронногоРесурса Тогда
					ОбъектыСУЗКлиент.ОткрытьОбозреватель(ОписаниеМероприятияСОднимЭлектроннымЗаданием.ЭлектронныйРесурс, ОписаниеМероприятияСОднимЭлектроннымЗаданием.Фрагмент, ?(ЗначениеЗаполнено(ОписаниеМероприятияСОднимЭлектроннымЗаданием.Фрагмент), Истина, Ложь), ОписаниеМероприятияСОднимЭлектроннымЗаданием.Фрагмент);
				Иначе
					ПоказатьЗначение(,ОписаниеМероприятияСОднимЭлектроннымЗаданием.Задание);
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЕсли;
		
		Если ИмяДействия = "openContextForum" Тогда			
			ОткрытьФорму("ОбщаяФорма.ФорумСУО", Новый Структура("ВыделенныйРаздел", ПроведениеОбучения));			
		КонецЕсли;		
		
		Если ИмяДействия = "completeActivity" Тогда			
			ПредложитьЗавершитьОбучение();			
		КонецЕсли;
		
		Если ИмяДействия = "openTestResult" Тогда			
			ПараметрыФормы = Новый Структура("ПрохождениеОбучения, Задание, Пользователь, ОткрытоВнешнимПользователем",  Обучение,, Пользователь, Параметры.ОткрытоВнешнимПользователем);
			ОткрытьФорму("Документ.ПрохождениеОбученияСУО.Форма.ФормаРезультатыТестирования", ПараметрыФормы);			
		КонецЕсли;		
		
		Если ИмяДействия = "start" Тогда
			ОбучениеСУО.ПриПрохожденииМероприятия(Обучение, ПредопределенноеЗначение("Перечисление.СтатусыПрохожденияОбъектовСУО.Проходит") ,,,,,,,,Ложь);
			СформироватьОписание();
			ЗагрузитьТаблицуЗаданий();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяОбъекта) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ОткрытьОбъект(СтруктураСсылки, УникальныйИдентификатор, Обучение, Пользователь);
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУчастники

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Участники

&НаКлиенте
Процедура УчастникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если НЕ ОбщегоНазначенияСУКлиент.ТекущиеДанныеТаблицыДоступны(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(,ТекущиеДанные.Пользователь);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПреподаватели

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Преподаватели

&НаКлиенте
Процедура ПреподавателиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(,ТекущиеДанные.Преподаватель);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПрисоединенныеФайлы

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ПрисоединенныеФайлы

&НаКлиенте
Процедура ПрисоединенныеФайлыСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Зашифрован Тогда
		Возврат;	
	КонецЕсли;
	
	ОткрытьФайл(ТекущиеДанные.Ссылка);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗадания

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Задания

&НаКлиенте
Процедура ЗаданияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные = Неопределено 
		ИЛИ НЕ Элемент.ТекущиеДанные.ДоступноДляПрохождения Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗадания = Новый Структура("Задание, НаОсновеЭлектронногоРесурса", Элемент.ТекущиеДанные.Задание, Элемент.ТекущиеДанные.НаОсновеЭлектронногоРесурса);
	
	ОбучениеСУОКлиент.ОткрытьЗадание(ПараметрыЗадания, Обучение,,, Элемент.ТекущиеДанные.ТолькоПросмотр);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВопросыНаПроверку

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ВопросыНаПроверку

&НаКлиенте
Процедура ВопросыНаПроверкуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	НастройкиТестирования = ПолучитьНастройкиТестирования(ТекущиеДанные.СессияТестирования, ТекущиеДанные.НомерГруппыПодборки);
	
	ОбъектыСУЗКлиент.ОткрытьОбозреватель(НастройкиТестирования.СводЗнаний,
										 НастройкиТестирования.СсылкаНаЭлемент,
										 Истина,
										 НастройкиТестирования.ЭлементСодержанияСводаЗнаний,
										 ТекущиеДанные.ПрохождениеОбучения,
										 ТекущиеДанные.Задание);
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНастройкиТестирования(СессияВыполненияТеста, НомерГруппыПодборки=Неопределено)
	Возврат Документы.ПопыткаВыполненияПодборкиВопросовСУЗ.ДанныеТестированияДляПросмотра(СессияВыполненияТеста, НомерГруппыПодборки);
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВедомость

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Ведомость

&НаКлиенте
Процедура ВедомостьВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ВедомостьПользователь" Тогда				
		СтандартнаяОбработка = Ложь;		
		ПоказатьЗначение(,ТекущиеДанные.Пользователь);			
	КонецЕсли;
	
	Если Найти(Поле.Имя, "ВедомостьЗадание") = 1 Тогда
		СтандартнаяОбработка = Ложь;
		ПроверитьОбучениеУчащегося();
	КонецЕсли;
	
	Если Поле.Имя = "ВедомостьКомментарий" Тогда				
		СтандартнаяОбработка = Ложь;		
		НаписатьКомментарийУчастнику();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВедомостьПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НЕ ОтменаРедактирования Тогда
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Мои файлы

&НаКлиенте
Процедура ОткрытьМойФайл(Команда)

	ТекущиеДанные = Элементы.ПрисоединенныеФайлыСписок.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Зашифрован Тогда
		Возврат;	
	КонецЕсли;
	
	ОткрытьФайл(ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьМойФайл(Команда)
	
	ПрисоединенныеФайлыКлиент.ДобавитьФайлы(Обучение, УникальныйИдентификатор);
	
КонецПроцедуры

// Ведомость

&НаКлиенте
Процедура ФайлыУчастников(Команда)
	МассивПроведенийОбучения = Новый Массив;
	МассивПроведенийОбучения.Добавить(ПроведениеОбучения);
	ОткрытьФорму("ОбщаяФорма.ФайлыУчастниковОбученияСУО", Новый Структура("ПроведенияМероприятий", МассивПроведенийОбучения));
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВедомость(Команда)
	ЗагрузитьВедомость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусЗавершил(Команда)
	УстановитьСтатусПрохождения("Завершил");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусЗавершилДляВсех(Команда)
	УстановитьСтатусПрохожденияДляВсех("Завершил");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусНеЗавершил(Команда)
	УстановитьСтатусПрохождения("НеЗавершил");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусНеЗавершилДляВсех(Команда)
	УстановитьСтатусПрохожденияДляВсех("НеЗавершил");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусПроходит(Команда)
	УстановитьСтатусПрохождения("Проходит");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусПроходитДляВсех(Команда)
	УстановитьСтатусПрохожденияДляВсех("Проходит");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусНеДопущен(Команда)
	УстановитьСтатусПрохождения("НеДопущен");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусНеДопущенДляВсех(Команда)
	УстановитьСтатусПрохожденияДляВсех("НеДопущен");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусАвтомат(Команда)
	УстановитьСтатусПрохождения("Автомат");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусАвтоматДляВсех(Команда)
	УстановитьСтатусПрохожденияДляВсех("Автомат");
КонецПроцедуры

&НаКлиенте
Процедура АктивизироватьПроведениеПреподавателемОбучения(Команда)
	УстановитьАктуальностьПроведенияПреподавателемОбучения(Ложь);
	Оповестить("ОбновитьМоеОбучение",,ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьПроведениеПреподавателемОбучения(Команда)
	УстановитьАктуальностьПроведенияПреподавателемОбучения(Истина);
	Оповестить("ОбновитьМоеОбучение",,ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОбучениеУчащегося(Команда = Неопределено)
	
	ТекущиеДанные = Элементы.Ведомость.ТекущиеДанные;
	
	Если НЕ ОбщегоНазначенияСУКлиент.ТекущиеДанныеТаблицыДоступны(ТекущиеДанные) Тогда
		Возврат;	
	КонецЕсли;
	
	ТекущееПоле = Элементы.Ведомость.ТекущийЭлемент;
	
	Если Найти(ТекущееПоле.Имя, "ВедомостьЗадание") = 1 Тогда // Стоим в ячейке задания
		
		НомерТекущегоЗадания = СтрЗаменить(ТекущееПоле.Имя, "ВедомостьЗадание", "");
		
		ЭлектронныйРесурс = ТекущиеДанные["Задание"+НомерТекущегоЗадания+"ЭлектронныйРесурс"];
		
		Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда // Сразу открываем прохождение электронного ресурса
			
			СсылкаНаЗадание             = ТекущиеДанные["Задание"+НомерТекущегоЗадания+"Ссылка"];
			ФрагментЭлектронногоРесурса = ТекущиеДанные["Задание"+НомерТекущегоЗадания+"ФрагментЭлектронногоРесурса"];
			ПрохождениеОбучения         = ТекущиеДанные["Задание"+НомерТекущегоЗадания+"ПрохождениеОбучения"];
			Вариант                     = ТекущиеДанные["Задание"+НомерТекущегоЗадания+"Вариант"];
			
			ОбъектыСУЗКлиент.ОткрытьОбозреватель(ЭлектронныйРесурс,
												 ФрагментЭлектронногоРесурса,
												 ?(ЗначениеЗаполнено(ФрагментЭлектронногоРесурса), Истина, Ложь),
												 ФрагментЭлектронногоРесурса,
												 ПрохождениеОбучения,
												 СсылкаНаЗадание,
			                                     Вариант);
			
			Возврат;
			
		Иначе
			
			ПрохождениеЗадания = ТекущиеДанные["Задание"+НомерТекущегоЗадания+"Прохождение"];
			
			ДанныеВедомостиЗадания = Новый Структура(
				"Оценка, ВозвращеноНаДоработку, ПричинаВозвратаНаДоработку, КомментарийПреподавателя");
			
			ДанныеВедомостиЗадания.Оценка = ТекущиеДанные["Задание"+НомерТекущегоЗадания+"Оценка"];
			ДанныеВедомостиЗадания.ВозвращеноНаДоработку = ТекущиеДанные["Задание"+НомерТекущегоЗадания+"ВозвращеноНаДоработку"];
			ДанныеВедомостиЗадания.ПричинаВозвратаНаДоработку = ТекущиеДанные["Задание"+НомерТекущегоЗадания+"ПричинаВозвратаНаДоработку"];
			ДанныеВедомостиЗадания.КомментарийПреподавателя = ТекущиеДанные["Задание"+НомерТекущегоЗадания+"КомментарийПреподавателя"];
			
			ДополнительныеПараметрыЗадания = Новый Структура;
			ДополнительныеПараметрыЗадания.Вставить("НомерЗадания", НомерТекущегоЗадания);
			ДополнительныеПараметрыЗадания.Вставить("ТекущаяСтрока", Элементы.Ведомость.ТекущаяСтрока);
			
			ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ОбработатьПроверкуЗадания", ЭтотОбъект, ДополнительныеПараметрыЗадания);
			
			ОткрытьФорму("ОбщаяФорма.КарточкаЗаданияСУО", Новый Структура("ПрохождениеЗадания, ДанныеВедомости", ПрохождениеЗадания, ДанныеВедомостиЗадания),,,,,ОписаниеОповещенияОЗакрытии);
			
			Возврат;
			
		КонецЕсли;
		
	Иначе
		
		Если ТипЗнч(Сценарий) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда			
			
			ОбъектыСУЗКлиент.ОткрытьОбозреватель(Сценарий,
												 ,
												 ,
												 ,
												 Элементы.Ведомость.ТекущиеДанные.Прохождение,
												 Сценарий
												 );
			
			
		Иначе
			
			ОписаниеМероприятияСОднимЭлектроннымЗаданием = ОбучениеСУОВызовСервера.ОписаниеЕдинственногоЗаданияОбучения(ПроведениеОбучения);
			
			Если ОписаниеМероприятияСОднимЭлектроннымЗаданием <> Неопределено И ОписаниеМероприятияСОднимЭлектроннымЗаданием.НаОсновеЭлектронногоРесурса Тогда

				ОбъектыСУЗКлиент.ОткрытьОбозреватель(ОписаниеМероприятияСОднимЭлектроннымЗаданием.ЭлектронныйРесурс,
													 ,
													 ,
													 ,
													 Элементы.Ведомость.ТекущиеДанные.Прохождение,
													 ОписаниеМероприятияСОднимЭлектроннымЗаданием.Задание
													 );				
													 
			Иначе
				
				ПоказатьПредупреждение(,НСтр("ru = 'Установите курсор на ячейку задания и выберите команду ""Проверить задание""'"));
													 
			КонецЕсли;
			
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПроверкуЗадания(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Ведомость.НайтиПоИдентификатору(ДополнительныеПараметры.ТекущаяСтрока);
	НомерТекущегоЗадания = ДополнительныеПараметры.НомерЗадания;	
	
	ТекущееКомментарийПреподавателя   = ДанныеСтроки["Задание"+НомерТекущегоЗадания+"КомментарийПреподавателя"];
	ТекущееОценкаЗаЗадание            = ДанныеСтроки["Задание"+НомерТекущегоЗадания+"Оценка"];
	ТекущееПричинаВозвратаНаДоработку = ДанныеСтроки["Задание"+НомерТекущегоЗадания+"ПричинаВозвратаНаДоработку"];
	ТекущееПопыткаЗавершена           = ДанныеСтроки["Задание"+НомерТекущегоЗадания+"ПопыткаЗавершена"];
	ТекущееЗадание                    = ДанныеСтроки["Задание"+НомерТекущегоЗадания+"Ссылка"];
	ТекущееПроверенПреподавателем     = ДанныеСтроки["Задание"+НомерТекущегоЗадания+"ПроверенПреподавателем"];
	ТекущееВозвращеноНаДоработку      = ДанныеСтроки["Задание"+НомерТекущегоЗадания+"ВозвращеноНаДоработку"];	
	ТекущееВыставляетсяОценка         = ДанныеСтроки["Задание"+НомерТекущегоЗадания+"ВыставляетсяОценка"];
	
	ЗаполнитьРеквизитыЗаданияВВедомости(ДанныеСтроки, НомерТекущегоЗадания, РезультатЗакрытия, РезультатЗакрытия.Оценка);
	
	ОписаниеПрохождения = ЗаписатьСтрокуВедомости(ДополнительныеПараметры.ТекущаяСтрока, НомерТекущегоЗадания);
	
	Если ОписаниеПрохождения.Свойство("Сообщение")
		И ЗначениеЗаполнено(ОписаниеПрохождения.Сообщение) Тогда
		
			ДанныеВедомостиЗадания = Новый Структура("Оценка, ВозвращеноНаДоработку, ПричинаВозвратаНаДоработку,
			|КомментарийПреподавателя, ПроверенПреподавателем, ПопыткаЗавершена, ВыставляетсяОценка");

			ДанныеВедомостиЗадания.Оценка = ТекущееОценкаЗаЗадание;
			ДанныеВедомостиЗадания.ВозвращеноНаДоработку = ТекущееВозвращеноНаДоработку;
			ДанныеВедомостиЗадания.ПричинаВозвратаНаДоработку = ТекущееПричинаВозвратаНаДоработку;
			ДанныеВедомостиЗадания.КомментарийПреподавателя = ТекущееКомментарийПреподавателя;
			ДанныеВедомостиЗадания.ПроверенПреподавателем = ТекущееПроверенПреподавателем;
			ДанныеВедомостиЗадания.ПопыткаЗавершена = ТекущееПопыткаЗавершена;
			ДанныеВедомостиЗадания.ВыставляетсяОценка = ТекущееВыставляетсяОценка;

			ЗаполнитьРеквизитыЗаданияВВедомости(ДанныеСтроки, НомерТекущегоЗадания, ДанныеВедомостиЗадания, ДанныеВедомостиЗадания.Оценка);
		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеПрохождения.Сообщение.Текст);
			
		Возврат;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИтоговыеОценкиВедомости(Команда)	
	ЗаписатьИтоговыеОценкиВедомостиНаСервере();				
КонецПроцедуры

&НаКлиенте
Процедура НаписатьКомментарийУчастникуКоманда(Команда)
	НаписатьКомментарийУчастнику();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Ведомость

&НаСервере
Процедура ЗагрузитьВедомость()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Ведомость.Очистить();	
	ВариантыЗаданий.Очистить();	
	
	ШкалаОценки = Документы.ПроведениеОбученияСУО.ШкалаОценки(ПроведениеОбучения);
			
	// Заполняем данные о прохождении пользователями мероприятия
	
	Запрос = Новый Запрос;

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчастникиОбучения.Статус КАК Статус,
		|	УчастникиОбучения.Баллы КАК Баллы,
		|	ВЫБОР
		|		КОГДА УчастникиОбучения.СтатусПроцессаОбучения = ЗНАЧЕНИЕ(Перечисление.СтатусыПроцессаОбученияСУО.Окончено)
		|				ИЛИ УчастникиОбучения.СтатусПроцессаОбучения = ЗНАЧЕНИЕ(Перечисление.СтатусыПроцессаОбученияСУО.ОконченоАвтоматом)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Пройдено,
		|	УчастникиОбучения.Пользователь КАК Пользователь,
		|	УчастникиОбучения.ШкалаОценки КАК ШкалаОценки,
		|	ВЫБОР
		|		КОГДА ИСТИНА
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ЭлементыШкалыОценокСУО.ПустаяСсылка)
		|	КОНЕЦ КАК ИтоговаяОценка,
		|	ВЫБОР
		|		КОГДА ИСТИНА
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ЭлементыШкалыОценокСУО.ПустаяСсылка)
		|	КОНЕЦ КАК ТекущаяОценка,
		|	УчастникиОбучения.Регистратор КАК Прохождение,
		|	УчастникиОбучения.КомментарийПреподавателя КАК КомментарийПреподавателя,
		|	ВЫБОР
		|		КОГДА УчастникиОбучения.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПрохожденияОбъектовСУО.Завершил)
		|			ТОГДА 1
		|		КОГДА УчастникиОбучения.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПрохожденияОбъектовСУО.Автомат)
		|			ТОГДА 1
		|		КОГДА УчастникиОбучения.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПрохожденияОбъектовСУО.НеЗавершил)
		|			ТОГДА 0
		|		КОГДА УчастникиОбучения.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПрохожденияОбъектовСУО.НеДопущен)
		|			ТОГДА 0
		|		КОГДА УчастникиОбучения.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПрохожденияОбъектовСУО.Проходит)
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК Картинка,
		|	УчастникиОбучения.Пользователь.Наименование КАК ПолноеИмяПользователя,
		|	УчастникиОбучения.ПроверяетсяПреподавателем КАК ПроверяетсяПреподавателем,
		|	УчастникиОбучения.ПроверенПреподавателем КАК ПроверенПреподавателем,
		|	УчастникиОбучения.ВозвращеноНаДоработку КАК ВозвращеноНаДоработку,
		|	УчастникиОбучения.СтатусПроцессаОбучения КАК СтатусПроцессаОбучения,
		|	УчастникиОбучения.ТекущиеБаллы КАК ТекущиеБаллы,
		|	УчастникиОбучения.ВыставляетсяОценка КАК ВыставляетсяОценка
		|ИЗ
		|	РегистрСведений.УчастникиОбученияСУО КАК УчастникиОбучения
		|ГДЕ
		|	УчастникиОбучения.ПроведениеОбучения = &ПроведениеОбучения
		|	И УчастникиОбучения.Сценарий = &Сценарий
		|
		|УПОРЯДОЧИТЬ ПО
		|	Пользователь";
		
	Запрос.УстановитьПараметр("Сценарий", Сценарий);
	Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);

	Результат = Запрос.Выполнить();

	ТаблицаПрохождений = Результат.Выгрузить();

	Для каждого Строка Из ТаблицаПрохождений Цикл
		
		// Ведомость
		
		НоваяСтрокаВедомости = Ведомость.Добавить();
		НоваяСтрокаВедомости.Пользователь              = Строка.Пользователь;
		НоваяСтрокаВедомости.ПолноеИмяПользователя     = Строка.ПолноеИмяПользователя;
		НоваяСтрокаВедомости.Пройдено                  = Строка.Пройдено;
		НоваяСтрокаВедомости.Прохождение               = Строка.Прохождение;
		НоваяСтрокаВедомости.Статус                    = Строка.Статус;
		НоваяСтрокаВедомости.Картинка                  = Строка.Картинка;
		НоваяСтрокаВедомости.Баллы                     = Строка.Баллы;
		НоваяСтрокаВедомости.ИтоговаяОценка            = Строка.ИтоговаяОценка;
		НоваяСтрокаВедомости.ТекущиеБаллы              = Строка.ТекущиеБаллы;
		НоваяСтрокаВедомости.ТекущаяОценка             = Строка.ТекущаяОценка;
		НоваяСтрокаВедомости.ШкалаОценки               = Строка.ШкалаОценки;
		НоваяСтрокаВедомости.Комментарий               = Строка.КомментарийПреподавателя;
		НоваяСтрокаВедомости.ПроверяетсяПреподавателем = Строка.ПроверяетсяПреподавателем;
		НоваяСтрокаВедомости.ПроверенПреподавателем    = Строка.ПроверенПреподавателем;
		НоваяСтрокаВедомости.ВозвращеноНаДоработку     = Строка.ВозвращеноНаДоработку;
		НоваяСтрокаВедомости.СтатусПроцессаОбучения    = Строка.СтатусПроцессаОбучения;
		НоваяСтрокаВедомости.ВыставляетсяОценка        = Строка.ВыставляетсяОценка;
		// Варианты заданий
		
		НоваяСтрокаВарианты = ВариантыЗаданий.Добавить();
		НоваяСтрокаВарианты.Пользователь   = Строка.Пользователь;
		НоваяСтрокаВарианты.Прохождение    = Строка.Прохождение;
		
				
	КонецЦикла;
	
	///////////////////////////////////////////////////////////////////
	// Получаем оценки пользователей
	
	ПоказыватьТекущуюОценкуНастройкаВида = ВидОбучения.ПоказыватьТекущуюОценку;
	ЕстьТекущаяОценка = Ложь;
	
	Если ВидОбучения.ВыставляетсяОценка Тогда
	
		///////////////////////////////////////////////////////////////////
		// Получаем итоговую оценку для каждого пользователя
		
		Для каждого Строка Из Ведомость Цикл
			
			Если Строка.Пройдено И Строка.ВыставляетсяОценка Тогда
				Строка.ИтоговаяОценка = УправлениеОбучениемСУОПовтИсп.ОценкаИзБаллов(Строка.Баллы, Строка.ШкалаОценки);				
			КонецЕсли;
			
			Если ПоказыватьТекущуюОценкуНастройкаВида 
				И Строка.ВыставляетсяОценка
				И Строка.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Проходит Тогда
				Строка.ТекущаяОценка = УправлениеОбучениемСУОПовтИсп.ОценкаИзБаллов(Строка.ТекущиеБаллы, Строка.ШкалаОценки);
				Если Строка.ТекущиеБаллы > 0 Тогда
					ЕстьТекущаяОценка = Истина;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		// Устанавливаем параметры выбора для итоговой оценки.
		
		МассивПараметровВыбора = Новый Массив();
		МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец", ШкалаОценки));
		Элементы.ВедомостьИтоговаяОценка.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);		
		
	КонецЕсли;
	
	ПоказыватьТекущуюОценку = ЕстьТекущаяОценка;
	
	///////////////////////////////////////////////////////////////////
	// Размещаем задания
	
	ТаблицаВсехЗаданийПроведения = Документы.ПроведениеОбученияСУО.ЗаданияОбучения(ПроведениеОбучения, Сценарий);
	
	Если ТаблицаВсехЗаданийПроведения.Количество() > 0 Тогда
		
		// Добавляем колонки к ведомости (задания)
		
		Для каждого СтрокаТВЗ Из ТаблицаВсехЗаданийПроведения Цикл
			
			Если Задания.НайтиСтроки(Новый Структура("Задание", СтрокаТВЗ.Задание)).Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			// Заполняем таблицу "Задания". 
			
			НовоеЗадание = Задания.Добавить();
			
			НовоеЗадание.Задание                     = СтрокаТВЗ.Задание;
			НовоеЗадание.Наименование                = СтрокаТВЗ.Наименование;
			НовоеЗадание.НесколькоВариантов          = СтрокаТВЗ.НесколькоВариантов;
			НовоеЗадание.Номер                       = Задания.Количество();
			НовоеЗадание.ТолькоПросмотр              = (СтрокаТВЗ.НаОсновеЭлектронногоРесурса И НЕ СтрокаТВЗ.ПреподавательВыставляетОценку);
			НовоеЗадание.НаОсновеЭлектронногоРесурса = СтрокаТВЗ.НаОсновеЭлектронногоРесурса;
			НовоеЗадание.РазмещеноВВедомости         = Ложь;
			
			Если СтрокаТВЗ.НесколькоВариантов Тогда
				ЕстьЗаданияСНесколькимиВариантами = Истина; // Реквизит формы	
			КонецЕсли;
			
		КонецЦикла;
		
		Для каждого Строка Из Задания Цикл
			
			Если Строка.РазмещеноВВедомости Тогда
				Продолжить;
			КонецЕсли;
			
			НомерЗаданияСтрока = ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(Строка.Номер);
			
			// 1. Создаем реквизиты формы для ведомости и вариантов заданий
			
			// Создаем реквизит, где будет хранится информация об оценке (колонка к таблице "Ведомость").
			
			МассивТиповРеквизитаЗадание = Новый Массив;
			МассивТиповРеквизитаЗадание.Добавить(Тип("СправочникСсылка.ЭлементыШкалыОценокСУО"));
			МассивТиповРеквизитаЗадание.Добавить(Тип("СправочникСсылка.ПричиныВозвратаЗаданияНаДоработкуСУО"));
			МассивТиповРеквизитаЗадание.Добавить(Тип("Строка"));
			
			Реквизит1 = Новый РеквизитФормы("Задание" + НомерЗаданияСтрока,
										   Новый ОписаниеТипов(МассивТиповРеквизитаЗадание),
										   "Ведомость",
										   Строка.Наименование,
										   Ложь); 
										   
			
			Реквизит2 = Новый РеквизитФормы("Задание" + НомерЗаданияСтрока + "ПроверяетсяПреподавателем",
										   Новый ОписаниеТипов("Булево"),
										   "Ведомость",
										   "Задание """ + Строка.Наименование + """ проверяется преподавателем",
										   Ложь); 
										   
										   
			Реквизит3 = Новый РеквизитФормы("Задание" + НомерЗаданияСтрока + "ПроверенПреподавателем",
										   Новый ОписаниеТипов("Булево"),
										   "Ведомость",
										   "Задание """ + Строка.Наименование + """ проверено преподавателем",
										   Ложь); 
										   
										   
			Реквизит4 = Новый РеквизитФормы("Задание" + НомерЗаданияСтрока + "КомментарийПреподавателя",
										   Новый ОписаниеТипов("Строка"),
										   "Ведомость",
										   "Комментарий к выполнению задания """ + Строка.Наименование + """",
										   Истина); 
										   
										   
			Реквизит5 = Новый РеквизитФормы("Задание" + НомерЗаданияСтрока + "Прохождение",
										   Новый ОписаниеТипов("ДокументСсылка.ПопыткаВыполненияЗаданияСУО"),
										   "Ведомость",
										   "Ссылка на попытку выполнения задания """ + Строка.Наименование + """",
										   Ложь); 
										   
										   
			Реквизит6 = Новый РеквизитФормы("Задание" + НомерЗаданияСтрока + "ЭлектронныйРесурс",
										   Новый ОписаниеТипов("СправочникСсылка.СводыЗнанийСУЗ"),
										   "Ведомость",
										   "Электронный ресурс задания """ + Строка.Наименование + """",
										   Ложь); 
										   
										   
			Реквизит7 = Новый РеквизитФормы("Задание" + НомерЗаданияСтрока + "ФрагментЭлектронногоРесурса",
										   Новый ОписаниеТипов("СправочникСсылка.СодержаниеСУЗ"),
										   "Ведомость",
										   "Фрагмент электронного ресурса задания """ + Строка.Наименование + """",
										   Ложь); 
										   
										   
			Реквизит8 = Новый РеквизитФормы("Задание" + НомерЗаданияСтрока + "Ссылка",
										    Метаданные.ОпределяемыеТипы.ЗаданиеЭлектронногоОбучения.Тип,
										   "Ведомость",
										   "Ссылка на задание """ + Строка.Наименование + """",
										   Ложь); 
										   
			Реквизит9 = Новый РеквизитФормы("Задание" + НомерЗаданияСтрока + "ПрохождениеОбучения",
										   Новый ОписаниеТипов("ДокументСсылка.ПрохождениеОбученияСУО"),
										   "Ведомость",
										   "Ссылка на прохождения мероприятия задания """ + Строка.Наименование + """",
										   Ложь); 
										   
			Реквизит10 = Новый РеквизитФормы("Задание" + НомерЗаданияСтрока + "НесколькоВариантов",
										   Новый ОписаниеТипов("Булево"),
										   "Ведомость",
										   "Несколько вариантов у задания """ + Строка.Наименование + """",
										   Ложь); 
										   
			Реквизит11 = Новый РеквизитФормы("Задание" + НомерЗаданияСтрока + "Вариант",
										   Новый ОписаниеТипов("СправочникСсылка.ВариантыЗаданийСУО"),
										   "Ведомость",
										   "Вариант задания """ + Строка.Наименование + """",
										   Ложь); 
										   
			Реквизит12 = Новый РеквизитФормы("Задание" + НомерЗаданияСтрока + "ВозвращеноНаДоработку",
										   Новый ОписаниеТипов("Булево"),
										   "Ведомость",
										   НСтр("ru = 'Возвращено на доработку'"),
										   Ложь); 
										   
			Реквизит13 = Новый РеквизитФормы("Задание" + НомерЗаданияСтрока + "ПричинаВозвратаНаДоработку",
										   Новый ОписаниеТипов("СправочникСсылка.ПричиныВозвратаЗаданияНаДоработкуСУО"),
										   "Ведомость",
										   НСтр("ru = 'Причина возврата на доработку'"),
										   Ложь); 
										   
			Реквизит14 = Новый РеквизитФормы("Задание" + НомерЗаданияСтрока + "Оценка",
										   Новый ОписаниеТипов("СправочникСсылка.ЭлементыШкалыОценокСУО"),
										   "Ведомость",
										   НСтр("ru = 'Оценка'"),
										   Ложь);										   
										   
			Реквизит15 = Новый РеквизитФормы("Задание" + НомерЗаданияСтрока + "ПопыткаЗавершена",
										   Новый ОписаниеТипов("Булево"),
										   "Ведомость",
										   НСтр("ru = 'Попытка завершена'"),
										   Ложь); 
										   
										   
										   
			Если Строка.НесколькоВариантов Тогда							   
										   
			    // Создаем реквизиты для таблицы "Варианты заданий"
				
				Реквизит16 = Новый РеквизитФормы("ВариантЗадания" + НомерЗаданияСтрока,
											   Новый ОписаниеТипов("СправочникСсылка.ВариантыЗаданийСУО"),
											   "ВариантыЗаданий",
											   Строка.Наименование,
											   Истина); 
				
											   
				Реквизит17 = Новый РеквизитФормы("ВариантЗадания" + НомерЗаданияСтрока + "Прохождение",
											   Новый ОписаниеТипов("ДокументСсылка.ПопыткаВыполненияЗаданияСУО"),
											   "ВариантыЗаданий",
											   "Ссылка на попытку выполнения задания """ + Строка.Наименование + """",
											   Ложь); 
											   
			КонецЕсли;
			
			Реквизит18 = Новый РеквизитФормы("Задание" + НомерЗаданияСтрока + "ВыставляетсяОценка",
										   Новый ОписаниеТипов("Булево"),
										   "Ведомость",
										   НСтр("ru = 'Выставляется оценка'"),
										   Ложь); 			
			
			ДобавляемыеРеквизиты = Новый Массив();										   
			ДобавляемыеРеквизиты.Добавить(Реквизит1);
			ДобавляемыеРеквизиты.Добавить(Реквизит2);
			ДобавляемыеРеквизиты.Добавить(Реквизит3);
			ДобавляемыеРеквизиты.Добавить(Реквизит4);
			ДобавляемыеРеквизиты.Добавить(Реквизит5);
			ДобавляемыеРеквизиты.Добавить(Реквизит6);
			ДобавляемыеРеквизиты.Добавить(Реквизит7);
			ДобавляемыеРеквизиты.Добавить(Реквизит8);
			ДобавляемыеРеквизиты.Добавить(Реквизит9);
			ДобавляемыеРеквизиты.Добавить(Реквизит10);
			ДобавляемыеРеквизиты.Добавить(Реквизит11);
			ДобавляемыеРеквизиты.Добавить(Реквизит12);
			ДобавляемыеРеквизиты.Добавить(Реквизит13);
			ДобавляемыеРеквизиты.Добавить(Реквизит14);
			ДобавляемыеРеквизиты.Добавить(Реквизит15);
			
			Если Строка.НесколькоВариантов Тогда				
				ДобавляемыеРеквизиты.Добавить(Реквизит16);
				ДобавляемыеРеквизиты.Добавить(Реквизит17);				
			КонецЕсли;
			
			ДобавляемыеРеквизиты.Добавить(Реквизит18);

			
			ИзменитьРеквизиты(ДобавляемыеРеквизиты);
			
			// 2. Добавляем элемент формы
			
			ЭлементФормыГруппаЗадания = Элементы.Добавить("ВедомостьГруппаЗадания" + НомерЗаданияСтрока,
											 Тип("ГруппаФормы"),
											 Элементы.Ведомость); 	
			
			// Добавляем элемент формы, в котором будет отображаться оценка за задание
			
			ЭлементФормы = Элементы.Добавить("ВедомостьЗадание" + НомерЗаданияСтрока,
											 Тип("ПолеФормы"),
											 ЭлементФормыГруппаЗадания); 	
							  
			ЭлементФормы.Вид            = ВидПоляФормы.ПолеВвода;
			ЭлементФормы.Заголовок      = Строка.Наименование;
			ЭлементФормы.ПутьКДанным    = "Ведомость.Задание" + НомерЗаданияСтрока;
			ЭлементФормы.КнопкаОткрытия = Ложь;
			ЭлементФормы.КнопкаОчистки  = Истина;
			ЭлементФормы.ТолькоПросмотр = Истина;
			
			МассивПараметровВыбора = Новый Массив();
			МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец", ШкалаОценки));
			ЭлементФормы.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
			
						
			//3. Добавляем условное оформление
			
			// Добавляем условное оформление к форме,
			// Чтобы выделить те ячейки ведомости,
			// Которые требуют проверки преподавателем.
			
			// Отбор 1. Помечаем зеленым проверенные задания.
			
			НовоеОформление = УсловноеОформление.Элементы.Добавить();
			НовоеОформление.Использование = Истина;
			НовоеОформление.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный; 
			НовоеОформление.ПредставлениеПользовательскойНастройки = "Оформление проверенных заданий """ + Строка.Наименование +""""; 
			
			Отбор = НовоеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Отбор.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ведомость.Задание"+НомерЗаданияСтрока+"ПроверяетсяПреподавателем");
			Отбор.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
			Отбор.Использование    = Истина;
			Отбор.Представление    = "Ведомость.Задание"+НомерЗаданияСтрока+"ПроверяетсяПреподавателем";
			Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			Отбор.ПравоеЗначение   = Истина;
			
			Отбор = НовоеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Отбор.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ведомость.Задание"+НомерЗаданияСтрока+"ПроверенПреподавателем");
			Отбор.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
			Отбор.Использование    = Истина;
			Отбор.Представление    = "Ведомость.Задание"+НомерЗаданияСтрока+"ПроверенПреподавателем";
			Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			Отбор.ПравоеЗначение   = Истина;
			
			// Находим элемент оформления "Цвет фона"
			ЭлементОформленияЦветФона = Неопределено;
			Для каждого ЭлементОформления Из НовоеОформление.Оформление.Элементы Цикл
				Если ЭлементОформления.Параметр = Новый ПараметрКомпоновкиДанных("ЦветФона") Тогда
					ЭлементОформленияЦветФона = ЭлементОформления;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			ЭлементОформленияЦветФона.Значение = ЦветаСтиля.ПоложительныйСтатусСУ;
			ЭлементОформленияЦветФона.Использование = Истина;
			
			// Устанавливаем поле для оформления
			
			ПолеОформления = НовоеОформление.Поля.Элементы.Добавить();
			ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ВедомостьЗадание"+НомерЗаданияСтрока); 
			
			// Отбор 2. Помечаем красным задания, которые требуют проверки.
			
			НовоеОформление = УсловноеОформление.Элементы.Добавить();
			НовоеОформление.Использование = Истина;
			НовоеОформление.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный; 
			НовоеОформление.ПредставлениеПользовательскойНастройки = "Оформление требующих проверки заданий """ + Строка.Наименование +""""; 
			
			Отбор = НовоеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Отбор.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ведомость.Задание"+НомерЗаданияСтрока+"ПроверяетсяПреподавателем");
			Отбор.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
			Отбор.Использование    = Истина;
			Отбор.Представление    = "Ведомость.Задание"+НомерЗаданияСтрока+"ПроверяетсяПреподавателем";
			Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			Отбор.ПравоеЗначение   = Истина;
			
			Отбор = НовоеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Отбор.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ведомость.Задание"+НомерЗаданияСтрока+"ПроверенПреподавателем");
			Отбор.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
			Отбор.Использование    = Истина;
			Отбор.Представление    = "Ведомость.Задание"+НомерЗаданияСтрока+"ПроверенПреподавателем";
			Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			Отбор.ПравоеЗначение   = Ложь;
			
			Отбор = НовоеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Отбор.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ведомость.Задание"+НомерЗаданияСтрока+"ПопыткаЗавершена");
			Отбор.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
			Отбор.Использование    = Истина;
			Отбор.Представление    = "Ведомость.Задание"+НомерЗаданияСтрока+"ПопыткаЗавершена";
			Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			Отбор.ПравоеЗначение   = Истина;			
			
			ЭлементОформленияЦветФона = НовоеОформление.Оформление.Элементы.Найти("ЦветФона");
			ЭлементОформленияЦветФона.Значение      = ЦветаСтиля.ОтрицательныйСтатусСУ;
			ЭлементОформленияЦветФона.Использование = Истина;
			
			// Устанавливаем поле для оформления
			
			ПолеОформления = НовоеОформление.Поля.Элементы.Добавить();
			ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ВедомостьЗадание"+НомерЗаданияСтрока); 
			
			// Отбор 3. Делаем не доступными те варианты, которые были установлены ранее
			//(вариант можно установить только один раз)
			
			НовоеОформление = УсловноеОформление.Элементы.Добавить();
			НовоеОформление.Использование = Истина;
			НовоеОформление.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный; 
			НовоеОформление.ПредставлениеПользовательскойНастройки = "Оформление вариантов """ + Строка.Наименование +""""; 
			
			Отбор = НовоеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Отбор.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ВариантыЗаданий.ВариантЗадания" + НомерЗаданияСтрока + "Прохождение");
			Отбор.ВидСравнения     = ВидСравненияКомпоновкиДанных.Заполнено;
			Отбор.Использование    = Истина;
			Отбор.Представление    = "ВариантыЗаданий.ВариантЗадания" + НомерЗаданияСтрока + "Прохождение";
			Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			
			// Находим элемент оформления "ТолькоПросмотр"
			ЭлементОформленияТолькоПросмотр = Неопределено;
			Для каждого ЭлементОформления Из НовоеОформление.Оформление.Элементы Цикл
				Если ЭлементОформления.Параметр = Новый ПараметрКомпоновкиДанных("ТолькоПросмотр") Тогда
					ЭлементОформленияТолькоПросмотр = ЭлементОформления;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			ЭлементОформленияТолькоПросмотр.Значение      = Истина;
			ЭлементОформленияТолькоПросмотр.Использование = Истина;
			
			// Устанавливаем поле для оформления
			
			ПолеОформления = НовоеОформление.Поля.Элементы.Добавить();
			ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ВариантЗадание"+НомерЗаданияСтрока); 
			
		КонецЦикла;
		
		// Помечаем размещенные в форме задания
		
		Для каждого Строка Из Задания Цикл
			Строка.РазмещеноВВедомости = Истина;	
		КонецЦикла;
		
		///////////////////////////////////////////////////////////////////
		// Выбираем все результаты выполнения всех заданий для мероприятия ведомости.
		
		МассивВсехЗаданий = ТаблицаВсехЗаданийПроведения.ВыгрузитьКолонку("Задание");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.Баллы КАК Баллы,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ШкалаОценки КАК ШкалаОценки,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ПроверяетсяПреподавателем КАК ПроверяетсяПреподавателем,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ПроверенПреподавателем КАК ПроверенПреподавателем,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.КомментарийПреподавателя КАК КомментарийПреподавателя,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.Регистратор КАК Прохождение,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(ПопыткиПрохожденияЗаданийСУОСрезПоследних.Задание) = ТИП(Справочник.ЗаданияСУО)
			|			ТОГДА ПопыткиПрохожденияЗаданийСУОСрезПоследних.Задание.НаОсновеЭлектронногоРесурса
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ КАК НаОсновеЭлектронногоРесурса,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(ПопыткиПрохожденияЗаданийСУОСрезПоследних.Задание) = ТИП(Справочник.ЗаданияСУО)
			|			ТОГДА ПопыткиПрохожденияЗаданийСУОСрезПоследних.Задание.ЭлектронныйРесурс
			|		ИНАЧЕ ПопыткиПрохожденияЗаданийСУОСрезПоследних.Задание
			|	КОНЕЦ КАК ЭлектронныйРесурс,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(ПопыткиПрохожденияЗаданийСУОСрезПоследних.Задание) = ТИП(Справочник.ЗаданияСУО)
			|			ТОГДА ПопыткиПрохожденияЗаданийСУОСрезПоследних.Задание.Фрагмент
			|		ИНАЧЕ NULL
			|	КОНЕЦ КАК Фрагмент,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.НесколькоВариантов КАК НесколькоВариантов,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.Вариант КАК Вариант,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.Вариант.ЭлектронныйРесурс КАК ВариантЭлектронныйРесурс,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.Вариант.Фрагмент КАК ВариантФрагмент,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.Задание КАК Задание,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ПрохождениеОбучения КАК ПрохождениеОбучения,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ЗавершеноВПроцентах КАК ЗавершеноВПроцентах,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ПопыткаЗавершена КАК ПопыткаЗавершена,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ВозвращеноНаДоработку КАК ВозвращеноНаДоработку,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ПричинаВозвратаНаДоработку КАК ПричинаВозвратаНаДоработку,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ВыставляетсяОценка КАК ВыставляетсяОценка
			|ИЗ
			|	РегистрСведений.ПопыткиПрохожденияЗаданийСУО.СрезПоследних КАК ПопыткиПрохожденияЗаданийСУОСрезПоследних
			|ГДЕ
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ПроведениеОбучения = &ПроведениеОбучения
			|	И ПопыткиПрохожденияЗаданийСУОСрезПоследних.Задание В(&Задания)";

		Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);
		Запрос.УстановитьПараметр("Задания", МассивВсехЗаданий);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		// Получаем из базы оценки по каждому заданию и заносим их в ведомость
		
		Для каждого Строка Из Ведомость Цикл
		 
			Для каждого Элемент Из Задания Цикл

				НомерЗадания = ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(Элемент.Номер);
				
				Строка["Задание"+НомерЗадания+"Ссылка"]              = Элемент.Задание;
				Строка["Задание"+НомерЗадания+"ПрохождениеОбучения"] = Строка.Прохождение;
				Строка["Задание"+НомерЗадания+"НесколькоВариантов"]  = Элемент.НесколькоВариантов;
									
				СтруктураПоиска = Новый Структура("ПрохождениеОбучения, Задание", Строка.Прохождение, Элемент.Задание);
				
				ВыборкаДетальныеЗаписи.Сбросить();
				
				Если ВыборкаДетальныеЗаписи.НайтиСледующий(СтруктураПоиска) Тогда										
										
					Строка["Задание"+НомерЗадания+"ПроверяетсяПреподавателем"]  = ВыборкаДетальныеЗаписи.ПроверяетсяПреподавателем;					
					Строка["Задание"+НомерЗадания+"Прохождение"]                = ВыборкаДетальныеЗаписи.Прохождение;
					Строка["Задание"+НомерЗадания+"Вариант"]                    = ВыборкаДетальныеЗаписи.Вариант;				
					
					
					Если ВыборкаДетальныеЗаписи.НаОсновеЭлектронногоРесурса Тогда
						
						Если ВыборкаДетальныеЗаписи.НесколькоВариантов Тогда
							Строка["Задание"+НомерЗадания+"ЭлектронныйРесурс"]           = ВыборкаДетальныеЗаписи.ВариантЭлектронныйРесурс;
							Строка["Задание"+НомерЗадания+"ФрагментЭлектронногоРесурса"] = ВыборкаДетальныеЗаписи.ВариантФрагмент;
						Иначе
							Строка["Задание"+НомерЗадания+"ЭлектронныйРесурс"]           = ВыборкаДетальныеЗаписи.ЭлектронныйРесурс;
							Строка["Задание"+НомерЗадания+"ФрагментЭлектронногоРесурса"] = ВыборкаДетальныеЗаписи.Фрагмент;
						КонецЕсли;
						
					КонецЕсли;
					
					ОценкаЗаЗадание = УправлениеОбучениемСУОПовтИсп.ОценкаИзБаллов(ВыборкаДетальныеЗаписи.Баллы, ВыборкаДетальныеЗаписи.ШкалаОценки);
					
					ЗаполнитьРеквизитыЗаданияВВедомости(Строка, НомерЗадания, ВыборкаДетальныеЗаписи, ОценкаЗаЗадание);
									
				КонецЕсли;
				
			КонецЦикла;
		 
		КонецЦикла;
		
		// Заносим варианты заданий
		
		Для каждого Строка Из ВариантыЗаданий Цикл
			
			Для каждого Элемент Из Задания Цикл
				
				СтруктураПоиска = Новый Структура("ПрохождениеОбучения, Задание", Строка.Прохождение, Элемент.Задание);
				
				ВыборкаДетальныеЗаписи.Сбросить();
				
				Если ВыборкаДетальныеЗаписи.НайтиСледующий(СтруктураПоиска)
					И ВыборкаДетальныеЗаписи.НесколькоВариантов Тогда
					
					НомерЗадания = ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(Элемент.Номер);
					
					Строка["ВариантЗадания"+НомерЗадания] = ВыборкаДетальныеЗаписи.Вариант;
					Строка["ВариантЗадания"+НомерЗадания+"Прохождение"] = ВыборкаДетальныеЗаписи.Прохождение;
					
				КонецЕсли;
				
			КонецЦикла;
		 
		КонецЦикла;
		
	КонецЕсли; // ВыставляетсяОценка
	
	///////////////////////////////////////////////////////////////////
	// Учебные группы
	
	Если ЭтоОбразовательнаяОрганизация ИЛИ ИспользоватьСтудентов Тогда
		ЗаполнитьСписокУчебныхГруппИСтудентов();	
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////////
	// Вопросы
	
	ЗаполнитьВопросыНаПроверку();
	
	///////////////////////////////////////////////////////////////////
	// Устанавливаем доступность элементов
	
	Элементы.СтраницаВопросыНаПроверку.Видимость = ?(ВопросынаПроверку.Количество() > 0, Истина, Ложь);
		
	Ведомость.Сортировать("ПолноеИмяПользователя");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьРеквизитыЗаданияВВедомости(Строка, НомерЗадания, Данные, Оценка)
	
	Строка["Задание"+НомерЗадания+"ПроверенПреподавателем"]     = Данные.ПроверенПреподавателем;
	Строка["Задание"+НомерЗадания+"КомментарийПреподавателя"]   = Данные.КомментарийПреподавателя;
	Строка["Задание"+НомерЗадания+"ПопыткаЗавершена"]           = Данные.ПопыткаЗавершена;
	Строка["Задание"+НомерЗадания+"ВозвращеноНаДоработку"]      = Данные.ВозвращеноНаДоработку;				
	Строка["Задание"+НомерЗадания+"ПричинаВозвратаНаДоработку"] = Данные.ПричинаВозвратаНаДоработку;										
	Строка["Задание"+НомерЗадания+"ВыставляетсяОценка"]         = Данные.ВыставляетсяОценка;
	
	Если Данные.ВозвращеноНаДоработку Тогда
		
		Если ЗначениеЗаполнено(Данные.ПричинаВозвратаНаДоработку) Тогда
			Строка["Задание"+НомерЗадания] = Данные.ПричинаВозвратаНаДоработку;
		Иначе
			Строка["Задание"+НомерЗадания] = НСтр("ru = 'Возвращено на доработку'");
		КонецЕсли;
		
		Строка["Задание"+НомерЗадания+"Оценка"] = Неопределено;
		
	ИначеЕсли (Данные.ПопыткаЗавершена И Данные.ПроверенПреподавателем И Данные.ВыставляетсяОценка)
		ИЛИ (Данные.ПопыткаЗавершена И НЕ Данные.ПроверяетсяПреподавателем И Данные.ВыставляетсяОценка) Тогда
		
		Строка["Задание"+НомерЗадания+"Оценка"] = Оценка;
		Строка["Задание"+НомерЗадания]          = Оценка;
		
	Иначе
		
		Строка["Задание"+НомерЗадания+"Оценка"] = Неопределено;
		Строка["Задание"+НомерЗадания] = Неопределено;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьСтрокуВедомости(НомерСтроки, НомерЗадания)
	
	Строка = Ведомость.НайтиПоИдентификатору(НомерСтроки);
	
	КомментарийПреподавателя   = Строка["Задание"+НомерЗадания+"КомментарийПреподавателя"];
	ОценкаЗаЗадание            = Строка["Задание"+НомерЗадания+"Оценка"];
	НесколькоВариантов         = Строка["Задание"+НомерЗадания+"НесколькоВариантов"];
	ПричинаВозвратаНаДоработку = Строка["Задание"+НомерЗадания+"ПричинаВозвратаНаДоработку"];
	ПопыткаЗавершена           = Строка["Задание"+НомерЗадания+"ПопыткаЗавершена"];
	ПопыткаВыполненияЗадания   = Строка["Задание"+НомерЗадания+"Прохождение"];
	Задание                    = Строка["Задание"+НомерЗадания+"Ссылка"];
	
	Возврат ОбучениеСУО.ПриПрохожденииЗадания(Строка.Прохождение, Задание, ОценкаЗаЗадание, КомментарийПреподавателя, Истина, Неопределено,,,ПопыткаЗавершена,,Ложь,ПопыткаВыполненияЗадания,ПричинаВозвратаНаДоработку,Пользователи.ТекущийПользователь());	
		
КонецФункции

&НаСервере
Процедура УстановитьАктуальностьПроведенияПреподавателемОбучения(Значение)
	
	Документы.ПроведениеПреподавателемОбученияСУО.УстановитьОтметкуПроведено(Обучение, Значение); 
	Актуально = Документы.ПроведениеПреподавателемОбученияСУО.Актуально(Обучение);
	
	УстановитьДоступностьЭлементовВедомости();
		
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовВедомости() 
	
	Если ВидОбучения.ВыставляетсяОценка Тогда
		
		Элементы.ВедомостьИтоговаяОценка.Видимость = Истина;
		
		Если Задания.Количество() = 0 И НЕ ЭтоЭлектронноеОбучение Тогда			
			Элементы.ВедомостьИтоговаяОценка.ТолькоПросмотр = Ложь;
			Элементы.ВедомостьЗаписатьИтоговыеОценкиВедомости.Видимость = Истина;
		Иначе			
			Элементы.ВедомостьИтоговаяОценка.ТолькоПросмотр = Истина;			
			Элементы.ВедомостьЗаписатьИтоговыеОценкиВедомости.Видимость = Ложь;
		КонецЕсли;
		
	Иначе
		
		Элементы.ВедомостьИтоговаяОценка.Видимость = Ложь;
		Элементы.ВедомостьЗаписатьИтоговыеОценкиВедомости.Видимость = Ложь;
		
	КонецЕсли;
	
	Элементы.ВедомостьТекущаяОценка.Видимость = ПоказыватьТекущуюОценку;
	
	Если Задания.Количество() > 0 ИЛИ ТипЗнч(Сценарий) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
		Элементы.ВедомостьПроверитьОбучениеУчащегося.Видимость = Истина;
	Иначе
		Элементы.ВедомостьПроверитьОбучениеУчащегося.Видимость = Ложь;
	КонецЕсли;
	
	Если ТипЗнч(Сценарий) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
		Элементы.ВедомостьПроверитьОбучениеУчащегося.Заголовок = НСтр("ru = 'Проверить'");
	КонецЕсли;
	
	СтатусПроцессаПреподавания = Документы.ПроведениеПреподавателемОбученияСУО.СтатусПроцессаПреподавания(Обучение);
	
	Если СтатусПроцессаПреподавания = Перечисления.СтатусыПроцессаПреподаванияСУО.Провожу Тогда
		Элементы.ВедомостьЗакончитьПроведениеПреподавателемОбучения.Видимость = Истина;
	Иначе
		Элементы.ВедомостьЗакончитьПроведениеПреподавателемОбучения.Видимость = Ложь;
	КонецЕсли;
	
	Если СтатусПроцессаПреподавания = Перечисления.СтатусыПроцессаПреподаванияСУО.Провел Тогда
		Элементы.ВедомостьАктивизироватьПроведениеПреподавателемОбучения.Видимость = Истина;
	Иначе
		Элементы.ВедомостьАктивизироватьПроведениеПреподавателемОбучения.Видимость = Ложь;
	КонецЕсли;
	
	
	Элементы.ВедомостьЗаписатьИтоговыеОценкиВедомости.Доступность = Актуально;
	Элементы.ВедомостьПроверитьОбучениеУчащегося.Доступность = Актуально;
	Элементы.ВедомостьНаписатьКомментарийУчастнику.Доступность = Актуально;
	
	Если СтатусПроцессаПреподавания = Перечисления.СтатусыПроцессаПреподаванияСУО.Запланировано Тогда
		Элементы.ВедомостьУстановитьСтатусПроходит.Доступность = Истина;
		Элементы.ВедомостьУстановитьСтатусЗавершил.Доступность = Ложь;
		Элементы.ВедомостьУстановитьСтатусНеЗавершил.Доступность = Ложь;
		Элементы.ВедомостьУстановитьСтатусНеДопущен.Доступность = Истина;
		Элементы.ВедомостьУстановитьСтатусАвтомат.Доступность = Истина;		
		Элементы.ВедомостьУстановитьСтатусПроходитДляВсех.Доступность = Истина;
		Элементы.ВедомостьУстановитьСтатусЗавершилДляВсех.Доступность = Ложь;
		Элементы.ВедомостьУстановитьСтатусНеЗавершилДляВсех.Доступность = Ложь;
		Элементы.ВедомостьУстановитьСтатусНеДопущенДляВсех.Доступность = Истина;
		Элементы.ВедомостьУстановитьСтатусАвтоматДляВсех.Доступность = Истина;	
	Иначе
		Элементы.ВедомостьГруппаКнопокСтатусы.Доступность = Актуально;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокУчебныхГруппИСтудентов()
	
	УстановитьПривилегированныйРежим(Истина);
	
	УчебныеГруппыОО.Очистить();	
	
	МассивПользователей = Новый Массив();
	
	Для каждого Строка Из Ведомость Цикл
		МассивПользователей.Добавить(Строка.Пользователь);	
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтудентыООСрезПоследних.Пользователь,
		|	СтудентыООСрезПоследних.УчебнаяГруппа
		|ИЗ
		|	РегистрСведений.СтудентыОО.СрезПоследних КАК СтудентыООСрезПоследних
		|ГДЕ
		|	СтудентыООСрезПоследних.Пользователь В (&МассивПользователей)";

	Запрос.УстановитьПараметр("МассивПользователей", МассивПользователей);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	//Заполняем таблицы
	//
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		//Ведомость
		
		НайденныеСтроки = Ведомость.НайтиСтроки(Новый Структура("Пользователь", ВыборкаДетальныеЗаписи.Пользователь));
		СтрокаВедомости = НайденныеСтроки[0]; //Есть всегда
		
		СтрокаВедомости.УчебнаяГруппаОО = ВыборкаДетальныеЗаписи.УчебнаяГруппа;
		
		//Учебные группы
		
		НайденныеСтроки = УчебныеГруппыОО.НайтиСтроки(Новый Структура("УчебнаяГруппа", ВыборкаДетальныеЗаписи.УчебнаяГруппа));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			СтрокаУчебнойГруппы = УчебныеГруппыОО.Добавить();                                 
			СтрокаУчебнойГруппы.УчебнаяГруппа = ВыборкаДетальныеЗаписи.УчебнаяГруппа;
			СтрокаУчебнойГруппы.Наименование  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальныеЗаписи.УчебнаяГруппа, "Наименование");
			
		Иначе
			
			СтрокаУчебнойГруппы = НайденныеСтроки[0];
			
		КонецЕсли;
		
		СтрокаУчебнойГруппы.КоличествоСтудентов = СтрокаУчебнойГруппы.КоличествоСтудентов + 1;
		СтрокаУчебнойГруппы.СуммаБалловСтудентов = СтрокаУчебнойГруппы.СуммаБалловСтудентов + СтрокаВедомости.Баллы;
		
		Если СтрокаВедомости.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Зачислен Тогда
			СтрокаУчебнойГруппы.КоличествоЗачисленныхСтудентов = СтрокаУчебнойГруппы.КоличествоЗачисленныхСтудентов + 1;
		КонецЕсли;
		
		Если СтрокаВедомости.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Проходит Тогда
			СтрокаУчебнойГруппы.КоличествоВыполняющихСтудентов = СтрокаУчебнойГруппы.КоличествоВыполняющихСтудентов + 1;
		КонецЕсли;
		
		Если СтрокаВедомости.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил Тогда
			СтрокаУчебнойГруппы.КоличествоЗавершившихСтудентов = СтрокаУчебнойГруппы.КоличествоЗавершившихСтудентов + 1;
		КонецЕсли;
		
		Если СтрокаВедомости.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат Тогда
			СтрокаУчебнойГруппы.КоличествоЗавершившихСтудентов = СтрокаУчебнойГруппы.КоличествоЗавершившихСтудентов + 1;
		КонецЕсли;
		
		Если СтрокаВедомости.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.НеЗавершил Тогда
			СтрокаУчебнойГруппы.КоличествоНеЗавершившихСтудентов = СтрокаУчебнойГруппы.КоличествоНеЗавершившихСтудентов + 1;
		КонецЕсли;
		
		Если СтрокаВедомости.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.НеДопущен Тогда
			СтрокаУчебнойГруппы.КоличествоНеДопущенныхСтудентов = СтрокаУчебнойГруппы.КоличествоНеДопущенныхСтудентов + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	//Считаем сводные данные
	//
	
	//Учебные группы
	
	Для каждого Строка Из УчебныеГруппыОО Цикл
		
		Если Строка.СуммаБалловСтудентов > 0 Тогда
			Строка.СреднийБалл = Окр(Строка.СуммаБалловСтудентов / Строка.КоличествоСтудентов, 2);
		КонецЕсли;
		
	КонецЦикла;
	
	//Сортируем и делаем отбор
	//
	
	УчебныеГруппыОО.Сортировать("Наименование");	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВопросыНаПроверку()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветНаВопросСУЗ.Ссылка,
		|	ОтветНаВопросСУЗ.Пользователь,
		|	ОтветНаВопросСУЗ.ДатаОтвета,
		|	ОтветНаВопросСУЗ.ПроверенПреподавателем,
		|	ОтветНаВопросСУЗ.Вопрос.Наименование КАК Наименование,
		|	ОтветНаВопросСУЗ.СессияВыполненияТеста,
		|	ОтветНаВопросСУЗ.СессияВыполненияТеста.ПрохождениеОбучения КАК ПрохождениеОбучения,
		|	ОтветНаВопросСУЗ.СессияВыполненияТеста.Задание КАК Задание,
		|	ПопыткаВыполненияПодборкиВопросовСУЗГруппыПодборки.НомерСтроки КАК НомерГруппыПодборки
		|ИЗ
		|	Документ.ОтветНаВопросСУЗ КАК ОтветНаВопросСУЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПопыткаВыполненияПодборкиВопросовСУЗ.Вопросы КАК ПопыткаВыполненияПодборкиВопросовСУЗВопросы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПопыткаВыполненияПодборкиВопросовСУЗ.ГруппыПодборки КАК ПопыткаВыполненияПодборкиВопросовСУЗГруппыПодборки
		|			ПО ПопыткаВыполненияПодборкиВопросовСУЗВопросы.ГруппаПодборки = ПопыткаВыполненияПодборкиВопросовСУЗГруппыПодборки.ГруппаПодборки
		|				И ПопыткаВыполненияПодборкиВопросовСУЗВопросы.Ссылка = ПопыткаВыполненияПодборкиВопросовСУЗГруппыПодборки.Ссылка
		|		ПО ОтветНаВопросСУЗ.СессияВыполненияТеста = ПопыткаВыполненияПодборкиВопросовСУЗВопросы.Ссылка
		|			И ОтветНаВопросСУЗ.Вопрос = ПопыткаВыполненияПодборкиВопросовСУЗВопросы.Вопрос
		|ГДЕ
		|	ОтветНаВопросСУЗ.ПроверяетсяПреподавателем = ИСТИНА
		|	И ОтветНаВопросСУЗ.Проведен = ИСТИНА
		|	И ОтветНаВопросСУЗ.ВопросОтвечен = ИСТИНА
		|   И ОтветНаВопросСУЗ.Отменено = ЛОЖЬ
		|	И ОтветНаВопросСУЗ.СессияВыполненияТеста.ПрохождениеОбучения.ПроведениеОбучения = &ПроведениеМероприятия
		|	И ОтветНаВопросСУЗ.СессияВыполненияТеста.Подборка.НазначениеТестирования <> &НазначениеТестированияАнкета";

	Запрос.УстановитьПараметр("ПроведениеМероприятия", ПроведениеОбучения);
	Запрос.УстановитьПараметр("НазначениеТестированияАнкета", Перечисления.НазначенияТестированийСУЗ.Анкетирование);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НайденныеСтроки = ВопросыНаПроверку.НайтиСтроки(Новый Структура("ОтветНаВопрос", ВыборкаДетальныеЗаписи.Ссылка));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = ВопросыНаПроверку.Добавить();
		Иначе
			НоваяСтрока = НайденныеСтроки[0];
		КонецЕсли;
		
		НоваяСтрока.Наименование = ВыборкаДетальныеЗаписи.Наименование;
		НоваяСтрока.ОтветНаВопрос = ВыборкаДетальныеЗаписи.Ссылка;
		НоваяСтрока.Проверен = ВыборкаДетальныеЗаписи.ПроверенПреподавателем;
		НоваяСтрока.ДатаОтвета = ВыборкаДетальныеЗаписи.ДатаОтвета;
		НоваяСтрока.Пользователь = ВыборкаДетальныеЗаписи.Пользователь;
		НоваяСтрока.СессияТестирования = ВыборкаДетальныеЗаписи.СессияВыполненияТеста;
		НоваяСтрока.ПрохождениеОбучения = ВыборкаДетальныеЗаписи.ПрохождениеОбучения;
		НоваяСтрока.Задание = ВыборкаДетальныеЗаписи.Задание;
		НоваяСтрока.НомерГруппыПодборки = ВыборкаДетальныеЗаписи.НомерГруппыПодборки;
		
		НайденныеСтроки = Ведомость.НайтиСтроки(Новый Структура("Пользователь", НоваяСтрока.Пользователь));
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			НоваяСтрока.УчебнаяГруппа = НайденныеСтроки[0].УчебнаяГруппаОО;		
		КонецЕсли;
		
	КонецЦикла;
	
	//Считаем сводные данные
	//
	
	// Ведомость
	
	Для каждого Строка Из Ведомость Цикл
		
		СтрокиВопросыНаПроверку = ВопросыНаПроверку.НайтиСтроки(Новый Структура("Пользователь, Проверен", Строка.Пользователь, Ложь));
		
		Строка.КоличествоВопросовНаПроверку = СтрокиВопросыНаПроверку.Количество();
	
	КонецЦикла;
	
	//Учебные группы
	
	Для каждого Строка Из УчебныеГруппыОО Цикл
		
		СтрокиВопросыНаПроверку = ВопросыНаПроверку.НайтиСтроки(Новый Структура("УчебнаяГруппа, Проверен", Строка.УчебнаяГруппа, Ложь));
		
		Строка.КоличествоВопросовНаПроверку = СтрокиВопросыНаПроверку.Количество();
		
	КонецЦикла;
	
	//Сортируем
	
	ВопросыНаПроверку.Сортировать("ДатаОтвета");
	
КонецПроцедуры

&НаКлиенте
Процедура НаписатьПользователюВедомости(Команда)

	ТекущиеДанные = Элементы.Ведомость.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Контекст", ТекущиеДанные.Пользователь);
	ОткрытьФорму("Документ.СообщениеСУО.ФормаОбъекта", ПараметрыФормы);	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИтоговыеОценкиВедомостиНаСервере()
	
	Для каждого СтрокаВедомости Из Ведомость Цикл
		Если ЗначениеЗаполнено(СтрокаВедомости.ИтоговаяОценка) Тогда
			ОбучениеСУО.ПриПрохожденииМероприятия(СтрокаВедомости.Прохождение, Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил,,СтрокаВедомости.ИтоговаяОценка);
		КонецЕсли;		
	КонецЦикла;

	ЗагрузитьВедомость();

	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура НаписатьКомментарийУчастнику()
	
	ТекущиеДанные = Элементы.Ведомость.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("КомментарийЗавершениеВвода", ЭтотОбъект, Элементы.Ведомость.ТекущаяСтрока);
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(Оповещение, ТекущиеДанные.Комментарий, НСтр("ru = 'Укажите комментарий для участника'"));
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийЗавершениеВвода(Знач ВведенныйТекст, Знач ДополнительныеПараметры) Экспорт
	Если ВведенныйТекст = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущаяСтрока = Ведомость.НайтиПоИдентификатору(ДополнительныеПараметры);
	ТекущаяСтрока.Комментарий = ВведенныйТекст;
	ЗаписатьКомментарийПрохождения(ТекущаяСтрока.Прохождение, ВведенныйТекст);
КонецПроцедуры

// Общее

&НаКлиенте
Процедура ОткрытьОбъект(СтруктураСсылки, УникальныйИдентификатор, Владелец, Пользователь=Неопределено) Экспорт
	
	ИмяОбъекта = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "object");
	
	Если ЗначениеЗаполнено(ИмяОбъекта) Тогда
		
		ОписаниеОбъекта = УправлениеОбучениемСУОВызовСервера.ПолучитьОписаниеОбъектаДляОткрытияПоСсылке(СтруктураСсылки); // Вызов сервера
		
		Если ОписаниеОбъекта.ИмяОбъекта = "book" Тогда
			ПараметрыФормы = Новый Структура("Книга", ОписаниеОбъекта.Ссылка);
			ОткрытьФорму("Справочник.ЛитератураСУО.Форма.ФормаКарточка", ПараметрыФормы);
		КонецЕсли;
	
		Если ОписаниеОбъекта.ИмяОбъекта = "teacher" Тогда
			
			ПоказатьЗначение(,ОписаниеОбъекта.Пользователь);
			
			//--| БШ |--//
			// ПараметрыФормы = Новый Структура("Контекст", ОписаниеОбъекта.Пользователь);
			// ОткрытьФорму("Документ.СообщениеСУО.ФормаОбъекта", ПараметрыФормы);
			//----------//
			
		КонецЕсли;
		
		Если ОписаниеОбъекта.ИмяОбъекта = "file" Тогда
			
			ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(ОписаниеОбъекта.Ссылка,, УникальныйИдентификатор);
			РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
			
		КонецЕсли;
		
		Если ОписаниеОбъекта.ИмяОбъекта = "electronicResource" Тогда
			
			ОбъектыСУЗКлиент.ОткрытьОбозреватель(ОписаниеОбъекта.Ссылка,
												 ?(ОписаниеОбъекта.Свойство("Фрагмент"), ОписаниеОбъекта.Фрагмент, Неопределено),
												 ?(ОписаниеОбъекта.Свойство("Фрагмент"), Истина, Ложь),
												 ?(ОписаниеОбъекта.Свойство("Фрагмент"), ОписаниеОбъекта.Фрагмент, Неопределено)
                                                 ,
									             ,
									             ,
                                                 ,
                                                 ,
                                                 Пользователь);
												 
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура СформироватьОписание(Знач МенеджерОбучения = Неопределено)
	
	Если МенеджерОбучения = Неопределено Тогда
		МенеджерОбучения = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Обучение);
	КонецЕсли;
	
	Описание = МенеджерОбучения.УчебнаяАктивностьОписаниеHTML(Обучение, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьЗавершитьОбучение()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПредложитьЗавершитьОбучениеПродолжение", ЭтотОбъект);		
		
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Завершить обучение?'"), РежимДиалогаВопрос.ДаНет, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьЗавершитьОбучениеПродолжение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда

		РезультатЗавершения = ОбучениеСУО.ПриПрохожденииМероприятия(Обучение, "Завершил",,,,,,Истина);
		
		Если РезультатЗавершения.Свойство("Сообщение")
			И ЗначениеЗаполнено(РезультатЗавершения.Сообщение.Текст) Тогда
			
			ПоказатьПредупреждение(,РезультатЗавершения.Сообщение.Текст);
			
		КонецЕсли;

		СформироватьОписание();

		Оповестить("ОбновитьМоеОбучение");
		
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ОткрытьФайл(Файл) Экспорт
	
	ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ПолучитьДанныеФайла(Файл, УникальныйИдентификатор);
	
	ПрисоединенныеФайлыКлиент.ОткрытьФайл(ДанныеФайла);		
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТаблицуЗаданий()
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем таблицу заданий
	
	Задания.Очистить();
	
	Если ТипЗнч(Обучение) = Тип("ДокументСсылка.ПроведениеПреподавателемОбученияСУО") Тогда
		Возврат;
	КонецЕсли;
	
	УчитыватьПоследовательностьПрохождения = Документы.ПрохождениеОбученияСУО.ПоследовательноеПрохождениеЗаданий(Обучение, ПроведениеОбучения, Сценарий);
	
	ТаблицаЗаданий = Документы.ПрохождениеОбученияСУО.ЗаданияПрохождения(Обучение);
	ЗаданияДоступны = Документы.ПрохождениеОбученияСУО.ЗаданияДоступны(Обучение, ПроведениеОбучения, Сценарий, ВидОбучения);
	ПредыдущееЗаданиеСтрока = Неопределено;
	ПоказатьКолонкуПроходнойБалл = Ложь;
	
	Для каждого Строка Из ТаблицаЗаданий Цикл
	
		НоваяСтрока = Задания.Добавить();
		
		НоваяСтрока.Задание                      = Строка.Задание;
		НоваяСтрока.Наименование                 = Строка.Наименование;
		НоваяСтрока.Значимость                   = Строка.Значимость;
		НоваяСтрока.Вариант                      = Строка.Вариант;
		
		НоваяСтрока.НаОсновеЭлектронногоРесурса  = Строка.НаОсновеЭлектронногоРесурса;
		НоваяСтрока.ЭлектронныйРесурс            = Строка.ЭлектронныйРесурс;
		НоваяСтрока.Фрагмент                     = Строка.Фрагмент;
		
		НоваяСтрока.ПроверяетсяПреподавателем    = Строка.ПроверяетсяПреподавателем;
		НоваяСтрока.ПроверенПреподавателем       = Строка.ПроверенПреподавателем;
		НоваяСтрока.ПопыткаВыполнения            = Строка.ПопыткаВыполнения;
		НоваяСтрока.НеЖдатьПроверки              = Строка.НеЖдатьПроверки;
		НоваяСтрока.ЗаданиеЗавершено             = Строка.Завершено;
		НоваяСтрока.ПроходнойБалл                = Строка.ПроходнойБалл;
		НоваяСтрока.Баллы                        = Строка.Баллы;
		НоваяСтрока.ТолькоПросмотр               = НЕ Актуально;
		
		НоваяСтрока.ДатаОкончанияДоступаКЗаданию = Строка.ДатаОкончанияДоступаКЗаданию;
		НоваяСтрока.ДатаНачалаДоступаКЗаданию    = Строка.ДатаНачалаДоступаКЗаданию;
		НоваяСтрока.СкрытьВремяДоступаКЗаданию   = Строка.СкрытьВремяДоступаКЗаданию;
		
		Если ЗначениеЗаполнено(Строка.ПопыткаВыполнения) Тогда
			Если Строка.НаОсновеЭлектронногоРесурса Тогда
				НоваяСтрока.Завершено = Строка(Строка.ЗавершеноВПроцентах) + "%";
			Иначе
				НоваяСтрока.Завершено = ?(Строка.Завершено, "Да", "Нет");
			КонецЕсли;
		КонецЕсли;
		
		Если ВидОбучения.ЗаданияПроверяютсяВыборочно Тогда
			Если ЗначениеЗаполнено(Строка.ПопыткаВыполнения) Тогда
				Если Строка.НаОсновеЭлектронногоРесурса Тогда
					НоваяСтрока.ЗаданиеВыполнено = Строка.Завершено И Строка.Баллы >= Строка.ПроходнойБалл;
				Иначе
					НоваяСтрока.ЗаданиеВыполнено = Строка.Завершено;
				КонецЕсли;
			Иначе
				НоваяСтрока.ЗаданиеВыполнено = Ложь;
			КонецЕсли;
		Иначе			
			НоваяСтрока.ЗаданиеВыполнено = Документы.ПопыткаВыполненияЗаданияСУО.Выполнено(Строка.ПопыткаВыполнения, Строка.Завершено, Строка.ПроверяетсяПреподавателем, Строка.ПроверенПреподавателем, Строка.Баллы, Строка.ПроходнойБалл, Строка.ДатаОкончанияДоступаКЗаданию);
		КонецЕсли;
		
		ПолученаОценка = Документы.ПопыткаВыполненияЗаданияСУО.ПолученаОценка(Строка.ПопыткаВыполнения, Строка.Завершено, Строка.ПроверяетсяПреподавателем, Строка.ПроверенПреподавателем, Строка.ДатаОкончанияДоступаКЗаданию, Строка.ВыставляетсяОценка); 
		
		НоваяСтрока.Оценка = Неопределено;		
		Если ПолученаОценка Тогда
			НоваяСтрока.Оценка = УправлениеОбучениемСУОПовтИсп.ОценкаИзБаллов(Строка.Баллы, Строка.ШкалаОценки);
			Если Справочники.ШкалыОценокСУО.ПоказыватьБаллыВместеСОценкой(Строка.ШкалаОценки) Тогда
				НоваяСтрока.Оценка = НоваяСтрока.Оценка + " (" + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(Строка.Баллы) + " баллов)";
			КонецЕсли;			
		КонецЕсли;
		
		Если НЕ ВидОбучения.ПоказыватьПодробныеСведенияОЗадании
			И НоваяСтрока.Значимость = 0 Тогда
			НоваяСтрока.Оценка = Неопределено;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.ДатаНачалаДоступаКЗаданию)
			ИЛИ ЗначениеЗаполнено(Строка.ДатаОкончанияДоступаКЗаданию) Тогда
			
			НоваяСтрока.ПродолжительностьСтрока = ОбщегоНазначенияСУКлиентСервер.ПериодВСтроку(
				Строка.ДатаНачалаДоступаКЗаданию, Строка.ДатаОкончанияДоступаКЗаданию, Строка.СкрытьВремяДоступаКЗаданию);
			
		КонецЕсли;
		
		НоваяСтрока.ДоступноДляПрохождения = ЗаданияДоступны;
		
		Если НоваяСтрока.ДоступноДляПрохождения
			И ЗначениеЗаполнено(Строка.ДатаНачалаДоступаКЗаданию)
			И Строка.ДатаНачалаДоступаКЗаданию > ТекущаяДатаСеанса() Тогда
				
			НоваяСтрока.ДоступноДляПрохождения = Ложь;
				
		КонецЕсли;
			
		Если НоваяСтрока.ДоступноДляПрохождения И УчитыватьПоследовательностьПрохождения И ПредыдущееЗаданиеСтрока <> Неопределено Тогда
			Если ПредыдущееЗаданиеСтрока.ДоступноДляПрохождения Тогда				
				Если ВидОбучения.ЗаданияПроверяютсяВыборочно ИЛИ ПредыдущееЗаданиеСтрока.НеЖдатьПроверки Тогда
					Если НЕ ПредыдущееЗаданиеСтрока.ЗаданиеЗавершено Тогда
						НоваяСтрока.ДоступноДляПрохождения = Ложь;
					ИначеЕсли ПредыдущееЗаданиеСтрока.НаОсновеЭлектронногоРесурса И ПредыдущееЗаданиеСтрока.Баллы < ПредыдущееЗаданиеСтрока.ПроходнойБалл Тогда
						НоваяСтрока.ДоступноДляПрохождения = Ложь;
					КонецЕсли;
				Иначе
					НоваяСтрока.ДоступноДляПрохождения = ПредыдущееЗаданиеСтрока.ЗаданиеВыполнено;	
				КонецЕсли;	
			Иначе
				НоваяСтрока.ДоступноДляПрохождения = Ложь;
			КонецЕсли;
		КонецЕсли;	
		
		НоваяСтрока.ПроходнаяОценка = Неопределено;
		
		Если ВидОбучения.ЗаданияПроверяютсяВыборочно И НЕ НоваяСтрока.НаОсновеЭлектронногоРесурса Тогда
			НоваяСтрока.ПроходнаяОценка = "";
		Иначе
			Если Строка.ПроходнойБалл > 0 Тогда
				ПоказатьКолонкуПроходнойБалл = Истина;
				Если НоваяСтрока.ДоступноДляПрохождения Тогда
					НоваяСтрока.ПроходнаяОценка = УправлениеОбучениемСУОПовтИсп.ОценкаИзБаллов(Строка.ПроходнойБалл, Строка.ШкалаОценки);
					Если Справочники.ШкалыОценокСУО.ПоказыватьБаллыВместеСОценкой(Строка.ШкалаОценки)
						И ВидОбучения.ПоказыватьПодробныеСведенияОЗадании  Тогда
						НоваяСтрока.ПроходнаяОценка = НоваяСтрока.ПроходнаяОценка + " (" + НСтр("ru = 'мин. '") 
							+ ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(Строка.ПроходнойБалл) + " баллов)";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;					
		КонецЕсли;		
		
		Если ЗначениеЗаполнено(Строка.ПопыткаВыполнения) И НоваяСтрока.ДоступноДляПрохождения Тогда			
			Если НоваяСтрока.ПроверяетсяПреподавателем Тогда
				Если Строка.ВозвращеноНаДоработку Тогда
					НоваяСтрока.Проверен = НСтр("ru = 'Возвращено на доработку'");
				Иначе
					Если Строка.Завершено Тогда
						НоваяСтрока.Проверен = ?(НоваяСтрока.ПроверенПреподавателем, НСтр("ru = 'Проверено'"), НСтр("ru = 'Проверяется'"));
					Иначе
						НоваяСтрока.Проверен = "";
					КонецЕсли;
				КонецЕсли;			
			Иначе
				НоваяСтрока.Проверен = НСтр("ru = 'Не требует проверки'");
			КонецЕсли;					
		Иначе
			НоваяСтрока.Проверен = "";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.ПопыткаВыполнения)
			И Строка.Завершено
			И ЗначениеЗаполнено(НоваяСтрока.ПроходнаяОценка)
			И Строка.Баллы < Строка.ПроходнойБалл
			И (НЕ Строка.ПроверяетсяПреподавателем ИЛИ Строка.ПроверенПреподавателем)
			И ВидОбучения.ПоказыватьПодробныеСведенияОЗадании Тогда
			
			НоваяСтрока.ВыделитьОценку = Истина;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.ПопыткаВыполнения)
			И Строка.Завершено
			И ЗначениеЗаполнено(НоваяСтрока.ПроходнаяОценка)
			И Строка.Баллы < Строка.ПроходнойБалл
			И (НЕ Строка.ПроверяетсяПреподавателем ИЛИ Строка.ПроверенПреподавателем)
			И НЕ ВидОбучения.ПоказыватьПодробныеСведенияОЗадании Тогда
			
			НоваяСтрока.Завершено = НСтр("ru = 'Улучшите оценку!'")
			
		КонецЕсли;
		
		ПредыдущееЗаданиеСтрока = НоваяСтрока;
		
	КонецЦикла;
	
	Элементы.ЗаданияПроходнаяОценка.Видимость = ПоказатьКолонкуПроходнойБалл;
	
	Если НЕ ВидОбучения.ПоказыватьПодробныеСведенияОЗадании Тогда
		Элементы.ЗаданияПроходнаяОценка.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусПрохождения(ИмяСтатуса)
	
	ТекущиеДанные = Элементы.Ведомость.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Прохождения = Новый Массив;
	Прохождения.Добавить(ТекущиеДанные.Прохождение);
	ЗаписатьСтатусПрохождений(Прохождения, ПредопределенноеЗначение("Перечисление.СтатусыПрохожденияОбъектовСУО."+ИмяСтатуса));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусПрохожденияДляВсех(ИмяСтатуса)
	
	Прохождения = Новый Массив;
	Для каждого Строка Из Ведомость Цикл
		Прохождения.Добавить(Строка.Прохождение);
	КонецЦикла;
	
	ЗаписатьСтатусПрохождений(Прохождения, ПредопределенноеЗначение("Перечисление.СтатусыПрохожденияОбъектовСУО."+ИмяСтатуса));
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСтатусПрохождений(ПрохожденияОбучения, СтатусПрохождения)
	
	НачатьТранзакцию();
	
	Попытка
		
		Для каждого ПрохождениеОбучения Из ПрохожденияОбучения Цикл	
			ЗаписатьСтатусПрохождения(ПрохождениеОбучения, СтатусПрохождения);	
		КонецЦикла;	
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	ЗагрузитьВедомость();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьСтатусПрохождения(ПрохождениеОбучения, СтатусПрохождения)	
	ОбучениеСУО.ПриПрохожденииМероприятия(ПрохождениеОбучения, СтатусПрохождения);					
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьКомментарийПрохождения(ПрохождениеОбучения, Комментарий)	
	ОбучениеСУО.ПриПрохожденииМероприятия(ПрохождениеОбучения,,Комментарий);
КонецПроцедуры

&НаКлиенте
Процедура НаписатьПреподавателю(Команда)
	
	ТекущиеДанные = Элементы.Преподаватели.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Контекст", ТекущиеДанные.Преподаватель);
	ОткрытьФорму("Документ.СообщениеСУО.ФормаОбъекта", ПараметрыФормы);	
	
КонецПроцедуры

#КонецОбласти

