
#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УзелЭтойБазы = ПланыОбмена.ОбменМатериаламиСУЗ.ЭтотУзел();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    ОбъектыСУЗКлиент.УстановитьЭлектронныеРесурсы();
	
	Элементы.Импорт.Обновить();
						
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЭкспорт

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Экспорт

&НаКлиенте
Процедура ЭкспортПриАктивизацииСтроки(Элемент)
	УстановитьДоступностьЭлементовФормыНаКлиенте();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура КомандаИмпорт(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжениеЗагрузкиФайла", ЭтотОбъект);		
		
	НачатьПомещениеФайла(ОписаниеОповещения,,, Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжениеЗагрузкиФайла(Результат, АдресФайла, ИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат Тогда
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(ИмяФайла);
	
	Если Файл.Расширение = ".zip" Тогда
		
		Если Сред(Файл.ИмяБезРасширения, 1, 7) = "E4HOME_" Тогда
			ИмяФормыДляИмпорта = "ПланОбмена.ОбменМатериаламиСУЗ.Форма.ФормаИмпортаПакетаЦОР";	
		Иначе
			ИмяФормыДляИмпорта = "ПланОбмена.ОбменМатериаламиСУЗ.Форма.ФормаИмпортаПакетаSCORM";	
		КонецЕсли;
		
	КонецЕсли;
	
	Если Файл.Расширение = ".xml" Тогда
		ИмяФормыДляИмпорта = "ПланОбмена.ОбменМатериаламиСУЗ.Форма.ФормаИмпортаПакетаXML";
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(ИмяФормыДляИмпорта) Тогда
		Текст = НСтр("ru = 'Неизвестный формат файла'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
	КонецЕсли;
	
	Если Файл.Расширение = ".intuit" Тогда
		ПутьКФайлуПакетаДанных = ИмяФайла;
	Иначе
		ПутьКФайлуПакетаДанных = ОбъектыСУЗ.ПолучитьПутьКПакетуДанных(АдресФайла, ИмяФайла);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ПутьКФайлуПакета", ПутьКФайлуПакетаДанных);
	
	ОткрытьФорму(ИмяФормыДляИмпорта, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЭкспорт(Команда)
	
	ТекущиеДанные = Элементы.Экспорт.ТекущиеДанные;
	
	Если НЕ ОбщегоНазначенияСУКлиент.ТекущиеДанныеТаблицыДоступны(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ТипПакетаДанных = ПредопределенноеЗначение("Перечисление.ТипыПакетовДанныхСУЗ.XML_V8") Тогда
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Узел", ТекущиеДанные.Ссылка);
		
		ОткрытьФорму("ПланОбмена.ОбменМатериаламиСУЗ.Форма.ФормаЭкспортаXML", ПараметрыФормы);
		
	КонецЕсли;
	
	Если ТекущиеДанные.ТипПакетаДанных = ПредопределенноеЗначение("Перечисление.ТипыПакетовДанныхСУЗ.SCORM_2004") Тогда
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Узел", ТекущиеДанные.Ссылка);
		
		ОткрытьФорму("ПланОбмена.ОбменМатериаламиСУЗ.Форма.ФормаЭкспортаSCORM", ПараметрыФормы);
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормыНаКлиенте()
	
	Если Элементы.Экспорт.ТекущиеДанные <> Неопределено Тогда
	
		АктивныйЭлементДляЭкспорта = Элементы.Экспорт.ТекущиеДанные.Ссылка;
		
		Если АктивныйЭлементДляЭкспорта = УзелЭтойБазы Тогда
			Элементы.ЭкспортЭкспорт.Доступность = Ложь;
		Иначе
			Элементы.ЭкспортЭкспорт.Доступность = Истина;
		КонецЕсли;
		
	Иначе
		
		Элементы.ЭкспортЭкспорт.Доступность = Ложь;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти


