
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Если ТипЗнч(Объект.СсылкаНаОбъектСУЗ) = Тип("СправочникСсылка.ФайлыСУЗ") Тогда
		Элементы.Якорь.Доступность       = Истина;
	Иначе
		Элементы.Якорь.Доступность       = Ложь;
	КонецЕсли;
	
	Если ТипЗнч(Объект.СсылкаНаОбъектСУЗ) = Тип("СправочникСсылка.ВопросыСУЗ") Тогда
		Элементы.ВесВопроса.Доступность  = Истина;
	Иначе
		Элементы.ВесВопроса.Доступность  = Ложь;
	КонецЕсли;
	
	Элементы.Наименование.ТолькоПросмотр = НЕ Объект.РазрешитьРедактироватьНаименование;
	
	// Определяем тип объекта
	
	ТипОбъекта = ПолучитьТипОбъекта(Объект.СсылкаНаОбъектСУЗ);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипОбъекта(СсылкаНаОбъектСУЗ)
	Возврат ОбъектыСУЗ.ПолучитьТипОбъектаСУЗ(СсылкаНаОбъектСУЗ);
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьДоступностьЭлементовФормы();

	//////////////////////////////////////////////////////////////////
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Объект);
	РазработкаСУЗ.УстановитьДоступностьДанныхОтПоставщика(ЭтотОбъект);
	//////////////////////////////////////////////////////////////////
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура УстановитьАвтоНаименование(Команда=Неопределено)
	
	Если ЗначениеЗаполнено(Объект.СсылкаНаОбъектСУЗ) Тогда
		Объект.Наименование = Строка(Объект.СсылкаНаОбъектСУЗ);
	Иначе
		Объект.Наименование = "";
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда 
		УстановитьАвтоНаименование();
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормы();

КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактироватьНаименованиеПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ <Наименование>

