#Область ПрограммныйИнтерфейс

// Вызывается при создании формы электронного курса и перед выполнением проверок.
// Можно отказаться от открытия или переопределить переменные.
// 
// Параметры:
//   ЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - Ссылка на электронный тест.
//   Контекст - ОпределяемыйТип.КонтекстЭлектронногоОбучения - 
//              Задает ссылку на событие, в рамках которого проходит тестирование.
//   Учащийся - ОпределяемыйТип.УчащийсяЭлектронногоОбучения - 
//                 Задает ссылку на тестируемого.
//   РежимПроверки - Булево - Форма открыта для проверки преподавателем.
//   РежимРедактирования - Булево - Форма открыта для редактирования курса.
//   РежимПросмотра - Булево - Форма открыта для изучения курса.
//   ИмяОповещенияПриЗакрытии - Строка - Имя оповещения, которое будет вызвано после закрытия.
//   Отказ - Булево - Отказ от открытия.
// 
Процедура ПриСозданииФормыЭлектронногоКурса(ЭлектронныйКурс, Контекст, Учащийся, РежимПроверки, РежимРедактирования, РежимПросмотра, ИмяОповещенияПриЗакрытии, Отказ) Экспорт
	
	ИмяОповещенияПриЗакрытии = "ПриЗакрытииЭлектронногоКурса";
	
КонецПроцедуры

// Определяет версию обработчика обновления подсистемы электронного обучения
// при внедрении ее в родительскую подсистему.
// Список версий см. ОбновлениеИнформационнойБазыБЭО.ПриДобавленииОбработчиковОбновления.
//
// Параметры:
//   СоответствиеВерсий - Соответствие - соответствие версии подсистемы Электронное обучение
//                        и родительской подсистемы.
//
//
Процедура ПриОпределенииСоответствияВерсийОбработчиковОбновлений(СоответствиеВерсий) Экспорт
КонецПроцедуры

#КонецОбласти