#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Функция Участники(РазделФорума) Экспорт

	ДляВсех = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РазделФорума, "ДляВсех");
	
	Если ДляВсех Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Пользователи.Ссылка КАК Пользователь
			|ИЗ
			|	Справочник.Пользователи КАК Пользователи
			|ГДЕ
			|	Пользователи.ПометкаУдаления = ЛОЖЬ
			|	И Пользователи.Недействителен = ЛОЖЬ";

		Результат = Запрос.Выполнить();

		ТаблицаУчастников = Результат.Выгрузить();
		
	Иначе
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РазделыФорумаСУОВидимость.Пользователь
			|ИЗ
			|	Справочник.РазделыФорумаСУО.Видимость КАК РазделыФорумаСУОВидимость
			|ГДЕ
			|	РазделыФорумаСУОВидимость.Ссылка = &РазделФорума";

		Запрос.УстановитьПараметр("РазделФорума", РазделФорума);

		Результат = Запрос.Выполнить();

		ТаблицаУчастников = Результат.Выгрузить();
		
		АвторРаздела = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РазделФорума, "Автор");
		
		Если ЗначениеЗаполнено(АвторРаздела) И ТаблицаУчастников.Найти(АвторРаздела, "Пользователь") = Неопределено Тогда
			
			НоваяСтрока = ТаблицаУчастников.Добавить();
			
			НоваяСтрока.Пользователь = АвторРаздела;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТаблицаУчастников;
	
КонецФункции

Функция РазделыПользователя(Знач Пользователь = Неопределено, Дерево = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазделыФорумаСУО.Ссылка,
		|	РазделыФорумаСУО.Наименование,
		|	РазделыФорумаСУО.Видимость.(
		|		Пользователь,
		|		Модератор
		|	),
		|	РазделыФорумаСУО.Автор
		|ИЗ
		|	Справочник.РазделыФорумаСУО КАК РазделыФорумаСУО
		|ГДЕ
		|	(РазделыФорумаСУО.Автор = &Пользователь
		|			ИЛИ РазделыФорумаСУО.Видимость.Пользователь = &Пользователь
		|			ИЛИ РазделыФорумаСУО.ДляВсех = ИСТИНА)
		|	И РазделыФорумаСУО.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	РазделыФорумаСУО.РеквизитДопУпорядочивания ИЕРАРХИЯ";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	РезультатЗапроса = Запрос.Выполнить();

	Если Дерево Тогда	
		Возврат РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);		
	Иначе		
		Возврат РезультатЗапроса.Выгрузить();		
	КонецЕсли;	
		
КонецФункции

Функция ЕстьПравоСоздаватьТемыФорума(Знач Пользователь, Знач РазделФорума) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазделыФорумаСУО.Ссылка
		|ИЗ
		|	Справочник.РазделыФорумаСУО КАК РазделыФорумаСУО
		|ГДЕ
		|	РазделыФорумаСУО.Ссылка = &РазделФорума
		|	И РазделыФорумаСУО.Автор = &Пользователь
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РазделыФорумаСУОВидимость.Ссылка
		|ИЗ
		|	Справочник.РазделыФорумаСУО.Видимость КАК РазделыФорумаСУОВидимость
		|ГДЕ
		|	РазделыФорумаСУОВидимость.Пользователь = &Пользователь
		|	И РазделыФорумаСУОВидимость.Ссылка = &РазделФорума
		|	И РазделыФорумаСУОВидимость.Модератор = ИСТИНА";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("РазделФорума", РазделФорума);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Веб-кабинет

Процедура ОбновитьДанныеВебКабинета(РазделФорума, ДополнительныеДанные = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РазделФорумаОбъект = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РазделФорума, "ПометкаУдаления, ДляВсех");
	
	РегистрыСведений.ДанныеВебКабинетаСУО_ОН.УдалитьДанные(РазделФорума, Перечисления.ТипыДанныхВебКабинетаСУО.РазделФорума);	
	РегистрыСведений.ДанныеВебКабинетаСУО_ПН.УдалитьДанные(РазделФорума, Перечисления.ТипыДанныхВебКабинетаСУО.РазделФорума);
	
	Если НЕ РазделФорумаОбъект.ПометкаУдаления Тогда

		ОписаниеРазделаJSON = РазделJSON(РазделФорума);			
		
		ПользователиРаздела = ПользователиРаздела(РазделФорума);
			
		Если ПользователиРаздела.Количество() = 0 Тогда			
			РегистрыСведений.ДанныеВебКабинетаСУО_ОН.ДобавитьДанные(Перечисления.ТипыДанныхВебКабинетаСУО.РазделФорума, РазделФорума, ОписаниеРазделаJSON, Перечисления.ФорматыВебДанныхСУ.json);			
		Иначе			
			Для каждого Пользователь Из ПользователиРаздела Цикл
				РегистрыСведений.ДанныеВебКабинетаСУО_ПН.ДобавитьДанные(Пользователь, Перечисления.ТипыДанныхВебКабинетаСУО.РазделФорума, РазделФорума, ОписаниеРазделаJSON, Перечисления.ФорматыВебДанныхСУ.json);
			КонецЦикла;			
		КонецЕсли;
		
	КонецЕсли;
	
	// Обновляем подчиненные разделы
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазделыФорумаСУО.Ссылка
		|ИЗ
		|	Справочник.РазделыФорумаСУО КАК РазделыФорумаСУО
		|ГДЕ
		|	РазделыФорумаСУО.Ссылка В ИЕРАРХИИ(&РазделФорума)
		|	И РазделыФорумаСУО.Ссылка <> &РазделФорума";
	
	Запрос.УстановитьПараметр("РазделФорума", РазделФорума);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбновитьДанныеВебКабинета(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

Функция МодераторыРаздела(РазделФорума) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазделыФорумаСУО.Автор КАК Пользователь,
		|	ФотографииПользователейСУО.ЕстьАватар КАК ЕстьАватар,
		|	РазделыФорумаСУО.Автор.Наименование КАК НаименованиеПользователя
		|ИЗ
		|	Справочник.РазделыФорумаСУО КАК РазделыФорумаСУО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФотографииПользователейСУО КАК ФотографииПользователейСУО
		|		ПО РазделыФорумаСУО.Автор = ФотографииПользователейСУО.Пользователь
		|ГДЕ
		|	РазделыФорумаСУО.Ссылка = &РазделФорума
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РазделыФорумаСУОВидимость.Пользователь,
		|	ФотографииПользователейСУО.ЕстьАватар,
		|	РазделыФорумаСУОВидимость.Пользователь.Наименование
		|ИЗ
		|	Справочник.РазделыФорумаСУО.Видимость КАК РазделыФорумаСУОВидимость
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФотографииПользователейСУО КАК ФотографииПользователейСУО
		|		ПО РазделыФорумаСУОВидимость.Пользователь = ФотографииПользователейСУО.Пользователь
		|ГДЕ
		|	РазделыФорумаСУОВидимость.Ссылка = &РазделФорума
		|	И РазделыФорумаСУОВидимость.Модератор = ИСТИНА";
	
	Запрос.УстановитьПараметр("РазделФорума", РазделФорума);
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

Функция РазделJSON(РазделФорума) Экспорт
	
	ОписаниеРаздела = Новый Структура("Наименование, Идентификатор, Родитель, Номер, Тип, Модераторы");
	
	ОписаниеРаздела.Идентификатор = Строка(РазделФорума.УникальныйИдентификатор());
	ОписаниеРаздела.Модераторы = Новый Массив;
	
	Если ТипЗнч(РазделФорума) = Тип("СправочникСсылка.РазделыФорумаСУО") Тогда
	
		ДанныеРаздела = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РазделФорума, "Наименование, Родитель, РеквизитДопУпорядочивания");
		
		ОписаниеРаздела.Наименование = ДанныеРаздела.Наименование;
		ОписаниеРаздела.Родитель = Строка(ДанныеРаздела.Родитель.УникальныйИдентификатор());
		ОписаниеРаздела.Номер = ДанныеРаздела.РеквизитДопУпорядочивания;
		ОписаниеРаздела.Тип = "forum";		
		
		ТаблицаМодераторов = МодераторыРаздела(РазделФорума);
		
		Для каждого СтрокаТМ Из ТаблицаМодераторов Цикл
			
			ЕстьАватар = ?(ТипЗнч(СтрокаТМ.ЕстьАватар) = Тип("Булево"), СтрокаТМ.ЕстьАватар, Ложь);
			
			ОписаниеМодератора = ВебКабинетСУО.ПользовательСтруктура(
				СтрокаТМ.Пользователь, СтрокаТМ.НаименованиеПользователя, ЕстьАватар);
				
			ОписаниеРаздела.Модераторы.Добавить(ОписаниеМодератора);
				
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипЗнч(РазделФорума) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		
		ОписаниеРаздела.Наименование = Документы.ПроведениеОбученияСУО.НаименованиеОбучения(РазделФорума);
		ОписаниеРаздела.Тип = "education";
		ОписаниеРаздела.Родитель = "00000000-0000-0000-0000-000000000000";
		
	КонецЕсли;
	
	Если ТипЗнч(РазделФорума) = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО") Тогда
		
		ОписаниеРаздела.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РазделФорума, "ПрограммаОбучения.Наименование");
		ОписаниеРаздела.Тип = "programmEducation";
		ОписаниеРаздела.Родитель = "00000000-0000-0000-0000-000000000000";
		
	КонецЕсли;
	
	Если ТипЗнч(РазделФорума) = Тип("СправочникСсылка.УчебныеГруппыСУО")
		ИЛИ ТипЗнч(РазделФорума) = Тип("СправочникСсылка.УчебныеГруппыОО") Тогда
		
		ОписаниеРаздела.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РазделФорума, "Наименование");
		ОписаниеРаздела.Тип = "eduGroup";
		ОписаниеРаздела.Родитель = "00000000-0000-0000-0000-000000000000";
		
	КонецЕсли;
	
	Возврат ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеРаздела);	
	
КонецФункции

Функция РазделОписаниеОбщееJSON(РазделФорума) Экспорт
	
	// КоличествоСообщений
	
	КоличествоСообщений = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(СообщенияТемСУО.Регистратор) КАК КоличествоСообщений
		|ИЗ
		|	РегистрСведений.СообщенияТемСУО КАК СообщенияТемСУО
		|ГДЕ
		|	СообщенияТемСУО.РазделФорума = &РазделФорума";
	
	Запрос.УстановитьПараметр("РазделФорума", РазделФорума);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();

		КоличествоСообщений = ВыборкаДетальныеЗаписи.КоличествоСообщений;
		
	КонецЕсли;
		
	// КоличествоТем
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ТемыСообщенийСУО.Ссылка) КАК КоличествоТем
		|ИЗ
		|	Справочник.ТемыСообщенийСУО КАК ТемыСообщенийСУО
		|ГДЕ
		|	ТемыСообщенийСУО.Контекст = &РазделФорума
		|	И ТемыСообщенийСУО.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("РазделФорума", РазделФорума);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();

	КоличествоТем = ВыборкаДетальныеЗаписи.КоличествоТем;
	
	// ПоследнееСообщение
	
	ПоследнееСообщение = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СообщенияТемСУОСрезПоследних.Регистратор КАК Сообщение
		|ИЗ
		|	РегистрСведений.СообщенияТемСУО.СрезПоследних(, РазделФорума = &РазделФорума) КАК СообщенияТемСУОСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	СообщенияТемСУОСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("РазделФорума", РазделФорума);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		ПоследнееСообщение = Документы.СообщениеСУО.СообщениеСтруктура(ВыборкаДетальныеЗаписи.Сообщение);
		
	КонецЕсли;
	
	// Описание
	
	ОписаниеРаздела = Новый Структура("ПоследнееСообщение, КоличествоСообщений, КоличествоТем", ПоследнееСообщение, КоличествоСообщений, КоличествоТем);
	ОписаниеРаздела	= ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеРаздела);	
	
	Возврат ОписаниеРаздела;
	
КонецФункции

Функция РазделОписаниеПользовательскоеJSON(РазделФорума, Пользователь) Экспорт
	
	// ДатаПросмотра
	
	ДатаПросмотра = Дата("00010101");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиТемФорумаСУО.ДатаПросмотра КАК ДатаПросмотра
		|ИЗ
		|	РегистрСведений.НастройкиТемФорумаСУО КАК НастройкиТемФорумаСУО
		|ГДЕ
		|	НастройкиТемФорумаСУО.Пользователь = &Пользователь
		|	И НастройкиТемФорумаСУО.РазделФорума = &РазделФорума
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПросмотра УБЫВ";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("РазделФорума", РазделФорума);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		ВыборкаДетальныеЗаписи.Следующий();
		
		ДатаПросмотра = ВыборкаДетальныеЗаписи.ДатаПросмотра;
		
	КонецЕсли;
	
	// Результат
	
	ОписаниеРаздела = Новый Структура("ДатаПросмотра", ДатаПросмотра);
	ОписаниеРаздела	= ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеРаздела);	
	
	Возврат ОписаниеРаздела;	
	
КонецФункции

Функция ПользователиРаздела(Раздел)
	
	МассивПользователей = Новый Массив;
	
	// Получаем всех родителей раздела (в массив входит сам раздел)
	
	МассивРодителей = Новый Массив;
	
	РодителиРаздела(Раздел, МассивРодителей);
	
	// Получаем всех пользователей разделов
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазделыФорумаСУОВидимость.Пользователь,
		|	РазделыФорумаСУОВидимость.Ссылка КАК Раздел
		|ИЗ
		|	Справочник.РазделыФорумаСУО.Видимость КАК РазделыФорумаСУОВидимость
		|ГДЕ
		|	РазделыФорумаСУОВидимость.Ссылка В(&МассивРодителей)
		|	И РазделыФорумаСУОВидимость.Ссылка.ДляВсех = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("МассивРодителей", МассивРодителей);
	
	РезультатЗапроса = Запрос.Выполнить();	
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат МассивПользователей; // Общий раздел		
	КонецЕсли;
	
	// Получаем пользователей, которые имеют право просматривать раздел
	
	ТаблицаПользователейРазделов      = РезультатЗапроса.Выгрузить();
	МассивВсехПользователей           = Новый Массив;
	МассивРазделовСПользователями     = Новый Массив;
	
	Для каждого Строка Из ТаблицаПользователейРазделов Цикл
	
		Если МассивВсехПользователей.Найти(Строка.Пользователь) = Неопределено Тогда
			МассивВсехПользователей.Добавить(Строка.Пользователь);	
		КонецЕсли;
		
		Если МассивРазделовСПользователями.Найти(Строка.Раздел) = Неопределено Тогда
			МассивРазделовСПользователями.Добавить(Строка.Раздел);
		КонецЕсли;
	
	КонецЦикла;
	
	КоличествоРазделовСПользователями = МассивРазделовСПользователями.Количество();
	
	// Подходят только тех пользователей, которые указаны во всех разделах с пользователями.
	
	Для каждого Пользователь Из МассивВсехПользователей Цикл
	
		РазделыПользователя = ТаблицаПользователейРазделов.НайтиСтроки(Новый Структура("Пользователь", Пользователь));
		
		Если РазделыПользователя.Количество() = КоличествоРазделовСПользователями Тогда
			МассивПользователей.Добавить(Пользователь);	
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат МассивПользователей;
	
КонецФункции

// Возвращает массив родителей раздела, включая сам раздел
//
Процедура РодителиРаздела(Знач Раздел, МассивРодителей)
	
	МассивРодителей.Добавить(Раздел);
	
	Родитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Раздел, "Родитель");
	
	Если ЗначениеЗаполнено(Родитель) Тогда
		РодителиРаздела(Родитель, МассивРодителей);
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
