#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;			
	
	Если ЭтоНовый() Тогда
		
		ДатаСоздания = ТекущаяДата();
		
		Если НЕ ЗначениеЗаполнено(Автор) Тогда
			Автор = Пользователи.ТекущийПользователь();
		КонецЕсли;
		
	КонецЕсли;

	ДатаИзменения = ТекущаяДата();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;			
	ОбновитьПодчиненныеДокументы();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ОбновитьПодчиненныеДокументы()
	
	Если НЕ УправлениеОбучениемСУО.МожноОбновлятьПодчиненныеДокументы(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СообщениеСУО.Ссылка
		|ИЗ
		|	Документ.СообщениеСУО КАК СообщениеСУО
		|ГДЕ
		|	СообщениеСУО.ПервоеСообщениеВТеме = ИСТИНА
		|	И СообщениеСУО.ПометкаУдаления = ЛОЖЬ
		|	И СообщениеСУО.Проведен = ИСТИНА
		|	И СообщениеСУО.Тема.Контекст = &РазделФорума";

	Запрос.УстановитьПараметр("РазделФорума", Ссылка);

	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Для каждого Результат Из МассивРезультатов Цикл
	
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокументы(ВыборкаДетальныеЗаписи, РежимЗаписиДокумента.Проведение,,3);
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
