
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РасширеннаяФункциональность = ПолучитьФункциональнуюОпцию("РасширеннаяФункциональностьСУО");
	УстановитьДоступностьЭлементовФормы();	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Запись.Тип = ПредопределенноеЗначение("Перечисление.ТипыАвтоматическихРассылокСУО.ПриОбновленииОтбораПользователей")
		И НЕ ЗначениеЗаполнено(Запись.ОтборПользователей) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите правило выбора адресатов'"),,"Запись.ОтборПользователей",,Отказ);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	// Мероприятие
	
	ТипыПроведенийОбучения = Новый Массив;
	Перечисления.ТипыАвтоматическихРассылокСУО.ДобавитьТипыПроведенийОбучения(ТипыПроведенийОбучения);
	Элементы.ГруппаМероприятие.Видимость = (ТипыПроведенийОбучения.Найти(Запись.Тип) <> Неопределено);
	Элементы.ГруппаМероприятие.ТолькоПросмотр = Параметры.ТолькоПросмотрУсловийПрименения;
	
	Элементы.Мероприятие.Видимость = РасширеннаяФункциональность;
	
	// Программа обучения
	
	ТипыПрограммОбучения = Новый Массив;
	Перечисления.ТипыАвтоматическихРассылокСУО.ДобавитьТипыПрограммОбучения(ТипыПрограммОбучения);
	Элементы.ГруппаПрограммаОбучения.Видимость = (ТипыПрограммОбучения.Найти(Запись.Тип) <> Неопределено);	
	Элементы.ГруппаПрограммаОбучения.ТолькоПросмотр = Параметры.ТолькоПросмотрУсловийПрименения;
	
	// Отбор пользователей
	
	Если РасширеннаяФункциональность
		И (Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПриЗачисленииНаМероприятие
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеПрохожденияМероприятия
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПриНачалеПрохожденияМероприятия
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПриглашениеНаОткрытоеМероприятие
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПриНазначенииПреподавателяНаМероприятие
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПриОтправкеЗаданияНаПроверку		
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеПроверкиЗаданияПреподавателем
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеВозвратаНаДоработкуЗадания
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПередОкончаниемДоступаКБазе
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПриОбновленииОтбораПользователей) Тогда
		
		Элементы.ОтборПользователей.Видимость = Истина;
		
	Иначе
		
		Если Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПриОбновленииОтбораПользователей Тогда			
			Элементы.ОтборПользователей.Видимость = Истина;
		Иначе			
			Элементы.ОтборПользователей.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;	
	
	
	// Организаторы
	
	Если Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПриЗачисленииНаМероприятие
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеПрохожденияМероприятия
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПриНачалеПрохожденияМероприятия
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПриглашениеНаОткрытоеМероприятие
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПриНазначенииПреподавателяНаМероприятие
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПриОтправкеЗаданияНаПроверку		
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеПроверкиЗаданияПреподавателем
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеВозвратаНаДоработкуЗадания		
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПриЗачисленииНаПрограммуОбучения
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеПрохожденияПрограммыОбучения
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПриНачалеПрохожденияПрограммыОбучения
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПриглашениеНаОткрытуюПрограммуОбучения
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПередОкончаниемДоступаКБазе
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПриОбновленииОтбораПользователей Тогда
		
		Элементы.Организатор.Видимость = Истина;
		Элементы.ШаблонСообщенияОрганизаторам.Видимость = Истина;
		
	Иначе
		
		Элементы.Организатор.Видимость = Ложь;
		Элементы.ШаблонСообщенияОрганизаторам.Видимость = Ложь;
		
	КонецЕсли;
	
	// Время рассылки
	
	Если Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПередОкончаниемДоступаКБазе Тогда
		
		Элементы.ГруппаОкончаниеДоступа.Видимость = Истина;
		
	Иначе
		
		Элементы.ГруппаОкончаниеДоступа.Видимость = Ложь;
		
	КонецЕсли;	
	
	// Шаблон
	
	Если Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ВажнаяНовость Тогда
		Элементы.Шаблон.Видимость = Ложь;
	Иначе
		Элементы.Шаблон.Видимость = Истина;
	КонецЕсли;
	
	// Шаблон администратора
	
	Если Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ВажнаяНовость Тогда
		Элементы.ШаблонСообщенияАдминистратору.Видимость = Ложь;
	Иначе
		Элементы.ШаблонСообщенияАдминистратору.Видимость = Истина;
	КонецЕсли;
	
	// Администратор
	
	Если Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ВажнаяНовость Тогда
		Элементы.Администратор.Видимость = Ложь;
	Иначе
		Элементы.Администратор.Видимость = Истина;
	КонецЕсли;
	
	// Шаблон преподавателям
	
	Если Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПриЗачисленииНаМероприятие
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеПрохожденияМероприятия
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПриНачалеПрохожденияМероприятия
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПриглашениеНаОткрытоеМероприятие
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПриОтправкеЗаданияНаПроверку Тогда
		
		Элементы.ШаблонСообщенияПреподавателям.Видимость = Истина;
		
	Иначе
		
		Элементы.ШаблонСообщенияПреподавателям.Видимость = Ложь;
		
	КонецЕсли;
	
	// Причина возврата на доработку
	
	Если (Справочники.ПричиныВозвратаЗаданияНаДоработкуСУО.ЕстьПричиныВозврата()
		И Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеВозвратаНаДоработкуЗадания)
		ИЛИ ЗначениеЗаполнено(Запись.ПричинаВозвратаНаДоработку) Тогда		
		Элементы.ПричинаВозвратаНаДоработку.Видимость = Истина;		
	Иначе
		Элементы.ПричинаВозвратаНаДоработку.Видимость = Ложь;
	КонецЕсли;
	
	// Прикреплять файлы
	
	Если Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеПрохожденияМероприятия
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПриОтправкеЗаданияНаПроверку		
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеПроверкиЗаданияПреподавателем
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеВозвратаНаДоработкуЗадания Тогда
		
		Элементы.ПрикреплятьФайлы.Видимость = Истина;
		
	Иначе
		
		Элементы.ПрикреплятьФайлы.Видимость = Ложь;
		
	КонецЕсли;
	
	// Только электронная почта
	
	Если Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ВосстановлениеПароля
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ВажнаяНовость
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.КонтрольНепрочитанныхЛичныхСообщений
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.КонтрольНепрочитанныхТемФорума Тогда
		Элементы.ТолькоЭлектроннаяПочта.Доступность = Ложь;
		Запись.ТолькоЭлектроннаяПочта = Истина;
	Иначе
		Элементы.ТолькоЭлектроннаяПочта.Доступность = Истина;
	КонецЕсли;
	
	// Альтернативная почта
	
	Если Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.КонтрольНепрочитанныхЛичныхСообщений
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.КонтрольНепрочитанныхТемФорума Тогда
		Элементы.ГруппаАльтернативнаяПочта.Видимость = Ложь;
	Иначе
		Элементы.ГруппаАльтернативнаяПочта.Видимость = Истина;
	КонецЕсли;
	
	// Подсказка регламентного задания
	
	Если Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.КонтрольНепрочитанныхЛичныхСообщений
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.КонтрольНепрочитанныхТемФорума
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПриОбновленииОтбораПользователей
		ИЛИ Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПередОкончаниемДоступаКБазе Тогда
		
		Элементы.ГруппаРегламентноеЗадание.Видимость = Истина;
		
		ИдентификаторЗадания = Неопределено;
		
		Если Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.КонтрольНепрочитанныхЛичныхСообщений Тогда
			ИдентификаторЗадания = Метаданные.РегламентныеЗадания.КонтрольНепрочитанныхЛичныхСообщенийСУО;
		КонецЕсли;
		
		Если Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.КонтрольНепрочитанныхТемФорума Тогда
			ИдентификаторЗадания = Метаданные.РегламентныеЗадания.КонтрольНепрочитанныхТемФорумаСУО;
		КонецЕсли;
		
		Если Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПриОбновленииОтбораПользователей Тогда
			ИдентификаторЗадания = Метаданные.РегламентныеЗадания.ФормированиеОтборовПользователейСУО;
		КонецЕсли;
		
		Если Запись.Тип = Перечисления.ТипыАвтоматическихРассылокСУО.ПередОкончаниемДоступаКБазе Тогда
			ИдентификаторЗадания = Метаданные.РегламентныеЗадания.КонтрольВремениДоступаПользователейСУО;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		
		Если РегламентныеЗаданияСервер.РегламентноеЗаданиеИспользуется(ИдентификаторЗадания) Тогда
			РасписаниеЗадания = РегламентныеЗаданияСервер.РасписаниеРегламентногоЗадания(ИдентификаторЗадания);
			Элементы.ДекорацияРегламентноеЗадание.Заголовок = 
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Расписание формирования рассылок: %1'"), Строка(РасписаниеЗадания));
		Иначе
			ИмяЗадания = ИдентификаторЗадания.Наименование;
			Элементы.ДекорацияРегламентноеЗадание.Заголовок = 
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Для работы автоматической рассылки требуется включить регламентное задание ""%1""'"), ИмяЗадания);			
		КонецЕсли;
		
	Иначе
		
		Элементы.ГруппаРегламентноеЗадание.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

