#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ЗначениеВСтроку(Значение) Экспорт
	
	Если Значение = Перечисления.ВариантыРазмещенияКнопкиВыходаСУЗ.ВКоманднойПанели Тогда
		Возврат "auto";
	КонецЕсли;
	
	Если Значение = Перечисления.ВариантыРазмещенияКнопкиВыходаСУЗ.БезКнопки Тогда
		Возврат "hidden";
	КонецЕсли;
	
	Если Значение = Перечисления.ВариантыРазмещенияКнопкиВыходаСУЗ.СлеваИсчезающая Тогда
		Возврат "left";
	КонецЕсли;
	
	Если Значение = Перечисления.ВариантыРазмещенияКнопкиВыходаСУЗ.СправаИсчезающая Тогда
		Возврат "right";
	КонецЕсли;
	
	Если Значение = Перечисления.ВариантыРазмещенияКнопкиВыходаСУЗ.СлеваФиксированная Тогда
		Возврат "leftFix";
	КонецЕсли;
	
	Если Значение = Перечисления.ВариантыРазмещенияКнопкиВыходаСУЗ.СправаФиксированная Тогда
		Возврат "rightFix";
	КонецЕсли;
	
	Возврат "auto";
	
КонецФункции

#КонецОбласти
	
#КонецЕсли
