
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьКоличествоНаСервере();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

#КонецОбласти



#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОбновитьКоличество(Команда)
	ОбновитьКоличествоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаданияСейчас(Команда)
	
	ПараметрыВыполнения = ВыполнитьЗаданияСейчасНаСервере();
	
	Если ПараметрыВыполнения = Неопределено Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Регламентное задание не найдено'"));
		
	Иначе
		
		Если ПараметрыВыполнения.ЗапускВыполнен Тогда
			
			ПоказатьОповещениеПользователя(НСтр("ru = 'Запущена процедура регламентного задания'"),,,БиблиотекаКартинок.ВыполнитьРегламентноеЗаданиеВручную);
			
		ИначеЕсли ПараметрыВыполнения.ПроцедураУжеВыполняется Тогда
			
			ПоказатьПредупреждение(, НСтр("ru = 'Процедура регламентного задания уже выполняется'"));
			
		Иначе
			
			ПоказатьПредупреждение(, НСтр("ru = 'Невозможно выполнить запуск регламентного задания'"));
			
		КонецЕсли;		
		
	КонецЕсли;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеЗадания(Команда)
	УдалитьВсеЗаданияНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ОбновитьКоличествоНаСервере()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданияНаОбновлениеДанныхВебКабинетаСУ.Период
		|ИЗ
		|	РегистрСведений.ЗаданияНаОбновлениеДанныхВебКабинетаСУ КАК ЗаданияНаОбновлениеДанныхВебКабинетаСУ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	КоличествоЗаданий = РезультатЗапроса.Выбрать().Количество();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьЗаданияСейчасНаСервере()
	
	Возврат ВебКабинетСУ.ВыполнитьВсеЗадания();
	
КонецФункции

&НаСервере
Процедура УдалитьВсеЗаданияНаСервере()
	
	НаборЗаписей = РегистрыСведений.ЗаданияНаОбновлениеДанныхВебКабинетаСУ.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();	
	
	Элементы.Список.Обновить();
	
КонецПроцедуры


#КонецОбласти





