
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(Параметры.ПрохождениеОбучения)
		ИЛИ НЕ ЗначениеЗаполнено(Параметры.Пользователь) Тогда
		
		Текст = НСтр("ru = 'Не заданы параметры формы'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		
		Возврат;
		
	КонецЕсли;
	
	// Получаем данные
	
	ДанныеПрохожденияМероприятия   = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.ПрохождениеОбучения, "Сценарий, Пользователь, ПроведениеОбучения");
	ТекущийПользовательМероприятия = ДанныеПрохожденияМероприятия.Пользователь;
	
	Если ЗначениеЗаполнено(Параметры.Задание) Тогда
		
		Задание = Параметры.Задание;
		
	Иначе
		
		
		ОписаниеМероприятияСОднимЭлектроннымЗаданием = УправлениеОбучениемСУОПовтИсп.ОписаниеЕдинственногоЗаданияСценария(ДанныеПрохожденияМероприятия.Сценарий, ДанныеПрохожденияМероприятия.ПроведениеОбучения);
		
		Если ОписаниеМероприятияСОднимЭлектроннымЗаданием = Неопределено Тогда
			Задание = Неопределено;
		Иначе
			Задание = ОписаниеМероприятияСОднимЭлектроннымЗаданием.Задание;
		КонецЕсли;
			
	КонецЕсли;
	
	// Заполняем список сессий
	
	Результат = Документы.ПопыткаВыполненияПодборкиВопросовСУЗ.СессииТестирования(Параметры.Пользователь, Параметры.ПрохождениеОбучения, Задание);
	
	Если Результат.Пустой() Тогда
		Текст = НСтр("ru = 'Результаты тестирования не найдены'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	СписокСессий = Элементы.СессияТестирования.СписокВыбора;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокСессий.Добавить(ВыборкаДетальныеЗаписи.Ссылка, ПолучитьПредставлениеСессии(ВыборкаДетальныеЗаписи));  
	КонецЦикла;
	
	СессияТестирования  = ВыборкаДетальныеЗаписи.Ссылка;
	
	УстановитьПараметрыТаблицыРезультатов();
	
	// Устанавливаем видимость элементов
	
	ЕстьПравоПросмотраСессииТестирования = ОбучениеСУОПовтИсп.ЕстьПравоПросматриватьВыполненныеЗадания();
	
	Если НЕ ЕстьПравоПросмотраСессииТестирования Тогда
		Элементы.ОткрытьТест.Видимость = Ложь;
		Элементы.РезультатыВопрос.Гиперссылка = Ложь;
		Элементы.РезультатыВопрос.ГиперссылкаЯчейки = Ложь;
		Элементы.РезультатыВопрос.Шрифт = Новый Шрифт();
		Элементы.РезультатыВопрос.ЦветТекста = Новый Цвет();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьПрохождениеОбучения"
		И Параметр = Параметры.ПрохождениеОбучения Тогда
		
		ОбновитьСписокСессийТестирования();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура СессияТестированияПриИзменении(Элемент)
	УстановитьПараметрыТаблицыРезультатов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРезультаты

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Результаты

&НаКлиенте
Процедура РезультатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЕстьПравоПросмотраСессииТестирования Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	НастройкиТестирования = ПолучитьНастройкиТестирования(СессияТестирования, ТекущиеДанные.НомерСтраницы);
	
	ОбъектыСУЗКлиент.ОткрытьОбозреватель(НастройкиТестирования.СводЗнаний,
										 НастройкиТестирования.СсылкаНаЭлемент,
										 Истина,
										 НастройкиТестирования.ЭлементСодержанияСводаЗнаний,
										 Параметры.ПрохождениеОбучения,
										 ?(ЗначениеЗаполнено(Задание), Задание, НастройкиТестирования.СводЗнаний),
	                                     ,
	                                     ,
	                                     Истина,
	                                     ?(Параметры.ОткрытоВнешнимПользователем, ТекущийПользовательМероприятия, Неопределено));
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОткрытьТест(Команда)
	
	Если ЕстьПравоПросмотраСессииТестирования Тогда
		
		НастройкиТестирования = ПолучитьНастройкиТестирования(СессияТестирования);
		
		ОбъектыСУЗКлиент.ОткрытьОбозреватель(НастройкиТестирования.СводЗнаний,
											 НастройкиТестирования.СсылкаНаЭлемент,
											 Истина,
											 НастройкиТестирования.ЭлементСодержанияСводаЗнаний,
											 Параметры.ПрохождениеОбучения,
											 ?(ЗначениеЗаполнено(Задание), Задание, НастройкиТестирования.СводЗнаний),
	                                         ,
	                                         ,
	                                         Истина,
	                                         ?(Параметры.ОткрытоВнешнимПользователем, ТекущийПользовательМероприятия, Неопределено));
		
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервереБезКонтекста
Функция ПолучитьНастройкиТестирования(СессияВыполненияТеста, НомерГруппыПодборки=Неопределено)
	Возврат Документы.ПопыткаВыполненияПодборкиВопросовСУЗ.ДанныеТестированияДляПросмотра(СессияВыполненияТеста, НомерГруппыПодборки);
КонецФункции

&НаСервере
Функция ПолучитьПредставлениеСессии(ДанныеСессии)
	
	ПредставлениеСессии = НСтр("ru = '%3 - Попытка от %1 - %2 баллов'");
	ПредставлениеСессии = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПредставлениеСессии, Формат(ДанныеСессии.Дата), ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(ДанныеСессии.ИтоговыйРезультат), ДанныеСессии.Наименование);
	
	Возврат ПредставлениеСессии;
	
КонецФункции

&НаСервере
Процедура ОбновитьСписокСессийТестирования()
	
	СписокСессий = Элементы.СессияТестирования.СписокВыбора;
	
	Результат = Документы.ПопыткаВыполненияПодборкиВопросовСУЗ.СессииТестирования(Параметры.Пользователь, Параметры.ПрохождениеОбучения, Задание);
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтрокаСписка = СписокСессий.НайтиПоЗначению(ВыборкаДетальныеЗаписи.Ссылка);
		
		Если СтрокаСписка = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаСписка.Представление = ПолучитьПредставлениеСессии(ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
	
	Элементы.Результаты.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСуммуВесовВопросов(СессияТестирования)
	
	Вопросы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СессияТестирования, "Вопросы").Выгрузить();
	
	Возврат Документы.ПопыткаВыполненияПодборкиВопросовСУЗ.СуммаВесовВопросов(Вопросы);
	
КонецФункции

&НаСервере
Процедура УстановитьПараметрыТаблицыРезультатов()
	
	Результаты.Параметры.УстановитьЗначениеПараметра("СессияВыполненияТеста", СессияТестирования);
	Результаты.Параметры.УстановитьЗначениеПараметра("СуммаВсехВесов", ПолучитьСуммуВесовВопросов(СессияТестирования));
	
	Тест                       = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СессияТестирования, "Подборка");
	ПоказыватьСтоимостьВопроса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Тест, "ПоказыватьСтоимостьВопроса");
	
	Если ПоказыватьСтоимостьВопроса Тогда
		Элементы.СтоимостьВопроса.Видимость    = Истина;		
		Элементы.НабраноБаллов.Видимость       = Истина;
		Элементы.РезультатыРезультат.Видимость = Ложь;
		Элементы.ВесВопроса.Видимость          = Ложь;
	Иначе
		Элементы.СтоимостьВопроса.Видимость    = Ложь;		
		Элементы.НабраноБаллов.Видимость       = Ложь;
		Элементы.РезультатыРезультат.Видимость = Истина;
		Элементы.ВесВопроса.Видимость          = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

