#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	

#Область ПрограммныйИнтерфейс

// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ТипОбъектаЗаявки(ОбъектЗаявки) Экспорт
	
	Если ТипЗнч(ОбъектЗаявки) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
		
		Возврат "Электронный ресурс";
		
	ИначеЕсли ТипЗнч(ОбъектЗаявки) = Тип("СправочникСсылка.КаталогПрограммОбученияСУО") Тогда
		
		Возврат "Программа обучения";
		
	ИначеЕсли ТипЗнч(ОбъектЗаявки) = Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда
		
		ВидМероприятия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектЗаявки, "Вид");
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидМероприятия, "Наименование");
		
	Иначе
		
		Возврат "";
		
	КонецЕсли;
	
КонецФункции

Функция ОбъектЗаявки(ПредметЗаявки) Экспорт
	
	Если ТипЗнч(ПредметЗаявки) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		Возврат Документы.ПроведениеОбученияСУО.СценарийОбучения(ПредметЗаявки);
	КонецЕсли;
	
	Если ТипЗнч(ПредметЗаявки) = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО") Тогда
		Возврат Документы.ПроведениеПрограммыОбученияСУО.ПрограммаОбучения(ПредметЗаявки);
	КонецЕсли;	
	
	Возврат Неопределено;
	
КонецФункции


Функция МожноПодатьЗаявку(ПредметЗаявки, Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкиНаОбучениеСУО.Регистратор КАК Заявка
		|ИЗ
		|	РегистрСведений.ЗаявкиНаОбучениеСУО КАК ЗаявкиНаОбучениеСУО
		|ГДЕ
		|	ЗаявкиНаОбучениеСУО.Пользователь = &Пользователь
		|	И ЗаявкиНаОбучениеСУО.ПредметЗаявки = &ПредметЗаявки
		|	И ЗаявкиНаОбучениеСУО.Статус <> &Статус";	
		
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЗаявокНаОбучениеСУО.Отменена);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ПредметЗаявки", ПредметЗаявки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

// ВЕБ-КАБИНЕТ

Процедура ОбновитьДанныеВебКабинета(ЗаявкаНаОбучение, ДополнительныеДанные=Неопределено) Экспорт
	

	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем данные
	
	ТребуемыеДанныеЗаявки = Новый Структура(
	"Текст,
	|Дата,
	|Статус,
	|Комментарий,
	|ДатаРассмотрения,
	|Пользователь,
	|ПредметЗаявки,
	|Проведен",
	"Информация",
	"Дата",
	"Статус",
	"Комментарий",
	"ДатаРассмотрения",
	"Пользователь",
	"ПредметЗаявки",
	"Проведен");
	
	ДанныеЗаявки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаявкаНаОбучение, ТребуемыеДанныеЗаявки);
	
	// Записываем описание заявки
	
	РегистрыСведений.ДанныеВебКабинетаСУО_ПН.УдалитьДанные(ЗаявкаНаОбучение, Перечисления.ТипыДанныхВебКабинетаСУО.ОписаниеЗаявки, ДанныеЗаявки.Пользователь);
	
	Если ДанныеЗаявки.Проведен Тогда
	
		ОписаниеЗаявки = Новый Структура("Идентификатор, Статус, Комментарий, ДатаРассмотрения, Пользователь, Текст, Дата, ДополнительныеСведения");
		
		ОписаниеЗаявки.Идентификатор = Строка(ЗаявкаНаОбучение.УникальныйИдентификатор());
		ОписаниеЗаявки.Дата = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ДанныеЗаявки.Дата);
		ОписаниеЗаявки.Статус = Перечисления.СтатусыЗаявокНаОбучениеСУО.ЗначениеВЧисло(ДанныеЗаявки.Статус);
		ОписаниеЗаявки.Комментарий = ДанныеЗаявки.Комментарий;
		ОписаниеЗаявки.ДатаРассмотрения = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ДанныеЗаявки.ДатаРассмотрения);
		ОписаниеЗаявки.Пользователь = Строка(ДанныеЗаявки.Пользователь.УникальныйИдентификатор());
		ОписаниеЗаявки.Текст = ДанныеЗаявки.Текст;
		ОписаниеЗаявки.ДополнительныеСведения = ВебКабинетСУО.ТаблицаДополнительныхРеквизитовОбъекта(ЗаявкаНаОбучение);
		
		ОписаниеЗаявкиJSON = ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеЗаявки);
		
		РегистрыСведений.ДанныеВебКабинетаСУО_ПН.ДобавитьДанные(ДанныеЗаявки.Пользователь, Перечисления.ТипыДанныхВебКабинетаСУО.ОписаниеЗаявки, ЗаявкаНаОбучение, ОписаниеЗаявкиJSON, Перечисления.ФорматыВебДанныхСУ.json);
		
	КонецЕсли;
		
	// Устанавливаем отбор
	
	РегистрыСведений.ОтборыДанныхВебКабинетаСУО_П.УдалитьОтбор(ЗаявкаНаОбучение, ДанныеЗаявки.Пользователь);
	
	Если ДанныеЗаявки.Проведен Тогда
	
		РегистрыСведений.ОтборыДанныхВебКабинетаСУО_П.ДобавитьОтбор(ЗаявкаНаОбучение, ДанныеЗаявки.Пользователь, ДанныеЗаявки.ПредметЗаявки);
		
	КонецЕсли;

	
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("ПредметЗаявки");
	Поля.Добавить("Пользователь");
	Поля.Добавить("Дата");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтандартнаяОбработка = Ложь;
	
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Заявка от %1 на ""%2""'"), Данные.Пользователь, Данные.ПредметЗаявки);
	
КонецПроцедуры


#КонецОбласти


#КонецЕсли
