#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ЗаявкиНаОбучениеСУО.Записывать = Истина;
	
	Движение = Движения.ЗаявкиНаОбучениеСУО.Добавить();
	
	Движение.Период           = Дата;
	Движение.Пользователь     = Пользователь;
	Движение.ПредметЗаявки    = ПредметЗаявки;
	Движение.Статус           = Статус;
	Движение.ОбъектЗаявки     = ОбъектЗаявки;
	Движение.Номер            = Номер;
    Движение.Тип              = Документы.ЗаявкаНаОбучениеСУО.ТипОбъектаЗаявки(ОбъектЗаявки);
	
	//////////////////////////////////////////////////////////////////////
	// Перепроводим подчиненные документы

	ОбновитьПодчиненныеДокументы(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ОбновитьПодчиненныеДокументы(РежимЗаписиДокумента.ОтменаПроведения);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ОбновитьПодчиненныеДокументы(РежимЗаписи)
	
	Если НЕ УправлениеОбучениемСУО.МожноОбновлятьПодчиненныеДокументы(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрохождениеОбученияСУО.Ссылка
		|ИЗ
		|	Документ.ПрохождениеОбученияСУО КАК ПрохождениеОбученияСУО
		|ГДЕ
		|	ПрохождениеОбученияСУО.Проведен = ИСТИНА
		|	И ПрохождениеОбученияСУО.Заявка = &Заявка
		|;";
		
	Запрос.Текст = Запрос.Текст + "
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПрохождениеПрограммыОбученияСУО.Ссылка
		|ИЗ
		|	Документ.ПрохождениеПрограммыОбученияСУО КАК ПрохождениеПрограммыОбученияСУО
		|ГДЕ
		|	ПрохождениеПрограммыОбученияСУО.Заявка = &Заявка
		|	И ПрохождениеПрограммыОбученияСУО.Проведен = ИСТИНА";

	Запрос.УстановитьПараметр("Заявка", Ссылка);

	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Для каждого Результат Из МассивРезультатов Цикл
	
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокументы(ВыборкаДетальныеЗаписи, РежимЗаписи,,3);
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли