#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Ссылка");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = Представление(Данные.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
Функция Отменено(ПрохождениеПрограммыОбучения) Экспорт
	
	ДанныеОПрохождении = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеПрограммыОбучения, "ПроведениеПрограммыОбучения, Отменено");
	
	Если ДанныеОПрохождении.Отменено Тогда
		
		Возврат Истина;
		
	Иначе
		
		СтатусПроведения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОПрохождении.ПроведениеПрограммыОбучения, "Статус");
		
		Если СтатусПроведения = Перечисления.СтатусыПроведенияОбъектовСУО.Отменено Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция СценарийОбучения(Знач ПрохождениеПрограммыОбучения) Экспорт
	
	Если ТипЗнч(ПрохождениеПрограммыОбучения) = Тип("ДокументСсылка.ПрохождениеПрограммыОбученияСУО") Тогда
		ПрохождениеПрограммыОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеПрограммыОбучения, "Сценарий, ПроведениеПрограммыОбучения");
	Иначе
		ПрохождениеПрограммыОбученияСвойства = ПрохождениеПрограммыОбучения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПрохождениеПрограммыОбученияСвойства.Сценарий) Тогда
		Возврат ПрохождениеПрограммыОбученияСвойства.Сценарий;
	Иначе
		Возврат Документы.ПроведениеПрограммыОбученияСУО.СценарийОбучения(ПрохождениеПрограммыОбученияСвойства.ПроведениеПрограммыОбучения);
	КонецЕсли;	
	
КонецФункции

Функция Представление(Знач ПрохождениеПрограммыОбучения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(ПрохождениеПрограммыОбучения) Тогда
		Возврат "<>";
	КонецЕсли;
	
	ТребуемыеДанные = Новый Структура("Наименование, НаименованиеПользователя", "ПроведениеПрограммыОбучения.Наименование", "Пользователь.Наименование");
	Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеПрограммыОбучения, ТребуемыеДанные);
	
	Возврат Строка(Данные.Наименование) + " / " + Строка(Данные.НаименованиеПользователя) + " /";
			
КонецФункции

#КонецОбласти


#КонецЕсли
