#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Делаем проверки возможности записи документа
	
	Если Ссылка.Пустая() Тогда

		ПрохождениеПрограммыОбучения = Документы.ПроведениеПрограммыОбученияСУО.ПрохождениеПрограммыОбучения(ПроведениеПрограммыОбучения, Пользователь);
		
		Если ЗначениеЗаполнено(ПрохождениеПрограммыОбучения) Тогда
			Текст = НСтр("ru = 'Пользователь ""%1"" уже зачислен на программу обучения ""%2"" (""%3"")'");
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, Пользователь, Сценарий, ПрохождениеПрограммыОбучения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ДокументПроведениеПрограммыОбученияПроведен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроведениеПрограммыОбучения, "Проведен");
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ ДокументПроведениеПрограммыОбученияПроведен Тогда
		Текст = НСтр("ru = 'Создание или изменение прохождения программы обучения ""%3"" пользователя ""%2"" не может быть выполнено, так как документ ""%1"" не проведен'");
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, ПроведениеПрограммыОбучения, Пользователь, Сценарий);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоНовый() Тогда	
		ДанныеСуществующегоПрохождения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ПометкаУдаления");		
		Если НЕ ПометкаУдаления И ДанныеСуществующегоПрохождения.ПометкаУдаления И РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
			РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(Ссылка, РежимЗаписиДокумента.Проведение, Ложь, 0, 3);
		КонецЕсли;		
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("СоздатьАвтоматическуюРассылку", Ложь);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ Проведен Тогда
		ДополнительныеСвойства.СоздатьАвтоматическуюРассылку = Истина;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Движения
	
	Движения.РасписаниеПрограммОбученияСУО.Записывать            = Истина;
	Движения.УчастникиПрограммОбученияСУО.Записывать             = Истина;
	Движения.ПрохожденияПрограммОбученияСУО.Записывать           = Истина;
	
	ПрохождениеОтменено = Документы.ПрохождениеПрограммыОбученияСУО.Отменено(Ссылка);
	
	Если НЕ ПрохождениеОтменено Тогда
		
		ШкалаОценки = Документы.ПроведениеПрограммыОбученияСУО.ШкалаОценки(ПроведениеПрограммыОбучения);
		ДанныеОПроведенииПрограммыОбучения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеПрограммыОбучения, "ДатаНачалаПроведения, ДатаОкончанияПроведения");
		
		
		Движение = Движения.РасписаниеПрограммОбученияСУО.Добавить();

		Движение.Баллы                        = Баллы;
		Движение.ЗавершеноВПроцентах          = ЗавершеноВПроцентах;
		Движение.Пользователь                 = Пользователь;
		Движение.Статус                       = Статус;
		Движение.ПроведениеПрограммыОбучения  = ПроведениеПрограммыОбучения;
		Движение.Сценарий                     = Сценарий;
		Движение.УчебнаяГруппа                = УчебнаяГруппа;
		Движение.ШкалаОценки                  = ШкалаОценки;
		Движение.ДатаНачалаПроведения         = ДанныеОПроведенииПрограммыОбучения.ДатаНачалаПроведения;
		Движение.ДатаОкончанияПроведения      = ДанныеОПроведенииПрограммыОбучения.ДатаОкончанияПроведения;
		
		
		Движение = Движения.ПрохожденияПрограммОбученияСУО.Добавить();
		Движение.Период                       = Дата;
		Движение.Пользователь                 = Пользователь;
		Движение.Сценарий                     = Сценарий;
		Движение.Баллы                        = Баллы;
		Движение.ЗавершеноВПроцентах          = ЗавершеноВПроцентах;
		Движение.Статус                       = Статус;
		Движение.УчебнаяГруппа                = УчебнаяГруппа;
		Движение.ПроведениеПрограммыОбучения  = ПроведениеПрограммыОбучения;
		Движение.ШкалаОценки                  = ШкалаОценки;
		Движение.ДатаНачалаПроведения         = ДанныеОПроведенииПрограммыОбучения.ДатаНачалаПроведения;
		Движение.ДатаОкончанияПроведения      = ДанныеОПроведенииПрограммыОбучения.ДатаОкончанияПроведения;
		
		
		Движение = Движения.УчастникиПрограммОбученияСУО.Добавить();
		Движение.ПроведениеПрограммыОбучения = ПроведениеПрограммыОбучения;
		Движение.Пользователь                = Пользователь;
		Движение.Баллы                       = Баллы;
		Движение.ЗавершеноВПроцентах         = ЗавершеноВПроцентах;
		Движение.Статус                      = Статус;
		Движение.УчебнаяГруппа               = УчебнаяГруппа;
		Движение.ШкалаОценки                 = ШкалаОценки;
				
	КонецЕсли;

	Движения.Записать(); // Записываем движения
	
	// Создание рассылки
		
	Если НЕ ПрохождениеОтменено
		И ДополнительныеСвойства.Свойство("СоздатьАвтоматическуюРассылку")
		И ДополнительныеСвойства.СоздатьАвтоматическуюРассылку Тогда
				
		УправлениеОбучениемСУО.СоздатьАвтоматическуюРассылку(ЭтотОбъект);

	КонецЕсли;
	
	// Перепроводим подчиненные документы
				
	ОбновитьПодчиненныеДокументы(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ОбновитьПодчиненныеДокументы(РежимЗаписиДокумента.ОтменаПроведения);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ОбновитьПодчиненныеДокументы(РежимЗаписи)
	
	ОбновлятьПодчиненныеДокументы = УправлениеОбучениемСУО.МожноОбновлятьПодчиненныеДокументы(ЭтотОбъект);
	
	// Примечание: выбираем только те прохождения, которые могут быть проведены,
	// то есть проведен соответствующий им документ "Проведение обучения".
	
	Запрос = Новый Запрос;
	
	Если ОбновлятьПодчиненныеДокументы Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПрохождениеОбученияСУО.Ссылка
			|ИЗ
			|	Документ.ПрохождениеОбученияСУО КАК ПрохождениеОбученияСУО
			|ГДЕ
			|	ПрохождениеОбученияСУО.ПометкаУдаления = ЛОЖЬ
			|	И ПрохождениеОбученияСУО.ПрохождениеПрограммыОбучения = &ПрохождениеПрограммыОбучения
			|	И ПрохождениеОбученияСУО.ПроведениеОбучения.Проведен = ИСТИНА
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СообщениеСУО.Ссылка
			|ИЗ
			|	Документ.СообщениеСУО КАК СообщениеСУО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТемыСообщенийСУО КАК ТемыСообщенийСУО
			|		ПО СообщениеСУО.Тема = ТемыСообщенийСУО.Ссылка
			|ГДЕ
			|	ТемыСообщенийСУО.Контекст = &ПроведениеПрограммыОбучения
			|	И СообщениеСУО.ПервоеСообщениеВТеме = ИСТИНА
			|	И СообщениеСУО.ПометкаУдаления = ЛОЖЬ
			|	И СообщениеСУО.Проведен = ИСТИНА
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СообщениеСУО.Ссылка
			|ИЗ
			|	Документ.СообщениеСУО КАК СообщениеСУО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТемыСообщенийСУО КАК ТемыСообщенийСУО
			|		ПО СообщениеСУО.Тема = ТемыСообщенийСУО.Ссылка
			|ГДЕ
			|	СообщениеСУО.ПервоеСообщениеВТеме = ИСТИНА
			|	И ТемыСообщенийСУО.Контекст = &ПрохождениеПрограммыОбучения
			|	И СообщениеСУО.ПометкаУдаления = ЛОЖЬ
			|	И СообщениеСУО.Проведен = ИСТИНА
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СертификатСУО.Ссылка
			|ИЗ
			|	Документ.СертификатСУО КАК СертификатСУО
			|ГДЕ
			|	СертификатСУО.ПометкаУдаления = ЛОЖЬ
			|	И СертификатСУО.ПрохождениеОбучения = &ПрохождениеПрограммыОбучения";
		
		Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);
		
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПрохождениеОбученияСУО.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПрохождениеОбученияСУО КАК ПрохождениеОбученияСУО
			|ГДЕ
			|	ПрохождениеОбученияСУО.ПометкаУдаления = ЛОЖЬ
			|	И ПрохождениеОбученияСУО.Проведен = ЛОЖЬ
			|	И ПрохождениеОбученияСУО.ПрохождениеПрограммыОбучения = &ПрохождениеПрограммыОбучения
			|	И ПрохождениеОбученияСУО.ПроведениеОбучения.Проведен = ИСТИНА";		
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПрохождениеПрограммыОбучения", Ссылка);	
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Для каждого Результат Из МассивРезультатов Цикл
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокументы(ВыборкаДетальныеЗаписи, РежимЗаписи,,3,Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
