
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЕстьПоддержкаСотрудников	= УправлениеОбучениемСУОВызовСервера.ЕстьПоддержкаСотрудников(); 
	ЕстьПоддержкаСтудентов = УправлениеОбучениемСУОВызовСервера.ЕстьПоддержкаСтудентов();
	
	Если ЕстьПоддержкаСотрудников И НЕ ЕстьПоддержкаСтудентов Тогда
		ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Новый Структура("ЭлектронныйРесурс", ПараметрКоманды), Истина);		
		ОткрытьФорму("Отчет.ОтветыНаВопросыСУО.Форма", ПараметрыФормы);			
	ИначеЕсли ЕстьПоддержкаСтудентов И НЕ ЕстьПоддержкаСотрудников Тогда
		ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Новый Структура("ЭлектронныйРесурс", ПараметрКоманды), Истина);		
		ОткрытьФорму("Отчет.ОтветыНаВопросыОО.Форма", ПараметрыФормы);							
	Иначе
		ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Новый Структура("ЭлектронныйРесурс", ПараметрКоманды), Истина);		
		ОткрытьФорму("Отчет.ОтветыНаВопросыСУЗ.Форма", ПараметрыФормы);					
	КонецЕсли;
	
КонецПроцедуры
