
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Объект создается только программно'"),,,,Отказ);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Получаем оценку
	
	Если Объект.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил
		ИЛИ Объект.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат Тогда
		Оценка = УправлениеОбучениемСУОПовтИсп.ОценкаИзБаллов(Объект.Баллы, Объект.ПроведениеПрограммыОбучения.ПрограммаОбучения.ШкалаОценки);	
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
