
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// ОСНОВНЫЕ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ЭлектронныйРесурс) Тогда
		Элементы.ЭлектронныйРесурс.Видимость = Истина;
		Элементы.НаименованиеЭлектронногоРесурса.Видимость = Ложь;
	Иначе
		Элементы.ЭлектронныйРесурс.Видимость = Ложь;
		Элементы.НаименованиеЭлектронногоРесурса.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстФайлаНастроек()
	
	НастройкиXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportCoursesSettings", "Настройки");
	НастройкиXDTO     = ФабрикаXDTO.Создать(НастройкиXDTOТип);
	
	НастройкиXDTO.ЭлектронныйРесурс = ЭлектронныйРесурс;
	НастройкиXDTO.Наименование      = НаименованиеЭлектронногоРесурса;
	
	ЭлементыЗагрузкиXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportCoursesSettings", "ЭлементыЗагрузки");
	ЭлементыЗагрузкиXDTO     = ФабрикаXDTO.Создать(ЭлементыЗагрузкиXDTOТип);
	
	// Теория
	
	ТеорияXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportCoursesSettings", "Теория");
	
	Для каждого Строка Из Материалы Цикл
		
		ТеорияXDTO = ФабрикаXDTO.Создать(ТеорияXDTOТип);
		ТеорияXDTO.Каталог = СтрЗаменить(Строка.ПутьККаталогу, ПутьКаталогуКурса, "");
		
		ЭлементыЗагрузкиXDTO.Теория.Добавить(ТеорияXDTO);
		
	КонецЦикла;
	
	// Тесты
	
	ТестXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportCoursesSettings", "Тест");
	
	Для каждого Строка Из Тесты Цикл
		
		ТестXDTO = ФабрикаXDTO.Создать(ТестXDTOТип);
		ТестXDTO.ФайлВопросов = СтрЗаменить(Строка.ПутьКФайлу, ПутьКаталогуКурса, "");;
		ТестXDTO.ФайлРесурсов = СтрЗаменить(Строка.ПутьКФайлуРесурсов, ПутьКаталогуКурса, "");;
		
		ЭлементыЗагрузкиXDTO.Тест.Добавить(ТестXDTO);
		
	КонецЦикла;
	
	// Глоссарии
	
	ГлоссарийXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportCoursesSettings", "Глоссарий");
	
	Для каждого Строка Из Глоссарии Цикл
		
		ГлоссарииXDTO = ФабрикаXDTO.Создать(ГлоссарийXDTOТип);
		ГлоссарииXDTO.Файл            = СтрЗаменить(Строка.ПутьКФайлу, ПутьКаталогуКурса, "");;
		
		ЭлементыЗагрузкиXDTO.Глоссарий.Добавить(ГлоссарииXDTO);
		
	КонецЦикла;
	
	НастройкиXDTO.ЭлементыЗагрузки = ЭлементыЗагрузкиXDTO;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, НастройкиXDTO);
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

&НаСервере
Процедура ЗагрузитьФайлНастроек(АдресФайлаВХранилище)
	
	ПутьКФайлуНастроекНаСервере = ПолучитьИмяВременногоФайла("xml");
	
	ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайлаВХранилище);
	ДвоичныеДанныеФайла.Записать(ПутьКФайлуНастроекНаСервере);
		
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПутьКФайлуНастроекНаСервере);
	
	ФайлНастроекXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportCoursesSettings", "Настройки");
	ФайлНастроекXDTO    = ФабрикаXDTO.Создать(ФайлНастроекXDTOТип);
	ФайлНастроекXDTO    = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ФайлНастроекXDTOТип);
	
	// Заполняем настройки из файла
	
	ЭлектронныйРесурс               = ФайлНастроекXDTO.ЭлектронныйРесурс;
	НаименованиеЭлектронногоРесурса = ФайлНастроекXDTO.Наименование;
	
	Для каждого НастройкиФайла Из ФайлНастроекXDTO.ЭлементыЗагрузки.Теория Цикл
		
		Если ЗначениеЗаполнено(НастройкиФайла.Каталог) И НЕ ЗначениеДобавленоВТаблицу(Материалы, "ПутьККаталогу", НастройкиФайла.Каталог) Тогда
		
			НоваяСтрока = Материалы.Добавить(); 
			НоваяСтрока.ПутьККаталогу = ПутьКаталогуКурса + НастройкиФайла.Каталог;
			
		КонецЕсли;
			
	КонецЦикла;
	
	Для каждого НастройкиФайла Из ФайлНастроекXDTO.ЭлементыЗагрузки.Тест Цикл
		
		Если ЗначениеЗаполнено(НастройкиФайла.ФайлВопросов) И НЕ ЗначениеДобавленоВТаблицу(Тесты, "ПутьКФайлу", НастройкиФайла.ФайлВопросов) Тогда
		
			НоваяСтрока = Тесты.Добавить(); 
			
			НоваяСтрока.ПутьКФайлу = ПутьКаталогуКурса + НастройкиФайла.ФайлВопросов;
			
			Если ЗначениеЗаполнено(НастройкиФайла.ФайлРесурсов) Тогда
				НоваяСтрока.ПутьКФайлуРесурсов = ПутьКаталогуКурса + НастройкиФайла.ФайлРесурсов;
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЦикла;
	
	Для каждого НастройкиФайла Из ФайлНастроекXDTO.ЭлементыЗагрузки.Глоссарий Цикл
		
		Если ЗначениеЗаполнено(НастройкиФайла.Файл) И НЕ ЗначениеДобавленоВТаблицу(Глоссарии, "ПутьКФайлу", НастройкиФайла.Файл) Тогда
		
			НоваяСтрока = Глоссарии.Добавить(); 
			НоваяСтрока.ПутьКФайлу      = ПутьКаталогуКурса + НастройкиФайла.Файл;
			
		КонецЕсли;
			
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	
	УдалитьФайлы(ПутьКФайлуНастроекНаСервере);
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьФайлНастроек()
	
	Если НЕ ЗначениеЗаполнено(ПутьКаталогуКурса) Тогда
	
		Текст = НСтр("ru = 'Укажите путь к каталогу с файлами курса'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,"ПутьКаталогуКурса");
		
		Возврат;
	
	КонецЕсли;
	
	ПутьКФайлуНастроек = ПутьКаталогуКурса + ПолучитьИмяФайлаНастроек(); 
	
	ФайлНастроекОбъект = Новый Файл(ПутьКФайлуНастроек);
	
	Если ФайлНастроекОбъект.Существует() И НЕ ФайлНастроекОбъект.ЭтоКаталог() Тогда
	
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаПолученияФайлаНастроек", ЭтотОбъект);		
		
		НачатьПомещениеФайла(ОписаниеОповещения,, ПутьКФайлуНастроек, Ложь, УникальныйИдентификатор);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПолученияФайлаНастроек(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		ЗагрузитьФайлНастроек(Адрес);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиВФайл()
	
	ФайлНастроекОбъект = Новый Файл(ПутьКаталогуКурса + ПолучитьИмяФайлаНастроек());
		
	ТекстовыйДокументФН = Новый ТекстовыйДокумент;	
	ТекстовыйДокументФН.УстановитьТекст(ПолучитьТекстФайлаНастроек());
	ТекстовыйДокументФН.Записать(ФайлНастроекОбъект.ПолноеИмя);
	
	ФайлНастроекОбъект.УстановитьНевидимость(Истина);

КонецПроцедуры

// ВСПОМОГАТЕЛЬНЫЕ

&НаКлиенте
Функция ВыбратьФайлДляЗагрузки(РежимДиалога, Расширение="", ВыбратьИзКаталогаКурса=Ложь)
	
	ПутьКВыбранномуФайлу = "";
	
	// Делаем проверки
	
	Если ВыбратьИзКаталогаКурса Тогда
		
		Если НЕ ЗначениеЗаполнено(ПутьКаталогуКурса) Тогда
		
			Текст = НСтр("ru = 'Укажите путь к каталогу с файлами курса'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,"ПутьКаталогуКурса");
			
			Возврат ПутьКВыбранномуФайлу;
		
		КонецЕсли;
		
		КаталогКурсаОбъект = Новый Файл(ПутьКаталогуКурса);
		
		Если НЕ КаталогКурсаОбъект.Существует() ИЛИ НЕ КаталогКурсаОбъект.ЭтоКаталог() Тогда
			
			Текст = НСтр("ru = 'Каталог с файлами курса не найден'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,"ПутьКаталогуКурса");
			
			Возврат ПутьКВыбранномуФайлу;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Показываем диалог
	
	Фильтр = "";
	
	Если НРег(Расширение) = "xls" Тогда
		Фильтр = НСтр("ru = 'Файл MS Excel '") + "(*.xls;*.xlsx)|*.xls;*.xlsx";
	КонецЕсли;
	
	Если НРег(Расширение) = "zip" Тогда
		Фильтр = НСтр("ru = 'Файл ZIP '") + "(*.zip)|*.zip";
	КонецЕсли;
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалога);
	ДиалогОткрытияФайла.ПолноеИмяФайла     = "";
	ДиалогОткрытияФайла.Фильтр             = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Каталог            = ПутьКаталогуКурса;
	
	Если РежимДиалога = РежимДиалогаВыбораФайла.ВыборКаталога Тогда
		ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Выберите каталог'");
	Иначе
		ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Выберите файл'");
	КонецЕсли;
		
	Если НЕ ДиалогОткрытияФайла.Выбрать() Тогда
		Возврат ПутьКВыбранномуФайлу;
	КонецЕсли;
	
	Если РежимДиалога = РежимДиалогаВыбораФайла.ВыборКаталога Тогда
		
		ПутьКВыбранномуФайлу = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ДиалогОткрытияФайла.Каталог);
		
	Иначе
		
		ПутьКВыбранномуФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;
		
	КонецЕсли;
	
	Если ВыбратьИзКаталогаКурса И (Найти(ПутьКВыбранномуФайлу, ПутьКаталогуКурса) = 0 ИЛИ ПутьКВыбранномуФайлу = ПутьКаталогуКурса) Тогда
		
		Текст = НСтр("ru = 'Выберите элемент из каталога с файлами курса'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		
		Возврат "";
		
	КонецЕсли;
	
	Возврат ПутьКВыбранномуФайлу;
	
КонецФункции

&НаКлиенте
Процедура УдалитьЭлементыДляЗагрузки()
	
	Материалы.Очистить();
	Тесты.Очистить();
	Глоссарии.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлектронныйРесурс()
	
	Если НЕ ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ЭлектронныйРесурс) Тогда
	
		ЭлектронныйРесурсОбъект = Справочники.СводыЗнанийСУЗ.СоздатьЭлемент();
		
		Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда 
				
			// Ссылка есть, но в базе объекта нет
			
			ЭлектронныйРесурсОбъект.УстановитьСсылкуНового(ЭлектронныйРесурс);
				
		КонецЕсли;
		
		ЭлектронныйРесурсОбъект.Наименование = НаименованиеЭлектронногоРесурса;
		ЭлектронныйРесурсОбъект.Редакция = 1;
		ЭлектронныйРесурсОбъект.Родитель = РодительЭлектронногоРесурса;
		ЭлектронныйРесурсОбъект.Тип      = Перечисления.ТипыЭлектронныхРесурсовСУЗ.ЭлектронныйКурс;

		РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ЭлектронныйРесурсОбъект);
		
		ЭлектронныйРесурсОбъект.Записать();
		
		ЭлектронныйРесурс = ЭлектронныйРесурсОбъект.Ссылка; // Реквизит
	
	КонецЕсли;

	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеДобавленоВТаблицу(Таблица, ИмяКолонки, Значение)
	
	МассивСтрок = Таблица.НайтиСтроки(Новый Структура(ИмяКолонки, Значение));
	
	Возврат ?(МассивСтрок.Количество() > 0, Истина, Ложь);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИмяФайлаНастроек()
	
	Возврат "v8_CourseImportSettings.xml";
	
КонецФункции

&НаСервере
Функция ПолучитьАдресХраненияШаблонаКурса()
	
	ДвоичныеДанные = Справочники.СводыЗнанийСУЗ.ПолучитьМакет("ШаблонФайловДляИмпорта");
	
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Устанавливаем переменные
	
	ЭлектронныйРесурс           = Параметры.ЭлектронныйРесурс;
	РодительЭлектронногоРесурса = ?(НЕ ЗначениеЗаполнено(Параметры.ГруппаЭлектронногоРесурса) ИЛИ Параметры.ГруппаЭлектронногоРесурса.ЭтоГруппа, Параметры.ГруппаЭлектронногоРесурса, Параметры.ГруппаЭлектронногоРесурса.Родитель);
	
	Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ЭлектронныйРесурс) Тогда
		НаименованиеЭлектронногоРесурса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлектронныйРесурс, "Наименование");
	КонецЕсли;
	
	// Изменяем доступность элементов формы
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	#Если ВебКлиент Тогда
		
	ПоказатьПредупреждение(,НСтр("ru = 'Загрузка материалов курса в веб-клиенте не поддерживается'"));
	
	Отказ = Истина;
	
	Возврат;
	
	#КонецЕсли	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура ВыполнитьИмпорт(Команда)
	
	// Делаем проверки
	//
	
	Если НЕ ЗначениеЗаполнено(ПутьКаталогуКурса) Тогда
	
		Текст = НСтр("ru = 'Укажите путь к каталогу с файлами курса'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,"ПутьКаталогуКурса");
		
		Возврат;
	
	КонецЕсли;
	
	Если НЕ ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ЭлектронныйРесурс)
		И НЕ ЗначениеЗаполнено(НаименованиеЭлектронногоРесурса) Тогда
		
		Текст = НСтр("ru = 'Укажите наименование электронного курса или теста'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,"НаименованиеЭлектронногоРесурса");
		
		Возврат;
		
	КонецЕсли;
	
	НомерСтроки = 0;
	
	Для каждого Строка Из Материалы Цикл
		
		КаталогОбъект = Новый Файл(Строка.ПутьККаталогу);
		
		Если НЕ КаталогОбъект.Существует() ИЛИ НЕ КаталогОбъект.ЭтоКаталог() Тогда
			
			ТекстОшибки = НСтр("ru = 'Каталог ""%1"" не найден'"); 
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Строка.ПутьККаталогу);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"Материалы[" + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(НомерСтроки) + "].ПутьККаталогу");
			
			Возврат;
			
		КонецЕсли;

		НомерСтроки = НомерСтроки + 1;

	КонецЦикла;
	
	НомерСтроки = 0;
	
	Для каждого Строка Из Тесты Цикл
		
		ФайлОбъект = Новый Файл(Строка.ПутьКФайлу);
		
		Если НЕ ФайлОбъект.Существует() ИЛИ ФайлОбъект.ЭтоКаталог() Тогда
			
			ТекстОшибки = НСтр("ru = 'Файл ""%1"" не найден'"); 
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Строка.ПутьКФайлу);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"Тесты[" + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(НомерСтроки) + "].ПутьКФайлу");
			
			Возврат;
			
		КонецЕсли;

		Если ЗначениеЗаполнено(Строка.ПутьКФайлуРесурсов) Тогда
			
			ФайлОбъект = Новый Файл(Строка.ПутьКФайлуРесурсов);
			
			Если НЕ ФайлОбъект.Существует() ИЛИ ФайлОбъект.ЭтоКаталог() Тогда
				
				ТекстОшибки = НСтр("ru = 'Файл ""%1"" не найден'"); 
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Строка.ПутьКФайлуРесурсов);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"Тесты[" + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(НомерСтроки) + "].ПутьКФайлуРесурсов");
				
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
			
		НомерСтроки = НомерСтроки + 1;

	КонецЦикла;
	
	НомерСтроки = 0;
	
	Для каждого Строка Из Глоссарии Цикл
		
		ФайлОбъект = Новый Файл(Строка.ПутьКФайлу);
		
		Если НЕ ФайлОбъект.Существует() ИЛИ ФайлОбъект.ЭтоКаталог() Тогда
			
			ТекстОшибки = НСтр("ru = 'Файл ""%1"" не найден'"); 
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Строка.ПутьКФайлу);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"Глоссарии[" + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(НомерСтроки) + "].ПутьКФайлу");
			
			Возврат;
			
		КонецЕсли;

		НомерСтроки = НомерСтроки + 1;

	КонецЦикла;
	
	// Создаем электронный ресурс
	//
	
	СоздатьЭлектронныйРесурс();
	
	// Загружаем данные
	//
	
	// Формируем таблицу загрузок
	
	ТекущиеЗагрузки.Очистить();
	
	Для каждого Строка Из Материалы Цикл
		НоваяСтрока = ТекущиеЗагрузки.Добавить();
		НоваяСтрока.НомерЭлемента = Строка.ПолучитьИдентификатор();
		НоваяСтрока.ИмяТаблицы = "Материалы";
	КонецЦикла;
	
	Для каждого Строка Из Тесты Цикл
		НоваяСтрока = ТекущиеЗагрузки.Добавить();
		НоваяСтрока.НомерЭлемента = Строка.ПолучитьИдентификатор();
		НоваяСтрока.ИмяТаблицы = "Тесты";
	КонецЦикла;
	
	Для каждого Строка Из Глоссарии Цикл
		НоваяСтрока = ТекущиеЗагрузки.Добавить();
		НоваяСтрока.НомерЭлемента = Строка.ПолучитьИдентификатор();
		НоваяСтрока.ИмяТаблицы = "Глоссарии";
	КонецЦикла;
	
	// Загружаем материалы
	
	Если ТекущиеЗагрузки.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьИмпортПродолжение", ЭтотОбъект);
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Количество элементов для загрузки: %1.
		|Для каждого элемента будет открыта своя форма загрузки.'"), Строка(ТекущиеЗагрузки.Количество()));
		ПоказатьПредупреждение(ОписаниеОповещения, ТекстСообщения);	
	Иначе
		ПоказатьПредупреждение(,НСтр("ru = 'Нет элементов для загрузки'"));
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьИмпортПродолжение(ДополнительныеПараметры) Экспорт
	ЗагрузитьЭлемент(Неопределено, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЭлемент(РезультатПредыдущейЗагрузки, НомерПредыдущейЗагрузки) Экспорт
	
	Если НомерПредыдущейЗагрузки = Неопределено Тогда
		ТекущаяЗагрузка = 0;
	Иначе
		ТекущаяЗагрузка = НомерПредыдущейЗагрузки + 1;
	КонецЕсли;
	
	Если ТекущаяЗагрузка > ТекущиеЗагрузки.Количество() - 1 Тогда
		
		// Сохраняем настройки
		//
		
		СохранитьНастройкиВФайл();
		
		// Обновляем данные в других формах
		//
		
		Оповестить("ЭлектронныйРесурсОбновлен", ЭлектронныйРесурс, ЭтотОбъект);
		Оповестить("ЭлектронныйРесурсЗаписан",, ЭтотОбъект);
		
		// Завершаем
		
		ПоказатьПредупреждение(,НСтр("ru = 'Загрузка всех материалов завершена'"));

		Возврат;
		
	КонецЕсли;
	
	ДанныеЗагрузки = ТекущиеЗагрузки.Получить(ТекущаяЗагрузка);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьЭлемент", ЭтотОбъект, ТекущаяЗагрузка);
	
	Если ДанныеЗагрузки.ИмяТаблицы = "Материалы" Тогда
		
		Строка = Материалы.НайтиПоИдентификатору(ДанныеЗагрузки.НомерЭлемента);
		
		НайденныеФайлы = НайтиФайлы(Строка.ПутьККаталогу, "*", Ложь); 
		
		ФайлыДляЗагрузки = Новый Массив;
		
		Для каждого НайденныйФайл Из НайденныеФайлы Цикл
			ФайлыДляЗагрузки.Добавить(НайденныйФайл.ПолноеИмя);	
		КонецЦикла;
		
		ПараметрыФормы = Новый Структура("ЭлектронныйРесурс, ФайлыДляЗагрузки, ЗакрыватьПослеЗагрузки", ЭлектронныйРесурс, ФайлыДляЗагрузки, Истина);
		
		ОткрытьФорму("Справочник.РесурсыСУЗ.Форма.ФормаИмпортаФайлов", ПараметрыФормы, ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
	Если ДанныеЗагрузки.ИмяТаблицы = "Тесты" Тогда
		
		Строка = Тесты.НайтиПоИдентификатору(ДанныеЗагрузки.НомерЭлемента);
		
		ПараметрыФормы = Новый Структура("ЭлектронныйРесурс, ФайлДляЗагрузки, РесурсыДляЗагрузки, ЗакрыватьПослеЗагрузки", ЭлектронныйРесурс, Строка.ПутьКФайлу, Строка.ПутьКФайлуРесурсов, Истина);
		
		ОткрытьФорму("Справочник.ПодборкиСУЗ.Форма.ФормаСозданияИзФайлов", ПараметрыФормы, ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
	Если ДанныеЗагрузки.ИмяТаблицы = "Глоссарии" Тогда
		
		Строка = Глоссарии.НайтиПоИдентификатору(ДанныеЗагрузки.НомерЭлемента);
		
		ПараметрыФормы = Новый Структура("ЭлектронныйРесурс, ФайлДляЗагрузки, ЗакрыватьПослеЗагрузки", ЭлектронныйРесурс, Строка.ПутьКФайлу, Истина);
		
		ОткрытьФорму("Справочник.ГлоссарииСУЗ.Форма.ФормаИмпортаГлоссария", ПараметрыФормы, ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьШаблонКурса(Команда)
	ПолучитьФайл(ПолучитьАдресХраненияШаблонаКурса(), "CourseTemplate.zip", Истина);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ЭлектронныйРесурсОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбъектыСУЗКлиент.РедактироватьЭлектронныйРесурс(ЭлектронныйРесурс);

КонецПроцедуры

&НаКлиенте
Процедура ПутьКаталогуКурсаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ВыбранныйФайл = ВыбратьФайлДляЗагрузки(РежимДиалогаВыбораФайла.ВыборКаталога,,Ложь);
	
	Если ЗначениеЗаполнено(ВыбранныйФайл) Тогда
		
		ПутьКаталогуКурса = ВыбранныйФайл;
		
		УдалитьЭлементыДляЗагрузки();
		
		ПолучитьФайлНастроек();
		
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКаталогуКурсаПриИзменении(Элемент)
	
	УдалитьЭлементыДляЗагрузки();
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ Материалы

&НаКлиенте
Процедура МатериалыПриИзменении(Элемент)
	
	КоличествоМатериалов = Материалы.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПутьККаталогуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыбранныйФайл = ВыбратьФайлДляЗагрузки(РежимДиалогаВыбораФайла.ВыборКаталога,,Истина);
	
	Если ЗначениеЗаполнено(ВыбранныйФайл) Тогда
		Элементы.Материалы.ТекущиеДанные.ПутьККаталогу = ВыбранныйФайл;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	ВыбранныйФайл = ВыбратьФайлДляЗагрузки(РежимДиалогаВыбораФайла.ВыборКаталога,,Истина);
	
	Если ЗначениеЗаполнено(ВыбранныйФайл) И НЕ ЗначениеДобавленоВТаблицу(Материалы, "ПутьККаталогу", ВыбранныйФайл) Тогда
	
		НоваяСтрока = Материалы.Добавить();
		НоваяСтрока.ПутьККаталогу = ВыбранныйФайл;

		КоличествоМатериалов = Материалы.Количество();
		
	КонецЕсли;
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ Тесты

&НаКлиенте
Процедура ТестыПриИзменении(Элемент)
	
	КоличествоТестов = Тесты.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура ТестыПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыбранныйФайл = ВыбратьФайлДляЗагрузки(РежимДиалогаВыбораФайла.Открытие, "xls", Истина);
	
	Если ЗначениеЗаполнено(ВыбранныйФайл) Тогда
		Элементы.Тесты.ТекущиеДанные.ПутьКФайлу = ВыбранныйФайл;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТестыПутьКФайлуРесурсовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыбранныйФайл = ВыбратьФайлДляЗагрузки(РежимДиалогаВыбораФайла.Открытие, "zip", Истина);
	
	Если ЗначениеЗаполнено(ВыбранныйФайл) Тогда
		Элементы.Тесты.ТекущиеДанные.ПутьКФайлуРесурсов = ВыбранныйФайл;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТестыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	ВыбранныйФайл = ВыбратьФайлДляЗагрузки(РежимДиалогаВыбораФайла.Открытие, "xls", Истина);
	
	Если ЗначениеЗаполнено(ВыбранныйФайл) И НЕ ЗначениеДобавленоВТаблицу(Тесты, "ПутьКФайлу", ВыбранныйФайл) Тогда
	
		НоваяСтрока = Тесты.Добавить();
		НоваяСтрока.ПутьКФайлу = ВыбранныйФайл;
		
		КоличествоТестов = Тесты.Количество();

	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ Глоссарии

&НаКлиенте
Процедура ГлоссарииПриИзменении(Элемент)
	
	КоличествоГлоссариев = Глоссарии.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура ГлоссарииПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыбранныйФайл = ВыбратьФайлДляЗагрузки(РежимДиалогаВыбораФайла.Открытие, "xls", Истина);
	
	Если ЗначениеЗаполнено(ВыбранныйФайл) Тогда
		Элементы.Глоссарии.ТекущиеДанные.ПутьКФайлу = ВыбранныйФайл;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГлоссарииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	ВыбранныйФайл = ВыбратьФайлДляЗагрузки(РежимДиалогаВыбораФайла.Открытие, "xls", Истина);
	
	Если ЗначениеЗаполнено(ВыбранныйФайл) И НЕ ЗначениеДобавленоВТаблицу(Глоссарии, "ПутьКФайлу", ВыбранныйФайл) Тогда
		
		НоваяСтрока = Глоссарии.Добавить();
		НоваяСтрока.ПутьКФайлу = ВыбранныйФайл;

		КоличествоГлоссариев = Глоссарии.Количество();
		
	КонецЕсли;

КонецПроцедуры





