
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ПолучитьПакетДанных()

	ДанныеУзла = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.Узел, "Наименование, Код, НомерВерсии, НомерРедакции, ДатаИзменения");
	
	СвойстваПакета = Новый Структура("Наименование, ИмяФайлаПакета, Код, Версия, КонтрольнаяСумма, АдресВоВременномХранилище, ДатаИзменения, Размер");
	
	СвойстваПакета.Наименование  = ДанныеУзла.Наименование;
	СвойстваПакета.Код           = Строка(ДанныеУзла.Код);
	СвойстваПакета.Версия        = Строка(ДанныеУзла.НомерРедакции) + "." + Строка(ДанныеУзла.НомерВерсии);
	СвойстваПакета.ДатаИзменения = ДанныеУзла.ДатаИзменения;
	
	ЭлементыДляЭкспорта = Новый ТаблицаЗначений();
	ЭлементыДляЭкспорта.Колонки.Добавить("СсылкаНаЭлемент");
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбменМатериаламиСУЗЭлементыДляЭкспорта.СсылкаНаЭлемент КАК СсылкаНаЭлемент
		|ИЗ
		|	ПланОбмена.ОбменМатериаламиСУЗ.ЭлементыДляЭкспорта КАК ОбменМатериаламиСУЗЭлементыДляЭкспорта
		|ГДЕ
		|	ОбменМатериаламиСУЗЭлементыДляЭкспорта.Ссылка = &Узел";
	
	Запрос.УстановитьПараметр("Узел", Параметры.Узел);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ЭлементыДляЭкспорта.Добавить();
		НоваяСтрока.СсылкаНаЭлемент = ВыборкаДетальныеЗаписи.СсылкаНаЭлемент; 
	КонецЦикла;
	
	ОбработкаПубликации = Обработки.ПубликацияЭлектронныхРесурсовСУЗ.Создать();
	ОбработкаПубликации.ТипПубликации = перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.SCORM_1_3;
	
	ОбработкаПубликации.ОпубликоватьПакетДанных(СвойстваПакета, ЭлементыДляЭкспорта, УникальныйИдентификатор);
	
	//
	
	АдресПакетаДанных = СвойстваПакета.АдресВоВременномХранилище;
	Наименование      = """" + СвойстваПакета.ИмяФайлаПакета + """";
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Параметры.Узел) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Пакет данных не задан.'"),,,,Отказ);
	КонецЕсли;
	
	ПолучитьПакетДанных();
	
	Если НЕ ЗначениеЗаполнено(АдресПакетаДанных) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура СохранитьПакетДанных(Команда)
	
	Если ЗначениеЗаполнено(АдресПакетаДанных) Тогда
		ИмяФайла = ОбщегоНазначенияСУКлиентСервер.ЗаменитьЗапрещенныеСимволыВИмениФайла(Наименование) + ".zip";
		ПолучитьФайл(АдресПакетаДанных, ИмяФайла, Истина);
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

