#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;		
	ДанныеВыбора = Новый СписокЗначений;
	
	Элемент = ДанныеВыбора.Добавить();
	Элемент.Значение = Перечисления.ТипыШаблоновСообщенийСУО.АвтоматическаяРассылка;
	Элемент.Представление = Перечисления.ТипыШаблоновСообщенийСУО.АвтоматическаяРассылка;	
	
	Элемент = ДанныеВыбора.Добавить();
	Элемент.Значение = Перечисления.ТипыШаблоновСообщенийСУО.РучнаяРассылка;
	Элемент.Представление = Перечисления.ТипыШаблоновСообщенийСУО.РучнаяРассылка;	
	
	Элемент = ДанныеВыбора.Добавить();
	Элемент.Значение = Перечисления.ТипыШаблоновСообщенийСУО.СбросПароля;
	Элемент.Представление = Перечисления.ТипыШаблоновСообщенийСУО.СбросПароля;		
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
