
#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// На основе программы обучения

&НаКлиенте
Процедура НаОсновеПрограммыОбучения(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПровестиПрограммуОбучениеНаОсновеСценарияПродолжение", ЭтотОбъект);	
	
	ОткрытьФорму("Справочник.КаталогПрограммОбученияСУО.ФормаВыбора",,,,,,ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ПровестиПрограммуОбучениеНаОсновеСценарияПродолжение(ВыбраннаяПрограммаОбучения, ДополнительныеПараметры) Экспорт
	
	Если ВыбраннаяПрограммаОбучения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть();
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("ПрограммаОбучения, БезСценария", ВыбраннаяПрограммаОбучения, Ложь));
	ОткрытьФорму("Документ.ПроведениеПрограммыОбученияСУО.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры

// Без сценария

&НаКлиенте
Процедура БезСценария(Команда)
	
	Закрыть();
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("БезСценария", Истина));
	ОткрытьФорму("Документ.ПроведениеПрограммыОбученияСУО.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры

#КонецОбласти


