////////////////////////////////////////////////////////////////////////////////
// ВИЗУАЛЬНЫЙ РЕДАКТОР

Процедура УстановитьЗаголовокДоступныхДанныхВизуальногоРедактора(Форма) Экспорт
	
	ВсеКнопкиДанных = Форма.Элементы.ИмяРедактируемыхДанных.СписокВыбора;
	
	Для каждого ТекКнопка Из ВсеКнопкиДанных Цикл
		
		ИмяКнопки = ТекКнопка.Значение;
		
		Если ТипЗнч(Форма[ИмяКнопки]) = Тип("ФорматированныйДокумент")
			ИЛИ ТипЗнч(Форма[ИмяКнопки]) = Тип("ТекстовыйДокумент") Тогда
			ТекстОписания = Форма[ИмяКнопки].ПолучитьТекст();
		Иначе
			ТекстОписания = Форма[ИмяКнопки];
		КонецЕсли;
		
		ТекКнопка.Представление = СтрЗаменить(ТекКнопка.Представление, " *", "");
		
		Если НЕ ПустаяСтрока(ТекстОписания) Тогда
			ТекКнопка.Представление = ТекКнопка.Представление + " *";
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ТЕРМИНЫ

Функция ПолучитьБуквуДляПоиска(Строка) Экспорт
	
	Искать     = 1;
	Поз        = 0;
	ДлинаСлова = СтрДлина(Строка);
	
	Пока (Искать И Поз <= ДлинаСлова)  Цикл
		
		Поз         = Поз + 1;
		Буква       = Лев(Строка, Поз);
		ПерваяБуква = Прав(Буква, 1);
		
		Попытка
			ПерваяБукваПР = Число(ПерваяБуква);
		Исключение
			ПерваяБукваПР = ПерваяБуква
		КонецПопытки;
		
		// Убеждаемся, что символ является буквой или числом.
		// Если нет, то ищем первую букву дальше.
		Если (НРег(ПерваяБуква) <> ВРег(ПерваяБуква) ИЛИ ТипЗнч(ПерваяБукваПР)= Тип("Число")) Тогда
			БукваДляПоиска = Врег(ПерваяБуква);
			Искать = 0;
		Иначе 
		    Искать = 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат БукваДляПоиска;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ФАЙЛЫ

// Возвращает тип файла (перечисление ТипыФайловСУЗ) по его расширению.
//
Функция ПолучитьТипФайлаПоРасширению(Знач Расширение) Экспорт
	
	Расширение               = СтрЗаменить(Расширение, ".", "");
	СоответствиеПоРасширению = РазработкаСУЗПовтИсп.ПолучитьСоответствиеРасширенияПоТипамФайлов();
	ТипПоУмолчанию           = ПредопределенноеЗначение("Перечисление.ТипыФайловСУЗ.Default");;
	
	ТипФайла = Неопределено;
	
	Если НЕ ПустаяСтрока(Расширение) Тогда
		Попытка
			СоответствиеПоРасширению.Свойство("_" + Расширение, ТипФайла);
		Исключение
			Возврат ТипПоУмолчанию;
		КонецПопытки;
	Иначе
		Возврат ТипПоУмолчанию;
	КонецЕсли;
	
	Если ТипФайла <> Неопределено Тогда
		Возврат ТипФайла;
	Иначе
		Возврат ТипПоУмолчанию;
	КонецЕсли;
	
КонецФункции

Функция ИмяФайлаМиниатюры(ИмяФайла) Экспорт
	
	Возврат ИмяФайла + "_thumbnail.jpg";
	
КонецФункции

Функция ДоступныеФорматыВидео() Экспорт
	
	ФорматыВидео = Новый Массив;
	ФорматыВидео.Добавить("MP4");
	ФорматыВидео.Добавить("FLV");
	ФорматыВидео.Добавить("WEBM");
	
	Возврат Новый ФиксированныйМассив(ФорматыВидео);
	
КонецФункции

Функция ПутьКФайлуЗапускаДокумента(ПутьККаталогу) Экспорт
	Возврат ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогу) + "index.html";
КонецФункции

Функция ЭтоФайлПрезентации(РасширениеФайлаИлиИмяФайла) Экспорт
	
	Если Прав(НРег(РасширениеФайлаИлиИмяФайла), 4) = ".ppt" 
		ИЛИ Прав(НРег(РасширениеФайлаИлиИмяФайла), 5) = ".pptx" Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;	
	
КонецФункции
