#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ЗначениеВЧисло(Значение) Экспорт
	
	Если Значение = Перечисления.ПродолжительностьОбученияСУО.НеЗадана Тогда
		Возврат 1;
	КонецЕсли;
	
	Если Значение = Перечисления.ПродолжительностьОбученияСУО.Фиксированная Тогда
		Возврат 2;
	КонецЕсли;
	
	Если Значение = Перечисления.ПродолжительностьОбученияСУО.СНачалаОбучения Тогда
		Возврат 3;
	КонецЕсли;
	
	Если Значение = Перечисления.ПродолжительностьОбученияСУО.СЗачисления Тогда
		Возврат 4;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ЧислоВЗначение(ЗначениеЧисло) Экспорт
	
	Если ЗначениеЧисло = 1 Тогда
		Возврат Перечисления.ПродолжительностьОбученияСУО.НеЗадана;
	КонецЕсли;
	
	Если ЗначениеЧисло = 2 Тогда
		Возврат Перечисления.ПродолжительностьОбученияСУО.Фиксированная;
	КонецЕсли;
	
	Если ЗначениеЧисло = 3 Тогда
		Возврат Перечисления.ПродолжительностьОбученияСУО.СНачалаОбучения;
	КонецЕсли;
	
	Если ЗначениеЧисло = 4 Тогда
		Возврат Перечисления.ПродолжительностьОбученияСУО.СЗачисления;
	КонецЕсли;
	
	Возврат Перечисления.ПродолжительностьОбученияСУО.ПустаяСсылка();	
	
КонецФункции

#КонецЕсли