
////////////////////////////////////////////////////////////////////////////////
// ПРЕПОДАВАТЕЛИ

Функция ВыбратьПреподавателя(РольПреподавателя, Форма) Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПреподавателяПродолжение", ЭтотОбъект, Новый Структура("Форма, РольПреподавателя", Форма, РольПреподавателя));		
	
	ПараметрыФормы = Новый Структура("РежимВыбора", Истина);
	ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыФормы,,,,,ОписаниеОповещения);	
	
КонецФункции

Процедура ВыбратьПреподавателяПродолжение(ВыбранныйПользователь, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ВыбранныйПользователь) <> Тип("СправочникСсылка.Пользователи")
		ИЛИ НЕ ЗначениеЗаполнено(ВыбранныйПользователь) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Форма.ЗачислитьПреподавателяНаКлиенте(ВыбранныйПользователь, ДополнительныеПараметры.РольПреподавателя);
	
КонецПроцедуры	

Процедура ВыбратьРольПреподавателя(РолиПреподавателей, Форма, Продолжение="ИзменитьРоль") Экспорт
	
	Если РолиПреподавателей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если РолиПреподавателей.Количество() = 1 Тогда
		
		ВыбранноеЗначение = РолиПреподавателей.Получить(0);
		
		Если Продолжение = "ИзменитьРоль" Тогда
			ВыбратьРольПреподавателяПродолжениеИзменитьРоль(ВыбранноеЗначение, Форма);
		КонецЕсли;
		
		Если Продолжение = "ВыбратьПреподавателя" Тогда
			ВыбратьРольПреподавателяПродолжениеВыбратьПреподавателя(ВыбранноеЗначение, Форма);
		КонецЕсли;
		
	КонецЕсли;
	
	Если РолиПреподавателей.Количество() > 1 Тогда
		
		Если Продолжение = "ИзменитьРоль" Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьРольПреподавателяПродолжениеИзменитьРоль", ЭтотОбъект, Форма);	
		КонецЕсли;
		
		Если Продолжение = "ВыбратьПреподавателя" Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьРольПреподавателяПродолжениеВыбратьПреподавателя", ЭтотОбъект, Форма);	
		КонецЕсли;
		
		РолиПреподавателей.ПоказатьВыборЭлемента(ОписаниеОповещения, НСтр("ru = 'Выберите роль преподавателя'"));
				
	КонецЕсли;

КонецПроцедуры

Процедура ВыбратьРольПреподавателяПродолжениеИзменитьРоль(ВыбранноеЗначение, Форма) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма.ИзменитьРольПреподавателяНаКлиенте(ВыбранноеЗначение.Значение);	
	
КонецПроцедуры	

Процедура ВыбратьРольПреподавателяПродолжениеВыбратьПреподавателя(ВыбранноеЗначение, Форма) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбратьПреподавателя(ВыбранноеЗначение.Значение, Форма);
	
КонецПроцедуры	

////////////////////////////////////////////////////////////////////////////////
// ПРОВЕДЕНИЕ ОБУЧЕНИЯ

Процедура СоздатьОбучениеПоВиду(ВидОбучения, ЕстьМероприятие, ПоказатьКнопкуОтменыВыбора = Истина, Мероприятие = Неопределено, ЗначенияЗаполнения = Неопределено, ВладелецФормы = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВидОбучения) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметрыСоздания = Новый Структура("ВидОбучения, ЗначенияЗаполнения, ВладелецФормы", ВидОбучения, ЗначенияЗаполнения, ВладелецФормы);
	
	Если ВидОбучения = ПредопределенноеЗначение("Справочник.ВидыМероприятийСУО.НаОсновеЭлектронногоРесурса") Тогда
		
		СоздатьОбучениеНаОсновеЭлектронногоРесурса(ДополнительныеПараметрыСоздания);
		
	Иначе
		
		Если ЕстьМероприятие И ПолучитьФункциональнуюОпциюИнтерфейса("ИспользоватьКаталогОбученийСУО") Тогда
			
			Если ЗначениеЗаполнено(Мероприятие) Тогда				
				ПровестиОбучениеНаОсновеМероприятияПродолжение(Мероприятие, ДополнительныеПараметрыСоздания);				
			Иначе				
				ПараметрыФормы = Новый Структура("Отбор, ПоказатьКнопкуОтменыВыбора", Новый Структура("Вид", ВидОбучения), ПоказатьКнопкуОтменыВыбора);
				ОписаниеОповещения = Новый ОписаниеОповещения("ПровестиОбучениеНаОсновеМероприятияПродолжение", ЭтотОбъект, ДополнительныеПараметрыСоздания);
				ОткрытьФорму("Справочник.КаталогМероприятийСУО.ФормаВыбора",ПараметрыФормы,,,,,ОписаниеОповещения);
			КонецЕсли;			
		
		Иначе
		
			ПровестиОбучениеБезСценарияПродолжение(ВидОбучения, ДополнительныеПараметрыСоздания);
		
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПровестиОбучениеБезСценарияПродолжение(ВидОбучения, ДополнительныеПараметрыСоздания) Экспорт
	
	Если ВидОбучения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("БезСценария, НаименованиеОбучения, ВидОбучения", Истина, Строка(ВидОбучения), ВидОбучения));
	
	Если ТипЗнч(ДополнительныеПараметрыСоздания) = Тип("Структура")
		И ДополнительныеПараметрыСоздания.Свойство("ЗначенияЗаполнения")
		И ТипЗнч(ДополнительныеПараметрыСоздания.ЗначенияЗаполнения) = Тип("Структура") Тогда
		Для каждого ЭлементСтруктуры Из ДополнительныеПараметрыСоздания.ЗначенияЗаполнения Цикл
			ПараметрыФормы.ЗначенияЗаполнения.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
		КонецЦикла;
	КонецЕсли;	
	
	ВладелецФормы = Неопределено;
		
	Если ТипЗнч(ДополнительныеПараметрыСоздания) = Тип("Структура")
		И ДополнительныеПараметрыСоздания.Свойство("ВладелецФормы") Тогда		
		ВладелецФормы = ДополнительныеПараметрыСоздания.ВладелецФормы;		
	КонецЕсли;			
	
	ОткрытьФорму("Документ.ПроведениеОбученияСУО.ФормаОбъекта", ПараметрыФормы, ВладелецФормы);

КонецПроцедуры

Процедура ПровестиОбучениеНаОсновеМероприятияПродолжение(ВыбранноеМероприятие, ДополнительныеПараметрыСоздания) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВыбранноеМероприятие) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеМероприятие) = Тип("СправочникСсылка.КаталогМероприятийСУО")
		И ЗначениеЗаполнено(ВыбранноеМероприятие) Тогда
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения",
			Новый Структура("НаОсновеМероприятия, Мероприятие", Истина, ВыбранноеМероприятие));
		
		Если ТипЗнч(ДополнительныеПараметрыСоздания) = Тип("Структура")
			И ДополнительныеПараметрыСоздания.Свойство("ЗначенияЗаполнения")
			И ТипЗнч(ДополнительныеПараметрыСоздания.ЗначенияЗаполнения) = Тип("Структура") Тогда
			
			Для каждого ЭлементСтруктуры Из ДополнительныеПараметрыСоздания.ЗначенияЗаполнения Цикл
				ПараметрыФормы.ЗначенияЗаполнения.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
			КонецЦикла;
			
		КонецЕсли;			
		
		ВладелецФормы = Неопределено;
		
		Если ТипЗнч(ДополнительныеПараметрыСоздания) = Тип("Структура")
			И ДополнительныеПараметрыСоздания.Свойство("ВладелецФормы") Тогда		
			ВладелецФормы = ДополнительныеПараметрыСоздания.ВладелецФормы;		
		КонецЕсли;		
		
		ОткрытьФорму("Документ.ПроведениеОбученияСУО.ФормаОбъекта", ПараметрыФормы, ВладелецФормы);
		
	Иначе		
		
		Если ТипЗнч(ДополнительныеПараметрыСоздания) = Тип("Структура")
			И ДополнительныеПараметрыСоздания.Свойство("ВидОбучения") Тогда			
			ПровестиОбучениеБезСценарияПродолжение(ДополнительныеПараметрыСоздания.ВидОбучения, ДополнительныеПараметрыСоздания);			
		КонецЕсли;		
		
	КонецЕсли;

КонецПроцедуры

Процедура СоздатьОбучениеНаОсновеЭлектронногоРесурса(ДополнительныеПараметрыСоздания)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПровестиОбучениеНаОсновеЭлектронногоРесурсаПродолжение", ЭтотОбъект, ДополнительныеПараметрыСоздания);
	ОткрытьФорму("Справочник.СводыЗнанийСУЗ.ФормаВыбора",,,,,,ОписаниеОповещения);

КонецПроцедуры

Процедура ПровестиОбучениеНаОсновеЭлектронногоРесурсаПродолжение(ВыбранныйЭлектронныйРесурс, ДополнительныеПараметрыСоздания) Экспорт
	
	Если ВыбранныйЭлектронныйРесурс = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения",
		Новый Структура("НаОсновеЭлектронногоРесурса, ЭлектронныйРесурс", Истина, ВыбранныйЭлектронныйРесурс));
	
	Если ТипЗнч(ДополнительныеПараметрыСоздания) = Тип("Структура")
		И ДополнительныеПараметрыСоздания.Свойство("ЗначенияЗаполнения")
		И ТипЗнч(ДополнительныеПараметрыСоздания.ЗначенияЗаполнения) = Тип("Структура") Тогда
		Для каждого ЭлементСтруктуры Из ДополнительныеПараметрыСоздания.ЗначенияЗаполнения Цикл
			ПараметрыФормы.ЗначенияЗаполнения.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
		КонецЦикла;
	КонецЕсли;		
	
	ВладелецФормы = Неопределено;
	
	Если ТипЗнч(ДополнительныеПараметрыСоздания) = Тип("Структура")
		И ДополнительныеПараметрыСоздания.Свойство("ВладелецФормы") Тогда		
		ВладелецФормы = ДополнительныеПараметрыСоздания.ВладелецФормы;		
	КонецЕсли;
	
	ОткрытьФорму("Документ.ПроведениеОбученияСУО.ФормаОбъекта", ПараметрыФормы, ВладелецФормы);

КонецПроцедуры

Процедура РезультатыЗаданийУчастника(ПрохождениеОбучения, ПараметрыВыполненияКоманды = Неопределено) Экспорт
	
	ЕстьПоддержкаСотрудников = УправлениеОбучениемСУОВызовСервера.ЕстьПоддержкаСотрудников();
	ЕстьПоддержкаСтудентов = УправлениеОбучениемСУОВызовСервера.ЕстьПоддержкаСтудентов();
	
	Если ЕстьПоддержкаСотрудников И НЕ ЕстьПоддержкаСтудентов Тогда
		ИмяФормыОтчета = "Отчет.РезультатыОбученияСУО.Форма";
	ИначеЕсли ЕстьПоддержкаСтудентов И НЕ ЕстьПоддержкаСотрудников Тогда
		ИмяФормыОтчета = "Отчет.РезультатыОбученияОО.Форма";
	Иначе
		ИмяФормыОтчета = "Отчет.РезультатыОбученияСУ.Форма";
	КонецЕсли;		
	
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии, КлючВарианта", Новый Структура("ПрохождениеОбучения", ПрохождениеОбучения), Истина, "ЗаданияУчастников");
	
	Если ПараметрыВыполненияКоманды = Неопределено Тогда
		ОткрытьФорму(ИмяФормыОтчета, ПараметрыФормы);
	Иначе
		ОткрытьФорму(ИмяФормыОтчета, ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	КонецЕсли;	

КонецПроцедуры

Процедура ВыполнитьПроверкуКорректностиДатПроведенияОбучения(
	ТекстВопроса, 
	Отказ,
	Знач Статус,
	Знач ДатаОкончанияПроведения,
	Знач ДатаКонтроля,
	Знач ДатаНачалаДоступа,
	Знач ДатаНачалаПроведения) Экспорт
	
	// Активное
	
	ТекущаяДатаКлиента = ТекущаяДата();
	
	Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроведенияОбъектовСУО.Активно")
		И (ЗначениеЗаполнено(ДатаОкончанияПроведения) И ДатаОкончанияПроведения < ТекущаяДатаКлиента
		ИЛИ ЗначениеЗаполнено(ДатаКонтроля) И ДатаКонтроля < ТекущаяДатаКлиента) Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Обучение имеет статус Активно, но дата окончания обучения уже прошла. Продолжить?'");
	КонецЕсли;
	
	Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроведенияОбъектовСУО.Активно")
		И (ЗначениеЗаполнено(ДатаНачалаПроведения) И ДатаНачалаПроведения > ТекущаяДатаКлиента
		ИЛИ ЗначениеЗаполнено(ДатаНачалаДоступа) И ДатаНачалаДоступа > ТекущаяДатаКлиента) Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Обучение имеет статус Активно, но дата начала обучения еще не наступила. Продолжить?'");
	КонецЕсли;		
	
	// Завершенное
	
	Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроведенияОбъектовСУО.Завершено")
		И (ЗначениеЗаполнено(ДатаОкончанияПроведения) И ДатаОкончанияПроведения >= ТекущаяДатаКлиента
		ИЛИ ЗначениеЗаполнено(ДатаКонтроля) И ДатаКонтроля >= ТекущаяДатаКлиента) Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Обучение имеет статус Завершено, но дата окончания еще не прошла. Продолжить?'");
	КонецЕсли;
	
	Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроведенияОбъектовСУО.Завершено")
		И (ЗначениеЗаполнено(ДатаНачалаПроведения) И ДатаНачалаПроведения > ТекущаяДатаКлиента
		ИЛИ ЗначениеЗаполнено(ДатаНачалаДоступа) И ДатаНачалаДоступа > ТекущаяДатаКлиента) Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Обучение имеет статус Завершено, но дата начала обучения еще не наступила. Продолжить?'");
	КонецЕсли;	
	
	// Запланированное
	
	Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроведенияОбъектовСУО.Запланировано")
		И (ЗначениеЗаполнено(ДатаНачалаДоступа) И ДатаНачалаДоступа <= ТекущаяДатаКлиента
		ИЛИ ЗначениеЗаполнено(ДатаНачалаПроведения) И ДатаНачалаПроведения <= ТекущаяДатаКлиента) Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Обучение имеет статус Запланировано, но дата начала обучения уже наступила. Продолжить?'");
	КонецЕсли;
	
	Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроведенияОбъектовСУО.Запланировано")
		И (ЗначениеЗаполнено(ДатаОкончанияПроведения) И ДатаОкончанияПроведения < ТекущаяДатаКлиента
		ИЛИ ЗначениеЗаполнено(ДатаКонтроля) И ДатаКонтроля < ТекущаяДатаКлиента) Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Обучение имеет статус Запланировано, но дата окончания обучения уже прошла. Продолжить?'");
	КонецЕсли;	

	
КонецПроцедуры	
	

////////////////////////////////////////////////////////////////////////////////
// ХАРАКТЕРИСТИКИ УЧЕБНЫХ ОБЪЕКТОВ

// Добавляет характеристику интерактивно
//
Процедура ДобавитьХарактеристику(Форма) Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьХарактеристикуПродолжение", ЭтотОбъект, Форма);		
	
	ОткрытьФорму("ПланВидовХарактеристик.ХарактеристикиУчебныхОбъектовСУО.ФормаВыбора",,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

Процедура ДобавитьХарактеристикуПродолжение(ВидХарактеристики, Форма) Экспорт
	
	Если ЗначениеЗаполнено(ВидХарактеристики) Тогда

		Если Форма.ОписаниеХарактеристик.НайтиСтроки(Новый Структура("ВидХарактеристики", ВидХарактеристики)).Количество() > 0 Тогда
			ПоказатьПредупреждение(,НСтр("ru = 'Характеристика уже существует'", "ru"));
		Иначе
			Форма.ДобавитьХарактеристикуНаСервере(ВидХарактеристики);	 
		КонецЕсли;	 
		
	КонецЕсли;
	
КонецПроцедуры	

// Удаляет характеристику интерактивно
//
Процедура УдалитьХарактеристику(Форма) Экспорт
	
	// Выберем удаляемый вид
	СписокВидов = Новый СписокЗначений;
	Для каждого ОписаниеХарактеристики Из Форма.ОписаниеХарактеристик Цикл
		ЭлементСпискаВидов = СписокВидов.Добавить();
		ЭлементСпискаВидов.Значение = ОписаниеХарактеристики.ПолучитьИдентификатор();
		ЭлементСпискаВидов.Представление = Строка(ОписаниеХарактеристики.ВидХарактеристики);
	КонецЦикла;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьХарактеристикуПродолжение", ЭтотОбъект, Форма);
	
	СписокВидов.ПоказатьВыборЭлемента(ОписаниеОповещения, НСтр("ru = 'Удалить характеристику:'"));
	
КонецПроцедуры

Процедура УдалитьХарактеристикуПродолжение(ВыбранныйЭлемент, Форма) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Форма.УдалитьХарактеристикуНаСервере(ВыбранныйЭлемент.Значение)
	КонецЕсли;
	
КонецПроцедуры	

