

#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(ОбщийКаталогМероприятий, Справочники.СхемыМероприятийСУО.Общая);

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыОбщийКаталогМероприятий

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ОбщийКаталогМероприятий

&НаКлиенте
Процедура ОбщийКаталогМероприятийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Копирование И НЕ Группа Тогда
		
		Отказ = Истина;		
		ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьОбщийСценарийПродолжение", ЭтотОбъект, Новый Структура("Родитель", Родитель));		
		ОткрытьФорму("Справочник.ВидыМероприятийСУО.ФормаВыбора", Новый Структура("Отбор", Новый Структура("Предопределенный", Ложь)),,,,,ОписаниеОповещения);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОбщийСценарийПродолжение(ВидОбучения, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВидОбучения) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("Вид, Владелец, Родитель", ВидОбучения, ПредопределенноеЗначение("Справочник.СхемыМероприятийСУО.Общая"), ДополнительныеПараметры.Родитель));
	ОткрытьФорму("Справочник.КаталогМероприятийСУО.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры

#КонецОбласти

