Функция ЗначениеДляВебКабинета(ТипПоля) Экспорт
	
	Если ТипПоля = Перечисления.ТипыПолейРегистрацииВебКабинетаСУО.ПолеВвода Тогда
		
		Возврат "text";
		
	ИначеЕсли ТипПоля = Перечисления.ТипыПолейРегистрацииВебКабинетаСУО.ЭлектроннаяПочта Тогда
		
		Возврат "email";
		
	ИначеЕсли ТипПоля = Перечисления.ТипыПолейРегистрацииВебКабинетаСУО.Пароль Тогда
		
		Возврат "password";
		
	ИначеЕсли ТипПоля = Перечисления.ТипыПолейРегистрацииВебКабинетаСУО.Число Тогда
		
		Возврат "number";
		
	КонецЕсли;
	
	Возврат "text";
		
КонецФункции