Функция ВыбратьЭлементыРасписания(ПроведениеОбучения=Неопределено, Пользователь=Неопределено, НачалоПериода=Неопределено, КонецПериода=Неопределено, ОткрытоДляРуководителей=Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос();

	Запрос.Текст = "ВЫБРАТЬ
	               |	ОткрытоеОбучение.Регистратор КАК ПроведениеОбучения,
	               |	ОткрытоеОбучение.ДатаНачалаПроведения,
	               |	ОткрытоеОбучение.ДатаОкончанияПроведения,
	               |	ПрохожденияОбучения.Регистратор КАК ПрохождениеОбучения,
	               |	ОткрытоеОбучение.ДатаОткрытияЗаписи,
	               |	ОткрытоеОбучение.ДатаЗакрытияЗаписи,
	               |	ОткрытоеОбучение.ТребуетсяЗаявка,
	               |	ВЫБОР
	               |		КОГДА ОткрытоеОбучение.ПроведениеОбучения.Наименование <> """"
	               |			ТОГДА ОткрытоеОбучение.ПроведениеОбучения.Наименование
	               |		КОГДА ОткрытоеОбучение.ПроведениеОбучения.НаОсновеЭлектронногоРесурса
	               |			ТОГДА ОткрытоеОбучение.ПроведениеОбучения.ЭлектронныйРесурс.Наименование
	               |		КОГДА ОткрытоеОбучение.ПроведениеОбучения.НаОсновеМероприятия
	               |			ТОГДА ОткрытоеОбучение.ПроведениеОбучения.Мероприятие.Наименование
	               |		ИНАЧЕ ""Обучение""
	               |	КОНЕЦ КАК Наименование,
	               |	ОткрытоеОбучение.ПроведениеОбучения.СкрытьВремяПроведения КАК СкрытьВремяПроведения,
	               |	ОткрытоеОбучение.Пользователь,
	               |	ЗаявкиНаОбучениеСУОСрезПоследних.Статус КАК СтатусЗаявки,
	               |	ЗаявкиНаОбучениеСУОСрезПоследних.Период КАК ДатаЗаявки,
	               |	ОткрытоеОбучение.ПроведениеОбучения.ФайлКартинки КАК ФайлКартинки,
	               |	ОткрытоеОбучение.ПроведениеОбучения.ФайлКартинки.Расширение КАК РасширениеКартинки
	               |ИЗ
	               |	РегистрСведений.ОткрытоеОбучениеСУО КАК ОткрытоеОбучение
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрохожденияОбученияСУО КАК ПрохожденияОбучения
	               |		ПО ОткрытоеОбучение.ПроведениеОбучения = ПрохожденияОбучения.ПроведениеОбучения
	               |			И ОткрытоеОбучение.Пользователь = ПрохожденияОбучения.Пользователь
	               |			И ОткрытоеОбучение.Сценарий = ПрохожденияОбучения.Сценарий
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаявкиНаОбучениеСУО.СрезПоследних(, ) КАК ЗаявкиНаОбучениеСУОСрезПоследних
	               |		ПО ОткрытоеОбучение.Пользователь = ЗаявкиНаОбучениеСУОСрезПоследних.Пользователь
	               |			И ОткрытоеОбучение.ПроведениеОбучения = ЗаявкиНаОбучениеСУОСрезПоследних.ПредметЗаявки
	               |ГДЕ
	               |	ОткрытоеОбучение.ОткрытоДляРуководителей = &ОткрытоДляРуководителей";
				   
	Запрос.Параметры.Вставить("ОткрытоДляРуководителей", ОткрытоДляРуководителей);			   
	
	Если ПроведениеОбучения <> Неопределено Тогда
		
		Запрос.Текст = 	Запрос.Текст + " И ОткрытоеОбучение.ПроведениеОбучения = &ПроведениеОбучения";
		
		Запрос.Параметры.Вставить("ПроведениеОбучения", ПроведениеОбучения);
		
	КонецЕсли;
	
	Если Пользователь <> Неопределено Тогда
		
		Запрос.Текст = 	Запрос.Текст + " И ОткрытоеОбучение.Пользователь В(&Пользователь)";
		
		Запрос.Параметры.Вставить("Пользователь", Пользователь);
		
	КонецЕсли;				   
				   
	Если НачалоПериода <> Неопределено И КонецПериода <> Неопределено Тогда
				   
		Запрос.Параметры.Вставить("НачалоПериода", НачалоПериода);
		Запрос.Параметры.Вставить("КонецПериода", КонецПериода);
		Запрос.Параметры.Вставить("ПустаяДата", Дата("00010101"));
				   
		Запрос.Текст = 	Запрос.Текст + "		   
	               |	И (ОткрытоеОбучение.ДатаНачалаПроведения МЕЖДУ &НачалоПериода И &КонецПериода
	               |			ИЛИ ОткрытоеОбучение.ДатаОкончанияПроведения МЕЖДУ &НачалоПериода И &КонецПериода
	               |			ИЛИ ОткрытоеОбучение.ДатаНачалаПроведения < &НачалоПериода
	               |				И ОткрытоеОбучение.ДатаОкончанияПроведения > &КонецПериода
	               |			ИЛИ ОткрытоеОбучение.ДатаНачалаПроведения = &ПустаяДата)";
					   
					   				   
		Результат = Запрос.Выполнить();

	КонецЕсли;

	Результат = Запрос.Выполнить();

	Возврат Результат.Выбрать();
	
КонецФункции