

#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	// При создании на основании
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Если Объект.Мероприятие.ЭтоГруппа Тогда
			
			Отказ = Истина;
			Текст = НСтр("ru = 'Выбрана группа мероприятий'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
			Возврат;
			
		КонецЕсли;
		
		Если Объект.ЭлектронныйРесурс.ЭтоГруппа Тогда
			
			Отказ = Истина;
			Текст = НСтр("ru = 'Выбрана группа электронных ресурсов'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
			Возврат;
			
		КонецЕсли;
		
		Если Объект.Аудитория.ЭтоГруппа Тогда
			
			Отказ = Истина;
			Текст = НСтр("ru = 'Выбрана группа аудиторий'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
			Возврат;
			
		КонецЕсли;		
		
	КонецЕсли;
		
	// Заполняем реквизиты
	
	УстановитьДатуИзмененияРесурсовПриСозданииФормы();
	Документы.ПроведениеОбученияСУО.УстановитьВидСценария(Объект, Отказ);	
	ЗапуститьОбновлениеДанныхУчастниковПриОткрытии = ЕстьДанныеУчастниковДляОбновления(Объект.Ссылка);	
	
	Если Объект.Ссылка.Пустая() Тогда
		
		УстановитьОбязательныеРеквизитыФормы();
		
		Если ЗначениеЗаполнено(Объект.ИдентификаторОбъектаКопирования) Тогда
		
			ДокументКопирования = Документы.ПроведениеОбученияСУО.ПолучитьСсылку(Объект.ИдентификаторОбъектаКопирования);
			
			КомментарийОткрытогоМероприятияДляУчастника = ДокументКопирования.КомментарийОткрытогоМероприятияДляУчастника.Получить();
			КомментарийЗапланированногоМероприятияДляУчастника = ДокументКопирования.КомментарийЗапланированногоМероприятияДляУчастника.Получить();
			КомментарийАктивногоМероприятияДляУчастника = ДокументКопирования.КомментарийАктивногоМероприятияДляУчастника.Получить();
			КомментарийЗавершенногоМероприятияДляУчастника = ДокументКопирования.КомментарийЗавершенногоМероприятияДляУчастника.Получить();
			КомментарийОтмененногоМероприятияДляУчастника = ДокументКопирования.КомментарийОтмененногоМероприятияДляУчастника.Получить();
			
			КомментарийЗапланированногоМероприятияДляПреподавателя = ДокументКопирования.КомментарийЗапланированногоМероприятияДляПреподавателя.Получить();
			КомментарийАктивногоМероприятияДляПреподавателя = ДокументКопирования.КомментарийАктивногоМероприятияДляПреподавателя.Получить();
			КомментарийЗавершенногоМероприятияДляПреподавателя = ДокументКопирования.КомментарийЗавершенногоМероприятияДляПреподавателя.Получить();
			КомментарийОтмененногоМероприятияДляПреподавателя = ДокументКопирования.КомментарийОтмененногоМероприятияДляПреподавателя.Получить();	
			
			КоличествоПреподавателейОбъектаКопирования = Документы.ПроведениеОбученияСУО.Преподаватели(
				ДокументКопирования, Объект.Мероприятие).Количество();
				
			Объект.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Запланировано;
				
		КонецЕсли;		
		
		Если Параметры.Свойство("ЗначенияЗаполнения")
			И Параметры.ЗначенияЗаполнения.Свойство("Мероприятие")
			И ТипЗнч(Параметры.ЗначенияЗаполнения.Мероприятие) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
			
			Объект.НаОсновеЭлектронногоРесурса = Истина;
			Объект.ЭлектронныйРесурс = Параметры.ЗначенияЗаполнения.Мероприятие;			
			
		КонецЕсли;
		
		Объект.ЗапросНаОбучение = Параметры.ЗапросНаОбучение;
		
		Если ЗначениеЗаполнено(Объект.ЗапросНаОбучение) Тогда
			
			ОбъектЗапроса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ЗапросНаОбучение, "ОбъектЗапроса");
			
			Если ТипЗнч(ОбъектЗапроса) = Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда
				Объект.Мероприятие = ОбъектЗапроса;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЭтоПолныйИнтерфейс Тогда
			Объект.НаОсновеЭлектронногоРесурса = Истина;
		КонецЕсли;
				
		Если Объект.НаОсновеЭлектронногоРесурса Тогда
			Объект.ВидОбучения = Справочники.ВидыМероприятийСУО.НаОсновеЭлектронногоРесурса;			
		КонецЕсли;
		
		Если Объект.НаОсновеМероприятия Тогда
			Объект.СкрытьВремяПроведения = ПродолжительностьКратноДню(ПродолжительностьМероприятияВСекундах);
		КонецЕсли;
		
		ДанныеНастроек = ХранилищеСистемныхНастроек.Загрузить(ИмяФормы+"/ТекущиеДанные");
		
		Если ДанныеНастроек <> Неопределено Тогда
			Объект.ЗаголовокБлокаОценкиКачестваОбучения = ДанныеНастроек.Получить("Объект.ЗаголовокБлокаОценкиКачестваОбучения");			
			Объект.ОписаниеБлокаОценкиКачестваОбучения = ДанныеНастроек.Получить("Объект.ОписаниеБлокаОценкиКачестваОбучения");			
		КонецЕсли;		
					
		ЗаполнитьДатыОбученияФормы();
		УстановитьДатыВозможностиУчиться(ЭтотОбъект);
		ЗаполнитьДатуПроведенияФормы(ЭтотОбъект, Объект);
		ЗаполнитьВариантПродолжительностиПоУмолчанию();
		ОбновитьАдресКартинки();
		ОпределитьЗаданыОграниченияНаЗапись(ЭтотОбъект);
		ОпределитьЗаданФильтрПоДатеПриемаСотрудника(ЭтотОбъект);
		ЗаполнитьТабличнуюЧастьЭлектронныеРесурсы();
		
		УстановитьДоступностьЭлементовФормы(Ложь);
		
	КонецЕсли;
		
	// Настраиваем списки
	
	Участники.Параметры.УстановитьЗначениеПараметра("СтатусУдален", НСтр("ru = 'Удален'"));
	Участники.Параметры.УстановитьЗначениеПараметра("СтатусОтменен", НСтр("ru = 'Отменен'"));
	Участники.Параметры.УстановитьЗначениеПараметра("СтатусУдаленИзПрограммы", НСтр("ru = 'Удален из программы'"));
	Участники.Параметры.УстановитьЗначениеПараметра("СтатусНеАктивно", НСтр("ru = 'В ожидании проведения'"));
	Участники.Параметры.УстановитьЗначениеПараметра("ПустаяДата", Дата("00010101"));
	Участники.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	Участники.Параметры.УстановитьЗначениеПараметра("УстановленыДатыДоступаЗаданий", УстановленыДатыДоступаЗаданий(ЭтотОбъект));
	Участники.Параметры.УстановитьЗначениеПараметра("ДатыДоступаЗаданийНеДействуютТекст", НСтр("ru = ', продолжительность заданий не действует'"));
	Участники.Параметры.УстановитьЗначениеПараметра("ТекущаяОценкаПостфикс", НСтр("ru = ' (текущая)'"));
	Участники.Параметры.УстановитьЗначениеПараметра("ПоказыватьТекущуюОценку", Объект.ВидОбучения.ПоказыватьТекущуюОценку);
	Участники.Параметры.УстановитьЗначениеПараметра("БезОценки", НСтр("ru = 'Без оценки'"));
	
	// Блокируем форму
	
	УправлениеОбучениемСУО.ЗаблокироватьДанныеФормы(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.ИдентификаторОбъектаКопирования)
		И КоличествоПреподавателейОбъектаКопирования > 0
		И Объект.Ссылка.Пустая() Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПриОткрытииПродолжениеСКопированием", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Скопировать преподавателей?'"), РежимДиалогаВопрос.ДаНет, 0);		
		
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		Если ЗначениеЗаполнено(Объект.ИдентификаторОбъектаКопирования) Тогда
			ЭтоКопирование = Истина;
		КонецЕсли;
		ЗаполнитьТаблицуЗаданий(ЭтотОбъект, Объект);
		УстановитьВидимостьЭлементовЗакладкиЗаданий(ЭтотОбъект);
	КонецЕсли;
	
	Если ЗапуститьОбновлениеДанныхУчастниковПриОткрытии Тогда
		ЗапуститьОбновлениеДанныхУчастников();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ЗаголовокБлокаОценкиКачестваОбучения) Тогда
		Объект.ЗаголовокБлокаОценкиКачестваОбучения = НСтр("ru = 'Вам понравилось?'");
	КонецЕсли;		
	
	Если НЕ ЗначениеЗаполнено(Объект.ОписаниеБлокаОценкиКачестваОбучения) Тогда
		Объект.ОписаниеБлокаОценкиКачестваОбучения = НСтр("ru = 'Ваше мнение о пройденном обучении действительно поможет нам стать лучше. Как все прошло?'");
	КонецЕсли;	
	
	УстановитьОтборыСпискаУчастников();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	Если ПерепровестиДокументВФонеПриЗакрытии И ЗначениеЗаполнено(Объект.Ссылка) Тогда		
		ПерепровестиДокументВФоне(Объект.Ссылка);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииПродолжениеСКопированием(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		УстановитьДоступностьЭлементовФормы(Истина);
		Возврат;
    КонецЕсли;

	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("НазначитьПреподавателейИзОбъектаКопирования", Истина);	
    Записать(ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)	
	ВыполнитьПроверкуПередЗаписью(Отказ, ПараметрыЗаписи, Ложь);	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	ВыполняетсяЗапись = Ложь;
	ВыполняетсяЗакрытие = Ложь;	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ВыполняетсяЗапись = Ложь;
	ВыполняетсяЗакрытие = Ложь;
	
	// Делаем проверки
	
	Если Объект.НаОсновеЭлектронногоРесурса И НЕ ЗначениеЗаполнено(ТекущийОбъект.Электронныйресурс) Тогда
		Текст = НСтр("ru = 'Укажите электронный курс или тест'");
		Поле = "ЭлектронныйРесурс";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ТекущийОбъект, Поле,, Отказ);			
	КонецЕсли;
	
	Если ТекущийОбъект.НаОсновеМероприятия И НЕ ЗначениеЗаполнено(ТекущийОбъект.Мероприятие) Тогда
		
		Текст = НСтр("ru = 'Укажите обучение'");
		Поле = "Мероприятие";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ТекущийОбъект, Поле,, Отказ);			
		
	КонецЕсли;	
		
	// Устанавливаем данные
	
	УстановитьДатуИзмененияРесурсовПередЗаписью(ТекущийОбъект);
	
	ТекущийОбъект.КомментарийОткрытогоМероприятияДляУчастника = Новый ХранилищеЗначения(КомментарийОткрытогоМероприятияДляУчастника, Новый СжатиеДанных(9));
	ТекущийОбъект.КомментарийЗапланированногоМероприятияДляУчастника = Новый ХранилищеЗначения(КомментарийЗапланированногоМероприятияДляУчастника, Новый СжатиеДанных(9));
	ТекущийОбъект.КомментарийАктивногоМероприятияДляУчастника = Новый ХранилищеЗначения(КомментарийАктивногоМероприятияДляУчастника, Новый СжатиеДанных(9));
	ТекущийОбъект.КомментарийЗавершенногоМероприятияДляУчастника = Новый ХранилищеЗначения(КомментарийЗавершенногоМероприятияДляУчастника, Новый СжатиеДанных(9));	
	ТекущийОбъект.КомментарийОтмененногоМероприятияДляУчастника = Новый ХранилищеЗначения(КомментарийОтмененногоМероприятияДляУчастника, Новый СжатиеДанных(9));
	
	ТекущийОбъект.КомментарийЗапланированногоМероприятияДляПреподавателя = Новый ХранилищеЗначения(КомментарийЗапланированногоМероприятияДляПреподавателя, Новый СжатиеДанных(9));
	ТекущийОбъект.КомментарийАктивногоМероприятияДляПреподавателя = Новый ХранилищеЗначения(КомментарийАктивногоМероприятияДляПреподавателя, Новый СжатиеДанных(9));
	ТекущийОбъект.КомментарийЗавершенногоМероприятияДляПреподавателя = Новый ХранилищеЗначения(КомментарийЗавершенногоМероприятияДляПреподавателя, Новый СжатиеДанных(9));	
	ТекущийОбъект.КомментарийОтмененногоМероприятияДляПреподавателя = Новый ХранилищеЗначения(КомментарийОтмененногоМероприятияДляПреподавателя, Новый СжатиеДанных(9));	
	
	// Определяем надо ли обновлять подчиненные документы
	
	НеОбновлятьПодчиненныеДокументы = Ложь;
	
	Если НЕ Объект.Проведен 
		И (ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись
		ИЛИ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) Тогда
		
		// Если выполняется любая запись непроведенного документа,
		// то подчиненные документы не обновляем.
		НеОбновлятьПодчиненныеДокументы = Истина;
		
	КонецЕсли;
	
	Если Объект.Проведен 
		И (ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись
		ИЛИ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение)
		И НЕ Модифицированность Тогда
		
		// Если выполняется запись или проведение проведенного документа,
		// но его не изменяли, то подчиненные документы не обновляем.
		НеОбновлятьПодчиненныеДокументы = Истина;
		
	КонецЕсли;
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ОбновлятьПодчиненныеДокументы", НЕ НеОбновлятьПодчиненныеДокументы);
		
	// Электронные задания
	
	ЗаписатьТаблицуЗаданий(ТекущийОбъект, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.ИдентификаторОбъектаКопирования) И ПараметрыЗаписи <> Неопределено Тогда
		
		ДокументКопирования = Документы.ПроведениеОбученияСУО.ПолучитьСсылку(Объект.ИдентификаторОбъектаКопирования);
		
		Если ПараметрыЗаписи.Свойство("НазначитьУчастниковИзОбъектаКопирования")
			И ПараметрыЗаписи.НазначитьУчастниковИзОбъектаКопирования Тогда
			
			УчастникиМероприятияКопирования = Документы.ПроведениеОбученияСУО.ПрохожденияОбучения(ДокументКопирования).ВыгрузитьКолонку("Пользователь");
			
			ЗачислитьУчастников(Объект.Ссылка, УчастникиМероприятияКопирования);
			
		КонецЕсли;
		
		Если ПараметрыЗаписи.Свойство("НазначитьПреподавателейИзОбъектаКопирования")
			И ПараметрыЗаписи.НазначитьПреподавателейИзОбъектаКопирования Тогда
			
			ПреподавателиМероприятияКопирования = Документы.ПроведениеОбученияСУО.Преподаватели(ДокументКопирования);
			СценарийЭтогоДокумента = Документы.ПроведениеОбученияСУО.СценарийОбучения(Объект.Ссылка);
			
			Для каждого Строка Из ПреподавателиМероприятияКопирования Цикл				
				УправлениеОбучениемСУО.НазначитьПреподавателяНаОбучение(Объект.Ссылка, СценарийЭтогоДокумента, Строка.Преподаватель, Строка.Роль,,,Истина);
			КонецЦикла;
			
		КонецЕсли;
		
		ЗаполнитьТабличнуюЧастьЭлектронныеРесурсы();
		
	КонецЕсли;
	
	ЗаполнитьВариантПродолжительностиПоУмолчанию();		
	УстановитьДоступностьЭлементовФормы(Истина);
	
	УправлениеОбучениемСУО.ЗаблокироватьДанныеФормы(ЭтотОбъект);
	
	ПерепровестиДокументВФонеПриЗакрытии = Ложь;
	
	// Запускаем регламентные задания вручную, не дожидаясь срабатывания расписания
	
	Если Объект.АвтозачислениеНаОбучение Тогда
		ОбщегоНазначенияСУ.ВыполнитьРегламентноеЗаданиеВручную("ЗачислениеПользователейНаОбучениеСУО");
	КонецЕсли;
	
	ОбщегоНазначенияСУ.ВыполнитьРегламентноеЗаданиеВручную("ПерепроведениеДокументовСУО");
	
	Если ВебКабинетСУ.Используется() Тогда
		ОбщегоНазначенияСУ.ВыполнитьРегламентноеЗаданиеВручную("ОбновлениеДанныхВебКабинетаСУ");
	КонецЕсли;
	
	Участники.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЗапуститьОбновлениеДанныхУчастников();
	Оповестить("ОбновитьСписокМероприятий",,ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УстановитьОбязательныеРеквизитыФормы();
	
	ОпределитьЗаданыОграниченияНаЗапись(ЭтотОбъект);
	ОпределитьЗаданФильтрПоДатеПриемаСотрудника(ЭтотОбъект);
	
	КомментарийОткрытогоМероприятияДляУчастника = ТекущийОбъект.КомментарийОткрытогоМероприятияДляУчастника.Получить();
	КомментарийЗапланированногоМероприятияДляУчастника = ТекущийОбъект.КомментарийЗапланированногоМероприятияДляУчастника.Получить();
	КомментарийАктивногоМероприятияДляУчастника = ТекущийОбъект.КомментарийАктивногоМероприятияДляУчастника.Получить();
	КомментарийЗавершенногоМероприятияДляУчастника = ТекущийОбъект.КомментарийЗавершенногоМероприятияДляУчастника.Получить();
	КомментарийОтмененногоМероприятияДляУчастника = ТекущийОбъект.КомментарийОтмененногоМероприятияДляУчастника.Получить();
	
	КомментарийЗапланированногоМероприятияДляПреподавателя = ТекущийОбъект.КомментарийЗапланированногоМероприятияДляПреподавателя.Получить();
	КомментарийАктивногоМероприятияДляПреподавателя = ТекущийОбъект.КомментарийАктивногоМероприятияДляПреподавателя.Получить();
	КомментарийЗавершенногоМероприятияДляПреподавателя = ТекущийОбъект.КомментарийЗавершенногоМероприятияДляПреподавателя.Получить();
	КомментарийОтмененногоМероприятияДляПреподавателя = ТекущийОбъект.КомментарийОтмененногоМероприятияДляПреподавателя.Получить();	
	
	ЗаполнитьДатыОбученияФормы();
	ЗаполнитьТаблицуЗаданий(ЭтотОбъект, ТекущийОбъект);
	ЗаполнитьТабличнуюЧастьЭлектронныеРесурсы();
	ЗаполнитьДатуПроведенияФормы(ЭтотОбъект, Объект);
	УстановитьДатыВозможностиУчиться(ЭтотОбъект);
	ЗаполнитьВариантПродолжительностиПоУмолчанию();
	ОбновитьАдресКартинки();

	// ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);

	УстановитьДоступностьЭлементовФормы(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьПрохождениеОбучения"
		И Источник <> ЭтотОбъект Тогда		
		Элементы.Участники.Обновить();		
	КонецЕсли;

	Если ИмяСобытия = "ЗачисленПреподаватель" Тогда		
		ОбновитьСписокПреподавателей();		
	КонецЕсли;
	
	Если ИмяСобытия = "ЗаписьМероприятия" И Параметр = Объект.Мероприятие Тогда		
		УстановитьДоступностьЭлементовФормы(Истина);
	КонецЕсли;
	
	Если ИмяСобытия = "ОбновленыВидыОбучения" Тогда		
		УстановитьДоступностьЭлементовФормы(Истина);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура МероприятиеПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СхемаПроведенияПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытоеМероприятиеПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементовФормы(Истина);
	
	Если Объект.ОткрытоеМероприятие Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаДоступКОбучению;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаИлиВремяПроведенияПриИзменении(Элемент)
	
	Модифицированность = Истина;	
	ПривестиДатуПроведения();
	УстановитьДатыВозможностиУчиться(ЭтотОбъект);
	ОпределитьЗаданыОграниченияНаЗапись(ЭтотОбъект);
	УстановитьДоступностьЭлементовФормы(Ложь);

	Если Элемент = Элементы.ДатаНачалаДоступа
		И ЗначениеЗаполнено(Объект.ДатаНачалаДоступа)
		И НЕ ЗначениеЗаполнено(Объект.ДатаКонтроля) Тогда
		
		 УстановитьРекомендованноеРасписание();
		
	КонецЕсли;
	
	Если Элемент = Элементы.ДатаНачалаПроведения
		И ЗначениеЗаполнено(Объект.ДатаНачалаПроведения)
		И НЕ ЗначениеЗаполнено(Объект.ДатаОкончанияПроведения) Тогда
		
		 УстановитьРекомендованноеРасписание();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АудиторияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	НовыйМассив = Новый Массив();

	НовыйМассив.Добавить(Новый ПараметрВыбора("ДокументСобытия", Объект.Ссылка));
	НовыйМассив.Добавить(Новый ПараметрВыбора("ДатаНачалаИспользования", Объект.ДатаНачалаПроведения));
	НовыйМассив.Добавить(Новый ПараметрВыбора("ДатаОкончанияИспользования", Объект.ДатаОкончанияПроведения));
	НовыйМассив.Добавить(Новый ПараметрВыбора("ТипАудитории", ТребуемыйТипАудитории));
	НовыйМассив.Добавить(Новый ПараметрВыбора("МаксимальноеКоличествоЧеловек", Объект.МаксимальноеКоличествоУчастников));

	Элементы.Аудитория.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытоДляРуководителейПриИзменении(Элемент)
	УстановитьЗаголовки();
КонецПроцедуры

&НаКлиенте
Процедура ОсновнойПреподавательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьПредупреждение(,Нстр("ru = 'Запишите документ'"));
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОсновнойПреподавательОбработкаВыбораИзСписка", ЭтотОбъект);		
	
	СписокПреподавателей.ПоказатьВыборЭлемента(ОписаниеОповещения, НСтр("ru = 'Выберите преподавателя'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнойПреподавательОбработкаВыбораИзСписка(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ОсновнойПреподаватель = ВыбранноеЗначение.Значение;	
	
КонецПроцедуры	

&НаКлиенте
Процедура АвтозачислениеНаОбучениеПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементовФормы(Истина);
	
	Если Объект.АвтозачислениеНаОбучение Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаДоступКОбучению;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытоДляВсехПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЭлектронныйРесурсОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбъектыСУЗКлиент.РедактироватьЭлектронныйРесурс(Объект.ЭлектронныйРесурс);

КонецПроцедуры

&НаКлиенте
Процедура ЭлектронныйРесурсПриИзменении(Элемент)
	Если ИспользоватьВстроенныйПлеерКурсовВебКабинета Тогда
		ТекущиеДанныеПлеера = ДанныеПлеераЕдинственногоЭлектронногоРесурса(Объект.ЭлектронныйРесурс, Объект.Ссылка);
		Объект.ПлеерВебКабинета = ТекущиеДанныеПлеера.ПлеерВебКабинета;
		УстановитьДоступностьЭлементовФормы(Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДоступноВнешнимПользователямПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВидОбученияПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы(Истина);
КонецПроцедуры

&НаКлиенте
Процедура МестоПроведенияПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СкрытьВремяПроведенияПриИзменении(Элемент)
	ПривестиДатуПроведения();
	УстановитьДоступностьЭлементовФормы(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПоследовательноеПрохождениеЗаданийПриИзменении(Элемент)
	УстановитьВидимостьЭлементовЗакладкиЗаданий(ЭтотОбъект);
	УстановитьРеквизитыПоУмолчаниюТаблицыЭлектронныеЗадания();
КонецПроцедуры

&НаКлиенте
Процедура ПроведениеПрограммыОбученияПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы(Истина);
КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьВозможностьУчитьсяПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура МаксимальноеКоличествоУчастниковПриИзменении(Элемент)
	ОпределитьЗаданыОграниченияНаЗапись(ЭтотОбъект);
	УстановитьДоступностьЭлементовФормы(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоДатеПриемаНаРаботуПриИзменении(Элемент)
	ОпределитьЗаданФильтрПоДатеПриемаСотрудника(ЭтотОбъект);
	УстановитьДоступностьЭлементовФормы(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НачатьДобавлениеКартинки();
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВариантПродолжительностиПриИзменении(Элемент)
	
	ПривестиДатуПроведения();
	
	Если (Объект.ВариантПродолжительности = ПредопределенноеЗначение("Перечисление.ПродолжительностьОбученияСУО.СЗачисления")
		ИЛИ Объект.ВариантПродолжительности = ПредопределенноеЗначение("Перечисление.ПродолжительностьОбученияСУО.СНачалаОбучения"))
		И НЕ ЗначениеЗаполнено(Объект.ПродолжительностьВСекундах) Тогда
		
		Если ПродолжительностьМероприятияВСекундах > 0 Тогда
			УстановитьРекомендованноеРасписание();
		Иначе			
			ЗадатьПродолжительность();
		КонецЕсли;
				
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормы(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОтличаетсяОтРекомендованногоНажатие(Элемент)
	УстановитьРекомендованноеРасписание();
КонецПроцедуры

&НаКлиенте
Процедура ДоступОтличаетсяОтРекомендованногоНажатие(Элемент)
	УстановитьРекомендованноеРасписание();
КонецПроцедуры

&НаКлиенте
Процедура ТолькоАктуальныеУчастникиПриИзменении(Элемент)
	УстановитьОтборыСпискаУчастников();
КонецПроцедуры

&НаКлиенте
Процедура СкрытьОтмененныхУчастниковПриИзменении(Элемент)
	УстановитьОтборыСпискаУчастников();
КонецПроцедуры

&НаКлиенте
Процедура КачествоОбученияОцениваетсяУчастникамиПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы(Ложь);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЭлектронныеРесурсы

&НаКлиенте
Процедура ЭлектронныеРесурсыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ПриНачалеРедактированияТаблицДопМатериалов(Элемент, НоваяСтрока, Копирование);
КонецПроцедуры

&НаКлиенте
Процедура ЭлектронныеРесурсыЭлектронныйРесурсПриИзменении(Элемент)
	Если НЕ ИспользоватьВстроенныйПлеерКурсовВебКабинета Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = Элементы.ЭлектронныеРесурсы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДанныеСтрокиПоУмолчанию = ДанныеСтрокиТаблицыЭлектронныхРесурсов(ТекущиеДанные.ЭлектронныйРесурс, ТекущиеДанные.ПлеерВебКабинета);
	ТекущиеДанные.ПлеерВебКабинета = ДанныеСтрокиПоУмолчанию.ПлеерВебКабинета;
	ТекущиеДанные.ДоступенВыборПлеераВебКабинета = ДанныеСтрокиПоУмолчанию.ДоступенВыборПлеераВебКабинета;
КонецПроцедуры

&НаКлиенте
Процедура ЭлектронныеРесурсыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	РесурсыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФайлы


&НаКлиенте
Процедура ФайлыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ПриНачалеРедактированияТаблицДопМатериалов(Элемент, НоваяСтрока, Копирование);
КонецПроцедуры

&НаКлиенте
Процедура ФайлыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	РесурсыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКниги

&НаКлиенте
Процедура КнигиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ПриНачалеРедактированияТаблицДопМатериалов(Элемент, НоваяСтрока, Копирование);
КонецПроцедуры

&НаКлиенте
Процедура КнигиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	РесурсыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОпросы

&НаКлиенте
Процедура ОпросыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУчастники

&НаКлиенте
Процедура УчастникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;		
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		Если Поле <> неопределено И (Поле.Имя = "УчастникиЗавершеноВПроцентах" ИЛИ Поле.Имя = "УчастникиОценка") Тогда
			
			УправлениеОбучениемСУОКлиент.РезультатыЗаданийУчастника(Элемент.ТекущиеДанные.Ссылка);
			
		ИначеЕсли Поле <> неопределено И Поле.Имя = "УчастникиМожетУчиться" Тогда
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ВозможностиУчитьсяПослеЗакрытия", ЭтотОбъект);
			ПараметрыФормыВУ = Новый Структура();
			ПараметрыФормыВУ.Вставить("Пользователь", Элемент.ТекущиеДанные.Пользователь);
			
			Если ЭлектронноДистанционное
				И ЗначениеЗаполнено(Объект.ДатаНачалаДоступа) Тогда
				ПараметрыФормыВУ.Вставить("НачалоПериода", Объект.ДатаНачалаДоступа);
			КонецЕсли;				
			
			Если ЭлектронноДистанционное
				И ЗначениеЗаполнено(Объект.ДатаКонтроля) Тогда
				ПараметрыФормыВУ.Вставить("КонецПериода", Объект.ДатаКонтроля);
			КонецЕсли;
			
			Если НЕ ЭлектронноДистанционное
				И ЗначениеЗаполнено(Объект.ДатаНачалаПроведения) Тогда
				ПараметрыФормыВУ.Вставить("НачалоПериода", Объект.ДатаНачалаПроведения);
			КонецЕсли;

			Если НЕ ЭлектронноДистанционное
				И ЗначениеЗаполнено(Объект.ДатаОкончанияПроведения) Тогда
				ПараметрыФормыВУ.Вставить("КонецПериода", Объект.ДатаОкончанияПроведения);
			КонецЕсли;
			
			ОткрытьФорму("РегистрСведений.ВозможностиУчитьсяСУО.Форма.НастройкаВозможностиУчиться",
				ПараметрыФормыВУ,,,,,ОписаниеОповещения);
				
								
		ИначеЕсли Поле <> неопределено И Поле.Имя = "УчастникиДобавленоВремениСтрока" Тогда
			
			НачатьДобавлениеВремениУчастнику();
			
		Иначе
			
			ПоказатьЗначение(,Элемент.ТекущиеДанные.Пользователь);			
			
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВозможностиУчитьсяПослеЗакрытия(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	УстановитьДатыВозможностиУчиться(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура УчастникиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	ЗачислитьУчастникаКоманда(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура УчастникиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда		
		Возврат;		
	КонецЕсли;
	
	УдаленныеПрохождения = УдаленныеПрохождения(Объект.Ссылка, ВыбранноеЗначение);
	
	Если УдаленныеПрохождения.Количество() = 0 Тогда
		ЗачислитьУчастников(Объект.Ссылка, ВыбранноеЗначение);	
	Иначе
		ТекстВопроса = НСтр("ru = 'Среди зачисляемых участников есть ранее удаленные. Выберите действие для них:'");
		ДополнительныеПараметры = Новый Структура("ВыбранныеУчастники, УдаленныеПрохождения", ВыбранноеЗначение, УдаленныеПрохождения);
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗачислитьУчастниковПослеВыбораДействияНадУдаленными", ЭтотОбъект, ДополнительныеПараметры);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Восстановить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Отменить и зачислить заново'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Оставить удаленными'"));
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , КодВозвратаДиалога.Да, НСтр("ru = 'Выбор действия для удаленных участников'"));		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗачислитьУчастниковПослеВыбораДействияНадУдаленными(РезультатОтвета, ДополнительныеПараметры) Экспорт
	
	Если РезультатОтвета = КодВозвратаДиалога.Да Тогда
		ЗачислитьУчастников(Объект.Ссылка, ДополнительныеПараметры.ВыбранныеУчастники, ДополнительныеПараметры.УдаленныеПрохождения, Ложь); 
		Возврат;
	КонецЕсли;
	
	Если РезультатОтвета = КодВозвратаДиалога.Нет Тогда
		ЗачислитьУчастников(Объект.Ссылка, ДополнительныеПараметры.ВыбранныеУчастники, ДополнительныеПараметры.УдаленныеПрохождения, Истина); 
		Возврат;
	КонецЕсли;
	
	ЗачислитьУчастников(Объект.Ссылка, ДополнительныеПараметры.ВыбранныеУчастники);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПреподаватели

&НаКлиенте
Процедура ПреподавателиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если НЕ РасширеннаяФункциональность Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПреподавателиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ=Истина;
	НазначитьПреподавателяКоманда(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПреподавателиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда		
		Возврат;		
	КонецЕсли;
		
	ЗачислитьПреподавателей(Объект.Ссылка, ВыбранноеЗначение);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЭлектронныеЗадания

&НаКлиенте
Процедура ЭлектронныеЗаданияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УстановитьРеквизитыПоУмолчаниюТаблицыЭлектронныеЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлектронныеЗаданияПриИзменении(Элемент)
	УстановитьВидимостьЭлементовЗакладкиЗаданий(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ЭлектронныеЗаданияПередУдалением(Элемент, Отказ)
		
	ВыделенныеСтроки = Элементы.ЭлектронныеЗадания.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалениеЗаданияПродолжение", ЭтотОбъект, ВыделенныеСтроки);
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Удалить выделенные задания?'"), РежимДиалогаВопрос.ДаНет, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалениеЗаданияПродолжение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да
		И ТипЗнч(Параметры) = Тип("Массив") Тогда
		
		МассивСтрок = Новый Массив;
		Для каждого ИндексСтроки Из Параметры Цикл
			МассивСтрок.Добавить(ЭлектронныеЗадания.НайтиПоИдентификатору(ИндексСтроки));
		КонецЦикла;
		
		Для каждого Строка Из МассивСтрок Цикл
			ЭлектронныеЗадания.Удалить(Строка);
		КонецЦикла;
		
		Модифицированность = Истина;
		
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлектронныеЗаданияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	НачатьВыборПродолжительностиЗадания(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыборПродолжительностиЗадания(Элемент)
	
	Если Элемент.ТекущийЭлемент = Неопределено ИЛИ Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент.Имя <> "ЭлектронныеЗаданияПродолжительностьСтрока" Тогда
		Возврат;
	КонецЕсли;
	
	ПродолжительностьСтруктура = Новый Структура;
	ПродолжительностьСтруктура.Вставить("ДатаНачала", Элемент.ТекущиеДанные.ДатаНачалаДоступаКЗаданию); 
	ПродолжительностьСтруктура.Вставить("ДатаОкончания", Элемент.ТекущиеДанные.ДатаОкончанияДоступаКЗаданию);
	ПродолжительностьСтруктура.Вставить("СкрытьВремя", Элемент.ТекущиеДанные.СкрытьВремяДоступаКЗаданию);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("НачальноеЗначение", ПродолжительностьСтруктура);
	ПараметрыФормы.Вставить("ФиксированныеДаты", Истина);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьПродолжительностьЗаданиеПродолжение", ЭтотОбъект, Элемент.ТекущиеДанные);			
	ОткрытьФорму("ОбщаяФорма.ВводПериодаСУ", ПараметрыФормы,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПродолжительностьЗаданиеПродолжение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ТекущиеДанные = ДополнительныеПараметры;
	ТекущиеДанные.ДатаНачалаДоступаКЗаданию = Период.ДатаНачала;
	ТекущиеДанные.ДатаОкончанияДоступаКЗаданию = Период.ДатаОкончания;
	ТекущиеДанные.СкрытьВремяДоступаКЗаданию = Период.СкрытьВремя;		
	ТекущиеДанные.ПродолжительностьСтрока = ОбщегоНазначенияСУКлиентСервер.ПериодВСтроку(
		Период.ДатаНачала, Период.ДатаОкончания, Период.СкрытьВремя);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПровестиИЗакрытьДокумент(Команда)
	Отказ = Ложь;
	ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	ВыполнитьПроверкуПередЗаписью(Отказ, ПараметрыЗаписи, Истина);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	Если Записать(ПараметрыЗаписи) Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервалЗаписиНаМероприятие(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период.ДатаНачала    = Объект.ДатаОткрытияЗаписи;
	Диалог.Период.ДатаОкончания = Объект.ДатаЗакрытияЗаписи;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьИнтервалЗаписиНаМероприятиеПродолжение", ЭтотОбъект);
	
	Диалог.Показать(ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервалЗаписиНаМероприятиеПродолжение(Период, ДополнительныеПараметры) Экспорт
			
	Если Период = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ДатаОткрытияЗаписи = Период.ДатаНачала;	
	ДатаНачалаЗаписи = Объект.ДатаОткрытияЗаписи;
	ВремяНачалаЗаписи = Объект.ДатаОткрытияЗаписи;
	
	Объект.ДатаЗакрытияЗаписи = Период.ДатаОкончания;
	ДатаОкончанияЗаписи	= Объект.ДатаЗакрытияЗаписи;
	ВремяОкончанияЗаписи = Объект.ДатаЗакрытияЗаписи;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервалПроведенияОбучения(Команда)
		
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Если ЭлектронноДистанционное Тогда
		Диалог.Период.ДатаНачала    = Объект.ДатаНачалаДоступа;
		Диалог.Период.ДатаОкончания = Объект.ДатаКонтроля;
	Иначе
		Диалог.Период.ДатаНачала    = Объект.ДатаНачалаПроведения;
		Диалог.Период.ДатаОкончания = Объект.ДатаОкончанияПроведения;		
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьИнтервалПроведенияОбученияПродолжение", ЭтотОбъект);
	
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервалПроведенияОбученияПродолжение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭлектронноДистанционное Тогда
		
		Объект.ДатаНачалаДоступа    = Период.ДатаНачала;
		Объект.ДатаКонтроля = Период.ДатаОкончания;

		ДатаНачалаДоступа = Объект.ДатаНачалаДоступа;
		ВремяНачалаДоступа = Объект.ДатаНачалаДоступа;
		
		ДатаКонтроля = Объект.ДатаКонтроля;
		ВремяКонтроля = Объект.ДатаКонтроля;		
		
	Иначе
		
		Объект.ДатаНачалаПроведения    = Период.ДатаНачала;
		Объект.ДатаОкончанияПроведения = Период.ДатаОкончания;

		ДатаНачалаПроведения = Объект.ДатаНачалаПроведения;
		ВремяНачалаПроведения = Объект.ДатаНачалаПроведения;
		
		ДатаОкончанияПроведения = Объект.ДатаОкончанияПроведения;
		ВремяОкончанияПроведения = Объект.ДатаОкончанияПроведения;		
		
	КонецЕсли;
		
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодчиненныеМероприятие(Команда)
	
	Отказ = Ложь;
	
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
	
	Если НЕ ЗначениеЗаполнено(Объект.Мероприятие) Тогда
		Текст = НСтр("ru = 'Укажите мероприятие'");
		Поле = "Мероприятие";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,Поле,"Объект",Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.СхемаПроведения) Тогда
		Текст = НСтр("ru = 'Укажите схему проведения'");
		Поле = "СхемаПроведения";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,Поле,"Объект",Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПодчиненныеМероприятиеПродолжение", ЭтотОбъект);		
		
	ПоказатьВопрос(ОписаниеОповещения, Нстр("ru = 'Список подчиненных мероприятий будет заменен. Продолжить?'"), РежимДиалогаВопрос.ДаНет, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодчиненныеМероприятиеПродолжение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
	    Возврат;
	КонецЕсли;
	
	ЗаполнитьПодчиненныеМероприятия(Объект.Ссылка, Объект.Мероприятие, Объект.СхемаПроведения);
	
	Элементы.ПроведениеПодчиненныхМероприятий.Обновить();	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПерейтиКИнтернетРесурсу(Команда)
	
	Если ЗначениеЗаполнено(Объект.АдресВИнтернете) Тогда
		ПерейтиПоНавигационнойСсылке(Объект.АдресВИнтернете);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодобратьУчастников(Команда)
	
	СпроситьПередЗачислениемУчастников("ПодобратьУчастниковПродолжение");
		
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьУчастниковПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Отказ = Ложь;
	
	ПередЗачислениемУчастников(Отказ);
	
	Если НЕ Отказ Тогда
		
		АдресСпискаВХранилище = ПоместитьСписокУчастниковВХранилище();
		
		ПараметрыФормы = Новый Структура("ПараметрыРасширеннойФормыПодбора, РасширенныйПодбор", АдресСпискаВХранилище, Истина);
		ОткрытьФорму("ОбщаяФорма.ПодборПользователейСУО", ПараметрыФормы, Элементы.Участники);

	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗачислитьУчастникаКоманда(Команда)
	
	СпроситьПередЗачислениемУчастников("ЗачислитьУчастникаКомандаПродолжение");

КонецПроцедуры

&НаКлиенте
Процедура ЗачислитьУчастникаКомандаПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Отказ = Ложь;
	
	ПередЗачислениемУчастников(Отказ);
	
	Если НЕ Отказ Тогда
		
		Отказ = Истина;
		
		ПараметрыФормы = Новый Структура("РежимВыбора", Истина);
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗачислитьУчастникаПродолжение", ЭтотОбъект);		
			
		ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыФормы,,,,,ОписаниеОповещения);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗачислитьУчастникаПродолжение(ВыбранныйПользователь, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ВыбранныйПользователь) = Тип("СправочникСсылка.Пользователи")
		И ЗначениеЗаполнено(ВыбранныйПользователь) Тогда 
		ЗачислитьУчастников(Объект.Ссылка, ВыбранныйПользователь);
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПодобратьПреподавателей(Команда)

	Отказ = Ложь;
	
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
	
	Если НЕ Отказ Тогда
		
		АдресСпискаВХранилище = ПоместитьСписокПреподавателейВХранилище();
		
		ПараметрыФормы = Новый Структура("ПараметрыРасширеннойФормыПодбора, РасширенныйПодбор", АдресСпискаВХранилище, Истина);
		ОткрытьФорму("ОбщаяФорма.ПодборПользователейСУО", ПараметрыФормы, Элементы.Преподаватели);

	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьПреподавателяКоманда(Команда)
	
	Отказ = Ложь;
	
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
	
	Если НЕ Отказ Тогда
		
		Отказ = Истина;
		
		УправлениеОбучениемСУОКлиент.ВыбратьРольПреподавателя(РолиПреподавателей, ЭтотОбъект, "ВыбратьПреподавателя");
				
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРольПреподавателяКоманда(Команда)
	
	ТекущиеДанные = Элементы.Преподаватели.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УправлениеОбучениемСУОКлиент.ВыбратьРольПреподавателя(РолиПреподавателей, ЭтотОбъект, "ИзменитьРоль");
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПреподавателяОтУченика(Команда)
	
	Если Элементы.Преподаватели.ВыделенныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ВыделеннаяСтрока Из Элементы.Преподаватели.ВыделенныеСтроки Цикл
	
		Если ТипЗнч(ВыделеннаяСтрока) = Тип("ДокументСсылка.ПроведениеПреподавателемОбученияСУО") Тогда
			СкрытьПреподавателяНаСервере(ВыделеннаяСтрока);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоПросмотрВедомостиПреподавателя(Команда)
	
	Если Элементы.Преподаватели.ВыделенныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ВыделеннаяСтрока Из Элементы.Преподаватели.ВыделенныеСтроки Цикл
	
		Если ТипЗнч(ВыделеннаяСтрока) = Тип("ДокументСсылка.ПроведениеПреподавателемОбученияСУО") Тогда
			УстановитьТолькоПросмотрВедомостиПреподавателяНаСервере(ВыделеннаяСтрока);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусУчастникаЗавершил(Команда)
	УстановитьСтатусПрохождения("Завершил");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусУчастникаНеЗавершил(Команда)
	УстановитьСтатусПрохождения("НеЗавершил");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусУчастникаПроходит(Команда)
	УстановитьСтатусПрохождения("Проходит");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусУчастникаНеДопущен(Команда)
	УстановитьСтатусПрохождения("НеДопущен");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусУчастникаАвтомат(Команда)
	УстановитьСтатусПрохождения("Автомат");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйФайл(Команда)
	
	Отказ = Ложь;
	
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьНовыйФайлПродолжение", ЭтотОбъект);		
	РаботаСФайламиКлиент.ДобавитьФайл(ОписаниеОповещения, ПредопределенноеЗначение("Справочник.ПапкиФайлов.ПроведенияМероприятий"), ЭтотОбъект, 2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйФайлПродолжение(Результат, Дополнительно) Экспорт
	
	НовыйФайлСсылка = Неопределено;
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("ФайлСсылка") И ЗначениеЗаполнено(Результат.ФайлСсылка) Тогда
		НовыйФайлСсылка = Результат.ФайлСсылка;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("СправочникСсылка.Файлы") И ЗначениеЗаполнено(Результат) Тогда
		НовыйФайлСсылка = Результат;
	КонецЕсли;
	
	Если НовыйФайлСсылка <> Неопределено Тогда
		НоваяСтрока = Объект.Файлы.Добавить();
		НоваяСтрока.Файл = НовыйФайлСсылка;
		НоваяСтрока.ПоказатьПриСтатусеЗапланировано = Ложь;
		НоваяСтрока.ПоказатьПриСтатусеАктивно = Истина;
		НоваяСтрока.ПоказатьПриСтатусеЗавершено = Истина;
		Модифицированность = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПрохождение(Команда)
	ОбновитьПрохождениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗаданиеНаПроверку(Команда)	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьНовоеЭлектронноеЗаданиеПродолжение", ЭтотОбъект);
	ЗначениеОтбора = Новый Структура("Владелец", ПредопределенноеЗначение("Справочник.СхемыМероприятийСУО.Общая"));
	ПараметрыОткрытияФормы = Новый Структура("Отбор, МножественныйВыбор", ЗначениеОтбора, Истина);
	
	ОткрытьФорму("Справочник.ЗаданияСУО.ФормаВыбора",ПараметрыОткрытияФормы,,,,,ОписаниеОповещения);	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭлектронныйКурсИлиТестКакЗадание(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьНовоеЭлектронноеЗаданиеПродолжение", ЭтотОбъект);
	ПараметрыОткрытияФормы = Новый Структура("МножественныйВыбор", Истина);
	ОткрытьФорму("Справочник.СводыЗнанийСУЗ.ФормаВыбора", ПараметрыОткрытияФормы,,,,,ОписаниеОповещения);	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьУчебныйМатериал(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьНовоеЭлектронноеЗаданиеПродолжение", ЭтотОбъект);
	ПараметрыОткрытияФормы = Новый Структура("МножественныйВыбор", Истина);
	ОткрытьФорму("Справочник.УчебныеМатериалыСУО.ФормаВыбора", ПараметрыОткрытияФормы,,,,,ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Функция ВыбранныеПрохожденияОбучения()
	
	ПрохожденияДляОтмены = Новый Массив;
	
	Если Элементы.Участники.ВыделенныеСтроки = Неопределено Тогда
		Возврат ПрохожденияДляОтмены;
	КонецЕсли;
		
	Для каждого ВыделеннаяСтрока Из Элементы.Участники.ВыделенныеСтроки Цикл	
		Если ТипЗнч(ВыделеннаяСтрока) = Тип("ДокументСсылка.ПрохождениеОбученияСУО") Тогда
			ПрохожденияДляОтмены.Добавить(ВыделеннаяСтрока);
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат ПрохожденияДляОтмены;
	
КонецФункции

&НаКлиенте
Процедура ОтменитьОбучениеУчастника(Команда)
	
	ПрохожденияДляОтмены = ВыбранныеПрохожденияОбучения();
	ПрохожденияДляОтмены = Новый ФиксированныйМассив(ПрохожденияДляОтмены);	
	УстановитьСнятьОтменуПрохожденияНаСервере(ПрохожденияДляОтмены);
				
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗаданияУчастника(Команда)
	
	ВыбранныеПрохождения = ВыбранныеПрохожденияОбучения();
	
	Если ВыбранныеПрохождения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВопросаПродолжение = Новый Структура();
	ПараметрыВопросаПродолжение.Вставить("ПрохожденияДляОтмены", Новый ФиксированныйМассив(ВыбранныеПрохождения));
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтменитьЗаданияУчастников", ЭтотОбъект, ПараметрыВопросаПродолжение);
	ПараметрыФормы = Новый Структура("ПроведениеОбучения", Объект.Ссылка);
	ОткрытьФорму("Документ.ПроведениеОбученияСУО.Форма.ФормаВыбораЗаданияНаПроверку", ПараметрыФормы,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗаданияУчастников(ВыбранныеЗадания, ДополнительныеПараметры) Экспорт
	Если ВыбранныеЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОтменитьПрохождениеЗаданийНаСервере(ВыбранныеЗадания, ДополнительныеПараметры.ПрохожденияДляОтмены);	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКартинку(Команда)
	НачатьДобавлениеКартинки();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКартинку(Команда)
	НачатьУдалениеКартинки()
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКартинкуИзЗагруженных(Команда)
	НачатьВыборКартинкиИзЗагруженных();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПродолжительность(Команда)	
	ЗадатьПродолжительность();	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПродолжительность(Команда)
	ОчиститьПродолжительностьКоманда();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВремяУчастнику(Команда)	
	НачатьДобавлениеВремениУчастнику();			
КонецПроцедуры

&НаКлиенте
Процедура СброситьОценкуКачестваОбучения(Команда)
	ТекущиеДанные = Элементы.Участники.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		СброситьОценкуКачестваОбученияНаСервере(ТекущиеДанные.Ссылка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Общее

&НаСервере
Процедура УстановитьОбязательныеРеквизитыФормы()
	
	РасширеннаяФункциональность = ПолучитьФункциональнуюОпцию("РасширеннаяФункциональностьСУО");
	ИспользуетсяВебКабинет = ВебКабинетСУ.Используется();
	ИспользуютсяСлушатели = ПолучитьФункциональнуюОпцию("ИспользоватьСлушателейСУО");	
	ЭтоПолныйИнтерфейс = ПолучитьФункциональнуюОпцию("ПолныйИнтерфейсСУО");
	ЭтоОбразовательнаяОрганизация = ПолучитьФункциональнуюОпцию("ОбразовательнаяОрганизацияОО");
	ИспользоватьСтудентов = ПолучитьФункциональнуюОпцию("ИспользоватьСтудентовСУО");
	ИспользоватьВстроенныйПлеерКурсовВебКабинета = РазработкаСУЗ.ИспользоватьВстроенныйПлеерКурсовВебКабинета();

	ВидОбучения                  = Документы.ПроведениеОбученияСУО.ВидОбучения(Объект);	
	ДистанционноеОбучение        = Документы.ПроведениеОбученияСУО.ДистанционноеОбучение(Объект);
	ЭтоЭлектронноеОбучение       = Документы.ПроведениеОбученияСУО.ЭтоЭлектронноеОбучение(Объект, ВидОбучения);
	ЭлектронноДистанционное      = ?(ДистанционноеОбучение И ЭтоЭлектронноеОбучение, Истина, Ложь);		
	КоличествоУчастников         = Документы.ПроведениеОбученияСУО.КоличествоУчастниковОбучения(Объект.Ссылка);
	КоличествоПреподавателей     = Документы.ПроведениеОбученияСУО.Преподаватели(Объект.Ссылка, Объект.Мероприятие).Количество();
	ЗаданияПроверяютсяВыборочно = ВидОбучения.ЗаданияПроверяютсяВыборочно;
	ШкалаОценок                  = Документы.ПроведениеОбученияСУО.ШкалаОценки(Объект);

	Если Объект.НаОсновеМероприятия Тогда
		ДанныеМероприятия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Мероприятие, "ТипАудитории, ПродолжительностьВСекундах, Продолжительность");
		ТребуемыйТипАудитории = ДанныеМероприятия.ТипАудитории;
		ПродолжительностьМероприятияВСекундах = ДанныеМероприятия.ПродолжительностьВСекундах;
	Иначе
		ТребуемыйТипАудитории = Неопределено;
		ПродолжительностьМероприятияВСекундах = 0;
	КонецЕсли;	
	
	ТребуетсяПреподаватель = Объект.ВидОбучения.ТребуетсяПреподаватель;
	
	Если Объект.НаОсновеЭлектронногоРесурса И ИспользоватьВстроенныйПлеерКурсовВебКабинета И НЕ ЗначениеЗаполнено(Объект.ПлеерВебКабинета) Тогда
		ТекущиеДанныеПлеера = ДанныеПлеераЕдинственногоЭлектронногоРесурса(Объект.ЭлектронныйРесурс, Объект.Ссылка);
		Объект.ПлеерВебКабинета = ТекущиеДанныеПлеера.ПлеерВебКабинета;
	КонецЕсли;
	
	ЗаполнитьРегламентныеЗаданияАктивацияПроведенийОбученияВключено();
	
КонецПроцедуры

&НаСервере
Функция ВидимостьЗакладкиЗаданий(ВидОбучения, ТекущийОбъект)
	Возврат ВидОбучения.Электронное И НЕ ТекущийОбъект.НаОсновеМероприятия И НЕ ТекущийОбъект.НаОсновеЭлектронногоРесурса;
КонецФункции

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы(УстановитьОбязательныеРеквизиты)
	
	// Получаем переменные
	
	Если УстановитьОбязательныеРеквизиты Тогда
		УстановитьОбязательныеРеквизитыФормы();	
	КонецЕсли;
	
	ЭтоЭлектронноеОбучение = Документы.ПроведениеОбученияСУО.ЭтоЭлектронноеОбучение(Объект, ВидОбучения);
	
	// Команды
	
	Элементы.ФормаЗаписать.Доступность = НЕ Объект.Проведен;
	
	Элементы.ФайлыУчащихся.Видимость = НЕ Объект.Ссылка.Пустая() И ЭтоПолныйИнтерфейс;
		
	Элементы.УчастникиУстановитьСтатусУчастникаПроходит.Доступность = (Объект.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Активно И НЕ ТолькоПросмотр);
	Элементы.УчастникиУстановитьСтатусУчастникаЗавершил.Доступность = (Объект.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Активно И НЕ ТолькоПросмотр);
	Элементы.УчастникиУстановитьСтатусУчастникаАвтомат.Доступность = (Объект.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Активно
		ИЛИ Объект.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Запланировано И НЕ ТолькоПросмотр);
	Элементы.УчастникиУстановитьСтатусУчастникаНеДопущен.Доступность = (Объект.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Активно
		ИЛИ Объект.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Запланировано И НЕ ТолькоПросмотр);
	Элементы.УчастникиУстановитьСтатусУчастникаНеЗавершил.Доступность = (Объект.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Активно И НЕ ТолькоПросмотр);	
	
	Элементы.УчастникиОтменитьОбучениеУчастника.Доступность = ((Объект.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Активно
		ИЛИ Объект.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Запланировано) И НЕ ТолькоПросмотр);
	
	// Вид сценария
	
	Элементы.ГруппаБезСценария.Видимость = Объект.БезСценария;	
	Элементы.ЭлектронныйРесурс.Видимость = Объект.НаОсновеЭлектронногоРесурса;	
	Элементы.ВидОбученияДляЭлектронногоОбучения.Видимость = (Объект.НаОсновеЭлектронногоРесурса И ЭтоПолныйИнтерфейс);	
	Элементы.Мероприятие.Видимость = Объект.НаОсновеМероприятия;
	Элементы.СхемаПроведения.Видимость = Объект.НаОсновеМероприятия И ВидОбучения.Общее;	
	
	Если ИспользоватьВстроенныйПлеерКурсовВебКабинета И Объект.НаОсновеЭлектронногоРесурса Тогда
		ТекущиеДанныеПлеера = ДанныеПлеераЕдинственногоЭлектронногоРесурса(Объект.ЭлектронныйРесурс, Объект.Ссылка);
		Элементы.ПлеерВебКабинета.Видимость = Истина;
		Элементы.ПлеерВебКабинета.ТолькоПросмотр = НЕ ТекущиеДанныеПлеера.ДоступенВыборПлеераВебКабинета;
	Иначе
		Элементы.ПлеерВебКабинета.Видимость = Ложь;
	КонецЕсли;
		
	Если Элементы.СхемаПроведения.Видимость Тогда
		Элементы.СхемаПроведения.ТолькоПросмотр = (НЕ Объект.Ссылка.Пустая() И Объект.Проведен И ЗначениеЗаполнено(Объект.СхемаПроведения) И НЕ ТолькоПросмотр);
	КонецЕсли;
	
	// Задания
	
	Элементы.ГруппаЭлектронныеЗадания.Видимость = ВидимостьЗакладкиЗаданий(ВидОбучения, Объект);
	ИспользуетсяЕдиныйКаталог = ПолучитьФункциональнуюОпцию("ПоказатьЕдиныйКаталогМатериаловСУО");
	Элементы.ЭлектронныеЗаданияДобавитьУчебныйМатериал.Видимость = ИспользуетсяЕдиныйКаталог;
	Элементы.ЭлектронныеЗаданияДобавитьЭлектронныйКурсИлиТестКакЗадание.Видимость = НЕ ИспользуетсяЕдиныйКаталог;
	Элементы.ЭлектронныеЗаданияДобавитьЗаданиеНаПроверку.Видимость = НЕ ИспользуетсяЕдиныйКаталог И ВидОбучения.ТребуетсяПреподаватель;
	Элементы.ЭлектронныеЗаданияПлеерВебКабинета.Видимость = ИспользоватьВстроенныйПлеерКурсовВебКабинета;
	Элементы.ЭлектронныеЗаданияПроходнойБалл.Видимость = ВидОбучения.ВыставляетсяОценка;
	Элементы.ЭлектронныеЗаданияПриОтсутствииОценкиЗаЗадание.Видимость = ВидОбучения.ВыставляетсяОценка;
	
	УстановитьВидимостьЭлементовЗакладкиЗаданий(ЭтотОбъект);
	
	// Проведение программы обучения
	
	Элементы.ПроведениеПрограммыОбучения.Видимость = ЭтоПолныйИнтерфейс;
	Элементы.УчастникиВключенВПрограмму.Видимость = ЗначениеЗаполнено(Объект.ПроведениеПрограммыОбучения);
	
	// Проведение подчиненных мероприятий
	
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(ПроведениеПодчиненныхМероприятий, Объект.Ссылка, "ПроведениеОбучения");
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(ПроведениеПодчиненныхМероприятий, Объект.СхемаПроведения, "СхемаПроведения");
	
	// Общение
	
	Если Объект.ДоступноВнешнимПользователям Тогда
		Объект.ЗапретитьОбщениеМеждуУчастниками = Истина;
	КонецЕсли;
			
	// Заявки
	
	Если НЕ Объект.ОткрытоеМероприятие Тогда
		Объект.ТребуетсяЗаявка = Ложь;
	КонецЕсли;
	
	// Участники
		
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Участники, Объект.Ссылка, "ПроведениеОбучения");
	Участники.Параметры.УстановитьЗначениеПараметра("ПоказыватьТекущуюОценку", ВидОбучения.ПоказыватьТекущуюОценку);
	
	Если Объект.НаОсновеМероприятия И ВидОбучения.Общее Тогда
		
		ОбщегоНазначенияСУКлиентСервер.ИзменитьИспользованиеГруппировкиДинамическогоСписка(Участники, "Сценарий", Истина);
		
		Если Участники.Группировка.Элементы.Количество() = 0 Тогда
			
			ЭлементГруппировкиУчастники = Участники.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			ЭлементГруппировкиУчастники.Использование = Истина;
			ЭлементГруппировкиУчастники.Поле = Новый ПолеКомпоновкиДанных("Пользователь");
			
		КонецЕсли;
			
		Элементы.УчастникиПользователь.Видимость = Ложь;
		
		Элементы.УчастникиСценарий.Видимость = Истина;
		
	Иначе
		
		Элементы.УчастникиПользователь.Видимость = Истина;
		
		ОбщегоНазначенияСУКлиентСервер.ИзменитьИспользованиеГруппировкиДинамическогоСписка(Участники, "Сценарий", Ложь);
		
		Элементы.УчастникиСценарий.Видимость = Ложь;
		
	КонецЕсли;	
	
	Элементы.УчастникиЕстьДанныеВебКабинета.Видимость = ИспользуетсяВебКабинет;
	Элементы.УчастникиОбщее.Видимость = ЭтоПолныйИнтерфейс;
	Элементы.УчастникиРодительскоеПрохождение.Видимость = ЭтоПолныйИнтерфейс;
	Элементы.УчастникиЗаявка.Видимость = ЭтоПолныйИнтерфейс;
	
	Если ЭтоОбразовательнаяОрганизация Тогда
		ОбщегоНазначенияСУКлиентСервер.УстановитьЗаголовокЭлементаФормы(ЭтотОбъект, "ГруппаУчастникиМероприятия", НСтр("ru = 'Студенты'"));
	КонецЕсли;
	
	Если НЕ ВидОбучения.ВыставляетсяОценка Тогда
		Элементы.УчастникиБаллы.Видимость  = Ложь;	
		Элементы.УчастникиОценка.Видимость = Ложь;
	КонецЕсли;	
	
	Если ЭтоОбразовательнаяОрганизация Тогда
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(ЭтотОбъект, "УчастникиОбщаяКомандаПрисоединенныеФайлыКОбъекту", Ложь);
	КонецЕсли;
	
	МожноДобавлятьВремя = ЭтоЭлектронноеОбучение И (Объект.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.СЗачисления
		ИЛИ Объект.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.СНачалаОбучения
		ИЛИ (Объект.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.Фиксированная
		И ЗначениеЗаполнено(Объект.ДатаОкончанияПроведения) ИЛИ ЗначениеЗаполнено(Объект.ДатаКонтроля)));
	
	Элементы.УчастникиОсталосьУчитьсяЧасов.Видимость = МожноДобавлятьВремя;
	Элементы.УчастникиДобавленоВремениСтрока.Видимость = МожноДобавлятьВремя;
	Элементы.УчастникиДобавитьВремяУчастнику.Видимость = МожноДобавлятьВремя;	
	Элементы.УчастникиОтменитьЗаданияУчастника.Видимость = ВидОбучения.Электронное И НЕ Объект.НаОсновеЭлектронногоРесурса;
	
	УстановитьДатыВозможностиУчиться(ЭтотОбъект);

	// Возможности учиться
	
	Если НЕ ИспользуютсяСлушатели Тогда
		
		МожетБытьПоказанаКолонкаВозможностьУчиться = ПоказатьКолонкуВозможностьУчиться(Объект.Ссылка, Истина,
			Объект.ДатаНачалаПроведения, Объект.ДатаОкончанияПроведения, Объект.ДатаНачалаДоступа, Объект.ДатаКонтроля);
		// Здесь мы предполагаем, что стоит флажок КонтролироватьВозможностьУчиться,
		// и смотрим, вернет ли функция ПоказатьКолонкуВозможностьУчиться Истина.
		// Если да, то показываем активный флажок КонтролироватьВозможностьУчиться.
		
		Если МожетБытьПоказанаКолонкаВозможностьУчиться Тогда
			Элементы.КонтролироватьВозможностьУчиться.Видимость = Истина;
			Элементы.КонтролироватьВозможностьУчитьсяНедоступно.Видимость = Ложь;		
			Элементы.УчастникиМожетУчиться.Видимость = ПоказатьКолонкуВозможностьУчиться(Объект.Ссылка, Объект.КонтролироватьВозможностьУчиться,
				Объект.ДатаНачалаПроведения, Объект.ДатаОкончанияПроведения, Объект.ДатаНачалаДоступа, Объект.ДатаКонтроля);
		Иначе
			Элементы.КонтролироватьВозможностьУчиться.Видимость = Ложь;
			Элементы.КонтролироватьВозможностьУчитьсяНедоступно.Видимость = Истина;
			Элементы.УчастникиМожетУчиться.Видимость = Ложь;
		КонецЕсли;
		
	Иначе
		
		Элементы.КонтролироватьВозможностьУчиться.Видимость = Ложь;
		Элементы.КонтролироватьВозможностьУчитьсяНедоступно.Видимость = Ложь;
		Элементы.УчастникиМожетУчиться.Видимость = Ложь;		
		
	КонецЕсли;

		
	// Потенциальные участники
	
	Если Объект.ОткрытоДляВсех Тогда
		Элементы.УчастникиОткрытогоМероприятия.Доступность = Ложь;
	Иначе
		Элементы.УчастникиОткрытогоМероприятия.Доступность = Истина;
	КонецЕсли;
	
	// Преподаватели
	
	РолиПреподавателей = Документы.ПроведениеОбученияСУО.РолиПреподавателей(Объект.Ссылка, Объект.Мероприятие);
	
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Преподаватели, Объект.Ссылка, "ПроведениеОбучения");
	
	ОбновитьСписокПреподавателей(Ложь);	
	
	Если ВидОбучения.ТребуетсяПреподаватель Тогда
		
		Элементы.СтраницаКомментарииДляПреподавателя.Видимость = Истина;
		Элементы.ГруппаПреподаватели.Видимость = Истина;
		
		Если ВидОбучения.Общее Тогда
			Элементы.ОсновнойПреподаватель.Видимость = Истина;
			ОбщегоНазначенияСУКлиентСервер.ИзменитьИспользованиеГруппировкиДинамическогоСписка(Преподаватели, "Сценарий", Истина);
		Иначе
			Элементы.ОсновнойПреподаватель.Видимость = Ложь;
			ОбщегоНазначенияСУКлиентСервер.ИзменитьИспользованиеГруппировкиДинамическогоСписка(Преподаватели, "Сценарий", Ложь);
		КонецЕсли;
		
		Элементы.ПреподавателиИзменитьРольПреподавателя.Видимость = (РолиПреподавателей.Количество() > 1);
		Элементы.ПреподавателиРоль.Видимость = (РолиПреподавателей.Количество() > 1);
		
		Если Объект.НаОсновеМероприятия И ВидОбучения.Общее Тогда
			
			Если Преподаватели.Группировка.Элементы.Количество() = 0 Тогда
			
				ЭлементГруппировкиПреподаватели = Преподаватели.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
				ЭлементГруппировкиПреподаватели.Использование = Истина;
				ЭлементГруппировкиПреподаватели.Поле = Новый ПолеКомпоновкиДанных("Преподаватель");

			КонецЕсли;
				
			Элементы.ПреподавателиСценарий.Видимость = Истина;
			Элементы.ПреподавателиПреподаватель.Видимость = Ложь;

		Иначе
			
			Элементы.ПреподавателиСценарий.Видимость = Ложь;
			Элементы.ПреподавателиПреподаватель.Видимость = Истина;
			
		КонецЕсли;
		
		
	Иначе
		
		Элементы.СтраницаКомментарииДляПреподавателя.Видимость = Ложь;
		Элементы.ГруппаПреподаватели.Видимость = Ложь;
		
	КонецЕсли;
	
	// Требуется заявка
	
	Если Объект.ОткрытоеМероприятие Тогда
		
		Элементы.ТребуетсяЗаявка.Доступность = Истина;
		
		Элементы.ВремяНачалаЗаписи.Видимость = НЕ Объект.СкрытьВремяПроведения;
		Элементы.ВремяОкончанияЗаписи.Видимость = НЕ Объект.СкрытьВремяПроведения;
		
	Иначе
		
		Элементы.ТребуетсяЗаявка.Доступность = Ложь;
		
	КонецЕсли;
	
	Если ИспользуютсяСлушатели ИЛИ НЕ ЭтоПолныйИнтерфейс Тогда
		Элементы.ТребуетсяЗаявка.Видимость = Ложь;
	КонецЕсли;
	
	// ГруппаЗаписьНаМероприятие
	
	Если Объект.ОткрытоеМероприятие Тогда
		Элементы.ГруппаЛимитыНаЗапись.Видимость = Истина;
	Иначе
		Элементы.ГруппаЛимитыНаЗапись.Видимость = Ложь;
	КонецЕсли;
		
	// Ресурсы
	
	Если ЗначениеЗаполнено(ВидОбучения) Тогда
		Элементы.ГруппаРесурсы.Видимость = Истина;
		Если НЕ ЭтоПолныйИнтерфейс Тогда
			Элементы.ЭлектронныеРесурсыГруппаПоказатьПриСтатусе.Заголовок = НСтр("ru = 'Показать в обучении при статусе проведения обучения'");
			Элементы.КнигиГруппаПоказатьПриСтатусе.Заголовок = НСтр("ru = 'Показать в обучении при статусе проведения обучения'");
			Элементы.ФайлыГруппаПоказатьПриСтатусе.Заголовок = НСтр("ru = 'Показать в обучении при статусе проведения обучения'");
			Элементы.КнигиДобавитьВБиблиотеку.Видимость = Ложь;
			Элементы.КнигиМеткаВБиблиотеке.Видимость = Ложь;
			Элементы.ЭлектронныеРесурсыДобавитьВБиблиотеку.Видимость = Ложь;
			Элементы.ЭлектронныеРесурсыМеткаВБиблиотеке.Видимость = Ложь;
			Элементы.ФайлыДобавитьВБиблиотеку.Видимость = Ложь;
			Элементы.ФайлыМеткаВБиблиотеке.Видимость = Ложь;			
		КонецЕсли;
	Иначе
		Элементы.ГруппаРесурсы.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.СтраницаКниги.Видимость = РасширеннаяФункциональность;
	Элементы.ЭлектронныеРесурсыПлеерВебКабинета.Видимость = ИспользоватьВстроенныйПлеерКурсовВебКабинета;
	
	// Календарь
	
	Элементы.ГруппаКалендарь.Видимость = НЕ ЭлектронноДистанционное;
	
	// Автозачисление
	
	Если Объект.ОткрытоеМероприятие Тогда
		Элементы.АвтозачислениеНаОбучение.Доступность = Ложь;
	Иначе
		Элементы.АвтозачислениеНаОбучение.Доступность = Истина;
	КонецЕсли;		
	
	Если ИспользуютсяСлушатели ИЛИ НЕ ЭтоПолныйИнтерфейс Тогда
		Элементы.АвтозачислениеНаОбучение.Видимость = Ложь;
	КонецЕсли;
	
	// Активировать автоматически
		
	Если Объект.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Запланировано
		И ((ВидОбучения.Электронное И Объект.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.Фиксированная
		И ЗначениеЗаполнено(Объект.ДатаНачалаДоступа))
		ИЛИ (НЕ ВидОбучения.Электронное И ЗначениеЗаполнено(Объект.ДатаНачалаПроведения))) Тогда		
		Элементы.АктивироватьАвтоматически.Доступность = Истина;		
	Иначе
		Элементы.АктивироватьАвтоматически.Доступность = Ложь;
		Объект.АктивироватьАвтоматически = Ложь;
	КонецЕсли;
	
	// Открытое мероприятие
	
	Если Объект.АвтозачислениеНаОбучение Тогда
		Элементы.ОткрытоеМероприятие.Доступность = Ложь;
	Иначе
		Элементы.ОткрытоеМероприятие.Доступность = Истина;
	КонецЕсли;
	
	Если ИспользуютсяСлушатели ИЛИ НЕ ЭтоПолныйИнтерфейс Тогда
		Элементы.ОткрытоеМероприятие.Видимость = Ложь;
	КонецЕсли;
	
	// Потенциальные участники
	
	Если Объект.ОткрытоеМероприятие
		ИЛИ Объект.АвтозачислениеНаОбучение Тогда		
		Элементы.ГруппаДоступКОбучению.Видимость = Истина;		
	Иначе
		Элементы.ГруппаДоступКОбучению.Видимость = Ложь;		
	КонецЕсли;
	
	Элементы.СтраницаФильтрПоДатеПриема.Видимость = Объект.АвтозачислениеНаОбучение И ПолучитьФункциональнуюОпцию("ИспользоватьСотрудниковСУО");
	
	// Опция "ЗапретитьОбщениеМеждуУчастниками"
	
	Если Объект.ДоступноВнешнимПользователям Тогда
		Элементы.ЗапретитьОбщениеМеждуУчастниками.Доступность = Ложь;
	Иначе
		Элементы.ЗапретитьОбщениеМеждуУчастниками.Доступность = Истина;
	КонецЕсли;
	
	// Опция "ДоступноВнешнимПользователям" (Внешнее)
	
	Если ЗначениеЗаполнено(Объект.ПроведениеПрограммыОбучения) Тогда
		Элементы.ДоступноВнешнимПользователям.Видимость = Ложь;
	КонецЕсли;

	// Даты
	
	Если ЭлектронноДистанционное Тогда
		
		Элементы.ГруппаДатаКонтроля.Видимость = Истина;
		Элементы.ГруппаДатаКонтроля.ТолькоПросмотр = ИспользуютсяСлушатели;
		
		Элементы.ГруппаПериодПроведения.Видимость = Ложь;
		
		Если Объект.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.Фиксированная Тогда
			
			Элементы.ВариантПродолжительности.Ширина = 15;
			Элементы.ГруппаДата.Видимость = Истина;
			Элементы.ВремяНачалаДоступа.Видимость = НЕ Объект.СкрытьВремяПроведения;
			Элементы.СкрытьВремяПроведенияДатаКонтроля.Видимость = НЕ ЭтоОбразовательнаяОрганизация;
			Элементы.ВремяКонтроля.Видимость = НЕ Объект.СкрытьВремяПроведения;			
			Элементы.УстановитьИнтервалДоступа.Видимость = НЕ ИспользуютсяСлушатели;		
			Элементы.ДоступОтличаетсяОтРекомендованного.Видимость = ПродолжительностьОтличаетсяОтРекомендованной();
			
		Иначе
			
			Элементы.ГруппаДата.Видимость = Ложь;
			
		КонецЕсли;
			
		Если Объект.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.СЗачисления
			ИЛИ Объект.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.СНачалаОбучения Тогда			
			
			Элементы.ВариантПродолжительности.Ширина = 24;
			Элементы.ГруппаПродолжительность.Видимость = Истина;			
			УстановитьТекстПродолжительностиОбучения();	
			
		Иначе			
			
			Элементы.ГруппаПродолжительность.Видимость = Ложь;			
			
		КонецЕсли;
		
		Если Объект.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.НеЗадана
			ИЛИ НЕ ЗначениеЗаполнено(Объект.ВариантПродолжительности) Тогда			
			Элементы.ГруппаБезРасписания.Видимость = Истина;
			Элементы.ВариантПродолжительности.Ширина = 15;
		Иначе		
			Элементы.ГруппаБезРасписания.Видимость = Ложь;			
		КонецЕсли;
		
	Иначе
		
		Элементы.ГруппаПериодПроведения.Видимость = Истина;
		Элементы.ГруппаПериодПроведения.ТолькоПросмотр = ИспользуютсяСлушатели;
		
		Элементы.ГруппаДатаКонтроля.Видимость = Ложь;
			
		Элементы.ВремяНачалаПроведения.Видимость = НЕ Объект.СкрытьВремяПроведения;
		Элементы.ВремяОкончанияПроведения.Видимость = НЕ Объект.СкрытьВремяПроведения;
		
		Элементы.УстановитьИнтервалПроведенияОбучения.Видимость = НЕ ИспользуютсяСлушатели;
	    Элементы.ПериодОтличаетсяОтРекомендованного.Видимость = ПродолжительностьОтличаетсяОтРекомендованной();
		
	КонецЕсли;
	
	// Аудитории
	
	Если ДистанционноеОбучение ИЛИ ВидОбучения.Общее Тогда
		Элементы.ГруппаАудитория.Видимость = Ложь;		
	Иначе
		Элементы.ГруппаАудитория.Видимость = Истина;
	КонецЕсли;
	
	// Подчиненные мероприятия
	
	Если Объект.НаОсновеМероприятия И ВидОбучения.Общее Тогда
		Элементы.ГруппаПроведениеОбщегоОбучения.Видимость = Истина;
	Иначе
		Элементы.ГруппаПроведениеОбщегоОбучения.Видимость = Ложь;
	КонецЕсли;	
	
	// Открыто для руководителей
	
	Если Объект.АвтозачислениеНаОбучение Тогда
		Элементы.ОткрытоДляРуководителей.Видимость = Ложь;
	Иначе
		Элементы.ОткрытоДляРуководителей.Видимость = Истина;
	КонецЕсли;
	
	// Запрос
	
	Элементы.Запрос.Видимость = ЗначениеЗаполнено(Объект.ЗапросНаОбучение);
	
	// Адрес в Интернет
	
	Если НЕ ВидОбучения.Общее И ДистанционноеОбучение Тогда
		Элементы.ГруппаАдресВИнтернете.Видимость = Истина;
	Иначе
		Элементы.ГруппаАдресВИнтернете.Видимость = Ложь;
	КонецЕсли;
	
	// Комментарий для менеджера
	
	Если Объект.НаОсновеМероприятия И ЗначениеЗаполнено(Объект.Мероприятие.КомментарийДляМенеджера) Тогда
		Элементы.МероприятиеКомментарийДляМенеджера.Видимость = Истина;
	Иначе
		Элементы.МероприятиеКомментарийДляМенеджера.Видимость = Ложь;
	КонецЕсли;
		
	// Дисциплины
	
	Элементы.Дисциплина.Видимость = ЭтоОбразовательнаяОрганизация ИЛИ ИспользоватьСтудентов;
	
	// Комментарии
	
	Элементы.КомментарийДляУчащегосяОткрытогоМероприятия.Видимость = ?(Объект.ОткрытоеМероприятие, Истина, Ложь);
	
	ОбщегоНазначенияСУКлиентСервер.УстановитьЗаголовокЭлементаФормы(ЭтотОбъект, "СтраницаКомментарииДляУчастника", НСтр("ru = 'Участнику'"));
	
	Если ЭтоОбразовательнаяОрганизация Тогда
		ОбщегоНазначенияСУКлиентСервер.УстановитьЗаголовокЭлементаФормы(ЭтотОбъект, "СтраницаКомментарииДляУчастника", НСтр("ru = 'Студенту'"));
	КонецЕсли;	
	
	// Вид сценария
	
	Элементы.ГруппаВидСценария.Видимость = ЭтоПолныйИнтерфейс;
	
	// Картинка
	
	Элементы.ГруппаКартинка.Видимость = ВебКабинетСУ.Используется() 
		И ВебКабинетСУ.Редакция() = Перечисления.РедакцииВебКабинетаСУ.Редакция30;
		
	// Оценка качества
	
	Если НЕ Объект.КачествоОбученияОцениваетсяУчастниками Тогда
		Объект.ПоказыватьОценкиИКомментарииВсемУчастникам = Ложь;
	КонецЕсли;
	
	Элементы.ГруппаОценкаКачества.Видимость = ВебКабинетСУ.Используется() 
		И ВебКабинетСУ.Редакция() = Перечисления.РедакцииВебКабинетаСУ.Редакция30;
							
	Элементы.ПоказыватьОценкиИКомментарииВсемУчастникам.Доступность = Объект.КачествоОбученияОцениваетсяУчастниками;
	Элементы.ОписаниеБлокаОценкиКачестваОбучения.Доступность = Объект.КачествоОбученияОцениваетсяУчастниками;
	Элементы.ЗаголовокБлокаОценкиКачестваОбучения.Доступность = Объект.КачествоОбученияОцениваетсяУчастниками;
	
	Элементы.УчастникиОценкаКачестваОбучения.Видимость = Объект.КачествоОбученияОцениваетсяУчастниками;
	Элементы.УчастникиКомментарийКачестваОбучения.Видимость = Объект.КачествоОбученияОцениваетсяУчастниками;
	Элементы.УчастникиДатаОцениванияКачестваОбучения.Видимость = Объект.КачествоОбученияОцениваетсяУчастниками;	
	
	// УУЦ
	
	ИспользоватьСлушателей = ПолучитьФункциональнуюОпцию("ИспользоватьСлушателейСУО"); 
	
	Элементы.ПрограммаОбучения.Видимость = ИспользоватьСлушателей И ЗначениеЗаполнено(Объект.ПрограммаОбучения);
	Элементы.ПрограммаОбучения.ТолькоПросмотр = ИспользоватьСлушателей;
	Элементы.ПрограммаОбучения.КнопкаОткрытия = ?(ИспользоватьСлушателей, Ложь, Истина);
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСлушателейСУО") Тогда
		Элементы.ПрограммаОбучения.Заголовок = НСтр("ru = 'Программа обучения УУЦ'");				
	КонецЕсли;
	
	Элементы.ГруппаСлушателей.Видимость = ИспользоватьСлушателей И ЗначениеЗаполнено(Объект.ГруппаСлушателей);
	Элементы.ГруппаСлушателей.ТолькоПросмотр = ИспользоватьСлушателей;
	Элементы.ГруппаСлушателей.КнопкаОткрытия = ?(ИспользоватьСлушателей, Ложь, Истина);
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСлушателейСУО") Тогда
		Элементы.ГруппаСлушателей.Заголовок = НСтр("ru = 'Группа слушателей УУЦ'");				
	КонецЕсли;
	
	Элементы.ДекорацияЗагруженоИзУУЦ.Видимость = Объект.ЗагруженоИзУУЦ;
	
	// Все элементы
	
	ТолькоПросмотрДляВсехЭлементов = ТолькоПросмотрФормы(Объект.Статус, ЭтотОбъект);
	
	Если ТолькоПросмотрДляВсехЭлементов <> ТолькоПросмотрФормыТекущее Тогда
		
		ТолькоПросмотрФормыТекущее = ТолькоПросмотрДляВсехЭлементов;
		
		Если ЭлементыДоступности.Количество() = 0 Тогда
			ЗаполнитьТаблицуЭлементыДоступности();
		КонецЕсли;
		
		СтрокиДляПеребора = ?(ТолькоПросмотр, ЭлементыДоступности, ЭлементыДоступности.НайтиСтроки(Новый Структура("ЕслиТолькоПросмотрФормы", Ложь))); 
		
		Для каждого СтрокаТЭД  Из СтрокиДляПеребора Цикл
			
			Если СтрокаТЭД.УстановитьДоступность Тогда
				Элементы[СтрокаТЭД.ИмяЭлемента].Доступность = НЕ ТолькоПросмотрДляВсехЭлементов;
			КонецЕсли;
			
			Если СтрокаТЭД.УстановитьТолькоПросмотр Тогда
				Элементы[СтрокаТЭД.ИмяЭлемента].ТолькоПросмотр = ТолькоПросмотрДляВсехЭлементов;
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЕсли;
	
	// Заголовки
	
	УстановитьЗаголовки();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуЭлементыДоступности()

	НоваяСтрока = ЭлементыДоступности.Добавить();
	НоваяСтрока.ИмяЭлемента = "ГруппаПривязки";
	НоваяСтрока.УстановитьДоступность = Ложь;
	НоваяСтрока.УстановитьТолькоПросмотр = Истина;
	НоваяСтрока.ЕслиТолькоПросмотрФормы = Ложь;
	
	НоваяСтрока = ЭлементыДоступности.Добавить();
	НоваяСтрока.ИмяЭлемента = "ГруппаБезСценария";
	НоваяСтрока.УстановитьДоступность = Ложь;
	НоваяСтрока.УстановитьТолькоПросмотр = Истина;
	НоваяСтрока.ЕслиТолькоПросмотрФормы = Ложь;
	
	НоваяСтрока = ЭлементыДоступности.Добавить();
	НоваяСтрока.ИмяЭлемента = "ГруппаСценарий";
	НоваяСтрока.УстановитьДоступность = Ложь;
	НоваяСтрока.УстановитьТолькоПросмотр = Истина;
	НоваяСтрока.ЕслиТолькоПросмотрФормы = Ложь;
	
	НоваяСтрока = ЭлементыДоступности.Добавить();
	НоваяСтрока.ИмяЭлемента = "ГруппаАудитория";
	НоваяСтрока.УстановитьДоступность = Ложь;
	НоваяСтрока.УстановитьТолькоПросмотр = Истина;
	НоваяСтрока.ЕслиТолькоПросмотрФормы = Ложь;
	
	НоваяСтрока = ЭлементыДоступности.Добавить();
	НоваяСтрока.ИмяЭлемента = "ГруппаДатаКонтроля";
	НоваяСтрока.УстановитьДоступность = Ложь;
	НоваяСтрока.УстановитьТолькоПросмотр = Истина;
	НоваяСтрока.ЕслиТолькоПросмотрФормы = Ложь;
	
	НоваяСтрока = ЭлементыДоступности.Добавить();
	НоваяСтрока.ИмяЭлемента = "ГруппаПериодПроведения";
	НоваяСтрока.УстановитьДоступность = Ложь;
	НоваяСтрока.УстановитьТолькоПросмотр = Истина;
	НоваяСтрока.ЕслиТолькоПросмотрФормы = Ложь;
	
	НоваяСтрока = ЭлементыДоступности.Добавить();
	НоваяСтрока.ИмяЭлемента = "ГруппаОсновныеХарактеристики";
	НоваяСтрока.УстановитьДоступность = Ложь;
	НоваяСтрока.УстановитьТолькоПросмотр = Истина;
	НоваяСтрока.ЕслиТолькоПросмотрФормы = Ложь;
	
	НоваяСтрока = ЭлементыДоступности.Добавить();
	НоваяСтрока.ИмяЭлемента = "Страницы";
	НоваяСтрока.УстановитьДоступность = Ложь;
	НоваяСтрока.УстановитьТолькоПросмотр = Истина;
	НоваяСтрока.ЕслиТолькоПросмотрФормы = Ложь;
	
	Для Каждого ТекущийЭлементФормы Из Элементы Цикл
		
		Если ТипЗнч(ТекущийЭлементФормы) = Тип("КнопкаФормы")
			И (Найти(ТекущийЭлементФормы.Имя, НСтр("ru = 'ЭлектронныеЗадания'")) > 0
			ИЛИ Найти(ТекущийЭлементФормы.Имя, НСтр("ru = 'УстановитьИнтервалПроведенияОбучения'")) > 0
			ИЛИ Найти(ТекущийЭлементФормы.Имя, НСтр("ru = 'ПроведениеПодчиненныхМероприятий'")) > 0
			ИЛИ Найти(ТекущийЭлементФормы.Имя, НСтр("ru = 'Преподаватели'")) > 0 
			ИЛИ Найти(ТекущийЭлементФормы.Имя, НСтр("ru = 'Участники'")) > 0			
			ИЛИ Найти(ТекущийЭлементФормы.Имя, НСтр("ru = 'Файлы'")) > 0			
			ИЛИ Найти(ТекущийЭлементФормы.Имя, НСтр("ru = 'ДобавитьКартинку'")) > 0
			ИЛИ Найти(ТекущийЭлементФормы.Имя, НСтр("ru = 'УдалитьКартинку'")) > 0
			ИЛИ Найти(ТекущийЭлементФормы.Имя, НСтр("ru = 'УстановитьПродолжительность'")) > 0
			ИЛИ Найти(ТекущийЭлементФормы.Имя, НСтр("ru = 'ОчиститьПродолжительность'")) > 0
			ИЛИ Найти(ТекущийЭлементФормы.Имя, НСтр("ru = 'ВыбратьКартинкуИзЗагруженных'")) > 0			
			)
			И Найти(ТекущийЭлементФормы.Имя, НСтр("ru = 'Отчет'")) = 0
			И ТекущийЭлементФормы.Имя <> "УчастникиОбщаяКомандаПрисоединенныеФайлыКОбъекту" Тогда
			
			НоваяСтрока = ЭлементыДоступности.Добавить();
			НоваяСтрока.ИмяЭлемента = ТекущийЭлементФормы.Имя;
			НоваяСтрока.УстановитьДоступность = Истина;
			НоваяСтрока.УстановитьТолькоПросмотр = Ложь;
			НоваяСтрока.ЕслиТолькоПросмотрФормы = Ложь;
			
		КонецЕсли;
		
		
		Если ТипЗнч(ТекущийЭлементФормы) = Тип("КнопкаФормы")
			И Найти(ТекущийЭлементФормы.Имя, НСтр("ru = 'Отчет'")) = 0
			И Найти(ТекущийЭлементФормы.Имя, НСтр("ru = 'Заметку'")) = 0
			И ТекущийЭлементФормы.Имя <> "УчастникиОбщаяКомандаПрисоединенныеФайлыКОбъекту"
			И ТекущийЭлементФормы.Имя <> "КомандаСотрудники" Тогда
			
			НоваяСтрока = ЭлементыДоступности.Добавить();
			НоваяСтрока.ИмяЭлемента = ТекущийЭлементФормы.Имя;
			НоваяСтрока.УстановитьДоступность = Истина;
			НоваяСтрока.УстановитьТолькоПросмотр = Ложь;
			НоваяСтрока.ЕслиТолькоПросмотрФормы = Истина;			
			
		КонецЕсли;
		
		Если ТипЗнч(ТекущийЭлементФормы) = Тип("ГруппаФормы") Тогда
			
			НоваяСтрока = ЭлементыДоступности.Добавить();
			НоваяСтрока.ИмяЭлемента = ТекущийЭлементФормы.Имя;
			НоваяСтрока.УстановитьДоступность = Ложь;
			НоваяСтрока.УстановитьТолькоПросмотр = Истина;
			НоваяСтрока.ЕслиТолькоПросмотрФормы = Истина;			
			
		КонецЕсли;
		
		
	КонецЦикла;	
	
КонецПроцедуры
	
&НаСервере
Процедура УстановитьЗаголовки()
	
	Если Объект.ОткрытоеМероприятие Тогда
		
		Если Объект.ОткрытоДляРуководителей Тогда
			Элементы.ОткрытоДляВсех.Заголовок = НСтр("ru = 'Открыто для всех руководителей'");
		Иначе
			Элементы.ОткрытоДляВсех.Заголовок = НСтр("ru = 'Открыто для всех пользователей базы'");
		КонецЕсли;
		
		Элементы.ГруппаДоступКОбучению.Заголовок = НСтр("ru = 'Доступ к обучению'");
		Элементы.СтраницаПотенциальныеУчастники.Заголовок = НСтр("ru = 'Кому открыта запись'");
		
		Если ЗаданыОграниченияНаЗапись Тогда
			Элементы.ГруппаЛимитыНаЗапись.Заголовок = НСтр("ru = 'Ограничения на запись (Задано)'");
		Иначе
			Элементы.ГруппаЛимитыНаЗапись.Заголовок = НСтр("ru = 'Ограничения на запись'");
		КонецЕсли;
		
		Элементы.УсловияЗачисленияУчастников.Заголовок = НСтр("ru = 'Записаться сможет только участник указанных обучений с заданным статусом и баллом'");
		
	Иначе
		
		Элементы.ОткрытоДляВсех.Заголовок = НСтр("ru = 'Зачислить всех пользователи базы'");
		Элементы.ГруппаДоступКОбучению.Заголовок = НСтр("ru = 'Правила автозачисления'");
		Элементы.СтраницаПотенциальныеУчастники.Заголовок = НСтр("ru = 'Кто будет зачислен'");		
		Элементы.УсловияЗачисленияУчастников.Заголовок = НСтр("ru = 'Зачислить только участников указанных обучений с заданным статусом и баллом'");
		
	КонецЕсли;
	
	Если ЗаданФильтрПоДатеПриемаСотрудника Тогда
		Элементы.СтраницаФильтрПоДатеПриема.Заголовок = НСтр("ru = 'Фильтр по дате приема сотрудника (Задан)'");		
	Иначе
		Элементы.СтраницаФильтрПоДатеПриема.Заголовок = НСтр("ru = 'Фильтр по дате приема сотрудника'");
	КонецЕсли;
	
	Если КоличествоПреподавателей = 0 Тогда
		Элементы.ГруппаПреподаватели.Заголовок = НСтр("ru = 'Преподаватели (0)'");
	Иначе
		Элементы.ГруппаПреподаватели.Заголовок = НСтр("ru = 'Преподаватели'");
	КонецЕсли;
	
	Если ЭтоОбразовательнаяОрганизация Тогда
		Если КоличествоУчастников = 0 Тогда
			Элементы.ГруппаУчастникиМероприятия.Заголовок = НСтр("ru = 'Студенты (0)'");
		Иначе
			Элементы.ГруппаУчастникиМероприятия.Заголовок = НСтр("ru = 'Студенты'");
		КонецЕсли;			
	Иначе
		Если КоличествоУчастников = 0 Тогда
			Элементы.ГруппаУчастникиМероприятия.Заголовок = НСтр("ru = 'Участники (0)'");
		Иначе
			Элементы.ГруппаУчастникиМероприятия.Заголовок = НСтр("ru = 'Участники'");
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкуПередЗаписью(Отказ, ПараметрыЗаписи, ЗакрытьФорму)
	
	Если ВыполняетсяЗапись Тогда
		Возврат;
	КонецЕсли;
	
	// Задания
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
		И Элементы.ГруппаЭлектронныеЗадания.Видимость
		И Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроведенияОбъектовСУО.Активно")
		И ЭлектронныеЗадания.Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Заполните хотя бы одну строку на закладке ""Обязательные задания""'"),,"ЭлектронныеЗадания",,Отказ);
			
		Возврат;
			
	КонецЕсли;	
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
		И Элементы.ГруппаЭлектронныеЗадания.Видимость
		И (Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроведенияОбъектовСУО.Активно")
			ИЛИ Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроведенияОбъектовСУО.Запланировано"))
		И Элементы.ГруппаЭлектронныеЗадания.Видимость	
		И ЭлектронныеЗадания.Количество() > 0
		И Объект.ВариантПродолжительности = ПредопределенноеЗначение("Перечисление.ПродолжительностьОбученияСУО.Фиксированная") Тогда
		
		ПредыдущаяДатаНачалаДоступаКЗаданию = Неопределено;
		ПредыдущаяДатаОкончанияДоступаКЗаданию = Неопределено;		
		
		Для каждого СтрокаЭЗ Из ЭлектронныеЗадания Цикл
			
			Текст = Неопределено;
			ДатаНачалаОбученияДляПроверки = ?(ЗначениеЗаполнено(Объект.ДатаНачалаДоступа), Объект.ДатаНачалаДоступа, Объект.ДатаНачалаПроведения);
			ДатаОкончанияОбученияДляПроверки = ?(ЗначениеЗаполнено(Объект.ДатаКонтроля), Объект.ДатаКонтроля, Объект.ДатаОкончанияПроведения);
			
			Если ЗначениеЗаполнено(СтрокаЭЗ.ДатаНачалаДоступаКЗаданию)
				И ЗначениеЗаполнено(ДатаНачалаОбученияДляПроверки)
				И СтрокаЭЗ.ДатаНачалаДоступаКЗаданию < ДатаНачалаОбученияДляПроверки Тогда
				
				Текст = НСтр("ru = 'Дата с... выполнения задания должна быть позднее даты с... обучения'");
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаЭЗ.ДатаНачалаДоступаКЗаданию)
				И ЗначениеЗаполнено(ДатаОкончанияОбученияДляПроверки)
				И СтрокаЭЗ.ДатаНачалаДоступаКЗаданию > ДатаОкончанияОбученияДляПроверки Тогда
				
				Текст = НСтр("ru = 'Дата с... выполнения задания должна быть раньше даты по... обучения'");
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаЭЗ.ДатаОкончанияДоступаКЗаданию)
				И ЗначениеЗаполнено(ДатаОкончанияОбученияДляПроверки)
				И СтрокаЭЗ.ДатаОкончанияДоступаКЗаданию > ДатаОкончанияОбученияДляПроверки Тогда
				
				Текст = НСтр("ru = 'Дата по... выполнения задания должна быть раньше даты по... обучения'");
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаЭЗ.ДатаОкончанияДоступаКЗаданию)
				И ЗначениеЗаполнено(ДатаНачалаОбученияДляПроверки)
				И СтрокаЭЗ.ДатаОкончанияДоступаКЗаданию < ДатаНачалаОбученияДляПроверки Тогда
				
				Текст = НСтр("ru = 'Дата по... выполнения задания должна быть позднее даты с... обучения'");
				
			КонецЕсли;
			
			Если Объект.ПоследовательноеПрохождениеЗаданий
				И ЗначениеЗаполнено(СтрокаЭЗ.ДатаНачалаДоступаКЗаданию)
				И ЗначениеЗаполнено(ПредыдущаяДатаНачалаДоступаКЗаданию)
				И СтрокаЭЗ.ДатаНачалаДоступаКЗаданию < ПредыдущаяДатаНачалаДоступаКЗаданию Тогда
				
				Текст = НСтр("ru = 'Дата с... выполнения задания должна быть позднее даты с... предыдущего задания'");
				
			КонецЕсли;
						
			ПредыдущаяДатаНачалаДоступаКЗаданию = СтрокаЭЗ.ДатаНачалаДоступаКЗаданию;
			ПредыдущаяДатаОкончанияДоступаКЗаданию = СтрокаЭЗ.ДатаОкончанияДоступаКЗаданию;
			
			Если ЗначениеЗаполнено(Текст) Тогда
				Поле = "ЭлектронныеЗадания";
	            ОбщегоНазначенияКлиент.СообщитьПользователю(Текст,, Поле + "[" + Строка(ЭлектронныеЗадания.Индекс(СтрокаЭЗ)) + "].ПродолжительностьСтрока",,Отказ);
				Возврат;				
			КонецЕсли;
			
		КонецЦикла;			
			
	КонецЕсли;	
	
	ТекстВопроса = "";
	
	УправлениеОбучениемСУОКлиент.ВыполнитьПроверкуКорректностиДатПроведенияОбучения(
		ТекстВопроса, Отказ, Объект.Статус, Объект.ДатаОкончанияПроведения, Объект.ДатаКонтроля, Объект.ДатаНачалаДоступа, Объект.ДатаНачалаПроведения);	
		
	// Отменено
	
	Если НЕ Объект.Ссылка.Пустая()
		И Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроведенияОбъектовСУО.Отменено")
		И ЕстьАктивныеУчастники(Объект.Ссылка) Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Есть участники, которые уже начали обучение. Продолжить?'");		
	КонецЕсли;
	
	// Активировать автоматически
	
	Если Объект.АктивироватьАвтоматически
		И НЕ ЗначениеЗаполнено(Объект.ДатаНачалаДоступа) 
		И НЕ ЗначениеЗаполнено(Объект.ДатаНачалаПроведения) Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Обучение не будет активировано автоматически, так как не указана дата начала обучения. Продолжить?'");
	КонецЕсли;

	// Не включено задание
	
	Если Объект.АктивироватьАвтоматически И НЕ РегламентноеЗаданиеАктивацияПроведенийОбученияВключено Тогда
		ЗаполнитьРегламентныеЗаданияАктивацияПроведенийОбученияВключено(); // Проверяем, не включилось ли задание
	КонецЕсли;
	
	Если Объект.АктивироватьАвтоматически И НЕ РегламентноеЗаданиеАктивацияПроведенийОбученияВключено Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Обучение не будет активировано автоматически, так как требуется включить регламентное задание ""Активация проведений обучения"". Продолжить?'");
	КонецЕсли;
	
	Если ТребуетсяПреподаватель 
		И ЗначениеЗаполнено(Объект.Ссылка)		
		И Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроведенияОбъектовСУО.Активно")
		И НЕ ЕстьПреподаватели(Объект.Ссылка) Тогда
		
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Преподаватели не назначены. Продолжить?'");
		
	КонецЕсли;
	
	// Выводим сообщение
	
	Если Отказ Тогда
		ПараметрыВопросаПродолжение = Новый Структура;
		ПараметрыВопросаПродолжение.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
		ПараметрыВопросаПродолжение.Вставить("ЗакрытьФорму", ЗакрытьФорму);
		Оповещение = Новый ОписаниеОповещения("ВыполнитьПроверкуПередЗаписьюПродолжение", ЭтотОбъект, ПараметрыВопросаПродолжение);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0);				
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРегламентныеЗаданияАктивацияПроведенийОбученияВключено()
	УстановитьПривилегированныйРежим(Истина);
	РегламентноеЗаданиеАктивацияПроведенийОбученияВключено = РегламентныеЗаданияСервер.РегламентноеЗаданиеИспользуется(Метаданные.РегламентныеЗадания.АктивацияПроведенийОбученияСУО);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкуПередЗаписьюПродолжение(Результат, ПараметрыВопросаПродолжение) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ВыполняетсяЗапись = Ложь;
		ВыполняетсяЗакрытие = Ложь;
        Возврат;
    КонецЕсли;

    ВыполняетсяЗапись = Истина;
	Если ПараметрыВопросаПродолжение.ЗакрытьФорму Тогда
		ВыполняетсяЗакрытие = Истина;
	КонецЕсли;

	Записать(ПараметрыВопросаПродолжение.ПараметрыЗаписи);
	Если ПараметрыВопросаПродолжение.ЗакрытьФорму Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьПреподаватели(ПроведениеОбучения)
	Возврат Документы.ПроведениеОбученияСУО.ПреподавательНазначен(ПроведениеОбучения);
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьАктивныеУчастники(ПроведениеОбучения)
	Возврат Документы.ПроведениеОбученияСУО.ЕстьУчастникОбучения(ПроведениеОбучения,,,Перечисления.СтатусыПрохожденияОбъектовСУО.Проходит);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОпределитьЗаданыОграниченияНаЗапись(Форма)
	
	Форма.ЗаданыОграниченияНаЗапись = Ложь;
	
	Если ЗначениеЗаполнено(Форма.Объект.ДатаОткрытияЗаписи) Тогда
		Форма.ЗаданыОграниченияНаЗапись = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Форма.Объект.ДатаЗакрытияЗаписи) Тогда
		Форма.ЗаданыОграниченияНаЗапись = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Форма.Объект.МаксимальноеКоличествоУчастников) Тогда
		Форма.ЗаданыОграниченияНаЗапись = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОпределитьЗаданФильтрПоДатеПриемаСотрудника(Форма)
	
	Форма.ЗаданФильтрПоДатеПриемаСотрудника = ЗначениеЗаполнено(Форма.Объект.ФильтрПоДатеПриемаНаРаботу);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТолькоПросмотрФормы(Статус, Форма)
	
	Возврат Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроведенияОбъектовСУО.Завершено")
		ИЛИ Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроведенияОбъектовСУО.Отменено")
		ИЛИ Форма.ТолькоПросмотр
		
КонецФункции

&НаСервереБезКонтекста
Процедура ПерепровестиДокументВФоне(ПроведениеОбучения)
	
	РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(ПроведениеОбучения);
	
КонецПроцедуры

// Электронные задания

&НаКлиенте
Процедура ДобавитьНовоеЭлектронноеЗаданиеПродолжение(ДанныеВыбора, ДополнительныеПараметры) Экспорт
		
	ВыбранныеЗадание = Неопределено;
	Если ТипЗнч(ДанныеВыбора) = Тип("Массив") Тогда
		ВыбранныеЗадание = ДанныеВыбора;
	Иначе
		ВыбранныеЗадание = Новый Массив;
		ВыбранныеЗадание.Добавить(ДанныеВыбора);
	КонецЕсли;
	
	Для каждого ВыбранноеЗадание Из ВыбранныеЗадание Цикл
		
		Если ТипЗнч(ВыбранноеЗадание) = Тип("СправочникСсылка.УчебныеМатериалыСУО") Тогда
			ВыбранноеЗадание = ХранениеУчебногоМатериала(ВыбранноеЗадание);
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(ВыбранноеЗадание) Тогда
			Продолжить;
		КонецЕсли;	
		
		СтрокиСТакимЗаданием = ЭлектронныеЗадания.НайтиСтроки(Новый Структура("Задание", ВыбранноеЗадание));
		
		Если СтрокиСТакимЗаданием.Количество() <> 0 Тогда
			Продолжить;										
		КонецЕсли;		
		
		ДанныеСтрокиПоУмолчанию = ДанныеЭлектронногоЗаданияПоУмолчанию(ВыбранноеЗадание, Объект.Ссылка, Неопределено, ИспользоватьВстроенныйПлеерКурсовВебКабинета);		
		НоваяСтрокаТЗ = ЭлектронныеЗадания.Добавить();
		НоваяСтрокаТЗ.Задание = ВыбранноеЗадание;		
		НоваяСтрокаТЗ.Тип = ДанныеСтрокиПоУмолчанию.Тип;
		НоваяСтрокаТЗ.Наименование = ДанныеСтрокиПоУмолчанию.Наименование;		
		Если ДанныеСтрокиПоУмолчанию.ЭтоАнкетирование Тогда
			НоваяСтрокаТЗ.Вес = 0;
		Иначе
			НоваяСтрокаТЗ.Вес = 1;
		КонецЕсли;		
		НоваяСтрокаТЗ.ЭтоАнкетирование = ДанныеСтрокиПоУмолчанию.ЭтоАнкетирование;
		НоваяСтрокаТЗ.НеЖдатьПроверки = Ложь;
		НоваяСтрокаТЗ.НеЖдатьПроверкиВсегдаИстина = Истина;
		НоваяСтрокаТЗ.ПлеерВебКабинета = ДанныеСтрокиПоУмолчанию.ПлеерВебКабинета;
		НоваяСтрокаТЗ.ДоступенВыборПлеераВебКабинета = ДанныеСтрокиПоУмолчанию.ДоступенВыборПлеераВебКабинета;		
		НоваяСтрокаТЗ.ПроходнойБаллНеДействует = ПроходнойБаллНеДействует(НоваяСтрокаТЗ.Задание, НоваяСтрокаТЗ.НеЖдатьПроверки, ЗаданияПроверяютсяВыборочно);
		НоваяСтрокаТЗ.ЭтоЭлектронныйРесурс = ?(ТипЗнч(НоваяСтрокаТЗ.Задание) = Тип("СправочникСсылка.СводыЗнанийСУЗ"), Истина, Ложь);
		НоваяСтрокаТЗ.ЭтоТест = ДанныеСтрокиПоУмолчанию.ЭтоТест;
		
		Если Объект.Ссылка.Пустая() И ЭлектронныеЗадания.Количество() = 1 И НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
			Объект.Наименование = ЭлектронныеЗадания[0].Наименование;
		КонецЕсли;
		
		Модифицированность = Истина;
		
	КонецЦикла;
		
	УстановитьВидимостьЭлементовЗакладкиЗаданий(ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ХранениеУчебногоМатериала(Знач УчебныйМатериал)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчебныйМатериал, "Хранение");
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИспользоватьТаблицуЗаданий(Форма, ТекущийОбъект)
	
	Если ТекущийОбъект.НаОсновеМероприятия ИЛИ ТекущийОбъект.НаОсновеЭлектронногоРесурса Тогда		
		Возврат Ложь;		
	КонецЕсли;
	
	Возврат ЭтоЭлектронноеОбучение(ТекущийОбъект, ТекущийОбъект.ВидОбучения);
	
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоЭлектронноеОбучение(Знач Объект, Знач ВидОбучения)
	Возврат Документы.ПроведениеОбученияСУО.ЭтоЭлектронноеОбучение(Объект, ВидОбучения);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовЗакладкиЗаданий(Форма)
	КоличествоЗаданий = Форма.ЭлектронныеЗадания.Количество();
	Форма.Элементы.ПоследовательноеПрохождениеЗаданий.Видимость = ?(КоличествоЗаданий > 1, Истина, Ложь);
	Форма.Элементы.ЭлектронныеЗаданияНаименование.Видимость = ?(КоличествоЗаданий > 1, Истина, Ложь);
	Форма.Элементы.ЭлектронныеЗаданияВес.Видимость = ?(КоличествоЗаданий > 1 И НЕ Форма.Объект.ЗагруженоИзУУЦ, Истина, Ложь);	
	Форма.Элементы.ЭлектронныеЗаданияНеЖдатьПроверки.Видимость = НЕ Форма.ЗаданияПроверяютсяВыборочно И Форма.ТребуетсяПреподаватель;
	Форма.Элементы.ЭлектронныеЗаданияНеЖдатьПроверкиВсегдаИстина.Видимость = Форма.ЗаданияПроверяютсяВыборочно И Форма.ТребуетсяПреподаватель;
	Форма.Элементы.ЭлектронныеЗаданияПродолжительностьСтрока.Видимость = РазрешеноУстановливатьДатыДоступаЗаданий(Форма);
	Форма.Участники.Параметры.УстановитьЗначениеПараметра("УстановленыДатыДоступаЗаданий", УстановленыДатыДоступаЗаданий(Форма));
	
	#Если Клиент Тогда
	Для каждого СтрокаТЭЗ Из Форма.ЭлектронныеЗадания Цикл
		СтрокаТЭЗ.ЭтоЭлектронныйРесурс = ?(ТипЗнч(СтрокаТЭЗ.Задание) = Тип("СправочникСсылка.СводыЗнанийСУЗ"), Истина, Ложь);
	КонецЦикла;
	#КонецЕсли

	#Если Сервер Тогда		
	Для каждого СтрокаТЭЗ Из Форма.ЭлектронныеЗадания Цикл
		ДанныеСтрокиПоУмолчанию = ДанныеЭлектронногоЗаданияПоУмолчанию(СтрокаТЭЗ.Задание, Форма.Объект.Ссылка, СтрокаТЭЗ.ПлеерВебКабинета, Форма.ИспользоватьВстроенныйПлеерКурсовВебКабинета);
		СтрокаТЭЗ.ЭтоТест = ДанныеСтрокиПоУмолчанию.ЭтоТест;
		СтрокаТЭЗ.ЭтоАнкетирование = ДанныеСтрокиПоУмолчанию.ЭтоАнкетирование;
		СтрокаТЭЗ.ЭтоЭлектронныйРесурс = ?(ТипЗнч(СтрокаТЭЗ.Задание) = Тип("СправочникСсылка.СводыЗнанийСУЗ"), Истина, Ложь);
	КонецЦикла;		
	#КонецЕсли

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РазрешеноУстановливатьДатыДоступаЗаданий(Форма)
	Возврат Форма.ЭлектронныеЗадания.Количество() > 1
		И (Форма.Объект.ВариантПродолжительности = ПредопределенноеЗначение("Перечисление.ПродолжительностьОбученияСУО.НеЗадана")
		ИЛИ Форма.Объект.ВариантПродолжительности = ПредопределенноеЗначение("Перечисление.ПродолжительностьОбученияСУО.Фиксированная"));
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция УстановленыДатыДоступаЗаданий(Форма)
	Если НЕ РазрешеноУстановливатьДатыДоступаЗаданий(Форма) Тогда
		Возврат Ложь;
	КонецЕсли;
	Для каждого СтрокаТЗ Из Форма.ЭлектронныеЗадания Цикл
	
		Если ЗначениеЗаполнено(СтрокаТЗ.ДатаНачалаДоступаКЗаданию) Тогда
			Возврат Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТЗ.ДатаОкончанияДоступаКЗаданию) Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПроходнойБаллНеДействует(ЗаданиеСтроки, НеЖдатьПроверкиСтроки, ЗаданияПроверяютсяВыборочно)
	
	Возврат ЗаданияПроверяютсяВыборочно ИЛИ НеЖдатьПроверкиСтроки;
				
КонецФункции

&НаКлиенте
Процедура УстановитьРеквизитыПоУмолчаниюТаблицыЭлектронныеЗадания()
	
	Для каждого СтрокаТаблицы Из ЭлектронныеЗадания Цикл
		ДанныеСтрокиПоУмолчанию = ДанныеЭлектронногоЗаданияПоУмолчанию(СтрокаТаблицы.Задание, Объект.Ссылка, СтрокаТаблицы.ПлеерВебКабинета, ИспользоватьВстроенныйПлеерКурсовВебКабинета);
	 	СтрокаТаблицы.Тип = ДанныеСтрокиПоУмолчанию.Тип;
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Наименование) Тогда
			СтрокаТаблицы.Наименование = ДанныеСтрокиПоУмолчанию.Наименование;
		КонецЕсли;
		СтрокаТаблицы.ПроходнойБаллНеДействует = ПроходнойБаллНеДействует(СтрокаТаблицы.Задание, СтрокаТаблицы.НеЖдатьПроверки, ЗаданияПроверяютсяВыборочно);
		Если СтрокаТаблицы.ПроходнойБаллНеДействует Тогда
			СтрокаТаблицы.ПроходнойБалл = 0;
		КонецЕсли;
		СтрокаТаблицы.ДоступенВыборПлеераВебКабинета = ДанныеСтрокиПоУмолчанию.ДоступенВыборПлеераВебКабинета;
	 КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьТаблицуЗаданий(Форма, ТекущийОбъект)
	
	Если НЕ ИспользоватьТаблицуЗаданий(Форма, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
	ЗаданияПроверяютсяВыборочно = Форма.ЗаданияПроверяютсяВыборочно;
	ШкалаОценок = Форма.ШкалаОценок;
	#Иначе
	ЗаданияПроверяютсяВыборочно = Документы.ПроведениеОбученияСУО.ВидОбучения(ТекущийОбъект).ЗаданияПроверяютсяВыборочно;
	ШкалаОценок = Документы.ПроведениеОбученияСУО.ШкалаОценки(ТекущийОбъект);
	#КонецЕсли
	
	Форма.ЭлектронныеЗадания.Очистить();
	
	Если ЗначениеЗаполнено(ТекущийОбъект.ЭлектронныйРесурс) Тогда
		
		НоваяСтрока = Форма.ЭлектронныеЗадания.Добавить();
		НоваяСтрока.Задание = ТекущийОбъект.ЭлектронныйРесурс;
		НоваяСтрока.Вес = 1;
		Если ЗначениеЗаполнено(ТекущийОбъект.ПлеерВебКабинета) Тогда
			НоваяСтрока.ПлеерВебКабинета = ТекущийОбъект.ПлеерВебКабинета;
		Иначе
			НоваяСтрока.ПлеерВебКабинета = ПредопределенноеЗначение("Перечисление.ПлеерыКурсовВебКабинетаСУЗ.Автономный");
		КонецЕсли;
		ДанныеСтрокиПоУмолчанию = ДанныеЭлектронногоЗаданияПоУмолчанию(НоваяСтрока.Задание, ТекущийОбъект.Ссылка, НоваяСтрока.ПлеерВебКабинета, Форма.ИспользоватьВстроенныйПлеерКурсовВебКабинета);
	 	НоваяСтрока.Тип = ДанныеСтрокиПоУмолчанию.Тип;
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.Наименование) Тогда
			НоваяСтрока.Наименование = ДанныеСтрокиПоУмолчанию.Наименование;
		КонецЕсли;		
			
	Иначе
		
		Для каждого СтрокаТЧ Из ТекущийОбъект.ЭлектронныеЗадания Цикл
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Задание) Тогда
				Продолжить;
			КонецЕсли;
			
			НайденныеСтроки = Форма.ЭлектронныеЗадания.НайтиСтроки(Новый Структура("Задание", СтрокаТЧ.Задание));
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Форма.ЭлектронныеЗадания.Добавить();
			НоваяСтрока.Задание = СтрокаТЧ.Задание;			
			НоваяСтрока.Вес = СтрокаТЧ.Вес;
			НоваяСтрока.Наименование = СтрокаТЧ.Наименование;
			ДанныеСтрокиПоУмолчанию = ДанныеЭлектронногоЗаданияПоУмолчанию(НоваяСтрока.Задание, ТекущийОбъект.Ссылка, НоваяСтрока.ПлеерВебКабинета, Форма.ИспользоватьВстроенныйПлеерКурсовВебКабинета);
			Если ЗначениеЗаполнено(СтрокаТЧ.ПлеерВебКабинета) Тогда
				НоваяСтрока.ПлеерВебКабинета = СтрокаТЧ.ПлеерВебКабинета;
			Иначе
				НоваяСтрока.ПлеерВебКабинета = ДанныеСтрокиПоУмолчанию.ПлеерВебКабинета;
			КонецЕсли;			
			НоваяСтрока.ДоступенВыборПлеераВебКабинета = ДанныеСтрокиПоУмолчанию.ДоступенВыборПлеераВебКабинета;
		 	НоваяСтрока.Тип = ДанныеСтрокиПоУмолчанию.Тип;
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.Наименование) Тогда
				НоваяСтрока.Наименование = ДанныеСтрокиПоУмолчанию.Наименование;
			КонецЕсли;			
			НоваяСтрока.ПроходнойБалл = СтрокаТЧ.ПроходнойБалл;						
			НоваяСтрока.ЭтоАнкетирование = ДанныеСтрокиПоУмолчанию.ЭтоАнкетирование;
			НоваяСтрока.НеЖдатьПроверки = СтрокаТЧ.НеЖдатьПроверки;						
			НоваяСтрока.НеЖдатьПроверкиВсегдаИстина = Истина;			
			НоваяСтрока.ПроходнойБаллНеДействует = ПроходнойБаллНеДействует(НоваяСтрока.Задание, НоваяСтрока.НеЖдатьПроверки, ЗаданияПроверяютсяВыборочно);
			НоваяСтрока.ДатаНачалаДоступаКЗаданию = СтрокаТЧ.ДатаНачалаДоступаКЗаданию;
			НоваяСтрока.ДатаОкончанияДоступаКЗаданию = СтрокаТЧ.ДатаОкончанияДоступаКЗаданию;
			НоваяСтрока.СкрытьВремяДоступаКЗаданию = СтрокаТЧ.СкрытьВремяДоступаКЗаданию;			
			НоваяСтрока.ПродолжительностьСтрока = ОбщегоНазначенияСУКлиентСервер.ПериодВСтроку(
				СтрокаТЧ.ДатаНачалаДоступаКЗаданию, СтрокаТЧ.ДатаОкончанияДоступаКЗаданию, СтрокаТЧ.СкрытьВремяДоступаКЗаданию);				
			НоваяСтрока.ЭтоЭлектронныйРесурс = ?(ТипЗнч(НоваяСтрока.Задание) = Тип("СправочникСсылка.СводыЗнанийСУЗ"), Истина, Ложь);
			НоваяСтрока.ПриОтсутствииОценкиЗаЗадание = СтрокаТЧ.ПриОтсутствииОценкиЗаЗадание;
			НоваяСтрока.ЭтоТест = ДанныеСтрокиПоУмолчанию.ЭтоТест;
			
		КонецЦикла;		
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьТаблицуЗаданий(ТекущийОбъект, Отказ)
	
	Если НЕ ИспользоватьТаблицуЗаданий(ЭтотОбъект, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Делаем проверки
	
	Если ОбщегоНазначенияСУКлиентСервер.ЕстьСовпаденияВКоллекцииЗначений(ЭлектронныеЗадания, "Задание", Истина) Тогда
		Текст = НСтр("ru = 'Таблица электронных заданий не может содержать одинаковые элементы.'");
		Поле = "ЭлектронныеЗадания";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ТекущийОбъект, Поле,, Отказ);
		Возврат;
	КонецЕсли;
	
	// Заполняем
	
	ТекущийОбъект.ЭлектронныеЗадания.Очистить();
			
	ТекущийОбъект.ЭлектронныйРесурс = Неопределено;
	
	Для каждого СтрокаТаблицы Из ЭлектронныеЗадания Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Задание) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТекущийОбъект.ЭлектронныеЗадания.Добавить();
		НоваяСтрока.Задание = СтрокаТаблицы.Задание;			
		НоваяСтрока.Наименование = СтрокаТаблицы.Наименование;
		НоваяСтрока.Вес = СтрокаТаблицы.Вес;
		НоваяСтрока.ПроходнойБалл = СтрокаТаблицы.ПроходнойБалл;
		НоваяСтрока.НеЖдатьПроверки = СтрокаТаблицы.НеЖдатьПроверки;
		НоваяСтрока.ПлеерВебКабинета = СтрокаТаблицы.ПлеерВебКабинета;
		НоваяСтрока.ДатаНачалаДоступаКЗаданию = СтрокаТаблицы.ДатаНачалаДоступаКЗаданию;
		НоваяСтрока.ДатаОкончанияДоступаКЗаданию = СтрокаТаблицы.ДатаОкончанияДоступаКЗаданию;
		НоваяСтрока.СкрытьВремяДоступаКЗаданию = СтрокаТаблицы.СкрытьВремяДоступаКЗаданию;
		НоваяСтрока.ПриОтсутствииОценкиЗаЗадание = СтрокаТаблицы.ПриОтсутствииОценкиЗаЗадание;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДанныеЭлектронногоЗаданияПоУмолчанию(Знач Задание, Знач ПроведениеОбучения, Знач ПлеерВебКабинета, Знач ИспользоватьВстроенныйПлеерКурсовВебКабинета)
	
	ДанныеИзБД = ДанныеЭлектронногоРесурсаИзБД(Задание, ПроведениеОбучения, ПлеерВебКабинета, ИспользоватьВстроенныйПлеерКурсовВебКабинета);
	ДанныеПоУмолчанию = Новый Структура("Наименование, Тип, ЭтоАнкетирование, ПлеерВебКабинета, ДоступенВыборПлеераВебКабинета, ЭтоТест");
	
	ДанныеПоУмолчанию.ЭтоТест                        = Ложь;
	ДанныеПоУмолчанию.ЭтоАнкетирование               = ДанныеИзБД.ЭтоАнкетирование;
	ДанныеПоУмолчанию.ПлеерВебКабинета               = ДанныеИзБД.ПлеерВебКабинета;
	ДанныеПоУмолчанию.ДоступенВыборПлеераВебКабинета = ДанныеИзБД.ДоступенВыборПлеераВебКабинета;
	
	Если ТипЗнч(Задание) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
		Если ДанныеИзБД.Тип = ПредопределенноеЗначение("Перечисление.ТипыЭлектронныхРесурсовСУЗ.Тест") Тогда
			ДанныеПоУмолчанию.ЭтоТест = Истина;
			Если ДанныеИзБД.ЭтоАнкетирование Тогда
				ДанныеПоУмолчанию.Тип = НСтр("ru = 'Электронная анкета'");
				ДанныеПоУмолчанию.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Заполните анкету ""%1""'"), ДанныеИзБД.Наименование);				
			Иначе
				ДанныеПоУмолчанию.Тип = НСтр("ru = 'Электронный тест'");
				ДанныеПоУмолчанию.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Пройдите электронный тест ""%1""'"), ДанныеИзБД.Наименование);	
			КонецЕсли;
		Иначе
			ДанныеПоУмолчанию.Тип = НСтр("ru = 'Электронный курс'");
			ДанныеПоУмолчанию.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Изучите электронный курс ""%1""'"), ДанныеИзБД.Наименование);
		КонецЕсли;	
	ИначеЕсли ТипЗнч(Задание) = Тип("СправочникСсылка.ЭлектронныеКурсы") Тогда
		Если ДанныеИзБД.Тип = ПредопределенноеЗначение("Перечисление.ТипыЭлектронныхКурсов.SCORM") Тогда
			ДанныеПоУмолчанию.Тип = НСтр("ru = 'Электронный курс'");
			ДанныеПоУмолчанию.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Пройдите электронный курс ""%1""'"), ДанныеИзБД.Наименование);
		КонецЕсли;		
		Если ДанныеИзБД.Тип = ПредопределенноеЗначение("Перечисление.ТипыЭлектронныхКурсов.Слайдовый") Тогда
			ДанныеПоУмолчанию.Тип = НСтр("ru = 'Электронный курс'");
			ДанныеПоУмолчанию.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Пройдите электронный курс ""%1""'"), ДанныеИзБД.Наименование);
		КонецЕсли;		
		Если ДанныеИзБД.Тип = ПредопределенноеЗначение("Перечисление.ТипыЭлектронныхКурсов.Тест") Тогда
			ДанныеПоУмолчанию.ЭтоТест = Истина;
			ДанныеПоУмолчанию.Тип = НСтр("ru = 'Электронный тест'");
			ДанныеПоУмолчанию.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Пройдите электронный тест ""%1""'"), ДанныеИзБД.Наименование);
		КонецЕсли;		
		Если ДанныеИзБД.Тип = ПредопределенноеЗначение("Перечисление.ТипыЭлектронныхКурсов.Учебник") Тогда
			ДанныеПоУмолчанию.Тип = НСтр("ru = 'Электронный учебник'");
			ДанныеПоУмолчанию.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Изучите электронный учебник ""%1""'"), ДанныеИзБД.Наименование);
		КонецЕсли;
	ИначеЕсли ТипЗнч(Задание) = Тип("СправочникСсылка.ЗаданияСУО") Тогда
		ДанныеПоУмолчанию.Тип = НСтр("ru = 'Задание на проверку'");
		ДанныеПоУмолчанию.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Выполните задание ""%1"" и сдайте его на проверку'"), ДанныеИзБД.Наименование);
	КонецЕсли;
	
	Возврат ДанныеПоУмолчанию;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеЭлектронногоРесурсаИзБД(Знач Задание, Знач ПроведениеОбучения, Знач ПлеерВебКабинета, Знач ИспользоватьВстроенныйПлеерКурсовВебКабинета)
	
	Если ТипЗнч(Задание) = Тип("СправочникСсылка.СводыЗнанийСУЗ")
		ИЛИ ТипЗнч(Задание) = Тип("СправочникСсылка.ЭлектронныеКурсы") Тогда		
		ДанныеЭлектронногоРесурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Задание, "Тип, Наименование");		
	Иначе
		ДанныеЭлектронногоРесурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Задание, "Наименование");
	КонецЕсли;
	
	ДанныеЭлектронногоРесурса.Вставить("ЭтоАнкетирование", Ложь);	
	ДанныеЭлектронногоРесурса.Вставить("ПлеерВебКабинета", ПлеерВебКабинета);
	ДанныеЭлектронногоРесурса.Вставить("ДоступенВыборПлеераВебКабинета", Ложь);
	
	Если ТипЗнч(Задание) = Тип("СправочникСсылка.ЗаданияСУО") Тогда
		ДанныеЭлектронногоРесурса.ПлеерВебКабинета = Неопределено;	
	КонецЕсли;
	
	Если ТипЗнч(Задание) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
		ЕдинственныйТест = Справочники.СводыЗнанийСУЗ.Тест(Задание);
		Если ЗначениеЗаполнено(ЕдинственныйТест) Тогда
			ТипТеста = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЕдинственныйТест, "НазначениеТестирования"); 
			Если ТипТеста = Перечисления.НазначенияТестированийСУЗ.Анкетирование Тогда
				ДанныеЭлектронногоРесурса.Вставить("ЭтоАнкетирование", Истина);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Задание) = Тип("СправочникСсылка.СводыЗнанийСУЗ")
		И ИспользоватьВстроенныйПлеерКурсовВебКабинета Тогда				
		ЗаполнитьДанныеПлеераВебКабинета(ДанныеЭлектронногоРесурса, Задание, Истина, ПроведениеОбучения);						
	КонецЕсли;
	
	Если ТипЗнч(Задание) = Тип("СправочникСсылка.ЭлектронныеКурсы") Тогда
		ДанныеЭлектронногоРесурса.ПлеерВебКабинета = Перечисления.ПлеерыКурсовВебКабинетаСУЗ.Встроенный;
	КонецЕсли;
	
	Возврат ДанныеЭлектронногоРесурса;
	
КонецФункции

// Ресурсы

&НаКлиенте
Процедура ПриНачалеРедактированияТаблицДопМатериалов(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И НЕ Копирование И Элемент.ТекущиеДанные <> Неопределено Тогда
		Элемент.ТекущиеДанные.ПоказатьПриСтатусеЗапланировано = Ложь;
		Элемент.ТекущиеДанные.ПоказатьПриСтатусеАктивно = Истина;
		Элемент.ТекущиеДанные.ПоказатьПриСтатусеЗавершено = Истина;
	КонецЕсли;		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеСтрокиТаблицыЭлектронныхРесурсов(Знач ЭлектронныйРесурс, Знач ПлеерВебКабинета)
	
	ДанныеСтрокиПоУмолчанию = Новый Структура("ПлеерВебКабинета, ДоступенВыборПлеераВебКабинета", ПлеерВебКабинета, Ложь);
	
	ЗаполнитьДанныеПлеераВебКабинета(ДанныеСтрокиПоУмолчанию, ЭлектронныйРесурс, Ложь);
		
	Возврат ДанныеСтрокиПоУмолчанию;	
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеПлеераЕдинственногоЭлектронногоРесурса(Знач ЭлектронныйРесурс, Знач ПроведениеОбучения)
	
	ДанныеПоУмолчанию = Новый Структура("ПлеерВебКабинета, ДоступенВыборПлеераВебКабинета", Неопределено, Ложь);
	
	ЗаполнитьДанныеПлеераВебКабинета(ДанныеПоУмолчанию, ЭлектронныйРесурс, Истина, ПроведениеОбучения);
		
	Возврат ДанныеПоУмолчанию;	
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьДанныеПлеераВебКабинета(ДанныеСтрокиПоУмолчанию, Знач ЭлектронныйРесурс, Знач ЭтоЗадание, Знач ПроведениеОбучения = Неопределено)
	
	// Устанавливаем плеер
	
	ПлеерВебКабинетаПоУмолчанию = РегистрыСведений.ПлеерКурсовВебКабинетаСУЗ.Плеер(ЭлектронныйРесурс);
	
	Если НЕ ЗначениеЗаполнено(ДанныеСтрокиПоУмолчанию.ПлеерВебКабинета) Тогда
		ДанныеСтрокиПоУмолчанию.ПлеерВебКабинета = ПлеерВебКабинетаПоУмолчанию;
	КонецЕсли;
	
	// Определяем возможность выбора плеера
	
	Если ПлеерВебКабинетаПоУмолчанию = Перечисления.ПлеерыКурсовВебКабинетаСУЗ.Автономный Тогда
		Возврат; // Нельзя выбирать встроенный
	КонецЕсли;
	
	Если ЭтоЗадание И ЗначениеЗаполнено(ПроведениеОбучения) Тогда
		Если ДанныеСтрокиПоУмолчанию.ПлеерВебКабинета = Перечисления.ПлеерыКурсовВебКабинетаСУЗ.Встроенный Тогда
			ЕстьПрохожденияВоВстроенномПлеере = РегистрыСведений.ПрохожденияЭлектронныхРесурсовСУЗ.ЕстьПрохожденияВПлеереВебКабинета(
				ПроведениеОбучения, ЭлектронныйРесурс, Перечисления.ПлеерыКурсовВебКабинетаСУЗ.Встроенный);
			Если НЕ ЕстьПрохожденияВоВстроенномПлеере Тогда
				ДанныеСтрокиПоУмолчанию.ДоступенВыборПлеераВебКабинета = Истина;	
			КонецЕсли;			
		КонецЕсли;
		Если ДанныеСтрокиПоУмолчанию.ПлеерВебКабинета = Перечисления.ПлеерыКурсовВебКабинетаСУЗ.Автономный Тогда
			ЕстьПрохожденияВАвтономномПлеере = РегистрыСведений.ПрохожденияЭлектронныхРесурсовСУЗ.ЕстьПрохожденияВПлеереВебКабинета(
				ПроведениеОбучения, ЭлектронныйРесурс, Перечисления.ПлеерыКурсовВебКабинетаСУЗ.Автономный);
			Если НЕ ЕстьПрохожденияВАвтономномПлеере Тогда
				ДанныеСтрокиПоУмолчанию.ДоступенВыборПлеераВебКабинета = Истина;	
			КонецЕсли;						
		КонецЕсли;
	Иначе
		// Разрешаем смену плеера в дополнительных материалах, так как там данные изучения не важны
		ДанныеСтрокиПоУмолчанию.ДоступенВыборПлеераВебКабинета = Истина;	
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьЭлектронныеРесурсы()
	
	Если НЕ ИспользоватьВстроенныйПлеерКурсовВебКабинета Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из Объект.ЭлектронныеРесурсы Цикл	
		ДанныеСтрокиПоУмолчанию = ДанныеСтрокиТаблицыЭлектронныхРесурсов(СтрокаТЧ.ЭлектронныйРесурс, СтрокаТЧ.ПлеерВебКабинета);
	    СтрокаТЧ.ПлеерВебКабинета = ДанныеСтрокиПоУмолчанию.ПлеерВебКабинета;
		СтрокаТЧ.ДоступенВыборПлеераВебКабинета = ДанныеСтрокиПоУмолчанию.ДоступенВыборПлеераВебКабинета;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РесурсыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Поле = Элемент.Имя;
	ТекстСообщения = "";
	ИмяРеквизита = "";
	
	Если НЕ Элемент.ТекущиеДанные.ПоказатьПриСтатусеЗапланировано
		И НЕ Элемент.ТекущиеДанные.ПоказатьПриСтатусеАктивно
		И НЕ Элемент.ТекущиеДанные.ПоказатьПриСтатусеЗавершено Тогда
				
		ТекстСообщения = НСтр("ru = 'Укажите, при каких статусах Проведения обучения показывать ресурс'");
		ИмяРеквизита = "ПоказатьПриСтатусеЗавершено";
		
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные.ПоказатьПриСтатусеЗапланировано
		И НЕ Элемент.ТекущиеДанные.ПоказатьПриСтатусеАктивно
		И НЕ Элемент.ТекущиеДанные.ПоказатьПриСтатусеЗавершено
		И Элемент.ТекущиеДанные.ПоказатьПослеПрохождения Тогда
		
		ТекстСообщения = НСтр("ru = 'Флажок не может быть установлен, когда ресурс показывается только при статусе Запланировано'");
		ИмяРеквизита = "ПоказатьПослеПрохождения";
			
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстСообщения) И ЗначениеЗаполнено(ИмяРеквизита) Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			,
			Поле + "["+ ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(Элемент.ТекущаяСтрока) +"]." + ИмяРеквизита,
			"Объект");
	
	КонецЕсли;
			
	
КонецПроцедуры

&НаСервере
Функция ИменаТабличныхЧастейРесурсов()
	
	ИменаТабличныхЧастейРесурсов = Новый Массив;
	ИменаТабличныхЧастейРесурсов.Добавить("Книги");
	ИменаТабличныхЧастейРесурсов.Добавить("ЭлектронныеРесурсы");
	ИменаТабличныхЧастейРесурсов.Добавить("Файлы");
	
	Возврат ИменаТабличныхЧастейРесурсов;
	
КонецФункции

&НаСервере
Процедура УстановитьДатуИзмененияРесурсовПриСозданииФормы()
	
	УстановитьДатуИзмененияРесурсов(Объект, Объект.Дата);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДатуИзмененияРесурсовПередЗаписью(ТекущийОбъект)
	
	УстановитьДатуИзмененияРесурсов(ТекущийОбъект, ТекущаяДатаСеанса());
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДатуИзмененияРесурсов(ОбъектДляИзменения, Знач ДатаДляУстановки)
	
	ТабличныеЧастиРесурсов = ИменаТабличныхЧастейРесурсов();
	
	Для каждого ИмяТабличнойЧасти Из ТабличныеЧастиРесурсов Цикл
	
		Для каждого СтрокаТЧ Из ОбъектДляИзменения[ИмяТабличнойЧасти] Цикл
		
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ДатаИзменения) Тогда
				СтрокаТЧ.ДатаИзменения = ДатаДляУстановки;
			КонецЕсли;
		
		КонецЦикла;	
	
	КонецЦикла;
	
КонецПроцедуры

// Участники

&НаКлиенте
Процедура ЗапуститьОбновлениеДанныхУчастников()
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	Элементы.УчастникиСтатусПроцессаОбучения.Заголовок = НСтр("ru = 'Статус (обновляется)'");
	Элементы.УчастникиСтатусПроцессаОбучения.ЦветФонаЗаголовка = Новый Цвет(250, 204, 31);
	ПодключитьОбработчикОжидания("Подключаемый_ИдетОбновлениеДанныхУчастников", 2, Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ИдетОбновлениеДанныхУчастников()
	Если ЕстьДанныеУчастниковДляОбновления(Объект.Ссылка) Тогда
		Элементы.УчастникиСтатусПроцессаОбучения.Заголовок = НСтр("ru = 'Статус (обновляется)'");
		Элементы.УчастникиСтатусПроцессаОбучения.ЦветФонаЗаголовка = Новый Цвет(250, 204, 31);
	Иначе
		ОтключитьОбработчикОжидания("Подключаемый_ИдетОбновлениеДанныхУчастников");
		Элементы.УчастникиСтатусПроцессаОбучения.Заголовок = НСтр("ru = 'Статус'");		
		Элементы.УчастникиСтатусПроцессаОбучения.ЦветФонаЗаголовка = Новый Цвет();
		Элементы.Участники.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция УдаленныеПрохождения(Знач ПроведениеОбучения, Знач МассивПользователей)	
	Возврат Документы.ПроведениеОбученияСУО.ПрохожденияОбучения(ПроведениеОбучения, Ложь, Истина, МассивПользователей).ВыгрузитьКолонку("Прохождение");	
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьДанныеУчастниковДляОбновления(Знач ПроведениеОбучения)
	Возврат РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ЕстьДокументыВладельца(ПроведениеОбучения);
КонецФункции

&НаКлиенте
Процедура СпроситьПередЗачислениемУчастников(ИмяПроцедурыПродолжения)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СпроситьПередЗачислениемУчастниковПродолжение", ЭтотОбъект, ИмяПроцедурыПродолжения);
	
	Если Объект.ВариантПродолжительности = ПредопределенноеЗначение("Перечисление.ПродолжительностьОбученияСУО.СЗачисления")
		И Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроведенияОбъектовСУО.Запланировано") Тогда
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Обучение имеет статус Запланировано, поэтому его участники не смогут учиться.
		|Но продолжительность их обучения отсчитывается с даты/времени зачисления. Продолжить зачисление?'"), РежимДиалогаВопрос.ДаНет, 0);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпроситьПередЗачислениемУчастниковПродолжение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(ДополнительныеПараметры, ЭтотОбъект);
	
	ВыполнитьОбработкуОповещения(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗачислениемУчастников(Отказ)
	
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
	
	Если НЕ Отказ И Модифицированность Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(,НСтр("ru = 'Перед зачислением участников запишите документ'"));
	КонецЕсли;
	
	Если НЕ Отказ И Объект.УсловияЗачисленияУчастников.Количество() > 0 И НЕ Объект.Проведен Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(,НСтр("ru = 'Перед зачислением участников проведите документ'"));
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗачислитьУчастников(ПроведениеОбучения, СписокПользователей, ПрохожденияДляСнятияУдаления = Неопределено, ОтменитьСнятыеСУдаления = Ложь)
	
	Если СписокПользователей = Неопределено ИЛИ ПроведениеОбучения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(СписокПользователей) = Тип("СправочникСсылка.Пользователи") Тогда
		Пользователь = СписокПользователей;
		СписокПользователей = Новый Массив();
		СписокПользователей.Добавить(Пользователь);
	КонецЕсли;
	
	Если ТипЗнч(СписокПользователей) = Тип("РегистрСведенийКлючЗаписи.СотрудникиСУО") Тогда
		Пользователь = СписокПользователей.Пользователь;
		СписокПользователей = Новый Массив();
		СписокПользователей.Добавить(Пользователь);
	КонецЕсли;
	
	Если ТипЗнч(СписокПользователей) <> Тип("Массив") Тогда
		Текст = НСтр("ru = 'Тип параметра ""Список пользователей"" определен неверно'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
	КонецЕсли;
	
	УправлениеОбучениемСУО.ЗаблокироватьДанныеФормы(ЭтотОбъект);
	
	НачатьТранзакцию();
	
	Попытка
		
		// Снимаем удаление с переданных прохождений
		
		Если ПрохожденияДляСнятияУдаления <> Неопределено Тогда
			Для каждого ПрохождениеОбучения Из ПрохожденияДляСнятияУдаления Цикл			
				ПрохождениеОбученияОбъект = ПрохождениеОбучения.ПолучитьОбъект();
				ПрохождениеОбученияОбъект.ПометкаУдаления = Ложь;
				ПрохождениеОбученияОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Если ОтменитьСнятыеСУдаления Тогда
					// Отменяем обучение, которое сняли с удаления
					ОбучениеСУО.ПриПрохожденииМероприятия(ПрохождениеОбучения,,,,,,,,Истина);
				КонецЕсли;
			КонецЦикла;			
		КонецЕсли;				
		
		// Зачисляем
		
		Для каждого Пользователь Из СписокПользователей Цикл
			УправлениеОбучениемСУО.ЗачислитьУчастникаНаОбучение(ПроведениеОбучения, ПроведениеОбучения.Мероприятие, Пользователь,,,,Ложь,,,Истина);
		КонецЦикла;				
		
		ПерепровестиДокументВФонеПриЗакрытии = Истина;
		
		ЗафиксироватьТранзакцию();
	
	Исключение		
			
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	КоличествоУчастников = Документы.ПроведениеОбученияСУО.КоличествоУчастниковОбучения(ПроведениеОбучения);
	Элементы.Участники.Обновить();	
	УстановитьЗаголовки();	
	
		
	
	ОбщегоНазначенияСУ.ВыполнитьРегламентноеЗаданиеВручную("ПерепроведениеДокументовСУО");
	
КонецПроцедуры

&НаСервере
Функция ПоместитьСписокУчастниковВХранилище()
	
	ТаблицаУчастников = Документы.ПроведениеОбученияСУО.ПрохожденияОбучения(Объект.Ссылка,,Ложь);
	
	ЗаголовокФормыПодбора = НСтр("ru = 'Подбор пользователей'");
	ПараметрыРасширеннойФормыПодбора = 
		Новый Структура("ЗаголовокФормыПодбора, ВыбранныеПользователи, ПодборГруппНевозможен",
		                 ЗаголовокФормыПодбора, ТаблицаУчастников, Истина);
	АдресХранилища = ПоместитьВоВременноеХранилище(ПараметрыРасширеннойФормыПодбора, УникальныйИдентификатор);
	Возврат АдресХранилища;	
	
КонецФункции

&НаСервере
Функция ПоместитьСписокПреподавателейВХранилище()
	
	ТаблицаПреподавателей = Документы.ПроведениеОбученияСУО.ПроведенияОбученияПреподавателей(Объект.Ссылка);
	
	ТаблицаПреподавателей.Колонки.Удалить("ПроведениеПреподавателемОбучения");
	
	ТаблицаПреподавателей.Свернуть("Пользователь");
	
	ЗаголовокФормыПодбора = НСтр("ru = 'Подбор пользователей'");
	ПараметрыРасширеннойФормыПодбора = 
		Новый Структура("ЗаголовокФормыПодбора, ВыбранныеПользователи, ПодборГруппНевозможен",
		                 ЗаголовокФормыПодбора, ТаблицаПреподавателей, Истина);
	АдресХранилища = ПоместитьВоВременноеХранилище(ПараметрыРасширеннойФормыПодбора, УникальныйИдентификатор);
	Возврат АдресХранилища;	
	
КонецФункции

&НаКлиенте
Процедура УстановитьСтатусПрохождения(Статус)
	
	Если Элементы.Участники.ВыделенныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ВыделеннаяСтрока Из Элементы.Участники.ВыделенныеСтроки Цикл
	
		Если ТипЗнч(ВыделеннаяСтрока) = Тип("ДокументСсылка.ПрохождениеОбученияСУО") Тогда
			ОбучениеСУО.ПриПрохожденииМероприятия(ВыделеннаяСтрока, Статус);
		КонецЕсли;
	
	КонецЦикла;
	
	Участники.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	Элементы.Участники.Обновить();	
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьПрохождениеНаСервере()
	
	ПрохожденияУчастников = Документы.ПроведениеОбученияСУО.ПрохожденияОбучения(Объект.Ссылка, Истина);
	
	Для каждого Строка Из ПрохожденияУчастников Цикл
		
		Если Строка.Проведен Тогда
			ОбучениеСУО.ПриПрохожденииМероприятия(Строка.Прохождение);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСнятьОтменуПрохожденияНаСервере(ПрохожденияОбучения)	
	Для каждого ПрохождениеОбучения Из ПрохожденияОбучения Цикл
		ОбучениеСУО.ПриПрохожденииМероприятия(ПрохождениеОбучения,,,,,,,,Истина);
	КонецЦикла;	
	Элементы.Участники.Обновить();
КонецПроцедуры

&НаСервере
Процедура ОтменитьПрохождениеЗаданийНаСервере(Знач ВыбранныеЗадания, Знач ВыбранныеПрохожденияОбучения)
	
	Если ВыбранныеЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Для каждого ВыбранноеПрохождениеОбучения Из ВыбранныеПрохожденияОбучения Цикл
			Для каждого ВыбранноеЗадание Из ВыбранныеЗадания Цикл
				ПопыткаВыполненияЗадания = ОбучениеСУО.ПоследнееПрохождениеЗадания(ВыбранноеПрохождениеОбучения, ВыбранноеЗадание);
				Если ЗначениеЗаполнено(ПопыткаВыполненияЗадания) Тогда
					Документы.ПопыткаВыполненияЗаданияСУО.ОтменитьВыполнениеЗадания(ПопыткаВыполненияЗадания, ВыбранноеПрохождениеОбучения, ВыбранноеЗадание);
				КонецЕсли;
				ТекущийСтатусПрохожденияОбучения = Документы.ПрохождениеОбученияСУО.СтатусПроцессаОбучения(ВыбранноеПрохождениеОбучения);
				Если ТекущийСтатусПрохожденияОбучения <> Перечисления.СтатусыПроцессаОбученияСУО.Новое
					И ТекущийСтатусПрохожденияОбучения <> Перечисления.СтатусыПроцессаОбученияСУО.Активно Тогда	
					ОбучениеСУО.ПриПрохожденииМероприятия(ВыбранноеПрохождениеОбучения, Перечисления.СтатусыПрохожденияОбъектовСУО.Проходит);
				КонецЕсли;				
			КонецЦикла;
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	Элементы.Участники.Обновить();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДатыВозможностиУчиться(Форма)
	
	Если ПоказатьКолонкуВозможностьУчиться(Форма.Объект.Ссылка, Форма.Объект.КонтролироватьВозможностьУчиться,
			Форма.Объект.ДатаНачалаПроведения, Форма.Объект.ДатаОкончанияПроведения, Форма.Объект.ДатаНачалаДоступа, Форма.Объект.ДатаКонтроля) Тогда
		
		Если Форма.ЭлектронноДистанционное Тогда
			Форма.Участники.Параметры.УстановитьЗначениеПараметра("ДатаНачалаОбучения", НачалоДня(Форма.Объект.ДатаНачалаДоступа));
			Форма.Участники.Параметры.УстановитьЗначениеПараметра("ДатаОкончанияОбучения", НачалоДня(Форма.Объект.ДатаКонтроля));
		Иначе
			Форма.Участники.Параметры.УстановитьЗначениеПараметра("ДатаНачалаОбучения", НачалоДня(Форма.Объект.ДатаНачалаПроведения));
			Форма.Участники.Параметры.УстановитьЗначениеПараметра("ДатаОкончанияОбучения", НачалоДня(Форма.Объект.ДатаОкончанияПроведения));
		КонецЕсли;		
			
	Иначе
		
		Форма.Участники.Параметры.УстановитьЗначениеПараметра("ДатаНачалаОбучения", Дата("00010101"));
		Форма.Участники.Параметры.УстановитьЗначениеПараметра("ДатаОкончанияОбучения", Дата("00010101"));		
			
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПоказатьКолонкуВозможностьУчиться(Ссылка, КонтролироватьВозможностьУчиться, ДатаНачалаПроведения, ДатаОкончанияПроведения, ДатаНачалаДоступа, ДатаКонтроля)
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	Если НЕ КонтролироватьВозможностьУчиться Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ЗначениеЗаполнено(НачалоДня(ДатаНачалаПроведения))
		И ЗначениеЗаполнено(НачалоДня(ДатаОкончанияПроведения))
		И ДатаНачалаПроведения <= ДатаОкончанияПроведения Тогда
		Возврат Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(НачалоДня(ДатаНачалаДоступа))
		И ЗначениеЗаполнено(НачалоДня(ДатаКонтроля))
		И ДатаНачалаДоступа <= ДатаКонтроля Тогда
		Возврат Истина;
	КонецЕсли;	
	Возврат Ложь;
КонецФункции

&НаКлиенте
Функция ИдентификаторОтбораТолькоАктуальныеУчастники()
	Возврат "9ba58774-b263-44fb-9338-517a9fb4f43a";
КонецФункции

&НаКлиенте
Процедура УстановитьОтборыСпискаУчастников()
	
	НайтиОтборСпискаУчастников("ТолькоАктивные").Использование = ТолькоАктуальныеУчастники;
	НайтиОтборСпискаУчастников("СкрытьОтмененные").Использование = СкрытьОтмененныхУчастников;
	
КонецПроцедуры

&НаКлиенте
Функция НайтиОтборСпискаУчастников(ИмяОтбора)
	
	НастройкаОтбора = Неопределено;
	
	Для каждого Строка Из Участники.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл	
		Если Строка.Представление = ИмяОтбора Тогда
			НастройкаОтбора = Строка;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Если НастройкаОтбора = Неопределено Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Отбор ""%1"" не найден'"), ИмяОтбора);
	КонецЕсли;
	
	Возврат НастройкаОтбора;
	
КонецФункции

&НаКлиенте
Процедура НачатьДобавлениеВремениУчастнику()
	
	Если ТипЗнч(Элементы.Участники.ВыделенныеСтроки) = Тип("Массив")
		И Элементы.Участники.ВыделенныеСтроки.Количество() > 1 Тогда
		
		ДобавитьПродолжительностьУчастникам(
			Новый ФиксированныйМассив(Элементы.Участники.ВыделенныеСтроки));
		
	Иначе
		
		ТекущиеДанные = Элементы.Участники.ТекущиеДанные;
	
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если ТекущиеДанные.Отменено Тогда
			ПоказатьПредупреждение(,НСтр("ru = 'Невозможно добавить время отмененному участнику'"));
			Возврат;
		КонецЕсли;
		
		ДобавитьПродолжительностьУчастнику(ТекущиеДанные.Ссылка, ТекущиеДанные.ДобавленоВремениВСекундах);
		
	КонецЕсли;	
		
КонецПроцедуры

// Преподаватели

&НаКлиенте
Процедура ЗачислитьПреподавателяНаКлиенте(Преподаватель, Роль) Экспорт
	
	ЗачислитьПреподавателя(Преподаватель, Роль);
	
КонецПроцедуры

&НаСервере
Процедура ЗачислитьПреподавателей(ПроведениеОбучения, Преподаватели)
	
	УправлениеОбучениемСУО.ЗаблокироватьДанныеФормы(ЭтотОбъект);
	
	Для каждого Преподаватель Из Преподаватели Цикл
		УправлениеОбучениемСУО.НазначитьПреподавателяНаОбучение(ПроведениеОбучения,, Преподаватель,,,,Истина);	
	КонецЦикла;		
	
	ПерепровестиДокументВФонеПриЗакрытии = Истина;
	
	ОбновитьСписокПреподавателей();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗачислитьПреподавателя(Преподаватель, Роль)
	
	УправлениеОбучениемСУО.ЗаблокироватьДанныеФормы(ЭтотОбъект);
	
	УправлениеОбучениемСУО.НазначитьПреподавателяНаОбучение(Объект.Ссылка, Объект.Мероприятие, Преподаватель, Роль,,,Истина);	
		
	ПерепровестиДокументВФонеПриЗакрытии = Истина;
	
	ОбновитьСписокПреподавателей();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокПреподавателей(ОбновитьЗаголовки = Истина)
	
	СписокПреподавателей.Очистить();
	
	ТаблицаПреподавателей = Документы.ПроведениеОбученияСУО.Преподаватели(Объект.Ссылка);
	
	Для каждого Строка Из ТаблицаПреподавателей Цикл
	
		Если СписокПреподавателей.НайтиПоЗначению(Строка.Преподаватель) = Неопределено Тогда
			СписокПреподавателей.Добавить(Строка.Преподаватель, Строка.ИмяПреподавателя);	
		КонецЕсли;
	
	КонецЦикла;
	
	КоличествоПреподавателей = Документы.ПроведениеОбученияСУО.Преподаватели(Объект.Ссылка, Объект.Мероприятие).Количество();
	
	Элементы.Преподаватели.Обновить();
	
	Если ОбновитьЗаголовки Тогда
		УстановитьЗаголовки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРольПреподавателяНаКлиенте(РольПреподавателя) Экспорт
	
	Если Элементы.Преподаватели.ВыделенныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ВыделеннаяСтрока Из Элементы.Преподаватели.ВыделенныеСтроки Цикл
	
		Если ТипЗнч(ВыделеннаяСтрока) = Тип("ДокументСсылка.ПроведениеПреподавателемОбученияСУО") Тогда
			ИзменитьРольПреподавателя(ВыделеннаяСтрока, РольПреподавателя)
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьРольПреподавателя(ПроведениеПреподавателемОбучения, Роль)
	
	ПроведениеОбъект = ПроведениеПреподавателемОбучения.ПолучитьОбъект();
	ПроведениеОбъект.Роль = Роль;
	
	Если ПроведениеОбъект.Проведен Тогда
		ПроведениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		ПроведениеОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
	ОбновитьСписокПреподавателей();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СкрытьПреподавателяНаСервере(ПроведениеПреподавателемОбучения)
	
	ПроведениеОбъект = ПроведениеПреподавателемОбучения.ПолучитьОбъект();
	ПроведениеОбъект.СкрыватьОтУченика = НЕ ПроведениеОбъект.СкрыватьОтУченика;
	
	Если ПроведениеОбъект.Проведен Тогда
		ПроведениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		ПроведениеОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
	ОбновитьСписокПреподавателей();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТолькоПросмотрВедомостиПреподавателяНаСервере(ПроведениеПреподавателемОбучения)
	
	ПроведениеОбъект = ПроведениеПреподавателемОбучения.ПолучитьОбъект();
	ПроведениеОбъект.ТолькоПросмотрВедомости = НЕ ПроведениеОбъект.ТолькоПросмотрВедомости;
	
	Если ПроведениеОбъект.Проведен Тогда
		ПроведениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		ПроведениеОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
	ОбновитьСписокПреподавателей();
	
КонецПроцедуры

// Подчиненные мероприятия

&НаСервереБезКонтекста
Процедура ЗаполнитьПодчиненныеМероприятия(Ссылка, Мероприятие, СхемаПроведения)
	
	Документы.ПроведениеОбученияСУО.ЗаполнитьПодчиненныеМероприятия(Ссылка, Мероприятие, СхемаПроведения);
	
	// Зачисляем повторно участников (преподавателей не зачисляем).
	
	Участники = Документы.ПроведениеОбученияСУО.ПрохожденияОбучения(Ссылка, Ложь).ВыгрузитьКолонку("Пользователь");
	
	Для каждого Пользователь Из Участники Цикл
		УправлениеОбучениемСУО.ЗачислитьУчастникаНаОбучение(Ссылка,,Пользователь,,,,Ложь,Истина,,Истина);
	КонецЦикла;
		
КонецПроцедуры

// Картинка

&НаКлиенте
Процедура НачатьДобавлениеКартинки()
	
	Отказ = Ложь;
	
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
	
	Если НЕ Отказ Тогда
		Отказ = ТолькоПросмотрФормы(Объект.Статус, ЭтотОбъект);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
 	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьДобавлениеКартинки", ЭтотОбъект);		
	РаботаСФайламиКлиент.ДобавитьФайл(ОписаниеОповещения, ПредопределенноеЗначение("Справочник.ПапкиФайлов.ПроведенияМероприятий"), ЭтотОбъект, 2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьДобавлениеКартинки(Результат, Дополнительно) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("ФайлСсылка") И ЗначениеЗаполнено(Результат.ФайлСсылка) Тогда
		Объект.ФайлКартинки = Результат.ФайлСсылка;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("СправочникСсылка.Файлы") И ЗначениеЗаполнено(Результат) Тогда
		Объект.ФайлКартинки = Результат;
	КонецЕсли;	
	
	Модифицированность = Истина;
	ОбновитьАдресКартинки();
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьАдресКартинки()
	
	АдресКартинки = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(Объект.ФайлКартинки) Тогда
		Возврат;				
	КонецЕсли;
	
	ВерсияФайла = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ФайлКартинки, "ТекущаяВерсия");
	
	Если НЕ ЗначениеЗаполнено(ВерсияФайла) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		АдресКартинки = РаботаСФайламиСлужебный.ПолучитьНавигационнуюСсылкуВоВременномХранилище(ВерсияФайла, УникальныйИдентификатор);		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Невозможно получить адрес картинки'"));
		АдресКартинки = Неопределено;
	КонецПопытки;	
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьУдалениеКартинки()
	Объект.ФайлКартинки = Неопределено;
	Модифицированность = Истина;
	ОбновитьАдресКартинки();
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыборКартинкиИзЗагруженных()
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВладелецФайла", ПредопределенноеЗначение("Справочник.ПапкиФайлов.ПроведенияМероприятий"));
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьВыборКартинкиИзЗагруженных", ЭтотОбъект);
	ОткрытьФорму("Справочник.Файлы.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьВыборКартинкиИзЗагруженных(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("СправочникСсылка.Файлы")
		И ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		
		Объект.ФайлКартинки = РезультатЗакрытия;
		Модифицированность = Истина;
		ОбновитьАдресКартинки();
		
	КонецЕсли;
	
КонецПроцедуры

// Продолжительность

&НаКлиенте
Процедура ЗадатьПродолжительность()
		
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("НачальноеЗначение", Объект.ПродолжительностьВСекундах);
	Если ЗначениеЗаполнено(ПродолжительностьМероприятияВСекундах) Тогда
		ПараметрыФормы.Вставить("РекомендованноеЗначение", ПродолжительностьМероприятияВСекундах);	
	КонецЕсли;
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьПродолжительностьОбученияПродолжение", ЭтотОбъект);			
	ОткрытьФорму("ОбщаяФорма.ВводПериодаСУ", ПараметрыФормы,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПродолжительностьОбученияПродолжение(НоваяСтруктураПериода, ДополнительныеПараметры) Экспорт
	
	Если НоваяСтруктураПериода <> Неопределено Тогда		
		Объект.ПродолжительностьВСекундах = ОбъектыSCORM.ПолучитьКоличествоСекундИзСтруктурыВременногоИнтервала(НоваяСтруктураПериода);
		Модифицированность = Истина;
		ПривестиДатуПроведения();
		УстановитьДоступностьЭлементовФормы(Ложь);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПродолжительностьУчастнику(Знач ПрохождениеОбучения, Знач РанееДобавленоВремениВСекундах)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("НачальноеЗначение", РанееДобавленоВремениВСекундах);
	Если УстановленыДатыДоступаЗаданий(ЭтотОбъект) Тогда
		ПараметрыФормы.Вставить("Подсказка", НСтр("ru = 'Будет продлена продолжительность обучения в целом.
		|Продолжительность выполнения обязательных заданий перестанет действовать.'"));
	КонецЕсли;
		
	ДополнительныеПараметры = Новый Структура("ПрохождениеОбучения", ПрохождениеОбучения);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьПродолжительностьУчастникуПродолжение", ЭтотОбъект, ДополнительныеПараметры);			
	ОткрытьФорму("ОбщаяФорма.ВводПериодаСУ", ПараметрыФормы,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПродолжительностьУчастникуПродолжение(НоваяСтруктураПериода, ДополнительныеПараметры) Экспорт
	
	Если НоваяСтруктураПериода <> Неопределено Тогда
		ДобавитьПродолжительностьВСекундах = ОбъектыSCORM.ПолучитьКоличествоСекундИзСтруктурыВременногоИнтервала(НоваяСтруктураПериода);
		ВремяУчастникаИстекло = ДобавитьПродолжительностьУчастникуНаСервере(ДополнительныеПараметры.ПрохождениеОбучения, ДобавитьПродолжительностьВСекундах);
		Если ВремяУчастникаИстекло Тогда
			ПоказатьПредупреждение(,НСТр("ru = 'Добавленного времени не достаточно для продолжения обучения.
			|Увеличьте добавленное время'"));
		КонецЕсли;
		Участники.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());	
		Элементы.Участники.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПродолжительностьУчастникам(Знач ПрохожденияОбучения)
		
	ДополнительныеПараметры = Новый Структура("ПрохожденияОбучения", ПрохожденияОбучения);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("НачальноеЗначение", 0);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьПродолжительностьУчастникамПродолжение", ЭтотОбъект, ДополнительныеПараметры);			
	ОткрытьФорму("ОбщаяФорма.ВводПериодаСУ",ПараметрыФормы,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПродолжительностьУчастникамПродолжение(НоваяСтруктураПериода, ДополнительныеПараметры) Экспорт
	
	Если НоваяСтруктураПериода <> Неопределено Тогда
		ДобавитьПродолжительностьВСекундах = ОбъектыSCORM.ПолучитьКоличествоСекундИзСтруктурыВременногоИнтервала(НоваяСтруктураПериода);
		ДобавитьПродолжительностьУчастникамНаСервере(ДополнительныеПараметры.ПрохожденияОбучения, ДобавитьПродолжительностьВСекундах);
		Участники.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());	
		Элементы.Участники.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПродолжительностьУчастникамНаСервере(Знач ПрохожденияОбучения, Знач ДобавленоВремениВСекундах)
	
	Для каждого ПрохождениеОбучения Из ПрохожденияОбучения Цикл	
		ДобавитьПродолжительностьНаСервере(ПрохождениеОбучения, ДобавленоВремениВСекундах);	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ДобавитьПродолжительностьУчастникуНаСервере(Знач ПрохождениеОбучения, Знач ДобавленоВремениВСекундах)
	
	ДобавитьПродолжительностьНаСервере(ПрохождениеОбучения, ДобавленоВремениВСекундах);

	Возврат Документы.ПрохождениеОбученияСУО.ВремяИстекло(ПрохождениеОбучения);
	
КонецФункции

&НаСервере
Процедура ДобавитьПродолжительностьНаСервере(Знач ПрохождениеОбучения, Знач ДобавленоВремениВСекундах)
	
	Документы.ПрохождениеОбученияСУО.ДобавитьВремя(ПрохождениеОбучения, ДобавленоВремениВСекундах);
	ТекущийСтатусПрохожденияОбучения = Документы.ПрохождениеОбученияСУО.СтатусПроцессаОбучения(ПрохождениеОбучения);
	Если ТекущийСтатусПрохожденияОбучения <> Перечисления.СтатусыПроцессаОбученияСУО.Новое Тогда	
		ОбучениеСУО.ПриПрохожденииМероприятия(ПрохождениеОбучения, Перечисления.СтатусыПрохожденияОбъектовСУО.Проходит);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПродолжительностьКоманда()
	
	Объект.ПродолжительностьВСекундах = 0;
	Модифицированность = Истина;		
	УстановитьДоступностьЭлементовФормы(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВариантПродолжительностиПоУмолчанию()		
	Документы.ПроведениеОбученияСУО.ЗаполнитьВариантПродолжительностиПоУмолчанию(Объект, ЭлектронноДистанционное);	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДатыОбученияФормы(УстановитьДоступностьЭлементов = Ложь)
	
	ДатаНачалаПроведения  = Объект.ДатаНачалаПроведения;
	ВремяНачалаПроведения = Объект.ДатаНачалаПроведения;		
	
	ДатаОкончанияПроведения  = Объект.ДатаОкончанияПроведения;
	ВремяОкончанияПроведения = Объект.ДатаОкончанияПроведения;	
	
	ДатаНачалаДоступа = Объект.ДатаНачалаДоступа;
	ВремяНачалаДоступа = Объект.ДатаНачалаДоступа;
	
	ДатаКонтроля = Объект.ДатаКонтроля;
	ВремяКонтроля = Объект.ДатаКонтроля;	
	
	ДатаНачалаЗаписи = Объект.ДатаОткрытияЗаписи;
	ВремяНачалаЗаписи = Объект.ДатаОткрытияЗаписи;
	
	ДатаОкончанияЗаписи = Объект.ДатаЗакрытияЗаписи;
	ВремяОкончанияЗаписи = Объект.ДатаЗакрытияЗаписи;
	
	Если УстановитьДоступностьЭлементов Тогда
		УстановитьДоступностьЭлементовФормы(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПродолжительностьОтличаетсяОтРекомендованной()
	
	Если НЕ Объект.НаОсновеМероприятия Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПродолжительностьМероприятияВСекундах) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Объект.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.НеЗадана Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЭлектронноДистанционное Тогда
		
		Если Объект.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.Фиксированная Тогда
			
			Если НЕ ЗначениеЗаполнено(Объект.ДатаНачалаДоступа)
				ИЛИ НЕ ЗначениеЗаполнено(Объект.ДатаКонтроля) Тогда			
				Возврат Истина;			
			КонецЕсли;
			
			ТекущаяПродолжительностьОбучения = ?(ПродолжительностьКратноДню(ПродолжительностьМероприятияВСекундах),
				(Объект.ДатаКонтроля - Объект.ДатаНачалаДоступа + 1), (Объект.ДатаКонтроля - Объект.ДатаНачалаДоступа));			
						
			Если ТекущаяПродолжительностьОбучения <> ПродолжительностьМероприятияВСекундах Тогда			
				Возврат Истина;			
			КонецЕсли;			
							
		КонецЕсли;
		
		Если Объект.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.СЗачисления
			ИЛИ Объект.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.СНачалаОбучения Тогда 
			
			Если НЕ ЗначениеЗаполнено(Объект.ПродолжительностьВСекундах) Тогда
				Возврат Истина;
			КонецЕсли;
			
			Если Объект.ПродолжительностьВСекундах <> ПродолжительностьМероприятияВСекундах Тогда
				Возврат Истина;
			КонецЕсли;
			
		КонецЕсли;		
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(Объект.ДатаНачалаПроведения)
			ИЛИ НЕ ЗначениеЗаполнено(Объект.ДатаОкончанияПроведения) Тогда			
			Возврат Истина;			
		КонецЕсли;
		
		ТекущаяПродолжительностьОбучения = ?(ПродолжительностьКратноДню(ПродолжительностьМероприятияВСекундах),
				(Объект.ДатаОкончанияПроведения - Объект.ДатаНачалаПроведения + 1), (Объект.ДатаОкончанияПроведения - Объект.ДатаНачалаПроведения));
				
		Если ТекущаяПродолжительностьОбучения <> ПродолжительностьМероприятияВСекундах Тогда			
			Возврат Истина;			
		КонецЕсли;		
		
	КонецЕсли;	
	
	Возврат Ложь;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПродолжительностьКратноДню(Знач ПродолжительностьВСекундах)
	
	ЧислоСекундВДне = 60*60*24;
	
	Возврат ЗначениеЗаполнено(ПродолжительностьВСекундах)
		И ОбщегоНазначенияСУКлиентСервер.ОстатокОтДеления(ПродолжительностьВСекундах, ЧислоСекундВДне) = 0
		И ПродолжительностьВСекундах > ЧислоСекундВДне;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДатуПроведенияФормы(Форма, Объект)
	
	Если Объект.ВариантПродолжительности = ПредопределенноеЗначение("Перечисление.ПродолжительностьОбученияСУО.Фиксированная")
		ИЛИ Объект.ВариантПродолжительности = ПредопределенноеЗначение("Перечисление.ПродолжительностьОбученияСУО.НеЗадана") Тогда
		Объект.ПродолжительностьВСекундах = 0;	
	КонецЕсли;
	
	Если Объект.ВариантПродолжительности = ПредопределенноеЗначение("Перечисление.ПродолжительностьОбученияСУО.СЗачисления")
		ИЛИ Объект.ВариантПродолжительности = ПредопределенноеЗначение("Перечисление.ПродолжительностьОбученияСУО.СНачалаОбучения")
		ИЛИ Объект.ВариантПродолжительности = ПредопределенноеЗначение("Перечисление.ПродолжительностьОбученияСУО.НеЗадана") Тогда
		Форма.ДатаНачалаДоступа = Дата("00010101");
		Форма.ВремяНачалаДоступа = Дата("00010101");
		Форма.ДатаКонтроля = Дата("00010101");
		Форма.ВремяКонтроля = Дата("00010101");
	КонецЕсли;
	
	Если Форма.ЭлектронноДистанционное Тогда
		
		Если Объект.СкрытьВремяПроведения Тогда
			Форма.ВремяНачалаДоступа = НачалоДня(Дата("00010101"));
			Если ЗначениеЗаполнено(НачалоДня(Форма.ДатаКонтроля)) Тогда
				Форма.ВремяКонтроля = КонецДня(Дата("00010101"));
			Иначе
				Форма.ВремяКонтроля = НачалоДня(Дата("00010101"));
			КонецЕсли;
		Иначе
			Форма.ВремяНачалаДоступа = НачалоМинуты(Форма.ВремяНачалаДоступа);
			Форма.ВремяКонтроля = НачалоМинуты(Форма.ВремяКонтроля); 
		КонецЕсли;		
		
		Если ЗначениеЗаполнено(НачалоДня(Форма.ДатаНачалаДоступа)) Тогда
			Объект.ДатаНачалаДоступа = НачалоДня(Форма.ДатаНачалаДоступа) + ОбщегоНазначенияСУКлиентСервер.ВыделитьВремя(Форма.ВремяНачалаДоступа);
		Иначе
			Объект.ДатаНачалаДоступа = Дата("00010101");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НачалоДня(Форма.ДатаКонтроля)) Тогда
			Объект.ДатаКонтроля = НачалоДня(Форма.ДатаКонтроля) + ОбщегоНазначенияСУКлиентСервер.ВыделитьВремя(Форма.ВремяКонтроля);
		Иначе
			Объект.ДатаКонтроля = Дата("00010101");
		КонецЕсли;			
		
		Объект.ДатаНачалаПроведения = Дата("00010101");
		Объект.ДатаОкончанияПроведения = Дата("00010101");
		
	Иначе
		
		Если Объект.СкрытьВремяПроведения Тогда
			Форма.ВремяНачалаПроведения = НачалоДня(Дата("00010101"));
			Если ЗначениеЗаполнено(НачалоДня(Форма.ДатаОкончанияПроведения)) Тогда
				Форма.ВремяОкончанияПроведения = КонецДня(Дата("00010101"));
			Иначе
				Форма.ВремяОкончанияПроведения = НачалоДня(Дата("00010101"));
			КонецЕсли;
		Иначе
			Форма.ВремяНачалаПроведения = НачалоМинуты(Форма.ВремяНачалаПроведения);
			Форма.ВремяОкончанияПроведения = НачалоМинуты(Форма.ВремяОкончанияПроведения);
		КонецЕсли;		
		
		Если ЗначениеЗаполнено(НачалоДня(Форма.ДатаНачалаПроведения)) Тогда
			Объект.ДатаНачалаПроведения = НачалоДня(Форма.ДатаНачалаПроведения) + ОбщегоНазначенияСУКлиентСервер.ВыделитьВремя(Форма.ВремяНачалаПроведения);
		Иначе
			Объект.ДатаНачалаПроведения = Дата("00010101");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НачалоДня(Форма.ДатаОкончанияПроведения)) Тогда
			Объект.ДатаОкончанияПроведения = НачалоДня(Форма.ДатаОкончанияПроведения) + ОбщегоНазначенияСУКлиентСервер.ВыделитьВремя(Форма.ВремяОкончанияПроведения);
		Иначе
			Объект.ДатаОкончанияПроведения = Дата("00010101");
		КонецЕсли;
		
		Объект.ДатаНачалаДоступа = Дата("00010101");
		Объект.ДатаКонтроля = Дата("00010101");			
		
	КонецЕсли;
	
	Если Объект.ОткрытоеМероприятие Тогда
		
		Если Объект.СкрытьВремяПроведения Тогда
			Форма.ВремяНачалаЗаписи = НачалоДня(Дата("00010101"));
			Если ЗначениеЗаполнено(НачалоДня(Форма.ДатаОкончанияЗаписи)) Тогда
				Форма.ВремяОкончанияЗаписи = КонецДня(Дата("00010101"));
			Иначе
				Форма.ВремяОкончанияЗаписи = НачалоДня(Дата("00010101"));
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НачалоДня(Форма.ДатаНачалаЗаписи)) Тогда
			Объект.ДатаОткрытияЗаписи = НачалоДня(Форма.ДатаНачалаЗаписи) + ОбщегоНазначенияСУКлиентСервер.ВыделитьВремя(Форма.ВремяНачалаЗаписи);
		Иначе
			Объект.ДатаОткрытияЗаписи = Дата("00010101");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НачалоДня(Форма.ДатаОкончанияЗаписи)) Тогда
			Объект.ДатаЗакрытияЗаписи = НачалоДня(Форма.ДатаОкончанияЗаписи) + ОбщегоНазначенияСУКлиентСервер.ВыделитьВремя(Форма.ВремяОкончанияЗаписи);
		Иначе
			Объект.ДатаЗакрытияЗаписи = Дата("00010101");
		КонецЕсли;
		
	Иначе
		
		Объект.ДатаОткрытияЗаписи = Дата("00010101");
		Объект.ДатаЗакрытияЗаписи = Дата("00010101");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПривестиДатуПроведения()
	ЗаполнитьДатуПроведенияФормы(ЭтотОбъект, Объект);		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРекомендованноеРасписание()
	
	Если НЕ ЗначениеЗаполнено(ПродолжительностьМероприятияВСекундах) Тогда
		Возврат;
	КонецЕсли;
	
	РекомендованнаяПродолжительность = ОбъектыSCORM.ПолучитьПолнуюСтрокуИзКоличестваСекунд(ПродолжительностьМероприятияВСекундах);
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСТр("ru = 'Установить рекомендованную продолжительность %1?'"), РекомендованнаяПродолжительность);
			
	Оповещение = Новый ОписаниеОповещения("УстановитьРекомендованноеРасписаниеПродолжение", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0);
		
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРекомендованноеРасписаниеПродолжение(Результат, Параметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ЭтотОбъект;
	
	Если Объект.ВариантПродолжительности = ПредопределенноеЗначение("Перечисление.ПродолжительностьОбученияСУО.СЗачисления")
		ИЛИ Объект.ВариантПродолжительности = ПредопределенноеЗначение("Перечисление.ПродолжительностьОбученияСУО.СНачалаОбучения") Тогда
		
		Объект.ПродолжительностьВСекундах = Форма.ПродолжительностьМероприятияВСекундах;
		
	Иначе
	
		ИмяРеквизитаДатаНачала = ?(Форма.ЭлектронноДистанционное, "ДатаНачалаДоступа", "ДатаНачалаПроведения");	
		ИмяРеквизитаДатаОкончания = ?(Форма.ЭлектронноДистанционное, "ДатаКонтроля", "ДатаОкончанияПроведения");
		
		Если ПродолжительностьКратноДню(Форма.ПродолжительностьМероприятияВСекундах) Тогда
			Объект.СкрытьВремяПроведения = Истина;
			Объект[ИмяРеквизитаДатаНачала] = НачалоДня(Объект[ИмяРеквизитаДатаНачала]);
			// Если продолжительность кратно дню, то из дня вычитаем 1 секунду, чтобы не выйти в следующие сутки
			Объект[ИмяРеквизитаДатаОкончания] = Объект[ИмяРеквизитаДатаНачала] + Форма.ПродолжительностьМероприятияВСекундах - 1;		
		Иначе
			Объект.СкрытьВремяПроведения = Ложь;
			Объект[ИмяРеквизитаДатаОкончания] = Объект[ИмяРеквизитаДатаНачала] + Форма.ПродолжительностьМероприятияВСекундах;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьДатыОбученияФормы(Истина);
		
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекстПродолжительностиОбучения()
		
	ТекстПродолжительности = ?(ЗначениеЗаполнено(Объект.ПродолжительностьВСекундах) 
		И ПродолжительностьОтличаетсяОтРекомендованной(),
		НСтр("ru = '%1 (отличается от рекомендованной)'"), "%1");
		
	ПродолжительностьОбучения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстПродолжительности,
		ОбъектыSCORM.ПолучитьПолнуюСтрокуИзКоличестваСекунд(Объект.ПродолжительностьВСекундах));		
		
КонецПроцедуры

&НаСервере
Процедура СброситьОценкуКачестваОбученияНаСервере(Знач ПрохождениеОбучения)
	ДанныеКачестваОбучения = Новый Структура("ОценкаКачестваОбучения, КомментарийКачестваОбучения", 0, "");	
	ОбучениеСУО.ЗаписатьДанныеОценкиКачестваОбучения(ПрохождениеОбучения, ДанныеКачестваОбучения, Ложь);
	Элементы.Участники.Обновить();
КонецПроцедуры



#КонецОбласти

