
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//////////////////////////////////////////////////////////////////
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Объект);
	РазработкаСУЗ.УстановитьДоступностьДанныхОтПоставщика(ЭтотОбъект);
	//////////////////////////////////////////////////////////////////
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура РесурсОткрытие(Элемент, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаОткрытияРесурса(Элемент, СтандартнаяОбработка, Объект.Ресурс);
КонецПроцедуры

&НаКлиенте
Процедура РесурсСоздание(Элемент, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаСозданияРесурса(ЭтотОбъект, Элемент, СтандартнаяОбработка, Объект.Ссылка); 
КонецПроцедуры

&НаКлиенте
Процедура РесурсОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаВыбораРесурса(ВыбранноеЗначение);
КонецПроцедуры

#КонецОбласти



