
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Объект.Текст = Справочники.ШаблоныСертификатовСУО.ПолучитьМакет("МакетHTMLПоУмолчанию").ПолучитьТекст();
		ТабличныйМакет = Справочники.ШаблоныСертификатовСУО.ПолучитьМакет("МакетPDFПоУмолчанию");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ТабличныйМакет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ЗначениеКопирования, "ТабличныйМакет").Получить();
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УстановитьДоступностьЭлементовФормы();
	ТабличныйМакетИзБД = ТекущийОбъект.ТабличныйМакет.Получить();
	Если ТабличныйМакетИзБД = Неопределено Тогда
		ТабличныйМакет = Справочники.ШаблоныСертификатовСУО.ПолучитьМакет("МакетPDFПоУмолчанию");
	Иначе
		ТабличныйМакет = ТабличныйМакетИзБД;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ТабличныйМакет = Новый ХранилищеЗначения(ТабличныйМакет);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДополнительныеПеременные

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ДополнительныеПеременные

&НаКлиенте
Процедура ДополнительныеПеременныеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока И Элемент.ТекущиеДанные <> Неопределено Тогда
		Элемент.ТекущиеДанные.ИмяПеременной =  ИмяПеременной(Элемент.ТекущиеДанные.Переменная);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ФорматHTMLПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ФорматPDFПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервереБезКонтекста 
Функция ИмяПеременной(Знач СсылкаНаПеременную)
	Если ТипЗнч(СсылкаНаПеременную) = Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения") Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаПеременную, "Заголовок");
	Иначе		
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаПеременную, "Наименование");
	КонецЕсли;
КонецФункции

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Элементы.СтраницаШаблонHTML.Видимость = Объект.ФорматHTML;
	Элементы.СтраницаШаблонPDF.Видимость = Объект.ФорматPDF;
	
КонецПроцедуры

#КонецОбласти