
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда
		ИмяПараметра = "Мероприятие";
	КонецЕсли;
		
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.КаталогПрограммОбученияСУО") Тогда
		ИмяПараметра = "ПрограммаОбучения";
	КонецЕсли;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.УчебныеГруппыСУО") Тогда
		ИмяПараметра = "УчебнаяГруппа";
	КонецЕсли;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ДолжностиСУО") Тогда
		ИмяПараметра = "Должность";
	КонецЕсли;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Организации") Тогда
		ИмяПараметра = "Организация";
	КонецЕсли;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ПодразделенияОрганизацииСУО") Тогда
		ИмяПараметра = "ПодразделениеОрганизации";
	КонецЕсли;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ПодразделенияПредприятияСУО") Тогда
		ИмяПараметра = "ПодразделениеПредприятия";
	КонецЕсли;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
		ИмяПараметра = "ЭлектронныйРесурс";
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура(ИмяПараметра, ПараметрКоманды);
	ОткрытьФорму("ОбщаяФорма.СводнаяВедомостьСУО", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
