#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//

Функция ПопыткиПрохожденияТестов(Пользователь, ПрохождениеОбучения, ПрисоединенныеЭлектронныеКурсы) Экспорт

	Запрос = Новый Запрос;
	
	Запрос.Текст = "";
	
	Если ПрохождениеОбучения <> Неопределено Тогда
	
		Запрос.Текст = Запрос.Текст + 
			"ВЫБРАТЬ
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Период КАК Дата,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Результат,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ВыставляетсяОценка,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПроверяетсяПреподавателем,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПроверенПреподавателем,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ДатаНачалаПрохождения,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ДатаОкончанияПрохождения,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Регистратор КАК СессияВыполненияТеста,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлементСодержания,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлементСодержания.Наименование КАК НаименованиеЭлементаСодержания,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлектронныйРесурс,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлектронныйРесурс.Наименование КАК НаименованиеЭлектронногоРесурса
			|ИЗ
			|	РегистрСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ КАК ПопыткиПрохожденияЭлектронныхРесурсовСУЗ
			|ГДЕ
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Пользователь = &Пользователь
			|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПрохождениеОбучения = &ПрохождениеОбучения
			|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭтоТест = ИСТИНА
			|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПопыткаЗавершена = ИСТИНА
			|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.СсылкаНаОбъектСУЗ.НазначениеТестирования <> &НазначениеТестированияАнкетирование";	
		
		Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбучения);
		Запрос.УстановитьПараметр("НазначениеТестированияАнкетирование", Перечисления.НазначенияТестированийСУЗ.Анкетирование);
		
	КонецЕсли;
	
	Если ПрисоединенныеЭлектронныеКурсы.Количество() > 0 Тогда
		
		Если ПрохождениеОбучения <> Неопределено Тогда
			
			Запрос.Текст = Запрос.Текст + " ОБЪЕДИНИТЬ ";
			
			// Используется именно ОБЪЕДИНИТЬ, а не ОБЪЕДИНИТЬ ВСЕ, так как
			// возможна ситуация, когда один курс прикреплен, как основной
			// и как вспомогательный материал (ресурс). Тогда обе выборки будут выбирать
			// одни данные два раза. 
			
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + 
			"ВЫБРАТЬ
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Период КАК Дата,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Результат,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ВыставляетсяОценка,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПроверяетсяПреподавателем,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПроверенПреподавателем,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ДатаНачалаПрохождения,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ДатаОкончанияПрохождения,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Регистратор КАК СессияВыполненияТеста,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлементСодержания,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлементСодержания.Наименование КАК НаименованиеЭлементаСодержания,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлектронныйРесурс,
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлектронныйРесурс.Наименование КАК НаименованиеЭлектронногоРесурса
			|ИЗ
			|	РегистрСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ КАК ПопыткиПрохожденияЭлектронныхРесурсовСУЗ
			|ГДЕ
			|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Пользователь = &Пользователь
			|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭтоТест = ИСТИНА
			|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПопыткаЗавершена = ИСТИНА
			|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлектронныйРесурс В(&ЭлектронныеКурсы)
			|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.СсылкаНаОбъектСУЗ.НазначениеТестирования <> &НазначениеТестированияАнкетирование";	
		
		Запрос.УстановитьПараметр("ЭлектронныеКурсы", ПрисоединенныеЭлектронныеКурсы);
		Запрос.УстановитьПараметр("НазначениеТестированияАнкетирование", Перечисления.НазначенияТестированийСУЗ.Анкетирование);
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + 
	" УПОРЯДОЧИТЬ ПО Дата ";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции

Функция КоличествоЗавершенныхТестов(ПрохождениеОбучения) Экспорт
	
	ПрохожденияОбучения = Документы.ПрохождениеОбученияСУО.ПодчиненныеПрохождения(ПрохождениеОбучения);
	ПрохожденияОбучения.Добавить(ПрохождениеОбучения);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлементСодержания
		|ИЗ
		|	РегистрСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ КАК ПопыткиПрохожденияЭлектронныхРесурсовСУЗ
		|ГДЕ
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПрохождениеОбучения В(&ПрохожденияОбучения)
		|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПопыткаЗавершена = &ПопыткаЗавершена
		|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭтоТест = ИСТИНА";
	
	Запрос.УстановитьПараметр("ПопыткаЗавершена", Истина);
	Запрос.УстановитьПараметр("ПрохожденияОбучения", ПрохожденияОбучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи.Количество();
	
КонецФункции

Функция КоличествоЗавершенныхЭлектронныхКурсов(ПрохождениеОбучения) Экспорт
	
	ПрохожденияОбучения = Документы.ПрохождениеОбученияСУО.ПодчиненныеПрохождения(ПрохождениеОбучения);
	ПрохожденияОбучения.Добавить(ПрохождениеОбучения);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлектронныйРесурс
		|ИЗ
		|	РегистрСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ КАК ПопыткиПрохожденияЭлектронныхРесурсовСУЗ
		|ГДЕ
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПрохождениеОбучения В(&ПрохожденияОбучения)
		|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПопыткаЗавершена = &ПопыткаЗавершена
		|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭтоТест = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ПопыткаЗавершена", Истина);
	Запрос.УстановитьПараметр("ПрохожденияОбучения", ПрохожденияОбучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи.Количество();
	
КонецФункции

//----------------------------------//

Функция ЕстьПопыткиПрохожденияИзЛичногоКабинета(Пользователь, ПрохождениеОбучения, Задание) Экспорт
	
	Если ЗначениеЗаполнено(ПрохождениеОбучения)
		И НЕ ЗначениеЗаполнено(Задание) Тогда
		
		ВызватьИсключение НСтр("ru = 'Задание прохождения обучения не задано'");
		
	КонецЕсли;
	
	Если ПрохождениеОбучения = Неопределено Тогда
		ПрохождениеОбучения = Метаданные.ОпределяемыеТипы.ПрохождениеЭлектронногоОбучения.Тип.ПривестиЗначение(ПрохождениеОбучения);
	КонецЕсли;
	
	Если Задание = Неопределено Тогда
		Задание = Метаданные.ОпределяемыеТипы.ЗаданиеЭлектронногоОбучения.Тип.ПривестиЗначение(Задание);
	КонецЕсли;		
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Регистратор
		|ИЗ
		|	РегистрСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ КАК ПопыткиПрохожденияЭлектронныхРесурсовСУЗ
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Регистратор) <> ТИП(Документ.СессияЭлектронногоРесурсаСУЗ)
		|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Пользователь = &Пользователь
		|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПрохождениеОбучения = &ПрохождениеОбучения
		|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Задание = &Задание";
	
	Запрос.УстановитьПараметр("Задание", Задание);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция ПопыткиПрохождения(Пользователь, ПрохождениеОбучения, Задание, ЭлектронныйРесурс) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлементСодержания КАК ЭлементСодержания,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.СсылкаНаОбъектСУЗ КАК СсылкаНаОбъектСУЗ,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Регистратор КАК ПопыткаВыполнения,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Результат КАК Результат,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПроверяетсяПреподавателем КАК ПроверяетсяПреподавателем,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПроверенПреподавателем КАК ПроверенПреподавателем,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ДатаНачалаПрохождения КАК Дата,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПопыткаЗавершена КАК ПопыткаЗавершена,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭтоТест КАК ЭтоТест,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ВремяПрохожденияВСекундах КАК ВремяПрохожденияВСекундах,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЗавершеноВПроцентах КАК ЗавершеноВПроцентах,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ВыставляетсяОценка КАК ВыставляетсяОценка
		|ИЗ
		|	РегистрСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ КАК ПопыткиПрохожденияЭлектронныхРесурсовСУЗ
		|ГДЕ
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Пользователь = &Пользователь
		|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПрохождениеОбучения = &ПрохождениеОбучения
		|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Задание = &Задание
		|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлектронныйРесурс = &ЭлектронныйРесурс";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбучения);
	Запрос.УстановитьПараметр("Задание", Задание);
	Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);
		
	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();	
	
КонецФункции

#КонецОбласти

#КонецЕсли

