
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Мероприятие = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ПроведениеОбучения, "Мероприятие");
	
	Список.Параметры.УстановитьЗначениеПараметра("ПроведениеОбучения", Параметры.ПроведениеОбучения);
	Список.Параметры.УстановитьЗначениеПараметра("Мероприятие", Мероприятие);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЭлемента()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Закрыть();
	Иначе
		Закрыть(ТекущиеДанные.Прохождение);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Выбрать(Команда)
	ВыборЭлемента();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыборЭлемента();
КонецПроцедуры
