
// События (привилегированный режим) 

Функция ПриПрохожденииПрограммыОбучения(ПрохождениеПрограммыОбучения, Статус = Неопределено) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		УстановитьПривилегированныйРежим(Истина);
		
		// Получаем основные переменные
		
		Если ТипЗнч(Статус) = Тип("Строка") Тогда
			Статус = Перечисления.СтатусыПрохожденияОбъектовСУО[Статус];
		КонецЕсли;
		ДанныеПрохождения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеПрограммыОбучения, "ПроведениеПрограммыОбучения, Сценарий");
		
		// Получаем таблицу всех проведений обучения программы
		
		ТаблицаПроведенийОбучения = Документы.ПроведениеПрограммыОбученияСУО.ПроведенияОбучения(ДанныеПрохождения.ПроведениеПрограммыОбучения);	
		ТаблицаПроведенийОбучения.Колонки.Добавить("Значимость");	
		Для каждого СтрокаТПО Из ТаблицаПроведенийОбучения Цикл
			СтрокаТПО.Значимость = 1;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ДанныеПрохождения.Сценарий)
			И ТипЗнч(ДанныеПрохождения.Сценарий) = Тип("СправочникСсылка.КаталогПрограммОбученияСУО") Тогда
			
			// Выбираем все мероприятия, которые должны быть
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СодержаниеПрограммыОбученияСУО.Мероприятие,
			|	СодержаниеПрограммыОбученияСУО.Значимость
			|ИЗ
			|	Справочник.СодержаниеПрограммыОбученияСУО КАК СодержаниеПрограммыОбученияСУО
			|ГДЕ
			|	СодержаниеПрограммыОбученияСУО.ЭтоГруппа = ЛОЖЬ
			|	И СодержаниеПрограммыОбученияСУО.ПометкаУдаления = ЛОЖЬ
			|	И СодержаниеПрограммыОбученияСУО.Владелец = &ПрограммаОбучения";
			
			Запрос.УстановитьПараметр("ПрограммаОбучения", ДанныеПрохождения.Сценарий);			
			Результат = Запрос.Выполнить();
			ТаблицаМероприятий = Результат.Выгрузить();
			
			Для каждого СтрокаТМ Из ТаблицаМероприятий Цикл		
				СтрокаТПО = ТаблицаПроведенийОбучения.Найти(СтрокаТМ.Мероприятие, "Мероприятие");				
				Если СтрокаТПО <> Неопределено Тогда
					СтрокаТПО.Значимость = СтрокаТМ.Значимость;
				КонецЕсли;			
			КонецЦикла;
			
		КонецЕсли;
		
		// Выбираем все прохождения мероприятий программы, которые есть у пользователя
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчастникиОбученияСУО.ПроведениеОбучения,
		|	УчастникиОбученияСУО.Сценарий,
		|	УчастникиОбученияСУО.Баллы,
		|	УчастникиОбученияСУО.ЗавершеноВПроцентах,
		|	УчастникиОбученияСУО.Статус
		|ИЗ
		|	РегистрСведений.УчастникиОбученияСУО КАК УчастникиОбученияСУО
		|ГДЕ
		|	УчастникиОбученияСУО.ПрохождениеПрограммыОбучения = &ПрохождениеПрограммыОбучения";
		
		Запрос.УстановитьПараметр("ПрохождениеПрограммыОбучения", ПрохождениеПрограммыОбучения);
		ТаблицаПрохождений = Запрос.Выполнить().Выгрузить();
		
		//////////////////////////////////////////////////////////////////////////////
		// Вычисляем данные прохождения программы обучения
		
		ВсегоМероприятий       = 0;
		ЗавершеноМероприятий   = 0;
		НеЗавершеноМероприятий = 0;
		ПроходитМероприятий    = 0;
		ЗачисленНаМероприятия  = 0;
		НабраноБаллов          = 0;
		МаксимумБаллов         = 0;
		
		Для каждого Строка Из ТаблицаПроведенийОбучения Цикл
			
			Если Строка.Значимость = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ВсегоМероприятий = ВсегоМероприятий + 1;
			МаксимумБаллов   = МаксимумБаллов + 100*Строка.Значимость;
			
			Прохождение = ТаблицаПрохождений.Найти(Строка.ПроведениеОбучения, "ПроведениеОбучения");
			
			Если Прохождение = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если Прохождение.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил
				ИЛИ Прохождение.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат Тогда
				ЗавершеноМероприятий = ЗавершеноМероприятий + 1;
				НабраноБаллов = НабраноБаллов + Прохождение.Баллы*Строка.Значимость;
			КонецЕсли;
			
			Если Прохождение.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.НеЗавершил Тогда
				НеЗавершеноМероприятий = НеЗавершеноМероприятий + 1;
			КонецЕсли;
			
			Если Прохождение.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Проходит Тогда
				ПроходитМероприятий = ПроходитМероприятий + 1;
			КонецЕсли;
			
			Если Прохождение.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Зачислен Тогда
				ЗачисленНаМероприятия = ЗачисленНаМероприятия + 1;
			КонецЕсли;
			
		КонецЦикла;
		
		СтатусПрохождения = Неопределено;
		
		Если ВсегоМероприятий = (ЗавершеноМероприятий + НеЗавершеноМероприятий) Тогда
			СтатусПрохождения = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил;
		Иначе		
			Если ПроходитМероприятий > 0 ИЛИ ЗавершеноМероприятий > 0 ИЛИ НеЗавершеноМероприятий > 0 Тогда
				СтатусПрохождения = Перечисления.СтатусыПрохожденияОбъектовСУО.Проходит;
			КонецЕсли;		
		КонецЕсли;
		
		Если ВсегоМероприятий  > 0 Тогда
			ЗавершеноВПроцентах = Окр((ЗавершеноМероприятий / ВсегоМероприятий)*100);
		Иначе
			ЗавершеноВПроцентах = 0;
		КонецЕсли;
		
		Если МаксимумБаллов > 0 Тогда
			Баллы = Окр((НабраноБаллов / МаксимумБаллов)*100);
		Иначе
			Баллы = 0;
		КонецЕсли;
		
		//////////////////////////////////////////////////////////////////////////////
		// Записываем прохождение
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.ПрохождениеПрограммыОбученияСУО");
		ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", ПрохождениеПрограммыОбучения);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		ПрохождениеОбъект = ПрохождениеПрограммыОбучения.ПолучитьОбъект();
		
		Если ЗначениеЗаполнено(Статус) Тогда
			
			// Статус, который передан в функцию устанавливаем в любом случае.
			// Например, такое имеет место, если преподаватель установил его принудительно.
			
			ПрохождениеОбъект.Статус = Статус;
			
			// Примечание: статус прохождений мероприятий программы обучения не меняем.
			// Менеджеру надо будет для каждого мероприятия установить статус вручную.
			
		Иначе
			
			Если СтатусПрохождения <> Неопределено Тогда			
				ПрохождениеОбъект.Статус = СтатусПрохождения;			
			КонецЕсли;
			
		КонецЕсли;
		
		Если Баллы <> Неопределено Тогда
			ПрохождениеОбъект.Баллы = Баллы;
		КонецЕсли;
		
		Если ЗавершеноВПроцентах <> Неопределено Тогда
			ПрохождениеОбъект.ЗавершеноВПроцентах = ЗавершеноВПроцентах;
		КонецЕсли;
		
		Попытка 
			ПрохождениеОбъект.Заблокировать();
		Исключение
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось заблокировать объект %1'"),
			Строка(ПрохождениеОбъект));
		КонецПопытки;
		
		ПрохождениеОбъект.ДополнительныеСвойства.Вставить("ПриПрохожденииОбучения", Истина);
		ПрохождениеОбъект.ДополнительныеСвойства.Вставить("ОбновлятьПодчиненныеДокументы", Ложь);
		ПрохождениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
		ПрохождениеОбъект.Разблокировать();
		
		// Создаем рассылку
		
		УправлениеОбучениемСУО.СоздатьАвтоматическуюРассылку(ПрохождениеОбъект);
		
		// Выдаем сертификат	
		
		Сертификат = Неопределено;
		Если ПрохождениеОбъект.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил
			ИЛИ ПрохождениеОбъект.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат Тогда
			Сертификат = УправлениеОбучениемСУО.ВыдатьСертификат(ПрохождениеПрограммыОбучения, Ложь);
		КонецЕсли;
		
		//////////////////////////////////////////////////////////////////////////////
		// Завершаем
		
		ОписаниеПрохождения = Новый Структура();
		ОписаниеПрохождения.Вставить("Статус", ПрохождениеОбъект.Статус);
		ОписаниеПрохождения.Вставить("Сертификат", Сертификат);
		
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	Возврат ОписаниеПрохождения;
	
КонецФункции

Функция ПриПрохожденииМероприятия(Знач ПрохождениеОбучения, Знач Статус = Неопределено, Знач КомментарийПреподавателя = Неопределено, Знач ОценкаЗаМероприятие = Неопределено, Знач ЕстьНеРеализованныеПопытки = Ложь, Знач Записывать = Истина, Знач НеОбновлятьДанныеВебКабинета = Неопределено, Знач ЗавершаетУчащийся = Ложь, Знач УстановитьСнятьОтмену = Ложь, Знач ОбновлятьПодчиненные = Истина) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		УстановитьПривилегированныйРежим(Истина);	
		
		//////////////////////////////////////////////////////////////////////////////
		// Получаем необходимые переменные
		
		ОписаниеПрохождения = Новый Структура(); // Будет возвращено в конце
		
		Если ТипЗнч(Статус) = Тип("Строка") Тогда
			Статус = Перечисления.СтатусыПрохожденияОбъектовСУО[Статус];
		КонецЕсли;	
		
		ТекущаяДата = ТекущаяДатаСеанса();
		
		ДанныеОПрохожденииОбучения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		
			ПрохождениеОбучения,
			
			Новый Структура(
			"ПроведениеОбучения,
			|Пользователь,
			|Сценарий,
			|ДатаКонтроля,
			|СхемаПроведения,
			|ДатаНачалаПрохождения,
			|ДатаОкончанияПрохождения,
			|РодительскоеПрохождение,
			|ПрохождениеПрограммыОбучения,
			|ЭлектронныйРесурс,
			|УчебнаяГруппа,
			|Заявка,
			|ПроверяетсяПреподавателем,
			|ПроверенПреподавателем,
			|Статус,
			|СтатусРодительскогоПрохождения,
			|ДатаОкончанияПроведения,
			|ВариантПродолжительности,
			|ДатаЗачисления,
			|ПродолжительностьВСекундах",
			"ПроведениеОбучения",
			"Пользователь",
			"Сценарий",
			"ПроведениеОбучения.ДатаКонтроля",
			"ПроведениеОбучения.СхемаПроведения",
			"ДатаНачалаПрохождения",
			"ДатаОкончанияПрохождения",
			"РодительскоеПрохождение",
			"ПрохождениеПрограммыОбучения",
			"ПроведениеОбучения.ЭлектронныйРесурс",
			"УчебнаяГруппа",
			"Заявка",
			"ПроверяетсяПреподавателем",
			"ПроверенПреподавателем",
			"Статус",
			"РодительскоеПрохождение.Статус",
			"ПроведениеОбучения.ДатаОкончанияПроведения",
			"ПроведениеОбучения.ВариантПродолжительности",
			"Дата",
			"ПродолжительностьВСекундах"
			
			)
		
		);
		
		ПроведениеОбучения        = ДанныеОПрохожденииОбучения.ПроведениеОбучения;
		Пользователь              = ДанныеОПрохожденииОбучения.Пользователь;
		Сценарий                  = ДанныеОПрохожденииОбучения.Сценарий;
		ВидОбучения               = Документы.ПроведениеОбученияСУО.ВидОбучения(ПроведениеОбучения, Сценарий);
		Электронное               = Документы.ПроведениеОбученияСУО.ЭтоЭлектронноеОбучение(ПроведениеОбучения, ВидОбучения, Сценарий);
		ЭлектронноДистанционное   = Документы.ПроведениеОбученияСУО.ЭлектронноДистанционноеОбучение(ПроведениеОбучения, ВидОбучения, Сценарий);	
		ЭлектронныйРесурс         = Документы.ПроведениеОбученияСУО.ЭлектронныйРесурсОбучения(ДанныеОПрохожденииОбучения, Сценарий, Электронное);
		СтатусОбучения            = Документы.ПрохождениеОбученияСУО.СтатусПроцессаОбучения(ПрохождениеОбучения);
		ЗаданияДоступны           = Документы.ПрохождениеОбученияСУО.ЗаданияДоступны(ПрохождениеОбучения, ДанныеОПрохожденииОбучения.ПроведениеОбучения, ДанныеОПрохожденииОбучения.Сценарий, ВидОбучения, СтатусОбучения, ДанныеОПрохожденииОбучения.ВариантПродолжительности, ДанныеОПрохожденииОбучения.ДатаНачалаПрохождения);
			
		ЭтоЗавершениеПреподавателемБезОценки = 
			Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил
			И НЕ ЗавершаетУчащийся
			И НЕ ЗначениеЗаполнено(ОценкаЗаМероприятие);
				
		// Эти переменные пока равны Неопределено,
		// но могут быть получены по необходимости
		
		ДанныеОПрохожденииЭР = Неопределено;	
		
		Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда			
			
			// Данные прохождения электронного ресурса могут быть, только если есть электронный ресурс.
			// Они нужны всегда, поэтому их сразу получаем.
			
			ДанныеОПрохожденииЭР = ЭлектронныеРесурсыСУЗ.ДанныеОПрохожденииЭлектронногоРесурса(ЭлектронныйРесурс,,,ПрохождениеОбучения,ЭлектронныйРесурс,,ВидОбучения);
			
			Если НЕ ЕстьНеРеализованныеПопытки Тогда
				
				// Если переменная ЕстьНеРеализованныеПопытки не была передана в функцию,
				// то ищем ее значения в данных о прохождении электронного ресурса.
				// Переданное значение важнее.
				
				ЕстьНеРеализованныеПопытки = ДанныеОПрохожденииЭР.ЕстьНеРеализованныеДобавленныеПопытки;
				
			КонецЕсли;		
			
		КонецЕсли;	
		
		Задания	= Неопределено;		
		ДанныеПрохожденияЗаданий = Неопределено;	
		
		Задания = Документы.ПроведениеОбученияСУО.ЗаданияОбучения(ПроведениеОбучения, Сценарий,,ВидОбучения);
		
		Если Задания.Количество() = 0 Тогда
			Задания = Неопределено;
		КонецЕсли;
		
		ПроверяетсяПреподавателем = ДанныеОПрохожденииОбучения.ПроверяетсяПреподавателем;
		ПроверенПреподавателем = ДанныеОПрохожденииОбучения.ПроверенПреподавателем;	
		
		Если ВидОбучения.Общее Тогда		
			ДанныеОПрохожденииПодчиненныхМероприятий = Документы.ПрохождениеОбученияСУО.ДанныеОПрохожденииПодчиненныхМероприятий(ПрохождениеОбучения, Пользователь, ПроведениеОбучения, ДанныеОПрохожденииОбучения.СхемаПроведения, ВидОбучения);
		КонецЕсли;
		
		//////////////////////////////////////////////////////////////////////////////
		// Получаем данные о состоянии прохождения
		
		// Определяем, проверяется ли преподавателем
		//
		
		Если ВидОбучения.Общее Тогда		
			
			ПроверяетсяПреподавателем = ДанныеОПрохожденииПодчиненныхМероприятий.ПроверяетсяПреподавателем;
			ПроверенПреподавателем    = ДанныеОПрохожденииПодчиненныхМероприятий.ПроверенПреподавателем;				
			
		Иначе
			
			Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
				
				// Если обучение на основе электронного ресурса, то преподаватель
				// должен проверять его, чтобы считалось, что все мероприятие проверено.
				// Т.е. преподаватель проверяет электронный ресурс и не может
				// проверить мероприятие без учета прохождения электронного ресурса.
				
				ПроверяетсяПреподавателем = ДанныеОПрохожденииЭР.ПроверяетсяПреподавателем;
				ПроверенПреподавателем    = ДанныеОПрохожденииЭР.ПроверенПреподавателем;
				
			Иначе
				
				Если Задания = Неопределено Тогда									
					ПроверяетсяПреподавателем = Ложь;
					ПроверенПреподавателем    = Ложь;			
				Иначе					
					Если ДанныеПрохожденияЗаданий = Неопределено Тогда
						ДанныеПрохожденияЗаданий = Документы.ПопыткаВыполненияЗаданияСУО.ДанныеОПрохожденииЗаданий(ПрохождениеОбучения, Задания, Сценарий, ВидОбучения);					
					КонецЕсли;				
					ПроверяетсяПреподавателем = ДанныеПрохожденияЗаданий.ПроверяетсяПреподавателем;
					ПроверенПреподавателем    = ДанныеПрохожденияЗаданий.ПроверенПреподавателем;			
				КонецЕсли;					
				
			КонецЕсли;				
			
		КонецЕсли;
		
		// Определяем, возвращено ли на доработку
		//
		
		ПрохождениеВозвращеноНаДоработку = Неопределено;	
		
		Если Задания <> Неопределено Тогда
			
			Если ДанныеПрохожденияЗаданий = Неопределено Тогда
				ДанныеПрохожденияЗаданий = Документы.ПопыткаВыполненияЗаданияСУО.ДанныеОПрохожденииЗаданий(ПрохождениеОбучения, Задания, Сценарий, ВидОбучения);					
			КонецЕсли;
			
			ПрохождениеВозвращеноНаДоработку = ДанныеПрохожденияЗаданий.ВозвращеноНаДоработку;
			
		КонецЕсли;
		
		Если ВидОбучения.Общее Тогда		
			ПрохождениеВозвращеноНаДоработку = ДанныеОПрохожденииПодчиненныхМероприятий.ВозвращеноНаДоработку;		
		КонецЕсли;		
		
		// Получаем процент завершенности
		//
		
		ЗавершеноВПроцентах = Неопределено;
		
		Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
			
			ЗавершеноВПроцентах = ДанныеОПрохожденииЭР.ЗавершеноВПроцентах;
			
		ИначеЕсли ВидОбучения.Общее Тогда
			
			ЗавершеноВПроцентах = ДанныеОПрохожденииПодчиненныхМероприятий.ЗавершеноВПроцентах;
			
		Иначе
			
			Если Задания <> Неопределено Тогда						
				
				Если ДанныеПрохожденияЗаданий = Неопределено Тогда
					ДанныеПрохожденияЗаданий = Документы.ПопыткаВыполненияЗаданияСУО.ДанныеОПрохожденииЗаданий(ПрохождениеОбучения, Задания, Сценарий, ВидОбучения);					
				КонецЕсли;
				
				ЗавершеноВПроцентах = ДанныеПрохожденияЗаданий.ЗавершеноВПроцентах;
				
			КонецЕсли;			
			
		КонецЕсли;
		
		// Определяем не истекло ли время
		//
		
		ВремяИстекло = Документы.ПрохождениеОбученияСУО.ВремяИстекло(ДанныеОПрохожденииОбучения);
		
		// Получаем статус прохождения обучения
		//
		
		СтатусПрохождения = Неопределено;
		
		Если НЕ Записывать ИЛИ ВидОбучения.ЗавершатьАвтоматически ИЛИ ВремяИстекло Тогда
			
			// Статус обучения может быть установлен вручную, т.е. передан в функцию
			// или автоматически. Здесь определяется автоматический статус. Он будет
			// установлен, если статус не передан в функцию и разрешено завершать
			// обучение автоматически или истекло время обучения. Параметр НЕ Записывать
			// говорит, что данные не будут записаны и надо только определить
			// потенциальный статус (без записи в базу).
			
			// ЗавершеноВПроцентах не учитывает то, что обучение еще может проверяться.
			// Оно показывает только то, сколько учащийся завершил выполнять заданий
			// или подчиненных мероприятий. Так же и статус Завершил, говорит о том,
			// что это учащийся завершил выполнение, но преподаватель еще может 
			// его проверять.
			
			Если СтатусОбучения = Перечисления.СтатусыПроцессаОбученияСУО.ОконченоАвтоматом Тогда
				
				СтатусПрохождения = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат;
				
			ИначеЕсли СтатусОбучения = Перечисления.СтатусыПроцессаОбученияСУО.НеДопущен Тогда
				
				СтатусПрохождения = Перечисления.СтатусыПрохожденияОбъектовСУО.НеДопущен;
				
			ИначеЕсли СтатусОбучения = Перечисления.СтатусыПроцессаОбученияСУО.НеОкончено Тогда
				
				СтатусПрохождения = Перечисления.СтатусыПрохожденияОбъектовСУО.НеЗавершил;
				
			Иначе
				
				МожноЗавершатьАвтоматически = Истина;
				Если Задания <> Неопределено Тогда
					Если ДанныеПрохожденияЗаданий = Неопределено Тогда
						ДанныеПрохожденияЗаданий = Документы.ПопыткаВыполненияЗаданияСУО.ДанныеОПрохожденииЗаданий(ПрохождениеОбучения, Задания, Сценарий, ВидОбучения);					
					КонецЕсли;			
					МожноЗавершатьАвтоматически = ДанныеПрохожденияЗаданий.МожноЗавершатьАвтоматически;			
				КонецЕсли;		
				
				Если ЗавершеноВПроцентах = 100 И МожноЗавершатьАвтоматически Тогда						
					СтатусПрохождения = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил			
				Иначе
					Если ВремяИстекло Тогда
						СтатусПрохождения = Перечисления.СтатусыПрохожденияОбъектовСУО.НеЗавершил;
					Иначе
						СтатусПрохождения = Перечисления.СтатусыПрохожденияОбъектовСУО.Проходит;
					КонецЕсли;				
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтатусПрохождения = Неопределено		
			И ДанныеОПрохожденииОбучения.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Зачислен Тогда
			
			// Данное условие надо, чтобы сбросить статус на Проходит с Новое
			
			Если ЗначениеЗаполнено(ЗавершеноВПроцентах)
				ИЛИ (ДанныеПрохожденияЗаданий <> Неопределено
				И ДанныеПрохожденияЗаданий.ЗавершеноВПроцентах > 0) Тогда
				
				СтатусПрохождения = Перечисления.СтатусыПрохожденияОбъектовСУО.Проходит;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Определяем реквизит "Выставляется оценка"
		//
		
		Если ЗначениеЗаполнено(Статус) Тогда
			ВыставляетсяОценка = Документы.ПрохождениеОбученияСУО.ВыставляетсяОценка(ПрохождениеОбучения, ВидОбучения, ЭлектронныйРесурс, Задания, Статус);
		Иначе
			ВыставляетсяОценка = Документы.ПрохождениеОбученияСУО.ВыставляетсяОценка(ПрохождениеОбучения, ВидОбучения, ЭлектронныйРесурс, Задания, СтатусПрохождения);
		КонецЕсли;
		
		// Получаем баллы за обучение
		//
		
		Баллы = Неопределено;
		ТекущиеБаллы = Неопределено;
		
		Если ВыставляетсяОценка Тогда
			
			Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
				
				// Преподаватель не ставит оценку вручную, даже если он требуется.
				// Если есть электронный ресурс, то преподаватель должен проверять
				// тесты, требующие проверки, а оценка выставится сама.
				
				Баллы = ДанныеОПрохожденииЭР.Баллы;				
				ТекущиеБаллы = ДанныеОПрохожденииЭР.ТекущиеБаллы;
				
			ИначеЕсли ВидОбучения.Общее Тогда
				
				Баллы = ДанныеОПрохожденииПодчиненныхМероприятий.Баллы;
				ТекущиеБаллы = ДанныеОПрохожденииПодчиненныхМероприятий.ТекущиеБаллы;
				
			Иначе			
				
				Если Задания <> Неопределено Тогда
					
					Если ДанныеПрохожденияЗаданий = Неопределено Тогда
						ДанныеПрохожденияЗаданий = Документы.ПопыткаВыполненияЗаданияСУО.ДанныеОПрохожденииЗаданий(ПрохождениеОбучения, Задания, Сценарий, ВидОбучения);					
					КонецЕсли;
					
					Баллы = ДанныеПрохожденияЗаданий.Баллы;						
					ТекущиеБаллы = ДанныеПрохожденияЗаданий.ТекущиеБаллы;
					
				Иначе 
					
					Если ЗначениеЗаполнено(ОценкаЗаМероприятие) Тогда // Выставил баллы преподаватель
						Баллы = УправлениеОбучениемСУОПовтИсп.ПолучитьБаллыИзОценки(ОценкаЗаМероприятие);
					КонецЕсли;									
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;		
		
		//////////////////////////////////////////////////////////////////////////////
		// Записываем документ "Прохождение обучения"
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.ПрохождениеОбученияСУО");
		ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", ПрохождениеОбучения);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();	
		
		ПрохождениеОбъект = ПрохождениеОбучения.ПолучитьОбъект();
		
		Если Записывать Тогда
			Попытка 
				ПрохождениеОбъект.Заблокировать();
			Исключение
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось заблокировать объект %1'"),
				Строка(ПрохождениеОбъект));
			КонецПопытки;
		КонецЕсли;	
		
		Если КомментарийПреподавателя <> Неопределено Тогда
			ПрохождениеОбъект.КомментарийПреподавателя = КомментарийПреподавателя;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Статус) Тогда
			
			// Статус, который передан в функцию устанавливаем в любом случае.
			// Например, такое имеет место, если преподаватель установил его принудительно.
			
			Если ЗавершаетУчащийся Тогда
				
				МожноЗавершать = Истина;
				
				Если НЕ ВидОбучения.ЗавершаетУчащийся Тогда
					
					МожноЗавершать = Ложь;
					ОписаниеПрохождения.Вставить("Сообщение", Новый Структура("Код, Текст", "denyFinish", НСтр("ru = 'Завершение обучения учащимся запрещено'")));
					
				КонецЕсли;			
				
				Если ВидОбучения.ЗавершаетУчащийся Тогда
					
					// Примечание: порядок сообщений важен
					
					// Проверяем условие МинимальныйБаллЗавершенияУчащимся
					
					Если ТипЗнч(Баллы) = Тип("Число") Тогда
						БаллыДляСравнения = Баллы;
					Иначе				
						БаллыДляСравнения = 0;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ВидОбучения.МинимальныйБаллЗавершенияУчащимся) Тогда					
						МинимальныйБаллЗавершенияУчащимся = ВидОбучения.МинимальныйБаллЗавершенияУчащимся;					
					Иначе					
						МинимальныйБаллЗавершенияУчащимся = 0; // Нет ограничений					
					КонецЕсли;								
					
					Если БаллыДляСравнения < МинимальныйБаллЗавершенияУчащимся Тогда
						
						МожноЗавершать = Ложь;
						
						Если ВыставляетсяОценка И ТипЗнч(Баллы) = Тип("Число") Тогда
							ОписаниеПрохождения.Вставить("Сообщение", Новый Структура("Код, Текст", "denyFinishScore", НСтр("ru = 'Вы сможете завершить, когда итоговый балл будет не менее %1. Сейчас Ваш балл - %2.'")));
							ОписаниеПрохождения.Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОписаниеПрохождения.Сообщение.Текст, Строка(МинимальныйБаллЗавершенияУчащимся), Строка(БаллыДляСравнения));
						Иначе
							ОписаниеПрохождения.Вставить("Сообщение", Новый Структура("Код, Текст", "denyFinishScoreWithoutScore", НСтр("ru = 'Вы сможете завершить, когда итоговый балл будет не менее %1. Сейчас итоговая оценка не выставлена.'")));
							ОписаниеПрохождения.Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОписаниеПрохождения.Сообщение.Текст, Строка(МинимальныйБаллЗавершенияУчащимся));
						КонецЕсли;
						
						ОписаниеПрохождения.Вставить("МинимальныйБаллЗавершенияУчащимся", МинимальныйБаллЗавершенияУчащимся);
						
					КонецЕсли;				
					
					// Проверяем условие МинимальныйПрогрессЗавершенияУчащимся
					
					Если ТипЗнч(ЗавершеноВПроцентах) = Тип("Число") Тогда
						ЗавершеноВПроцентахДляСравнения = ЗавершеноВПроцентах;
					Иначе				
						ЗавершеноВПроцентахДляСравнения = 0;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ВидОбучения.МинимальныйПрогрессЗавершенияУчащимся) Тогда					
						МинимальныйПрогрессЗавершенияУчащимся = ВидОбучения.МинимальныйПрогрессЗавершенияУчащимся;					
					Иначе					
						МинимальныйПрогрессЗавершенияУчащимся = 0; // Нет ограничений					
					КонецЕсли;								
					
					Если ЗавершеноВПроцентахДляСравнения < МинимальныйПрогрессЗавершенияУчащимся Тогда
						
						МожноЗавершать = Ложь;
						
						Если ЗавершеноВПроцентахДляСравнения = 100 Тогда
							
							ОписаниеПрохождения.Вставить("Сообщение", Новый Структура("Код, Текст", "denyFinishProgressAll", НСтр("ru = 'Для завершения обучения выполните все задания. Сейчас выполнено %1 процентов заданий'")));
							ОписаниеПрохождения.Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОписаниеПрохождения.Сообщение.Текст, Строка(ЗавершеноВПроцентахДляСравнения));
							
						Иначе
							
							ОписаниеПрохождения.Вставить("Сообщение", Новый Структура("Код, Текст", "denyFinishProgress", НСтр("ru = 'Обучение можно будет завершить после выполнения не менее %1 процентов заданий. Сейчас выполнено %2 процентов'")));
							ОписаниеПрохождения.Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОписаниеПрохождения.Сообщение.Текст, Строка(МинимальныйПрогрессЗавершенияУчащимся), Строка(ЗавершеноВПроцентахДляСравнения));						
							
						КонецЕсли;
						
						
						ОписаниеПрохождения.Вставить("МинимальныйПрогрессЗавершенияУчащимся", МинимальныйПрогрессЗавершенияУчащимся);
						
					КонецЕсли;
					
					// Проверяем не проверяется ли обучение преподавателем
					
					Если Электронное И ПроверяетсяПреподавателем И НЕ ПроверенПреподавателем И НЕ Справочники.ВидыМероприятийСУО.ЗаданияПроверяютсяВыборочно(ВидОбучения) Тогда					
						МожноЗавершать = Ложь;					
						ОписаниеПрохождения.Вставить("Сообщение", Новый Структура("Код, Текст", "denyFinishMustVerifiedTeacher", НСтр("ru = 'Обучение можно будет завершить, когда преподаватель проверит задания и выставит оценку'")));										
					КонецЕсли;
					
					Если Электронное И ПроверяетсяПреподавателем И ПрохождениеВозвращеноНаДоработку = Истина Тогда
						МожноЗавершать = Ложь;					
						ОписаниеПрохождения.Вставить("Сообщение", Новый Структура("Код, Текст", "denyFinishWhenToRevision", НСтр("ru = 'Обучение завершить нельзя. Есть задания, возвращенные на доработку'")));
					КонецЕсли;
					
				КонецЕсли;				
				
				
				Если ВидОбучения.ЗавершаетУчащийся
					И ВидОбучения.КоличествоФайловДляЗавершенияУчастником > 0
					И ВидОбучения.РазрешитьУчащимсяПрикреплятьФайлы Тогда
					
					КоличествоПрикрепленныхФайлов = Документы.ПрохождениеОбученияСУО.КоличествоПрикрепленныхФайлов(ПрохождениеОбучения);
					
					Если КоличествоПрикрепленныхФайлов < ВидОбучения.КоличествоФайловДляЗавершенияУчастником Тогда
						
						МожноЗавершать = Ложь;
						ОписаниеПрохождения.Вставить("Сообщение", Новый Структура("Код, Текст", "denyFinishFiles", НСтр("ru = 'Обучение можно будет завершить, когда к нему будут прикреплены не менее %1 файла(ов). Сейчас прикреплены %2 файла(ов)'")));
						ОписаниеПрохождения.Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОписаниеПрохождения.Сообщение.Текст, Строка(ВидОбучения.КоличествоФайловДляЗавершенияУчастником), Строка(КоличествоПрикрепленныхФайлов));
						
						ОписаниеПрохождения.Вставить("КоличествоПрикрепленныхФайлов", КоличествоПрикрепленныхФайлов);
						ОписаниеПрохождения.Вставить("КоличествоФайловДляЗавершенияУчастником", ВидОбучения.КоличествоФайловДляЗавершенияУчастником);
						
					КонецЕсли;				
					
				КонецЕсли;
				
				
				Если МожноЗавершать Тогда
					
					Если ВремяИстекло Тогда					
						ПрохождениеОбъект.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.НеЗавершил;					
					Иначе				
						ПрохождениеОбъект.Статус = Статус;					
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				ПрохождениеОбъект.Статус = Статус;
				
			КонецЕсли;
			
			
		Иначе		
			
			Если СтатусПрохождения <> Неопределено Тогда			
				ПрохождениеОбъект.Статус = СтатусПрохождения; 			
			КонецЕсли;
			
		КонецЕсли;
		
		Если УстановитьСнятьОтмену Тогда
			ПрохождениеОбъект.Отменено = НЕ ПрохождениеОбъект.Отменено;
		КонецЕсли;
		
		ПрохождениеОбъект.Баллы = 0;
		ПрохождениеОбъект.ТекущиеБаллы = ТекущиеБаллы;
		ПрохождениеОбъект.ВыставляетсяОценка = ВыставляетсяОценка;
		ПрохождениеОбъект.ВыставленаОценка = Ложь;
		
		Если ПрохождениеОбъект.ВыставляетсяОценка Тогда
		
			Если ПрохождениеОбъект.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат Тогда
				ПрохождениеОбъект.Баллы = 100;
				ПрохождениеОбъект.ТекущиеБаллы = 100;
				ПрохождениеОбъект.ВыставленаОценка = Истина;
			КонецЕсли;		
			
			Если ПрохождениеОбъект.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил Тогда			
				ПрохождениеОбъект.Баллы = Баллы;
				ПрохождениеОбъект.ТекущиеБаллы = Баллы;
				Если ЭтоЗавершениеПреподавателемБезОценки Тогда
					ПрохождениеОбъект.ВыставленаОценка = Ложь;
				Иначе
					ПрохождениеОбъект.ВыставленаОценка = Истина;
				КонецЕсли;
			КонецЕсли;		
			
		КонецЕсли;
			
		Если ПрохождениеОбъект.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат Тогда
			ПрохождениеОбъект.ЗавершеноВПроцентах = 100;	
		ИначеЕсли ЗавершеноВПроцентах <> Неопределено Тогда
			ПрохождениеОбъект.ЗавершеноВПроцентах = ЗавершеноВПроцентах;
		Иначе
			ПрохождениеОбъект.ЗавершеноВПроцентах = 0;
		КонецЕсли;		
		
		ПрохождениеОбъект.ПроверяетсяПреподавателем = ПроверяетсяПреподавателем;
		ПрохождениеОбъект.ПроверенПреподавателем = ?(ПроверяетсяПреподавателем, ПроверенПреподавателем, Ложь);
		
		Если ПрохождениеОбъект.ПроверяетсяПреподавателем Тогда
			
			// Если выставлена оценка, то значит преподаватель проверил мероприятие.
			
			Если (ПрохождениеОбъект.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил
				ИЛИ ПрохождениеОбъект.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат)
				И ЗначениеЗаполнено(ОценкаЗаМероприятие) Тогда
				
				ПрохождениеОбъект.ПроверенПреподавателем = Истина;			
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПрохождениеВозвращеноНаДоработку <> Неопределено Тогда		
			ПрохождениеОбъект.ВозвращеноНаДоработку = ПрохождениеВозвращеноНаДоработку; 		
		КонецЕсли;
		
		// Примечание: переменные ДатаНачалаПрохождения и ДатаОкончанияПрохождения
		// заполняются в обработчике объекта перед записью документа.
		
		ОбучениеПройдено = Документы.ПрохождениеОбученияСУО.Пройдено(ПрохождениеОбъект.Статус);
		
		Если НЕ ЗначениеЗаполнено(ПрохождениеОбъект.ДатаНачалаОбучения)
			И (ПрохождениеОбъект.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Проходит
			ИЛИ ОбучениеПройдено) Тогда  // Обучение может быть пройдено сразу без статуса Проходит		
			ПрохождениеОбъект.ДатаНачалаОбучения = ТекущаяДата;		
		КонецЕсли;
		
		Если НЕ ОбучениеПройдено Тогда
			ПрохождениеОбъект.ДатаОкончанияОбучения = Неопределено;	
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ПрохождениеОбъект.ДатаОкончанияОбучения) И ОбучениеПройдено Тогда
			ПрохождениеОбъект.ДатаОкончанияОбучения = ТекущаяДата;
		КонецЕсли;		
		
		ПрохождениеОбъект.ДатаПоследнейАктивности = ТекущаяДата;
		
		
		СледующееПрохождение = Неопределено;
		
		Если Записывать Тогда
			
			Если НеОбновлятьДанныеВебКабинета <> Неопределено Тогда
				ПрохождениеОбъект.ДополнительныеСвойства.Вставить("НеОбновлятьДанныеВебКабинета", НеОбновлятьДанныеВебКабинета);
			КонецЕсли;		
			
			ПрохождениеОбъект.ДополнительныеСвойства.Вставить("ПриПрохожденииОбучения", Истина);
			ПрохождениеОбъект.ДополнительныеСвойства.Вставить("ОбновлятьПодчиненныеДокументы", ОбновлятьПодчиненные);
			ПрохождениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			УправлениеОбучениемСУО.СоздатьАвтоматическуюРассылку(ПрохождениеОбъект);
			
			//////////////////////////////////////////////////////////////////////////////
			
			Если ЗначениеЗаполнено(ДанныеОПрохожденииОбучения.РодительскоеПрохождение) Тогда
				
				Если ЗначениеЗаполнено(ДанныеОПрохожденииОбучения.СхемаПроведения) 
					И (ДанныеОПрохожденииОбучения.СтатусРодительскогоПрохождения = Перечисления.СтатусыПрохожденияОбъектовСУО.Зачислен 
					ИЛИ ДанныеОПрохожденииОбучения.СтатусРодительскогоПрохождения = Перечисления.СтатусыПрохожденияОбъектовСУО.Проходит)  Тогда
					
					ДанныеСхемы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеОПрохожденииОбучения.СхемаПроведения, "ПоследовательноеПрохождение, ЗачислятьНаСледующееПослеПроверки");
					
					Если ДанныеСхемы.ПоследовательноеПрохождение Тогда
						
						ТаблицаПодчиненныхМероприятий = Документы.ПроведениеОбученияСУО.ПодчиненныеМероприятия(ПроведениеОбучения,,ДанныеОПрохожденииОбучения.СхемаПроведения);
						
						// Таблица отсортирована по номеру мероприятия
						
						Запрос = Новый Запрос;				
						Запрос.Текст = "ВЫБРАТЬ
						|	УчастникиОбученияСУО.Статус КАК Статус,
						|	УчастникиОбученияСУО.Сценарий КАК Сценарий,
						|	УчастникиОбученияСУО.ПроверяетсяПреподавателем,
						|	УчастникиОбученияСУО.ПроверенПреподавателем
						|ИЗ
						|	РегистрСведений.УчастникиОбученияСУО КАК УчастникиОбученияСУО
						|ГДЕ
						|	УчастникиОбученияСУО.Пользователь = &Пользователь
						|	И УчастникиОбученияСУО.ПроведениеОбучения = &ПроведениеОбучения";
						
						Запрос.УстановитьПараметр("Пользователь", Пользователь);
						Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);
						
						Результат = Запрос.Выполнить();
						
						ТаблицаПрохожденийМероприятий = Результат.Выгрузить();
						
						ПредыдущаяСтрокаТПМ = Неопределено;
						
						Для каждого СтрокаПМ Из ТаблицаПодчиненныхМероприятий Цикл
							
							СтрокаТПМ = ТаблицаПрохожденийМероприятий.Найти(СтрокаПМ.Мероприятие, "Сценарий");
							
							Если СтрокаТПМ = Неопределено
								И ПредыдущаяСтрокаТПМ <> Неопределено
								И (ПредыдущаяСтрокаТПМ.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил
								ИЛИ ПредыдущаяСтрокаТПМ.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат) Тогда
								
								Если НЕ ДанныеСхемы.ЗачислятьНаСледующееПослеПроверки ИЛИ (ПредыдущаяСтрокаТПМ.ПроверяетсяПреподавателем И ПредыдущаяСтрокаТПМ.ПроверенПреподавателем) ИЛИ НЕ ПредыдущаяСтрокаТПМ.ПроверяетсяПреподавателем ИЛИ Справочники.ВидыМероприятийСУО.ЗаданияПроверяютсяВыборочно(ВидОбучения) Тогда
									
									// Условие равносильно СтатусыПроцессаОбученияСУО.Окончено.
									// т.е. мы зачисляем на следующее, если обучение завершено и проверено
									// или завершено и не требует проверки или стоит настройка ВидОбучения.ЗаданияПроверяютсяВыборочно.
									
									СледующееПрохождение = УправлениеОбучениемСУО.ЗачислитьУчастникаНаОбучение(ПроведениеОбучения, СтрокаПМ.Мероприятие, Пользователь, ДанныеОПрохожденииОбучения.УчебнаяГруппа, ДанныеОПрохожденииОбучения.РодительскоеПрохождение, ДанныеОПрохожденииОбучения.Заявка);
									
								КонецЕсли;
								
								Прервать;
								
							КонецЕсли;
							
							Если СтрокаТПМ = Неопределено Тогда
								
								ПредыдущаяСтрокаТПМ = Неопределено;
								
							Иначе
								
								ПредыдущаяСтрокаТПМ = СтрокаТПМ;
								
							КонецЕсли;
							
							
						КонецЦикла;
						
					КонецЕсли;			
					
				КонецЕсли;
				
				ОписаниеРодительскогоПрохождения = ПриПрохожденииМероприятия(
					ДанныеОПрохожденииОбучения.РодительскоеПрохождение,,,,,,НеОбновлятьДанныеВебКабинета,,,ОбновлятьПодчиненные); // Рекурсия
				
			Иначе // Простое или общее
				
				Если ЗначениеЗаполнено(ДанныеОПрохожденииОбучения.ПрохождениеПрограммыОбучения) Тогда
					ПриПрохожденииПрограммыОбучения(ДанныеОПрохожденииОбучения.ПрохождениеПрограммыОбучения);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;	
		
		//////////////////////////////////////////////////////////////////////////////
		// Выдаем сертификат	
		
		Сертификат = Неопределено;
		
		Если (ПрохождениеОбъект.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил
			ИЛИ ПрохождениеОбъект.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат)
			И НЕ ЗначениеЗаполнено(ДанныеОПрохожденииОбучения.РодительскоеПрохождение) Тогда				
			
			Сертификат = УправлениеОбучениемСУО.ВыдатьСертификат(ПрохождениеОбучения, НеОбновлятьДанныеВебКабинета, ДанныеОПрохожденииОбучения);
			
		КонецЕсли;
		
		//////////////////////////////////////////////////////////////////////////////
		// Завершаем
		
		ТребуетсяЗаполнитьАнкету = Ложь;
		СтатусПроцессаОбучения = Документы.ПрохождениеОбученияСУО.СтатусПроцессаОбучения(ПрохождениеОбучения);
		
		ОписаниеПрохождения.Вставить("ТребуетсяЗаполнитьАнкету", ТребуетсяЗаполнитьАнкету);
		ОписаниеПрохождения.Вставить("Статус", ПрохождениеОбъект.Статус);
		ОписаниеПрохождения.Вставить("СтатусСтрока", ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ПрохождениеОбъект.Статус));
		ОписаниеПрохождения.Вставить("СтатусРасчетныйСтрока", ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(СтатусПрохождения));
		ОписаниеПрохождения.Вставить("ВремяИстекло", ВремяИстекло);
		ОписаниеПрохождения.Вставить("ЗавершеноВПроцентах", ЗавершеноВПроцентах);
		ОписаниеПрохождения.Вставить("Баллы", Баллы);
		ОписаниеПрохождения.Вставить("ТекущиеБаллы", ТекущиеБаллы);
		ОписаниеПрохождения.Вставить("РодительскоеПрохождение", ДанныеОПрохожденииОбучения.РодительскоеПрохождение);
		ОписаниеПрохождения.Вставить("СледующееПрохождение", СледующееПрохождение);
		ОписаниеПрохождения.Вставить("Сертификат", Сертификат);
		ОписаниеПрохождения.Вставить("ОписаниеРодительскогоПрохождения", ОписаниеРодительскогоПрохождения);
		ОписаниеПрохождения.Вставить("ЗаданияДоступны", ЗаданияДоступны);
		ОписаниеПрохождения.Вставить("СтатусПроцессаОбучения", СтатусПроцессаОбучения);
		ОписаниеПрохождения.Вставить("ВыставляетсяОценка", ВыставляетсяОценка);
		ОписаниеПрохождения.Вставить("Актуально", Документы.ПрохождениеОбученияСУО.Актуально(ПрохождениеОбучения, СтатусПроцессаОбучения));
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	
	Возврат ОписаниеПрохождения;
	
КонецФункции

// Событие срабатывает при прохождении задания. 
//
// Попытка прохождения задания фиксирует все данные о том,
// как пользователь выполнял задание. Событие вызывается при
// прохождении электронного ресурса, как задания, а так же
// при проверке его преподавателем.
//
Функция ПриПрохожденииЗадания(ПрохождениеОбучения, Задание, Оценка = Неопределено, КомментарийПреподавателя = Неопределено, ВызватьСобытияВладельца = Истина, Вариант = Неопределено, ЕстьНеРеализованныеПопытки = Ложь, НеОбновлятьДанныеВебКабинета = Неопределено, ПопыткаЗавершена = Неопределено, ТекстОтвета = Неопределено, Знач ЗавершаетУчащийся = Ложь, Знач ПопыткаВыполненияЗадания = Неопределено, Знач ПричинаВозвратаЗадания = Неопределено, Знач ПроверяющийПреподаватель = Неопределено, Знач УстановитьОтмену = Неопределено, Знач Записывать = Истина) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		УстановитьПривилегированныйРежим(Истина);
		
		Если ЗначениеЗаполнено(ПопыткаВыполненияЗадания)
			И (НЕ ЗначениеЗаполнено(ПрохождениеОбучения) ИЛИ НЕ ЗначениеЗаполнено(Задание)) Тогда
			
			ДанныеПопыткиВыполненияЗадания = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПопыткаВыполненияЗадания, "ПрохождениеОбучения, Задание");
			
			ПрохождениеОбучения = ДанныеПопыткиВыполненияЗадания.ПрохождениеОбучения;
			Задание = ДанныеПопыткиВыполненияЗадания.Задание;
			
		КонецЕсли;
		
		ОписаниеПрохождения = Новый Структура(
		"ЭлектронныйРесурс,
		|Фрагмент,
		|ПопыткаВыполненияЗадания,
		|Вариант, 
		|ОписаниеПрохожденияМероприятия,
		|Пользователь,
		|ЭлектронныйКурс, 
		|ПроведениеОбучения,
		|Сообщение,
		|ПрохождениеОбучения,
		|ВыставляетсяОценка");
		
		ТребуемыеДанныеПрохожденияОбучения = Новый Структура(
		"Пользователь,
		|Сценарий,
		|ПроведениеОбучения,
		|ДатаКонтроля,
		|ДатаОкончанияПроведения,
		|ДатаНачалаПрохождения,
		|ВариантПродолжительности,
		|ДатаЗачисления,
		|ПродолжительностьВСекундах,
		|Статус",		
		"Пользователь",
		"Сценарий",
		"ПроведениеОбучения",
		"ПроведениеОбучения.ДатаКонтроля",
		"ПроведениеОбучения.ДатаОкончанияПроведения",
		"ДатаНачалаПрохождения",
		"ПроведениеОбучения.ВариантПродолжительности",
		"Дата",
		"ПродолжительностьВСекундах",
		"Статус");
		
		ДанныеПрохожденияОбучения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеОбучения, ТребуемыеДанныеПрохожденияОбучения);		
		
		НаОсновеЭлектронногоРесурса = ТипЗнч(Задание) = Тип("СправочникСсылка.СводыЗнанийСУЗ")
			ИЛИ (ТипЗнч(Задание) = Тип("СправочникСсылка.ЗаданияСУО") И Задание.НаОсновеЭлектронногоРесурса И НЕ Задание.ПреподавательВыставляетОценку)
			ИЛИ (ТипЗнч(Задание) = Тип("СправочникСсылка.ЭлектронныеКурсы"));
			
		СтатусОбученияДляПринудительнойУстановки = Неопределено;
		
		СвойстваЗадания = Документы.ПрохождениеОбученияСУО.СвойстваЗаданияПрохождения(ПрохождениеОбучения, Задание);
		
		Если (ЗавершаетУчащийся И ПопыткаЗавершена = Истина) ИЛИ (НЕ ЗавершаетУчащийся И ПопыткаЗавершена = Ложь И НЕ НаОсновеЭлектронногоРесурса) Тогда
			
			ВремяИстекло = Документы.ПопыткаВыполненияЗаданияСУО.ВремяИстекло(СвойстваЗадания, ДанныеПрохожденияОбучения);
			
			Если ВремяИстекло И ЗавершаетУчащийся Тогда
				
				ПопыткаЗавершена = Ложь;
				Если НЕ ЗначениеЗаполнено(ОписаниеПрохождения.Сообщение) Тогда
					ОписаниеПрохождения.Сообщение = Новый Структура("Код, Текст", "expiredTime",
						НСтр("ru = 'Закончилось отведенное время'"));
				КонецЕсли;
				
			КонецЕсли;
			
			Если ВремяИстекло И НЕ ЗавершаетУчащийся Тогда
				
				Если ДанныеПрохожденияОбучения.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Проходит Тогда
					
					ПопыткаЗавершена = Неопределено;
					Если НЕ ЗначениеЗаполнено(ОписаниеПрохождения.Сообщение) Тогда
						ОписаниеПрохождения.Сообщение = Новый Структура("Код, Текст", "expiredTimeToRevision",
							НСтр("ru = 'Невозможно вернуть задание на доработку, т.к. закончилось отведенное время'"));
					КонецЕсли;
					
				Иначе
					
					ПопыткаЗавершена = Неопределено;
					Если НЕ ЗначениеЗаполнено(ОписаниеПрохождения.Сообщение) Тогда
						ОписаниеПрохождения.Сообщение = Новый Структура("Код, Текст", "completedToRevision",
							НСтр("ru = 'Невозможно вернуть задание на доработку, т.к. данный пользователь уже завершил обучение'"));					
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ВидОбучения = Документы.ПроведениеОбученияСУО.ВидОбучения(ДанныеПрохожденияОбучения.ПроведениеОбучения, ДанныеПрохожденияОбучения.Сценарий);
		
		// Примечание: Если прохождение не было создано, то создается новое. Если
		// прохождение существует, то берется последнее и редактируется.
		// Два прохождения одного задания быть не может, кроме случая,
		// когда одно из проведений было не проведено, а потом его провели,
		// когда новое уже создалось.
		// 
		
		Если НЕ ЗначениеЗаполнено(ПопыткаВыполненияЗадания) Тогда
			ПопыткаВыполненияЗадания = ПоследнееПрохождениеЗадания(ПрохождениеОбучения, Задание);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Задание) И ЗначениеЗаполнено(ПопыткаВыполненияЗадания) Тогда
			Задание = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПопыткаВыполненияЗадания, "Задание");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ПрохождениеОбучения) И ЗначениеЗаполнено(ПопыткаВыполненияЗадания) Тогда			
			ПрохождениеОбучения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПопыткаВыполненияЗадания, "ПрохождениеОбучения");			
			ДанныеПрохожденияОбучения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеОбучения, ТребуемыеДанныеПрохожденияОбучения);					
		КонецЕсли;
		
		Если ПопыткаВыполненияЗадания = Неопределено Тогда			
			
			ПопыткаВыполненияЗаданияОбъект = Документы.ПопыткаВыполненияЗаданияСУО.СоздатьДокумент();
			ПопыткаВыполненияЗаданияОбъект.Дата = ТекущаяДата();			
			
		Иначе			
			
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.ПопыткаВыполненияЗаданияСУО");
			ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", ПопыткаВыполненияЗадания);
			ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
			БлокировкаДанных.Заблокировать();
			
			ПопыткаВыполненияЗаданияОбъект = ПопыткаВыполненияЗадания.ПолучитьОбъект();			
			
			Попытка 
				ПопыткаВыполненияЗаданияОбъект.Заблокировать();
			Исключение
				ВызватьИсключение НСтр("ru = 'Задание еще обновляется. Повторите операцию через некоторое время'");
			КонецПопытки;		
			
		КонецЕсли;
		
		Если Вариант <> Неопределено И НЕ ЗначениеЗаполнено(ПопыткаВыполненияЗаданияОбъект.Вариант) Тогда
			ПопыткаВыполненияЗаданияОбъект.Вариант = Вариант; // Повторно изменить вариант нельзя.
		КонецЕсли;
		
		Если ТипЗнч(Задание) = Тип("СправочникСсылка.ЗаданияСУО")
			И Задание.НесколькоВариантов	
			И НЕ ЗначениеЗаполнено(ПопыткаВыполненияЗаданияОбъект.Вариант) Тогда
			
			ПопыткаВыполненияЗаданияОбъект.Вариант = Справочники.ЗаданияСУО.СлучайныйВариантЗадания(Задание); // Случайный вариант
			
		КонецЕсли;
		
		ПопыткаВыполненияЗаданияОбъект.ПрохождениеОбучения = ПрохождениеОбучения;
		ПопыткаВыполненияЗаданияОбъект.ПроведениеОбучения  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПрохождениеОбучения, "ПроведениеОбучения");
		ПопыткаВыполненияЗаданияОбъект.Задание             = Задание;
		
		Если КомментарийПреподавателя <> Неопределено Тогда
			ПопыткаВыполненияЗаданияОбъект.КомментарийПреподавателя = КомментарийПреподавателя;
		КонецЕсли;
		
		Если ТекстОтвета <> Неопределено Тогда
			ПопыткаВыполненияЗаданияОбъект.Описание = ТекстОтвета;
		КонецЕсли;
		
		ПроверенПреподавателемСтароеЗначение = ПопыткаВыполненияЗаданияОбъект.ПроверенПреподавателем;
		ВозвращеноНаДоработкуСтароеЗначение = ПопыткаВыполненияЗаданияОбъект.ВозвращеноНаДоработку;
		ПопыткаЗавершенаСтароеЗначение = ПопыткаВыполненияЗаданияОбъект.ПопыткаЗавершена;
		
		Если ДанныеПрохожденияОбучения.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Зачислен Тогда
			СтатусОбученияДляПринудительнойУстановки = Перечисления.СтатусыПрохожденияОбъектовСУО.Проходит;
		КонецЕсли;
		
		Если НаОсновеЭлектронногоРесурса Тогда
			
			Если ТипЗнч(Задание) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
				ДанныеОПрохождении = ЭлектронныеРесурсыСУЗ.ДанныеОПрохожденииЭлектронногоРесурса(Задание,, ДанныеПрохожденияОбучения.Пользователь, ПрохождениеОбучения, Задание,,ВидОбучения);
			ИначеЕсли ТипЗнч(Задание) = Тип("СправочникСсылка.ЭлектронныеКурсы") Тогда				
				ИзучениеЭлектронногоКурса = ИзучениеЭлектронныхКурсов.НайтиИзучениеПоКонтексту(Задание, ПопыткаВыполненияЗаданияОбъект.ПроведениеОбучения, ДанныеПрохожденияОбучения.Пользователь);
				ДанныеОПрохождении = ИзучениеЭлектронныхКурсов.ДанныеОбИзученииЭлектронногоКурса(ИзучениеЭлектронногоКурса); 
				ДанныеОПрохождении.Вставить("Баллы", ДанныеОПрохождении.Балл);
				ДанныеОПрохождении.Вставить("ПроверяетсяПреподавателем", Ложь);
				ДанныеОПрохождении.Вставить("ПроверенПреподавателем", Ложь);
				ДанныеОПрохождении.Вставить("ЕстьНеРеализованныеДобавленныеПопытки", Ложь);
				ДанныеОПрохождении.Вставить("ЗатраченоВремениВСекундах", 0); // Не реализовано в БЭО
				ДанныеОПрохождении.Вставить("ВыставляетсяОценка", ВидОбучения.ВыставляетсяОценка); // Не реализовано в БЭО
			ИначеЕсли ЗначениеЗаполнено(ПопыткаВыполненияЗаданияОбъект.Вариант) Тогда
				ДанныеОПрохождении = ЭлектронныеРесурсыСУЗ.ДанныеОПрохожденииЭлектронногоРесурса(ПопыткаВыполненияЗаданияОбъект.Вариант.ЭлектронныйРесурс, ПопыткаВыполненияЗаданияОбъект.Вариант.Фрагмент, ДанныеПрохожденияОбучения.Пользователь, ПрохождениеОбучения, Задание, Задание.МетодВыбораПопыткиПрохождения,ВидОбучения);
			Иначе
				ДанныеОПрохождении = ЭлектронныеРесурсыСУЗ.ДанныеОПрохожденииЭлектронногоРесурса(Задание.ЭлектронныйРесурс, Задание.Фрагмент, ДанныеПрохожденияОбучения.Пользователь, ПрохождениеОбучения, Задание, Задание.МетодВыбораПопыткиПрохождения,ВидОбучения);
			КонецЕсли;
			
			ПопыткаВыполненияЗаданияОбъект.Баллы                     = ДанныеОПрохождении.Баллы;
			ПопыткаВыполненияЗаданияОбъект.ЗавершеноВПроцентах       = ДанныеОПрохождении.ЗавершеноВПроцентах;
			ПопыткаВыполненияЗаданияОбъект.ПроверяетсяПреподавателем = ДанныеОПрохождении.ПроверяетсяПреподавателем; 
			ПопыткаВыполненияЗаданияОбъект.ПроверенПреподавателем    = ДанныеОПрохождении.ПроверенПреподавателем;
			ПопыткаВыполненияЗаданияОбъект.ЗатраченоВремениВСекундах = ДанныеОПрохождении.ЗатраченоВремениВСекундах;
			
			Если ДанныеОПрохождении.ЗавершеноВПроцентах = 100 Тогда				
				
				ПопыткаВыполненияЗаданияОбъект.ПопыткаЗавершена = Истина;
				
				// Примечание: НЕ ДанныеОПрохождении.ЕстьНезавершенныеПопытки
				// не учитываем, т.е. разрешаем иметь незавершенные попытки.
				// Это лучше, так как пользователи бросают тесты, если плохо
				// их проходят и потом не понимают, почему не могут пройти дальше.
				
			Иначе
				
				ПопыткаВыполненияЗаданияОбъект.ПопыткаЗавершена = Ложь;
				
			КонецЕсли;
			
			Если НЕ ЕстьНеРеализованныеПопытки Тогда
				ЕстьНеРеализованныеПопытки = ДанныеОПрохождении.ЕстьНеРеализованныеДобавленныеПопытки;
			КонецЕсли;
			
			ПопыткаВыполненияЗаданияОбъект.ВозвращеноНаДоработку = Ложь;
			
		Иначе
			
			// В этом случае задание проверяется преподавателем. Оно считается проверенным,
			// когда он выставил оценку или указал "Попытка завершена". Если указал
			// явно, что попытка не завершена, то задание считается не проверенным
			// и оценка и процент завершения сбрасываются.
			
			ПопыткаВыполненияЗаданияОбъект.ПроверяетсяПреподавателем = ВидОбучения.ТребуетсяПреподаватель; 
			
			Если ПопыткаВыполненияЗаданияОбъект.ПроверяетсяПреподавателем Тогда
				
				Если НЕ ЗавершаетУчащийся И ЗначениеЗаполнено(Оценка) Тогда
					
					// Выставил оценку преподаватель
					
					ПопыткаВыполненияЗаданияОбъект.Баллы                     = УправлениеОбучениемСУОПовтИсп.ПолучитьБаллыИзОценки(Оценка);
					ПопыткаВыполненияЗаданияОбъект.ЗавершеноВПроцентах       = 100;
					ПопыткаВыполненияЗаданияОбъект.ПопыткаЗавершена          = Истина;
					ПопыткаВыполненияЗаданияОбъект.ПроверенПреподавателем    = Истина;
					ПопыткаВыполненияЗаданияОбъект.ВозвращеноНаДоработку     = Ложь;				
					
				КонецЕсли;
				
				Если ПопыткаЗавершена <> Неопределено Тогда
					
					Если ПопыткаЗавершена Тогда
						
						// Отмечаем, как проверенное (если это преподаватель)
						// Сдаем на проверку (если это ученик)
						
						ПопыткаВыполненияЗаданияОбъект.ЗавершеноВПроцентах             = 100;
						ПопыткаВыполненияЗаданияОбъект.ПопыткаЗавершена                = Истина;
						ПопыткаВыполненияЗаданияОбъект.ПроверенПреподавателем          = НЕ ЗавершаетУчащийся;
						ПопыткаВыполненияЗаданияОбъект.ВозвращеноНаДоработку           = Ложь;
						ПопыткаВыполненияЗаданияОбъект.ПроверяющийПреподаватель        = Неопределено;
						ПопыткаВыполненияЗаданияОбъект.ДатаПоследнейАктивностиПроверки = Неопределено;
						
					Иначе
						
						Если ЗавершаетУчащийся И (ПопыткаВыполненияЗаданияОбъект.ПроверенПреподавателем
							ИЛИ ПопыткаВыполненияЗаданияОбъект.ВозвращеноНаДоработку) Тогда
							
							ПопыткаЗавершена = Неопределено;
							Если НЕ ЗначениеЗаполнено(ОписаниеПрохождения.Сообщение) Тогда
								ОписаниеПрохождения.Сообщение = Новый Структура("Код, Текст", "noCancelTaskAnswer",
									НСтр("ru = 'Невозможно отозвать ответ, так как задание уже проверено преподавателем'"));
							КонецЕсли;
							
						КонецЕсли;
						
						Если ЗавершаетУчащийся
							И ЗначениеЗаполнено(ПопыткаВыполненияЗаданияОбъект.ДатаПоследнейАктивностиПроверки) Тогда
							
							ПопыткаЗавершена = Неопределено;
							Если НЕ ЗначениеЗаполнено(ОписаниеПрохождения.Сообщение) Тогда
								ОписаниеПрохождения.Сообщение = Новый Структура("Код, Текст", "noCancelTaskAnswer",
									НСтр("ru = 'Невозможно отозвать ответ, так как задание уже открыто преподавателем'"));
							КонецЕсли;
								
						КонецЕсли;
						
						Если ПопыткаЗавершена <> Неопределено Тогда 
							
							ПопыткаВыполненияЗаданияОбъект.Баллы                     = 0;
							ПопыткаВыполненияЗаданияОбъект.ЗавершеноВПроцентах       = 0;
							ПопыткаВыполненияЗаданияОбъект.ПопыткаЗавершена          = Ложь;							
							
							Если ЗавершаетУчащийся Тогда
								// Возвращаем ответ (если это ученик)
								ПопыткаВыполненияЗаданияОбъект.ПроверенПреподавателем = Ложь;
								ПопыткаВыполненияЗаданияОбъект.ВозвращеноНаДоработку  = Ложь;
								СтатусОбученияДляПринудительнойУстановки = Перечисления.СтатусыПрохожденияОбъектовСУО.Проходит;
							Иначе
								// Возвращаем на доработку (если это преподаватель)
								ПопыткаВыполненияЗаданияОбъект.ВозвращеноНаДоработку  = Истина;
								ПопыткаВыполненияЗаданияОбъект.ПроверенПреподавателем = Истина;
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;				
					
				КонецЕсли;
				
			Иначе
				
				УсловияЗавершенияВыполнены = Ложь;
				
				Если Задание.КонтролироватьПрикреплениеФайлаКОтвету Тогда
					
					Если ЗначениеЗаполнено(ПопыткаВыполненияЗаданияОбъект.Ссылка) Тогда					
						
						ФайлыЗадания = Документы.ПопыткаВыполненияЗаданияСУО.ФайлыПрохожденияЗадания(ПопыткаВыполненияЗаданияОбъект.Ссылка);						
						
						Если ФайлыЗадания.Количество() > 0 Тогда
							УсловияЗавершенияВыполнены = Истина;
						КонецЕсли;						
						
					КонецЕсли;					
					
				Иначе
					
					УсловияЗавершенияВыполнены = Истина;
					
				КонецЕсли;
				
				
				Если УсловияЗавершенияВыполнены И ЗавершаетУчащийся Тогда
					
					Если ПопыткаЗавершена <> Неопределено Тогда
						
						Если ПопыткаЗавершена Тогда
							
							ПопыткаВыполненияЗаданияОбъект.Баллы               = 100;  // Некому выставить оценку
							ПопыткаВыполненияЗаданияОбъект.ЗавершеноВПроцентах = 100;
							ПопыткаВыполненияЗаданияОбъект.ПопыткаЗавершена    = Истина;
							
						Иначе
							
							ПопыткаВыполненияЗаданияОбъект.Баллы               = 0;
							ПопыткаВыполненияЗаданияОбъект.ЗавершеноВПроцентах = 0;
							ПопыткаВыполненияЗаданияОбъект.ПопыткаЗавершена    = Ложь;
							
						КонецЕсли;				
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПопыткаВыполненияЗаданияОбъект.ПроверяетсяПреподавателем Тогда
			
			// Указываем дату проверки или возврата на доработку. Она используется
			// для формирования рассылок. По ней контролируется, надо ли делать
			// новую рассылку или нет.
			
			Если ПопыткаЗавершенаСтароеЗначение <> ПопыткаВыполненияЗаданияОбъект.ПопыткаЗавершена Тогда
				
				Если ПопыткаВыполненияЗаданияОбъект.ПопыткаЗавершена Тогда
					ПопыткаВыполненияЗаданияОбъект.ДатаОтправкиНаПроверку = ТекущаяДатаСеанса();
				Иначе
					ПопыткаВыполненияЗаданияОбъект.ДатаОтправкиНаПроверку = Неопределено;
				КонецЕсли;
				
			КонецЕсли;
			
			Если ПроверенПреподавателемСтароеЗначение <> ПопыткаВыполненияЗаданияОбъект.ПроверенПреподавателем Тогда
				
				Если ПопыткаВыполненияЗаданияОбъект.ПроверенПреподавателем Тогда
					ПопыткаВыполненияЗаданияОбъект.ДатаПроверки = ТекущаяДатаСеанса();
				Иначе
					ПопыткаВыполненияЗаданияОбъект.ДатаПроверки = Неопределено;
				КонецЕсли;				
				
			КонецЕсли;
			
			Если ВозвращеноНаДоработкуСтароеЗначение <> ПопыткаВыполненияЗаданияОбъект.ВозвращеноНаДоработку Тогда
				
				Если ПопыткаВыполненияЗаданияОбъект.ВозвращеноНаДоработку Тогда
					ПопыткаВыполненияЗаданияОбъект.ДатаВозвратаНаДоработку = ТекущаяДатаСеанса();
				Иначе
					ПопыткаВыполненияЗаданияОбъект.ДатаВозвратаНаДоработку = Неопределено;
				КонецЕсли;
				
			КонецЕсли;
			
			// Указываем причину возврата на доработку
			
			Если ПопыткаВыполненияЗаданияОбъект.ВозвращеноНаДоработку Тогда
				Если ЗначениеЗаполнено(ПричинаВозвратаЗадания) Тогда
					// Устанавливаем причину возврата, если задание возвращено и причина передана в функцию
					ПопыткаВыполненияЗаданияОбъект.ПричинаВозвратаНаДоработку = ПричинаВозвратаЗадания;
				КонецЕсли;
			Иначе
				// Сбрасываем причину возврата, если задание больше не возвращено на доработку
				ПопыткаВыполненияЗаданияОбъект.ПричинаВозвратаНаДоработку = Неопределено;
			КонецЕсли;
			
			Если ПроверяющийПреподаватель <> Неопределено И ПопыткаВыполненияЗаданияОбъект.ПроверенПреподавателем Тогда
				// Указываем проверевшего преподавателя, если он выполняет действия выставления оценки или возврата
				ПопыткаВыполненияЗаданияОбъект.ПроверившийПреподаватель = ПроверяющийПреподаватель;
			КонецЕсли;
			
			Если ПроверяющийПреподаватель <> Неопределено 
				И ПопыткаЗавершена = Неопределено
				И НЕ ПопыткаВыполненияЗаданияОбъект.ПроверенПреподавателем
				И НЕ ЗначениеЗаполнено(ПопыткаВыполненияЗаданияОбъект.ПроверяющийПреподаватель) Тогда
				// Устанавливаем проверяющего преподавателя, если он указан и нет данных о завершенности попытки
				// и задание не начал проверять кто-то другой.
				ПопыткаВыполненияЗаданияОбъект.ПроверяющийПреподаватель = ПроверяющийПреподаватель;				
			КонецЕсли;			
			
			Если ПопыткаВыполненияЗаданияОбъект.ПроверенПреподавателем Тогда 
				// Сбрасываем проверяющего преподавателя
				ПопыткаВыполненияЗаданияОбъект.ПроверяющийПреподаватель = Неопределено;
				ПопыткаВыполненияЗаданияОбъект.ДатаПоследнейАктивностиПроверки = Неопределено;
			КонецЕсли;			
			
			Если ПопыткаВыполненияЗаданияОбъект.ПроверяющийПреподаватель = ПроверяющийПреподаватель Тогда
				ПопыткаВыполненияЗаданияОбъект.ДатаПоследнейАктивностиПроверки = ТекущаяДатаСеанса();
			КонецЕсли;
			
		КонецЕсли;
		
		ПопыткаВыполненияЗаданияОбъект.ВыставляетсяОценка = Документы.ПопыткаВыполненияЗаданияСУО.ВыставляетсяОценка(
			ПопыткаВыполненияЗаданияОбъект.ПроведениеОбучения, ПопыткаВыполненияЗаданияОбъект.Задание, ДанныеПрохожденияОбучения.Сценарий, ВидОбучения, ПрохождениеОбучения, ДанныеПрохожденияОбучения.Пользователь);
		
		Если УстановитьОтмену <> Неопределено Тогда
			ПопыткаВыполненияЗаданияОбъект.Отменено = УстановитьОтмену;
		КонецЕсли;
		
		ПопыткаВыполненияЗаданияОбъект.ДатаПоследнейАктивности = ТекущаяДатаСеанса();		
		
		Если НеОбновлятьДанныеВебКабинета <> Неопределено Тогда
			ПопыткаВыполненияЗаданияОбъект.ДополнительныеСвойства.Вставить("НеОбновлятьДанныеВебКабинета", НеОбновлятьДанныеВебКабинета);	
		КонецЕсли;
		
		ПопыткаВыполненияЗаданияОбъект.ДополнительныеСвойства.Вставить("ПриПрохожденииОбучения", Истина);
		
		Если Записывать Тогда
			
			ПопыткаВыполненияЗаданияОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
			// Создаем автоматическую рассылку
			
			УправлениеОбучениемСУО.СоздатьАвтоматическуюРассылку(ПопыткаВыполненияЗаданияОбъект);
			
			// Вызываем событие владельца (прохождения обучения)
			
			ВызватьСобытияВладельца = ?(ТипЗнч(ВызватьСобытияВладельца) = Тип("Булево"), ВызватьСобытияВладельца, Истина); //Web client bug
			
			Если ВызватьСобытияВладельца Тогда		
				ЕстьНеРеализованныеПопытки = ?(ТипЗнч(ЕстьНеРеализованныеПопытки) <> Тип("Булево"), Ложь, ЕстьНеРеализованныеПопытки);
				ОписаниеПрохожденияМероприятия = ПриПрохожденииМероприятия(ПрохождениеОбучения,СтатусОбученияДляПринудительнойУстановки,,, ЕстьНеРеализованныеПопытки,, НеОбновлятьДанныеВебКабинета,,,Ложь);
			КонецЕсли;			
			
		КонецЕсли;
		
				
		// Формируем результат события и возвращаем его	
		
		ОписаниеПрохождения.Вставить("Пользователь", ДанныеПрохожденияОбучения.Пользователь);
		ОписаниеПрохождения.Вставить("ПроведениеОбучения", ПопыткаВыполненияЗаданияОбъект.ПроведениеОбучения);
		ОписаниеПрохождения.Вставить("ПрохождениеОбучения", ПрохождениеОбучения);
		ОписаниеПрохождения.Вставить("Задание", Задание);
		ОписаниеПрохождения.Вставить("ВыставляетсяОценка", ПопыткаВыполненияЗаданияОбъект.ВыставляетсяОценка);
		ОписаниеПрохождения.Вставить("ПопыткаВыполненияЗадания", ПопыткаВыполненияЗаданияОбъект.Ссылка);
		ОписаниеПрохождения.Вставить("Вариант", ПопыткаВыполненияЗаданияОбъект.Вариант);
		
		Если ТипЗнч(Задание) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
			ОписаниеПрохождения.Вставить("ЭлектронныйРесурс", Задание);
			ОписаниеПрохождения.Вставить("Фрагмент", Неопределено);			
		ИначеЕсли ТипЗнч(Задание) = Тип("СправочникСсылка.ЭлектронныеКурсы") Тогда
			ОписаниеПрохождения.Вставить("ЭлектронныйКурс", Задание);
		ИначеЕсли ЗначениеЗаполнено(ПопыткаВыполненияЗаданияОбъект.Вариант) Тогда
			ОписаниеПрохождения.Вставить("ЭлектронныйРесурс", ПопыткаВыполненияЗаданияОбъект.Вариант.ЭлектронныйРесурс);
			ОписаниеПрохождения.Вставить("Фрагмент", ПопыткаВыполненияЗаданияОбъект.Вариант.Фрагмент);
		Иначе
			ОписаниеПрохождения.Вставить("ЭлектронныйРесурс", Задание.ЭлектронныйРесурс);
			ОписаниеПрохождения.Вставить("Фрагмент", Задание.Фрагмент);
		КонецЕсли;
		
		ОписаниеПрохождения.Вставить("ЗавершеноВПроцентах", ПопыткаВыполненияЗаданияОбъект.ЗавершеноВПроцентах);
		ОписаниеПрохождения.Вставить("ОписаниеПрохожденияМероприятия", ОписаниеПрохожденияМероприятия);	
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	Возврат ОписаниеПрохождения;
	
КонецФункции

Функция ПриПрохожденииЭлектронногоРесурса(ПрохождениеОбучения, Задание = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Если ЗначениеЗаполнено(Задание) Тогда
		ДанныеПрохождения = ОбучениеСУО.ПриПрохожденииЗадания(ПрохождениеОбучения, Задание,,,,,,Истина);
		ВебКабинетСУ.ОбновитьДанныеОбъекта(Документы.ПопыткаВыполненияЗаданияСУО, ДанныеПрохождения.ПопыткаВыполненияЗадания);
		ОписаниеПрохожденияМероприятия = ДанныеПрохождения.ОписаниеПрохожденияМероприятия; 
	Иначе
		ДанныеПрохождения = ОбучениеСУО.ПриПрохожденииМероприятия(ПрохождениеОбучения,,,,,,Истина,,,Ложь);
		ОписаниеПрохожденияМероприятия = ДанныеПрохождения;
	КонецЕсли;	
	
	ВебКабинетСУ.ОбновитьДанныеОбъекта(Документы.ПрохождениеОбученияСУО, ПрохождениеОбучения);
	
	Если ЗначениеЗаполнено(ОписаниеПрохожденияМероприятия.СледующееПрохождение) Тогда
		ВебКабинетСУ.ОбновитьДанныеОбъекта(Документы.ПрохождениеОбученияСУО, ОписаниеПрохожденияМероприятия.СледующееПрохождение);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ОписаниеПрохожденияМероприятия.РодительскоеПрохождение) Тогда
		ВебКабинетСУ.ОбновитьДанныеОбъекта(Документы.ПрохождениеОбученияСУО, ОписаниеПрохожденияМероприятия.РодительскоеПрохождение);
	КонецЕсли;		
	
	Если ЗначениеЗаполнено(ОписаниеПрохожденияМероприятия.Сертификат) Тогда
		ВебКабинетСУ.ОбновитьДанныеОбъекта(Документы.СертификатСУО, ОписаниеПрохожденияМероприятия.Сертификат);
	КонецЕсли;	
	
	Если ОписаниеПрохожденияМероприятия.ОписаниеРодительскогоПрохождения <> Неопределено
		И ЗначениеЗаполнено(ОписаниеПрохожденияМероприятия.ОписаниеРодительскогоПрохождения.Сертификат) Тогда
		ВебКабинетСУ.ОбновитьДанныеОбъекта(Документы.СертификатСУО, ОписаниеПрохожденияМероприятия.ОписаниеРодительскогоПрохождения.Сертификат);		
	КонецЕсли;	
		
	Возврат ДанныеПрохождения;
	
КонецФункции

Процедура ЗаписатьДанныеОценкиКачестваОбучения(Знач ПрохождениеОбучения, Знач ДанныеОценкиКачества, Знач НеОбновлятьДанныеВебКабинета = Неопределено) Экспорт
	
	ПрохождениеОбъект = ПрохождениеОбучения.ПолучитьОбъект();

	Попытка 
		ПрохождениеОбъект.Заблокировать();
	Исключение
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось заблокировать объект %1'"),
			Строка(ПрохождениеОбъект));
	КонецПопытки;

	Если ТипЗнч(ДанныеОценкиКачества) = Тип("Структура")
		И ДанныеОценкиКачества.Количество() > 0 Тогда
		
		Если ДанныеОценкиКачества.Свойство("ОценкаКачестваОбучения") Тогда
			ПрохождениеОбъект.ОценкаКачестваОбучения = ДанныеОценкиКачества.ОценкаКачестваОбучения;
		КонецЕсли;
		
		Если ДанныеОценкиКачества.Свойство("КомментарийКачестваОбучения") Тогда
			ПрохождениеОбъект.КомментарийКачестваОбучения = ДанныеОценкиКачества.КомментарийКачестваОбучения;
		КонецЕсли;
		
	КонецЕсли;

	Если ЗначениеЗаполнено(ПрохождениеОбъект.ОценкаКачестваОбучения)
		ИЛИ ЗначениеЗаполнено(ПрохождениеОбъект.КомментарийКачестваОбучения) Тогда
		
		ПрохождениеОбъект.ДатаОцениванияКачестваОбучения = ТекущаяДатаСеанса();
		
	Иначе
		
		ПрохождениеОбъект.ДатаОцениванияКачестваОбучения = Неопределено;
		
	КонецЕсли;
	
	Если НеОбновлятьДанныеВебКабинета <> Неопределено Тогда
		ПрохождениеОбъект.ДополнительныеСвойства.Вставить("НеОбновлятьДанныеВебКабинета", НеОбновлятьДанныеВебКабинета);
	КонецЕсли;		
	
	ПрохождениеОбъект.ДополнительныеСвойства.Вставить("ОбновлятьПодчиненныеДокументы", Ложь);
	ПрохождениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

// Получение данных (привилегированный режим) 

Функция ПоследнееПрохождениеЗадания(ПрохождениеОбучения = Неопределено, Задание) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.Регистратор КАК ПопыткаВыполненияЗадания
		|ИЗ
		|	РегистрСведений.ПопыткиПрохожденияЗаданийСУО.СрезПоследних(
		|			,
		|			Задание = &Задание
		|				%1) КАК ПопыткиПрохожденияЗаданийСУОСрезПоследних";

	Запрос.УстановитьПараметр("Задание", Задание);
	
	Если ПрохождениеОбучения = Неопределено Тогда		
		Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Запрос.Текст, " И Пользователь = &Пользователь ");		
		Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());		
	Иначе		
		Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Запрос.Текст, " И ПрохождениеОбучения = &ПрохождениеОбучения ");		
		Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбучения);		
	КонецЕсли;

	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда		
		Возврат Неопределено;		
	Иначе		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();		
		Возврат ВыборкаДетальныеЗаписи.ПопыткаВыполненияЗадания;		
	КонецЕсли;
	
КонецФункции

// Заполняет массив ссылками на файлы объекта.
// Аналог функции ПолучитьПрикрепленныеФайлыКОбъекту в модуле ПрисоединенныеФайлы
//
// Параметры:
//  Объект       - Ссылка - ссылка на объект, который может содержать присоединенные файлы.
//
Функция ПрикрепленныеФайлыКОбъектуОбучения(Знач ВладелецФайлов, ИсключитьПомеченныеНаУдаление = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИменаСправочников = РаботаСФайламиСлужебный.ИменаСправочниковХраненияФайлов(ВладелецФайлов);
	ТекстЗапросов = "";
	
	Для каждого КлючИЗначение Из ИменаСправочников Цикл
		Если ЗначениеЗаполнено(ТекстЗапросов) Тогда
			ТекстЗапросов = ТекстЗапросов + 
			"
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|";
		КонецЕсли;
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ПрисоединенныеФайлы.Ссылка,
		|	ПрисоединенныеФайлы.ПометкаУдаления,
		|	ПрисоединенныеФайлы.Автор,
		|	ПрисоединенныеФайлы.Наименование,
		|	ПрисоединенныеФайлы.Расширение,
		|	ПрисоединенныеФайлы.Размер
		|ИЗ
		|	&ИмяСправочника КАК ПрисоединенныеФайлы
		|ГДЕ
		|	ПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайлов";
		
		Если ИсключитьПомеченныеНаУдаление Тогда
			ТекстЗапроса = ТекстЗапроса + " И ПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ ";
		КонецЕсли;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяСправочника", "Справочник." + КлючИЗначение.Ключ);
		ТекстЗапросов = ТекстЗапросов + ТекстЗапроса;
	КонецЦикла;
	
	Запрос = Новый Запрос(ТекстЗапросов);
	Запрос.УстановитьПараметр("ВладелецФайлов", ВладелецФайлов);
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

// Запись на обучение

Функция ЗаписатьПользователяНаОткрытоеОбучение(Знач ПроведениеОбучения, Знач Пользователь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗачисления = Новый Структура("ПрохождениеОбучения, ЕстьОшибки, ТекстОшибки", Неопределено, Ложь, "");
	
	// Получаем переменные
	
	ДанныеПроведенияОбучения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеОбучения, "Статус, ДатаКонтроля, ОткрытоеМероприятие, ОткрытоДляВсех, ТребуетсяЗаявка, МаксимальноеКоличествоУчастников, ОткрытоДляРуководителей, ДатаОткрытияЗаписи, ДатаЗакрытияЗаписи, ПрименениеУсловийЗачисления, Мероприятие, ФильтрПоДатеПриемаНаРаботу");
	ТекущаяДата = ТекущаяДатаСеанса();
	
	// Делаем проверки
	
	Если НЕ ДанныеПроведенияОбучения.ОткрытоеМероприятие Тогда
		
		РезультатЗачисления.ЕстьОшибки  = Истина;
		РезультатЗачисления.ТекстОшибки = НСтр("ru = 'Обучение не открыто для записи на него'"); 
		Возврат РезультатЗачисления;
		
	КонецЕсли;
	
	Если ДанныеПроведенияОбучения.ОткрытоДляРуководителей Тогда
		
		РезультатЗачисления.ЕстьОшибки  = Истина;
		РезультатЗачисления.ТекстОшибки = НСтр("ru = 'Запись на обучение возможна только через руководителя.'"); 
		Возврат РезультатЗачисления;
		
	КонецЕсли;		
	
	Если ДанныеПроведенияОбучения.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Завершено
		ИЛИ ДанныеПроведенияОбучения.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Отменено Тогда
		
		РезультатЗачисления.ЕстьОшибки  = Истина;
		РезультатЗачисления.ТекстОшибки = НСтр("ru = 'Статус обучения отличен от ""Активно""'"); 
		Возврат РезультатЗачисления;
		
	КонецЕсли;
	
	Если НЕ ДанныеПроведенияОбучения.ОткрытоДляВсех Тогда
		
		ПотенциальныеУчастники = Документы.ПроведениеОбученияСУО.ВозможныеУчастникиОбучения(ПроведениеОбучения);
		
		Если ПотенциальныеУчастники.Найти(Пользователь, "Пользователь") = Неопределено Тогда
			
			РезультатЗачисления.ЕстьОшибки  = Истина;
			РезультатЗачисления.ТекстОшибки = НСтр("ru = 'Пользователь не входит в потенциальные участники данного обучения'"); 
			Возврат РезультатЗачисления;

		КонецЕсли;		
		
	КонецЕсли;	
	
	РезультатБазовойПроверки = Документы.ПроведениеОбученияСУО.ПроверитьВозможностьЗачисленияНаОбучение(Пользователь, ПроведениеОбучения, ДанныеПроведенияОбучения);
	
	// Зачисляем пользователя
	
	Если РезультатБазовойПроверки.ЕстьОшибки Тогда
		
		РезультатЗачисления.ЕстьОшибки = Истина;
		РезультатЗачисления.ТекстОшибки = РезультатБазовойПроверки.ТекстОшибки;
		Возврат РезультатЗачисления;

	Иначе
		
		РезультатЗачисления.ПрохождениеОбучения = УправлениеОбучениемСУО.ЗачислитьУчастникаНаОбучение(ПроведениеОбучения,,Пользователь,,,,Ложь); // Внутри повторных проверок не будет
		Возврат РезультатЗачисления;
		
	КонецЕсли;
		
КонецФункции

Функция ПодатьЗаявкуНаОбучение(ПредметЗаявки, Пользователь, ТекстЗаявки, НеОбновлятьДанныеВебКабинета = Неопределено) Экспорт
	
	ЗаявкаОбъект = Документы.ЗаявкаНаОбучениеСУО.СоздатьДокумент();
	
	ЗаявкаОбъект.Дата = ТекущаяДата();
	ЗаявкаОбъект.ОбъектЗаявки = Документы.ЗаявкаНаОбучениеСУО.ОбъектЗаявки(ПредметЗаявки);
	ЗаявкаОбъект.ПредметЗаявки = ПредметЗаявки;
	ЗаявкаОбъект.Пользователь = Пользователь;
	ЗаявкаОбъект.Информация = ТекстЗаявки;
	ЗаявкаОбъект.Статус = Перечисления.СтатусыЗаявокНаОбучениеСУО.НаРассмотрении;
	
	Если НеОбновлятьДанныеВебКабинета <> Неопределено Тогда
		ЗаявкаОбъект.ДополнительныеСвойства.Вставить("НеОбновлятьДанныеВебКабинета", НеОбновлятьДанныеВебКабинета);
	КонецЕсли;	
	
	ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат ЗаявкаОбъект.Ссылка; 
	
КонецФункции

// Аутентификация

Функция ПользователюРазрешенВход(Знач Пользователь = Неопределено, Знач ЭтоПолноправныйПользователь = Неопределено) Экспорт
	
	// Получаем переменные
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	// Выполняем проверку
	
	Если ЭтоПолноправныйПользователь = Неопределено Тогда
		ЭтоПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь(Пользователь,,Ложь);
	КонецЕсли;
	
	Если ЭтоПолноправныйПользователь Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьОграниченияВремениДоступаКПрограммеСУО") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат РегистрыСведений.ВремяДоступаПользователейСУО.ДоступПользователюРазрешен(Пользователь);
	
КонецФункции