
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолучитьНастройкиВидаОбучения();
		
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ЗавершаетУчащийсяПриИзменении(Элемент)
	СохранитьНастройкиВидаОбучения();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершатьАвтоматическиПриИзменении(Элемент)	
	СохранитьНастройкиВидаОбучения();
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяПреподавательПриИзменении(Элемент)
	СохранитьНастройкиВидаОбучения();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ПолучитьНастройкиВидаОбучения() Экспорт
	
	ЗавершаетУчащийся = Справочники.ВидыМероприятийСУО.НаОсновеЭлектронногоРесурса.ЗавершаетУчащийся;
	ЗавершатьАвтоматически = Справочники.ВидыМероприятийСУО.НаОсновеЭлектронногоРесурса.ЗавершатьАвтоматически;
	ТребуетсяПреподаватель = Справочники.ВидыМероприятийСУО.НаОсновеЭлектронногоРесурса.ТребуетсяПреподаватель;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиВидаОбучения() Экспорт
	
	ВидОбученияОбъект = Справочники.ВидыМероприятийСУО.НаОсновеЭлектронногоРесурса.ПолучитьОбъект();
	ВидОбученияОбъект.ЗавершаетУчащийся = ЗавершаетУчащийся;
	ВидОбученияОбъект.ЗавершатьАвтоматически = ЗавершатьАвтоматически;
	ВидОбученияОбъект.ТребуетсяПреподаватель = ТребуетсяПреподаватель;
	
	Если ВидОбученияОбъект.ПроверитьЗаполнение() Тогда	
		ВидОбученияОбъект.Записать();
	Иначе
		ПолучитьНастройкиВидаОбучения();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


