#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ИМПОРТ

// Импортирует пакет данных XML в информационную базу.
// Примечание: пакет данных должен быть предварительно сохранен на сервере.
//
Процедура ВыполнитьИмпортПакетаДанныхXML(ПутьКФайлуПакета, СтарыеПакеты = Неопределено, ОписаниеИмпорта = Неопределено, Отказ, ЭтоИмпортБазовогоПакета = Ложь) Экспорт
	
	Если ОписаниеИмпорта = Неопределено Тогда
		ОписаниеИмпорта = Новый Структура();
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
			
		// Делаем проверку пакета
		//
		
		ОписаниеПакета = ПолучитьИнформациюОПакетеДанных(ПутьКФайлуПакета);
		
		ОписаниеИмпорта.Вставить("Код", ОписаниеПакета.Код);
		ОписаниеИмпорта.Вставить("Наименование", ОписаниеПакета.Наименование);
		
		Отказ = ОписаниеПакета.Отказ;
		
		Если ОписаниеПакета.Отказ Тогда
			ОписаниеИмпорта.Вставить("Результат", ОписаниеПакета.ОписаниеОшибки);
			Возврат;
		КонецЕсли;
		
		// Создаем новый узел пакета данных
		//

		УзелПакетаДанных = ПланыОбмена.ОбменМатериаламиСУЗ.НайтиПоКоду(ОписаниеПакета.Код);
		
		Если НЕ ЗначениеЗаполнено(УзелПакетаДанных) Тогда
			УзелПакетаДанныхОбъект = ПланыОбмена.ОбменМатериаламиСУЗ.СоздатьУзел();
			УзелПакетаДанныхОбъект.ТипПакетаДанных = Перечисления.ТипыПакетовДанныхСУЗ.XML_V8;
		Иначе
			УзелПакетаДанныхОбъект = УзелПакетаДанных.ПолучитьОбъект();
		КонецЕсли;
		
		УзелПакетаДанныхОбъект.Код          = ОписаниеПакета.Код;
		УзелПакетаДанныхОбъект.Наименование = ОписаниеПакета.Наименование;
		УзелПакетаДанныхОбъект.ЭтоИмпортированныйПакет = Истина;
		УзелПакетаДанныхОбъект.Записать();
		
		// Загрузка из файла.
		//
		
		ЧтениеXML = Новый ЧтениеXML;	
		ЧтениеXML.ОткрытьФайл(ПутьКФайлуПакета);
		
		ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
		ЧтениеСообщения.НачатьЧтение(ЧтениеXML, ДопустимыйНомерСообщения.Любой);
		
		РазработкаСУЗ.НачатьЧтениеПакетаДанных(ЧтениеXML);
		
		// Читаем данные из сообщения
		Пока ВозможностьЧтенияXML(ЧтениеXML) Цикл
					
			// Читаем очередное значение
			Данные = ПрочитатьXML(ЧтениеXML);
						
			// Записываем перенесенные данные
			Данные.ОбменДанными.Отправитель = ЧтениеСообщения.Отправитель;
			Данные.ОбменДанными.Загрузка = Истина;
			Если ТипЗнч(Данные) = Тип("СправочникОбъект.СводыЗнанийСУЗ") Тогда
				Данные.ДатаИзменения = ТекущаяДатаСеанса();
			КонецЕсли;		
			Данные.Записать();
			
		КонецЦикла;
		
		РазработкаСУЗ.НачатьЧтениеПакетаДанных(ЧтениеXML, "ЭлементыДляУдаления");
		
		Пока ВозможностьЧтенияXML(ЧтениеXML) Цикл
					
			// Читаем очередное значение
			Данные = ПрочитатьXML(ЧтениеXML);
			
			Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(Данные) Тогда
				
				ДанныеОбъект = Данные.ПолучитьОбъект();
				
				Если НЕ ДанныеОбъект.Предопределенный Тогда			
					ДанныеОбъект.УстановитьПометкуУдаления(Истина, Ложь);				
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;

		ЧтениеXML.Прочитать();
		
		ЧтениеСообщения.ЗакончитьЧтение();
		ЧтениеXML.Закрыть();
		
		// Завершаем
		//
		
		Если НЕ ЭтоИмпортБазовогоПакета Тогда
			ПланыОбмена.ОбменМатериаламиСУЗ.ВыполнитьИмпортБазовогоПакетаДанныхСУЗ();
		КонецЕсли;
		ОбъектыСУЗ.ОбновитьКэшШаблоновСУЗ();		
		ЭлектронныеРесурсыПереопределяемый.ПослеЗагрузкиЭлектронногоРесурса();		
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	
	ОписаниеИмпорта.Вставить("Результат", "Импорт успешно завершен");
	
КонецПроцедуры

// Получает информацию о пакете данных.
// Примечание: пакет данных должен быть предварительно сохранен на сервере.
//
Функция ПолучитьИнформациюОПакетеДанных(ПутьКФайлуПакета, ДляВозвратаНаКлиент=Ложь) Экспорт
	
	// Читаем необходимые параметры из файла пакета данных.
	//
	
	ЧтениеXML = Новый ЧтениеXML;	
	ЧтениеXML.ОткрытьФайл(ПутьКФайлуПакета);
	
	ТаблицаДопустимыхПакетов = Новый ТаблицаЗначений();
	ТаблицаДопустимыхПакетов.Колонки.Добавить("Наименование");
	ТаблицаДопустимыхПакетов.Колонки.Добавить("Код");
	ТаблицаДопустимыхПакетов.Колонки.Добавить("ДопустимыйНомер");
	
	КодПакетаДанных           = "";	
	ДопустимаяВерсия          = "";
	НаименованиеПакетаДанных  = "";
	Отказ                     = Ложь;
	ОписаниеОшибки            = "";
	ДопустимоеИмяКонфигурации = "";

	ТаблицаЧтениеXML = Новый ТаблицаЗначений();
	ТаблицаЧтениеXML.Колонки.Добавить("Имя");
	ТаблицаЧтениеXML.Колонки.Добавить("УзелПрочитан");
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		ГлубинаЧтения = Число(ЧтениеXML.КонтекстПространствИмен.Глубина);
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
			
			СтрокаТаблицы = ТаблицаЧтениеXML.Вставить(ГлубинаЧтения-1);
			СтрокаТаблицы.Имя = ЧтениеXML.Имя;
			СтрокаТаблицы.УзелПрочитан = Ложь;
			СократитьСправаТаблицу(ТаблицаЧтениеXML, ГлубинаЧтения);
			
			ПустаяСтрокаТаблицы = ТаблицаЧтениеXML.Вставить(ГлубинаЧтения);
			ПустаяСтрокаТаблицы.Имя = "";
			
		КонецЕсли;	
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда 
		
			СтрокаТаблицы = ТаблицаЧтениеXML.Получить(ГлубинаЧтения);
			СтрокаТаблицы.УзелПрочитан = Истина;
		
		КонецЕсли;
		
		Если ТаблицаЧтениеXML[0].Имя = "v8msg:Message" Тогда 
			
				Если ТаблицаЧтениеXML[1].Имя = "v8msg:Header" Тогда
				
					Если ТаблицаЧтениеXML[2].Имя = "v8msg:From" 
						И ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
						КодПакетаДанных = ЧтениеXML.Значение;
					КонецЕсли;
				
				КонецЕсли;
			
				Если ТаблицаЧтениеXML[1].Имя = "v8msg:Body" Тогда
					
					Если ТаблицаЧтениеXML[2].Имя = "ИнформацияОПакетеДанных" Тогда
						
						Если ТаблицаЧтениеXML[3].Имя = "ДопустимаяВерсия"
							И ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
							ДопустимаяВерсия = ЧтениеXML.Значение;
						КонецЕсли;
						
						Если ТаблицаЧтениеXML[3].Имя = "ДопустимоеИмяКонфигурации"
							И ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
							ДопустимоеИмяКонфигурации = ЧтениеXML.Значение;
						КонецЕсли;
						
						Если ТаблицаЧтениеXML[3].Имя = "ДопустимыеПакетыДанных" Тогда
							
							Если ТаблицаЧтениеXML[4].Имя = "ПакетДанных" Тогда
								
								Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента 
									И ТаблицаЧтениеXML[5].Имя = "" Тогда
									СтрокаТаблицыДопустимыхПакетов = ТаблицаДопустимыхПакетов.Добавить();
								КонецЕсли;
									
								Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст 
									И ТаблицаЧтениеXML[5].Имя <> "" Тогда 
									СтрокаТаблицыДопустимыхПакетов[ТаблицаЧтениеXML[5].Имя] = ЧтениеXML.Значение; 
								КонецЕсли;
								
							КонецЕсли;
						
						КонецЕсли;
							
						Если ТаблицаЧтениеXML[3].Имя = "Наименование" И
							ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
							НаименованиеПакетаДанных = ЧтениеXML.Значение;
						КонецЕсли; 
						
						// Закончили чтение узла "ПакетДанных".
						Если ТаблицаЧтениеXML[2].УзелПрочитан Тогда
							Прервать;
						КонецЕсли;
						
					КонецЕсли; 
					
				КонецЕсли; 
				
				
		КонецЕсли;
		
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	
	// Проверяем формат файла пакета данных.
	
	Если ПустаяСтрока(КодПакетаДанных)
		ИЛИ ПустаяСтрока(ДопустимаяВерсия)
		ИЛИ ПустаяСтрока(НаименованиеПакетаДанных) Тогда
		
		ОписаниеОшибки = НСтр("ru = 'Неверный формат файла пакета данных'");
		Отказ          = Истина;
		
	КонецЕсли;
		
	// Проверяем версию конфигурации.
	//
	
	Если НЕ Отказ Тогда
		
		ТекущаяВерсия = ЭлектронныеРесурсыСУЗ.ВерсияПодсистемы();
		МассивНомеровВерсии = ОбщегоНазначенияСУКлиентСервер.РасщепитьСтроку(ТекущаяВерсия, ".");
		ТекущаяВерсия = Строка(МассивНомеровВерсии[0] + "." + МассивНомеровВерсии[1] + "." + МассивНомеровВерсии[2]);	
			
		Если ТекущаяВерсия <> ДопустимаяВерсия Тогда
			ОписаниеОшибки = НСтр("ru = 'Требуется версия конфигурации: '") + ДопустимаяВерсия;
			Отказ          = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	// Проверяем имя конфигурации
	//
	
	Если НЕ Отказ И ЗначениеЗаполнено(ДопустимоеИмяКонфигурации) Тогда
		
		ТекущееИмяКонфигурации = Метаданные.Имя;
		
		Если ТекущееИмяКонфигурации <> ДопустимоеИмяКонфигурации Тогда
			ОписаниеОшибки = НСтр("ru = 'Требуется конфигурация: '") + ДопустимоеИмяКонфигурации;
			Отказ          = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	// Проверяем допустимые установленные пакеты данных.
	//
	
	Если ТаблицаДопустимыхПакетов.Количество() > 0 Тогда
	
		ЕстьДопустимыйПакетДанных = Ложь;
		СтрокаТребуемыхПакетовДанных = "";
		
		Для каждого Элемент Из ТаблицаДопустимыхПакетов Цикл
			
			СтрокаТребуемыхПакетовДанных = СтрокаТребуемыхПакетовДанных + Символы.ПС + Символы.Таб + "- " + Элемент.Наименование + ", версия " + Элемент.ДопустимыйНомер; 
			
			ТребУзелПакетаДанных = ПланыОбмена.ОбменМатериаламиСУЗ.НайтиПоКоду(Элемент.Код);
			
			Если НЕ ТребУзелПакетаДанных = ПланыОбмена.ОбменМатериаламиСУЗ.ПустаяСсылка() Тогда
				
				Если ТребУзелПакетаДанных.НомерПринятого = Число(Элемент.ДопустимыйНомер) Тогда
					ЕстьДопустимыйПакетДанных = Истина;
				КонецЕсли;

			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ ЕстьДопустимыйПакетДанных Тогда
			ОписаниеОшибки = НСтр("ru = 'Требуется наличие одного из следующих установленных пакетов данных: '") + СтрокаТребуемыхПакетовДанных;
			Отказ          = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Информация = Новый Структура;
	
	Информация.Вставить("Отказ", Отказ);
	Информация.Вставить("ОписаниеОшибки", ОписаниеОшибки);
	
	Если ДляВозвратаНаКлиент Тогда
		Информация.Вставить("ТаблицаДопустимыхПакетов", Неопределено);
	Иначе
		Информация.Вставить("ТаблицаДопустимыхПакетов", ТаблицаДопустимыхПакетов);
	КонецЕсли;
	
	Информация.Вставить("Код", КодПакетаДанных);
	Информация.Вставить("ДопустимаяВерсия", ДопустимаяВерсия);
	Информация.Вставить("Наименование", НаименованиеПакетаДанных);
	Информация.Вставить("ДопустимоеИмяКонфигурации", ДопустимоеИмяКонфигурации);
	
	Возврат Информация;
	
КонецФункции

// Удаляет строки таблицы, имеющие индекс больше заданного.
//
// Параметры
//  ВходТаблица      – Таблица
//  ПоследнийИндекс  – Число
//
Процедура СократитьСправаТаблицу(ВходТаблица, ПоследнийИндекс)
	
	Пока ВходТаблица.Количество() > ПоследнийИндекс Цикл
		ВходТаблица.Удалить(ВходТаблица.Количество()-1);
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьИмпортБазовогоПакетаДанныхСУЗ() Экспорт
		
	ДвоичныеДанные = ПолучитьОбщийМакет(Метаданные.ОбщиеМакеты.БазовыйПакетДанныхСУЗ);
	ПутьКПакетуДанныхОбщихОбъектов = ПолучитьИмяВременногоФайла("xml");
	
	ДвоичныеДанные.Записать(ПутьКПакетуДанныхОбщихОбъектов);
	
	ОписаниеИмпорта = Новый Структура;
	Отказ           = Ложь;
	
	ПланыОбмена.ОбменМатериаламиСУЗ.ВыполнитьИмпортПакетаДанныхXML(ПутьКПакетуДанныхОбщихОбъектов,, ОписаниеИмпорта, Отказ, Истина);
	
	Если Отказ Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка импорта пакета данных: '") + ОписаниеИмпорта.Результат;
	КонецЕсли;
	
	Попытка
		УдалитьФайлы(ПутьКПакетуДанныхОбщихОбъектов);
	Исключение
	КонецПопытки;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТ

// Функция возвращает объекты метаданных, которые включены в план обмена.
// 
// Реквизиты
// 		МассивОбъектовМетаданных - Массив. Содержит объекты метаданных, например "Метаданные.Справочники".
//
// Возвращаемое значение 
//		Массив.
//
Функция ПолучитьМассивОбъектовМетаданныхПланаОбмена(МассивОбъектовМетаданных)
	
	МассивЭлементов = Новый Массив();
	
	Для каждого ОбъектМетаданных Из МассивОбъектовМетаданных Цикл
		
		Для каждого Элемент Из ОбъектМетаданных Цикл
		
			Если Метаданные.ПланыОбмена.ОбменМатериаламиСУЗ.Состав.Содержит(Элемент) Тогда
				МассивЭлементов.Добавить(Элемент);
			конецЕсли;
		
		КонецЦикла;	
	
	КонецЦикла;
	
	Возврат МассивЭлементов;
	
КонецФункции

// Функция возвращает дерево, показывающее подчиненность объектов метаданных.
// Дерево может иметь только два уровня. На верхнем уровне размещен владелец.
// На втором, тот элемент метаданных, который подчинен этому владельцу.
// 
// Реквизиты
// 		Нет.
//
// Возвращаемое значение 
//		Дерево значений.
//
Функция ПолучитьДеревоПодчиненныхОбъектовМетаданных() Экспорт

	// Формируем ДеревоПодчиненныхОбъектовМетаданных

	МассивКоллекцийОбъектовМетаданных = Новый Массив();
	МассивКоллекцийОбъектовМетаданных.Добавить(Метаданные.Справочники);

	МассивМетаданных = ПолучитьМассивОбъектовМетаданныхПланаОбмена(МассивКоллекцийОбъектовМетаданных);

	ДеревоПодчиненныхОбъектовМетаданных = Новый ДеревоЗначений();
	ДеревоПодчиненныхОбъектовМетаданных.Колонки.Добавить("ОбъектМетаданных");

	Для каждого ОбъектМетаданных Из МассивМетаданных Цикл

		Если ОбъектМетаданных.Владельцы.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;

		Для каждого ВладелецСправочника Из ОбъектМетаданных.Владельцы Цикл
			ВладелецВДереве = ДеревоПодчиненныхОбъектовМетаданных.Строки.Найти(ВладелецСправочника, "ОбъектМетаданных");
			Если ВладелецВДереве = Неопределено Тогда
				ВладелецВДереве = ДеревоПодчиненныхОбъектовМетаданных.Строки.Добавить();
				ВладелецВДереве.ОбъектМетаданных = ВладелецСправочника;
			КонецЕсли;
			НовыйПодчиненныйСправочник = ВладелецВДереве.Строки.Добавить();
			НовыйПодчиненныйСправочник.ОбъектМетаданных = ОбъектМетаданных;
		КонецЦикла;		
		
	КонецЦикла;

	Возврат ДеревоПодчиненныхОбъектовМетаданных;
	
КонецФункции

// Функция возвращает полный список всех ссылочных объектов метаданных,
// которые участвуют в обмене.
// 
// Реквизиты
// 		Нет.
//
// Возвращаемое значение 
//		Массив.
//
Функция ПолучитьМассивСсылочныхОбъектовМетаданных() Экспорт
	
	МассивКоллекцийОбъектовМетаданных = Новый Массив();
	
	МассивКоллекцийОбъектовМетаданных.Добавить(Метаданные.ПланыВидовХарактеристик);
    МассивКоллекцийОбъектовМетаданных.Добавить(Метаданные.Справочники);
	
	МассивСсылочныхОбъектовМетаданных = ПолучитьМассивОбъектовМетаданныхПланаОбмена(МассивКоллекцийОбъектовМетаданных);
	
	Возврат МассивСсылочныхОбъектовМетаданных;
	
КонецФункции

// Функция возвращает информацию о регистрах, которые используются
// для хранения данных объектов СУЗ. Учитывается, что регистры
// могут хранить вспомогательные данные (настройки) и данные объектов.
//
// На первом уровне указываются объекты метаданных, данные которых хранятся
// в регистре, а на втором уровне дерева те регистры, которые хранят данные.
// 
// Реквизиты
// 		МассивСсылочныхОбъектовМетаданных - Массив, полученный из функции ПолучитьМассивСсылочныхОбъектовМетаданных.
//
// Возвращаемое значение 
//		Дерево значений.
//
Функция ПолучитьДеревоРегистровСведенийОбъектовМетаданных(МассивСсылочныхОбъектовМетаданных) Экспорт
	
	ДеревоРегистровСведенийОбъектовМетаданных = Новый ДеревоЗначений();
	ДеревоРегистровСведенийОбъектовМетаданных.Колонки.Добавить("ОбъектМетаданных");
	ДеревоРегистровСведенийОбъектовМетаданных.Колонки.Добавить("Измерение");
	ДеревоРегистровСведенийОбъектовМетаданных.Колонки.Добавить("РегистрСДаннымиСУЗ");

	МассивКоллекцийОбъектовМетаданных = Новый Массив();
	МассивКоллекцийОбъектовМетаданных.Добавить(Метаданные.РегистрыСведений);

	МассивМетаданных = ПолучитьМассивОбъектовМетаданныхПланаОбмена(МассивКоллекцийОбъектовМетаданных);

	Для каждого Регистр Из МассивМетаданных Цикл

		ИмяРегистра = Регистр.Имя;
		ЕстьИзмерениеСсылкаНаОбъектСУЗ = Ложь;
		ЕстьИзмерениеПоставщик = Ложь;
		ЕстьИзмерениеВерсия = Ложь;
		ЕстьИзмерениеКодДанных = Ложь;
		
		Для каждого ИзмерениеРегистра Из Регистр.Измерения Цикл

			Если ИзмерениеРегистра.Имя = "СсылкаНаОбъектСУЗ"  Тогда
				ЕстьИзмерениеСсылкаНаОбъектСУЗ = Истина;
			КонецЕсли;

			Если ИзмерениеРегистра.Имя = "Поставщик"  Тогда
				ЕстьИзмерениеПоставщик = Истина;
			КонецЕсли;
			
			Если ИзмерениеРегистра.Имя = "Версия"  Тогда
				ЕстьИзмерениеВерсия = Истина;
			КонецЕсли;
			
			Если ИзмерениеРегистра.Имя = "КодДанных"  Тогда
				ЕстьИзмерениеКодДанных = Истина;
			КонецЕсли;
			
		КонецЦикла;	
		
		Если Лев(ИмяРегистра, 6) = "Данные"
			И ЕстьИзмерениеСсылкаНаОбъектСУЗ
			И ЕстьИзмерениеПоставщик
			И ЕстьИзмерениеВерсия
			И ЕстьИзмерениеКодДанных Тогда
			
			// Особые регистры в которых хранятся данные объектов в разрезе версия-поставщик.
			РегистрСДаннымиСУЗ = Истина;
			
		Иначе
			
			// Все другие регистры.
			РегистрСДаннымиСУЗ = Ложь;
			
		КонецЕсли;

		// В данном цикле для каждого объекта метаданных формируется
		// Список регистров, которые хранят данные этого объекта.
		// При этом указывается измерение, по которому надо делать выборку
		// Для регистрации всех данных объекта в регистре.
		Для каждого Измерение Из Регистр.Измерения Цикл
			
			Если РегистрСДаннымиСУЗ Тогда
				// Примечание: Для регистров с данными отбор происходит особым образом,
				// Поэтому по сути не важно какое измерение будет выступать как основное.
				Если Измерение <> Регистр.Измерения.СсылкаНаОбъектСУЗ Тогда
					Продолжить;
				КонецЕсли;
			Иначе
				// Для обычных регистров измерение "Поставщик" не является
				// Основным измерением, то есть, если в процессе прохода по
				// Элементам будет обрабатываться поставщик, то из регистра не 
				// Должны выбираться все записи для данного поставщика. Данные
				// Выбираются только для объектов.
				Если Измерение.Имя = "Поставщик" Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			// Участвуют измерения только из основного отбора.
			Если НЕ Измерение.ОсновнойОтбор Тогда
				Продолжить;	
			КонецЕсли;
			
			ТипыВладельцев = Измерение.Тип.Типы();
			
			// Для каждого типа, которое может храниться
			// В основном измерении указываем, что у него есть регистр в 
			// Котором хранятся данные.
			
			Для каждого Тип Из ТипыВладельцев Цикл
			 
				ВладелецРегистра = Метаданные.НайтиПоТипу(Тип); 	
				
				Если МассивСсылочныхОбъектовМетаданных.Найти(ВладелецРегистра) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ВладелецВДереве = ДеревоРегистровСведенийОбъектовМетаданных.Строки.Найти(ВладелецРегистра, "ОбъектМетаданных");
				
				Если ВладелецВДереве = Неопределено Тогда
					ВладелецВДереве = ДеревоРегистровСведенийОбъектовМетаданных.Строки.Добавить();
					ВладелецВДереве.ОбъектМетаданных = ВладелецРегистра;
				КонецЕсли;
				
				НовыйПодчиненныйРегистр = ВладелецВДереве.Строки.Добавить();
				НовыйПодчиненныйРегистр.ОбъектМетаданных = Регистр;
				НовыйПодчиненныйРегистр.Измерение = Измерение;
				НовыйПодчиненныйРегистр.РегистрСДаннымиСУЗ = РегистрСДаннымиСУЗ;
				
			КонецЦикла;
			
			
		КонецЦикла;

	КонецЦикла;

	Возврат ДеревоРегистровСведенийОбъектовМетаданных;
	
КонецФункции	

#КонецЕсли