

#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭлектронныйРесурс = Параметры.ЭлектронныйРесурс;
	ЭлементСодержания = Параметры.ЭлементСодержания;
	
	РазработкаСУЗ.УстановитьРодителяНовогоОбъекта(Объект, Параметры, "СправочникСсылка.ГлоссарииСУЗ");	
	
	УстановитьДоступностьЭлементовФормы();
	
	//////////////////////////////////////////////////////////////////
	
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Объект);
	
	// Устанавливаем доступность данных от поставщика
	
	ТаблицаДоступностиДанныхПоставщика = РазработкаСУЗ.ПолучитьТаблицуДоступностиДанныхПоставщика();

	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.ТерминыГлоссария;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	РазработкаСУЗ.УстановитьДоступностьДанныхОтПоставщика(ЭтотОбъект, ТаблицаДоступностиДанныхПоставщика);
	
	//////////////////////////////////////////////////////////////////
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РазработкаСУЗКлиент.УстановитьКонтекстЭлектронногоРесурса(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ЭлементСодержания) Тогда
		Справочники.СодержаниеСУЗ.Перезаписать(ЭлементСодержания);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбъектСУЗЗаписан", Объект.Ссылка, ЭтотОбъект);
	
	Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		Оповестить("ЭлектронныйРесурсОбновлен", ЭлектронныйРесурс, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ГлоссарийОбновлен" И Источник <> ЭтотОбъект И Параметр = Объект.Ссылка Тогда
		Элементы.ТерминыГлоссария.Обновить();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыТерминыГлоссария

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ТерминыГлоссария

&НаКлиенте
Процедура ТерминыГлоссарияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ТерминыГлоссарияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбщегоНазначенияСУКлиент.ПередВыборомЭлементаПодчиненногоСправочника(ЭтотОбъект, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		
		СтандартнаяОбработка = Ложь;
		
		РедактироватьТерминТаблицы();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТерминыГлоссарияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) И ТипЗнч(ВыбранноеЗначение) <> Тип("СправочникСсылка.СодержаниеГлоссарияСУЗ") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДобавитьТерминВГлоссарий(Объект.Ссылка, ВыбранноеЗначение);
		
		Элементы.ТерминыГлоссария.Обновить();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТерминыГлоссарияОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(НовыйОбъект) И ТипЗнч(НовыйОбъект) <> Тип("СправочникСсылка.СодержаниеГлоссарияСУЗ") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДобавитьТерминВГлоссарий(Объект.Ссылка, НовыйОбъект);
		
		Элементы.ТерминыГлоссария.Обновить();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗагрузитьТермины(Команда)
	РазработкаСУЗКлиент.ЗагрузитьЭлементыВТаблицуСУЗ(ЭтотОбъект, Элементы.ТерминыГлоссария,,,, Объект.Ссылка, "глоссарий");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТермин(Команда)
	РазработкаСУЗКлиент.ДобавитьЭлементВТаблицуСУЗ(ЭтотОбъект, Элементы.ТерминыГлоссария, "ТерминыСУЗ");
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьТермин(Команда)
	РедактироватьТерминТаблицы();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТермин(Команда)
	РазработкаСУЗКлиент.СоздатьЭлементТаблицыСУЗ(ЭтотОбъект, Элементы.ТерминыГлоссария, "Термин", ЭлектронныйРесурс,,Объект.Ссылка);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(ТерминыГлоссария, Объект.Ссылка);
	
	// Для веб-кабинета
	
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета = Новый Массив;
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.ГруппаНастройка);
	
	РазработкаСУЗ.УбратьВидимостьНеподдерживаемыхПлееромВебКабинетаЭлементов(ЭлектронныйРесурс, МассивЭлементовНеподдерживаемыхПлееромВебКабинета);	
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьТерминТаблицы()
	РазработкаСУЗКлиент.РедактироватьЭлементТаблицыСУЗ(Элементы.ТерминыГлоссария, "ТерминГлоссария", ЭлектронныйРесурс,,Объект.Ссылка);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьТерминВГлоссарий(Глоссарий, Термин)
	
	Если НЕ ЗначениеЗаполнено(Термин) Тогда
		Возврат;
	КонецЕсли;
	
	Справочники.ГлоссарииСУЗ.ДобавитьТерминВГлоссарий(Термин, Глоссарий);
	
КонецПроцедуры

#КонецОбласти





