#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура РазместитьФайлResJS(Знач ПутьККаталогуЭлектронныхРесурсов) Экспорт
	
	ДвоичныеДанныеФайла = Обработки.ПубликацияЭлектронныхРесурсовСУЗ.ПолучитьМакет("resJS");
	
	ПутьКФайлу = ОбщегоНазначенияСУКЛиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуЭлектронныхРесурсов)
		+ "res.js";
		
	ДвоичныеДанныеФайла.Записать(ПутьКФайлу);
	
КонецПроцедуры

Функция ДатаСущественногоИзмененияМакетов() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ДатаОбновленияМакетовПубликацииСУЗ.Получить();
КонецФункции

#КонецОбласти

#КонецЕсли
