#Если Сервер Тогда
	
Перем КаталогРесурсов;
Перем МассивВыгруженныхОбъектов;
Перем МассивЭлементовСодержания;
Перем МассивСсылок;
Перем МассивРесурсов;
Перем МассивПодборок;
Перем МассивВопросов;
Перем ТаблицаСтраницПодборок;
Перем МассивЭлектронныхКурсов;

// Основное

Функция ВыполнитьПубликацию(УникальныйИдентификаторФормы = Неопределено) Экспорт
	
	// Делаем проверки
		
	Если ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.WS
		И НЕ ЗначениеЗаполнено(ОбъектыСУЗПовтИсп.ПутьКОбщемуКаталогу()) Тогда
		
		ВызватьИсключение ОбщегоНазначенияСУПовтИсп.ТекстОНеобходимостиНастроитьОбщийКаталог();
		
	КонецЕсли;	
	
	// Получаем переменные
	
	ТаблицаПубликаций = Новый ТаблицаЗначений;
	ТаблицаПубликаций.Колонки.Добавить("ЭлектронныйРесурс");
	ТаблицаПубликаций.Колонки.Добавить("СвойстваПакета");
	
	ДатаПубликации = ТекущаяДатаСеанса();
	
	// Получаем публикации электронных ресурсов (таблица ТаблицаПубликаций)
	
	Для каждого Строка Из ЭлектронныеРесурсы Цикл
		
		ОбъектыСУЗ.ОбновитьДанныеДляИндексирования(Строка.ЭлектронныйРесурс);
		
		ДанныеЭлектронногоРесурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Строка.ЭлектронныйРесурс, "Наименование, Версия, Редакция, ДатаИзменения");
		
		СвойстваПакета = Новый Структура("Наименование, ИмяФайлаПакета, Код, Версия, КонтрольнаяСумма, АдресВоВременномХранилище, ДатаИзменения, Размер, КаталогДляСохранения, РазмещениеКнопкиВыхода");
		
		СвойстваПакета.Наименование           = ДанныеЭлектронногоРесурса.Наименование;
		СвойстваПакета.Код                    = Строка(Строка.ЭлектронныйРесурс.УникальныйИдентификатор());
		СвойстваПакета.Версия                 = Строка(ДанныеЭлектронногоРесурса.Редакция) + "." + Строка(ДанныеЭлектронногоРесурса.Версия);
		СвойстваПакета.ДатаИзменения          = ДанныеЭлектронногоРесурса.ДатаИзменения;
		СвойстваПакета.ИмяФайлаПакета         = ОбщегоНазначенияСУКлиентСервер.ЗаменитьЗапрещенныеСимволыВИмениФайла(СвойстваПакета.Наименование);		
		СвойстваПакета.РазмещениеКнопкиВыхода = Строка.РазмещениеКнопкиВыхода;
		
		Если ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.WS Тогда
	
			СвойстваПакета.КаталогДляСохранения = ПолучитьИмяВременногоФайла("");
			
			СоздатьКаталог(СвойстваПакета.КаталогДляСохранения);
				
		ИначеЕсли ЗначениеЗаполнено(КаталогДляСохранения) Тогда
			
			КаталогДляСохраненияПакета = Новый Файл(КаталогДляСохранения);
			
			Если НЕ КаталогДляСохраненияПакета.Существует() Тогда
				ВызватьИсключение НСтр("ru = 'Каталог для публикации не найден'")
			КонецЕсли;
			
			КаталогДляСохраненияПакета = Новый Файл(КаталогДляСохранения + СвойстваПакета.ИмяФайлаПакета + " (" + СвойстваПакета.Версия + ")");
			
			Если КаталогДляСохраненияПакета.Существует() Тогда
				
				Если УдалитьСтарыеПубликации Тогда
					УдалитьФайлы(КаталогДляСохраненияПакета.ПолноеИмя);
				Иначе
					КаталогДляСохраненияПакета = Новый Файл(ОбщегоНазначенияСУКлиентСервер.УникальноеИмяФайла(КаталогДляСохраненияПакета.ПолноеИмя));
				КонецЕсли;
				
			КонецЕсли;			
				
			СоздатьКаталог(КаталогДляСохраненияПакета.ПолноеИмя);			
			
			СвойстваПакета.КаталогДляСохранения = КаталогДляСохраненияПакета.ПолноеИмя;			
			
		КонецЕсли;
		
		ЭлементыДляЭкспорта = Новый ТаблицаЗначений();
		ЭлементыДляЭкспорта.Колонки.Добавить("СсылкаНаЭлемент");
		
		НоваяСтрока = ЭлементыДляЭкспорта.Добавить(); // Всегда один элемент для электронного ресурса
		НоваяСтрока.СсылкаНаЭлемент = Строка.ЭлектронныйРесурс; 
		
		ДлительныеОперации.СообщитьПрогресс(0,  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Публикация: %1'"), СвойстваПакета.Наименование));
		
		Если ЭлектронныеРесурсы.Количество() = 1 Тогда
			ОпубликоватьПакетДанных(СвойстваПакета, ЭлементыДляЭкспорта, УникальныйИдентификаторФормы);
		Иначе
			ОпубликоватьПакетДанных(СвойстваПакета, ЭлементыДляЭкспорта, Неопределено);
		КонецЕсли;
		
		НоваяСтрока = ТаблицаПубликаций.Добавить();
		НоваяСтрока.ЭлектронныйРесурс = Строка.ЭлектронныйРесурс;
		НоваяСтрока.СвойстваПакета = СвойстваПакета;
		
	КонецЦикла;
	
	// Записываем результат публикаций
		
	Если ТаблицаПубликаций.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Таблица публикаций не заполнена'")
	КонецЕсли;
	
	РезультатПубликаций = Новый Структура("АдресВоВременномХранилище, ИмяФайлаПакета, Версия, КоличествоПубликаций, Размер", Неопределено, "", "", 0, 0);
	
	Если ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.WS Тогда
		
		НачатьТранзакцию();
		
		Для каждого Строка Из ТаблицаПубликаций Цикл
			
			ДанныеВыгрузки = Строка.СвойстваПакета;
			
			ДлительныеОперации.СообщитьПрогресс(0,  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Сохранение: %1'"), ДанныеВыгрузки.Наименование));
			
			// Удаляем старые публикации
			
			Если УдалитьСтарыеПубликации Тогда
				
				НаборЗаписей = РегистрыСведений.ПубликацииЭлектронныхРесурсовСУЗ.СоздатьНаборЗаписей();				
				НаборЗаписей.Отбор.ЭлектронныйРесурс.Установить(Строка.ЭлектронныйРесурс);				
				НаборЗаписей.Записать();
				
			КонецЕсли;
			
			// Перемещаем публикацию в общий каталог из временного каталога
		
			ПутьККаталогуВыгрузки = ОбъектыСУЗПовтИсп.ПутьКОбщемуКаталогу();
			
			РезультатИнициализации = ЭлектронныеРесурсыСУЗ.ИнициализироватьКаталогЭлектронногоРесурса(Строка.ЭлектронныйРесурс, ДанныеВыгрузки.КонтрольнаяСумма, ПутьККаталогуВыгрузки, ДанныеВыгрузки.КаталогДляСохранения, УдалитьСтарыеПубликации);
					
			Если НЕ РезультатИнициализации.КаталогИнициализирован Тогда
				
				ТекстСообщения = НСтр("ru = 'Ошибка при копировании данных в общий каталог ""%1"". Причина ошибки: %2'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПутьККаталогуВыгрузки, РезультатИнициализации.ТекстОшибки);
				ВызватьИсключение ТекстСообщения;
				
			КонецЕсли;
			
			Попытка
				УдалитьФайлы(ДанныеВыгрузки.КаталогДляСохранения);
			Исключение
			КонецПопытки;
			
			// Размещаем данные веб-кабинета
			
			РазмещеныДанныеДляВебКабинета = РегистрыСведений.ПлеерКурсовВебКабинетаСУЗ.ВыгрузитьДанныеДляВебКабинета(
				Строка.ЭлектронныйРесурс, ДанныеВыгрузки.КонтрольнаяСумма, РезультатИнициализации, ДанныеВыгрузки.РазмещениеКнопкиВыхода);
			
			// Сохраняем публикацию в базе
			
			СвойстваСуществующейПубликации = ЭлектронныеРесурсыСУЗ.ПолучитьСвойстваПубликации(Строка.ЭлектронныйРесурс, ДанныеВыгрузки.КонтрольнаяСумма); 
			
			Если СвойстваСуществующейПубликации <> Неопределено Тогда
				НаборЗаписей = РегистрыСведений.ПубликацииЭлектронныхРесурсовСУЗ.СоздатьНаборЗаписей();				
				НаборЗаписей.Отбор.ЭлектронныйРесурс.Установить(Строка.ЭлектронныйРесурс);
				НаборЗаписей.Отбор.Период.Установить(СвойстваСуществующейПубликации.Период);
				НаборЗаписей.Записать(); // Удаляем старую запись о публикации
			КонецЕсли;
			
			СвойстваСуществующейПубликации = Неопределено;
			
			НаборЗаписей = РегистрыСведений.ПубликацииЭлектронныхРесурсовСУЗ.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.ЭлектронныйРесурс.Установить(Строка.ЭлектронныйРесурс);
			НаборЗаписей.Отбор.Период.Установить(ДатаПубликации);
			
			НоваяЗапись = НаборЗаписей.Добавить();
				
			НоваяЗапись.ЭлектронныйРесурс             = Строка.ЭлектронныйРесурс;
			НоваяЗапись.Период                        = ДатаПубликации;	
			НоваяЗапись.КонтрольнаяСумма              = ДанныеВыгрузки.КонтрольнаяСумма;
			НоваяЗапись.ДатаЭлектронногоРесурса       = ДанныеВыгрузки.ДатаИзменения;
			НоваяЗапись.Версия                        = ДанныеВыгрузки.Версия;
			НоваяЗапись.Наименование                  = ДанныеВыгрузки.Наименование;
			НоваяЗапись.Размер                        = ДанныеВыгрузки.Размер;
			НоваяЗапись.Описание                      = Описание;
			НоваяЗапись.РазмещениеКнопкиВыхода        = ДанныеВыгрузки.РазмещениеКнопкиВыхода;			
			НоваяЗапись.РазмещеныДанныеДляВебКабинета = РазмещеныДанныеДляВебКабинета;	
			
			НаборЗаписей.Записать();					
			
			// Сохраняем информацию о размере
			
			РезультатПубликаций.Размер = РезультатПубликаций.Размер + ДанныеВыгрузки.Размер;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
		РезультатПубликаций.КоличествоПубликаций = ТаблицаПубликаций.Количество();
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(КаталогДляСохранения) Тогда
		
			ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Упаковка...'"));
			
			Если ТаблицаПубликаций.Количество() = 1 Тогда
				
				РезультатПубликаций.КоличествоПубликаций      = 1;
				РезультатПубликаций.АдресВоВременномХранилище = ТаблицаПубликаций[0].СвойстваПакета.АдресВоВременномХранилище;
				РезультатПубликаций.ИмяФайлаПакета            = ТаблицаПубликаций[0].СвойстваПакета.ИмяФайлаПакета;
				РезультатПубликаций.Версия                    = ТаблицаПубликаций[0].СвойстваПакета.Версия;
				РезультатПубликаций.Размер                    = ТаблицаПубликаций[0].СвойстваПакета.Размер;
				
			Иначе
			
				ВременныйКаталогПубликаций = ПолучитьИмяВременногоФайла();
				
				СоздатьКаталог(ВременныйКаталогПубликаций);
				
				ВременныйКаталогПубликаций = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ВременныйКаталогПубликаций);
				
				Для каждого Строка Из ТаблицаПубликаций Цикл
				
					ДвоичныеДанныеПакета = ПолучитьИзВременногоХранилища(Строка.СвойстваПакета.АдресВоВременномХранилище);
					
					ДвоичныеДанныеПакета.Записать(ВременныйКаталогПубликаций + Строка.СвойстваПакета.ИмяФайлаПакета + " (" + Строка.СвойстваПакета.Версия + ")" + ".zip");
					
				КонецЦикла;
				
				ИмяАрхива = ПолучитьИмяВременногоФайла(".zip");
					
				Архиватор = Новый ЗаписьZipФайла(ИмяАрхива);
					
				Архиватор.Добавить(ВременныйКаталогПубликаций + "*", РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
				Архиватор.Записать();
				
				ДвоичныеДанныеАрхива = Новый ДвоичныеДанные(ИмяАрхива);
				
				РезультатПубликаций.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанныеАрхива, УникальныйИдентификаторФормы);
				РезультатПубликаций.ИмяФайлаПакета            = НСтр("ru = 'Электронные ресурсы'") + " - " +ОбщегоНазначенияСУКлиентСервер.ЗаменитьЗапрещенныеСимволыВИмениФайла(Формат(ДатаПубликации, "ДФ=yyyy-MM-dd"));			
				РезультатПубликаций.Размер                    = ДвоичныеДанныеАрхива.Размер();
				
				Попытка
					УдалитьФайлы(ВременныйКаталогПубликаций);
					УдалитьФайлы(ИмяАрхива);
				Исключение
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;
		
	Возврат РезультатПубликаций;
	
КонецФункции

Процедура ОпубликоватьПакетДанных(СвойстваПакета, ЭлементыДляЭкспорта, УникальныйИдентификаторФормы) Экспорт	
	
	// Переменные
	//
	
	// Обнуляем переменные модуля
	
	МассивВыгруженныхОбъектов  = Новый Массив;
	МассивЭлементовСодержания  = Новый Массив;
	МассивСсылок               = Новый Массив;
	МассивРесурсов             = Новый Массив;
	МассивПодборок             = Новый Массив;
	МассивВопросов             = Новый Массив;
	МассивПрограммныхПродуктов = Новый Массив;
	МассивЭлектронныхКурсов    = Новый Массив;
	
	ТаблицаСтраницПодборок = Новый ТаблицаЗначений;
	ТаблицаСтраницПодборок.Колонки.Добавить("Подборка");
	ТаблицаСтраницПодборок.Колонки.Добавить("НомерСтраницы");
	ТаблицаСтраницПодборок.Колонки.Добавить("СсылкаНаСтраницу");
	ТаблицаСтраницПодборок.Колонки.Добавить("СсылкаНаОбъектСУЗ");
	ТаблицаСтраницПодборок.Колонки.Добавить("ВесВопроса");
	ТаблицаСтраницПодборок.Колонки.Добавить("ЭтоГруппа");
	ТаблицаСтраницПодборок.Колонки.Добавить("Подгруппы");
	ТаблицаСтраницПодборок.Колонки.Добавить("КоличествоВопросов");
	ТаблицаСтраницПодборок.Колонки.Добавить("ТипЭлемента");
	ТаблицаСтраницПодборок.Колонки.Добавить("ЭлементПодборкиИзРубрикатора");
	
	// Дополнительные переменные
	
	ПоказыватьПоследнююВерсию = Константы.ПоказыватьПоследнююВерсиюСУЗ.Получить();
	
	Если ПоказыватьПоследнююВерсию Тогда
		ПредпочитаемыйПоставщикБазы = Константы.ПредпочитатьПоставщикаСУЗ.Получить();
	Иначе
		ПредпочитаемыйПоставщикБазы = Неопределено;
	КонецЕсли;
	
	АвтоРубрикатор = Справочники.РубрикаторыСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(СвойстваПакета.Код));
	Если НЕ ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(АвтоРубрикатор, Ложь) Тогда
		АвтоРубрикатор = Неопределено;
	КонецЕсли;
	
	// Создаем каталоги
	//	
	
	Если ЗначениеЗаполнено(СвойстваПакета.КаталогДляСохранения) Тогда		
		РабочийКаталог = СвойстваПакета.КаталогДляСохранения;
	Иначе		
		РабочийКаталог = ПолучитьИмяВременногоФайла("");		
	КонецЕсли;		

	ДобавитьСлешЕслиНужно(РабочийКаталог);
	
	СоздатьКаталог(РабочийКаталог);		
	
	Если ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.HTML И ВключитьБраузер Тогда
	
		КаталогКонтента = РабочийКаталог + "content\"; 
		
		КаталогКонтента = ОбщегоНазначенияСУКлиентСервер.ПривестиСлэши(КаталогКонтента);
		
		СоздатьКаталог(КаталогКонтента);
		
	Иначе
		
		КаталогКонтента = РабочийКаталог;
		
	КонецЕсли;		
	
	КаталогРесурсов = КаталогКонтента + "res\"; // Переменная модуля
	КаталогРесурсов = ОбщегоНазначенияСУКлиентСервер.ПривестиСлэши(КаталогРесурсов);	
	
	КаталогДанных   = КаталогКонтента + "data\";
	КаталогДанных   = ОбщегоНазначенияСУКлиентСервер.ПривестиСлэши(КаталогДанных);	
	
	СоздатьКаталог(КаталогДанных);
	
	// Распаковываем файлы проигрывателя
	//
	
	// Общий шаблон плеера
	
	Если ДляТестирования Тогда
		ДвоичныеДанныеШаблона = ПолучитьМакет("ШаблонДляТестирования");
	Иначе
		ДвоичныеДанныеШаблона = ПолучитьМакет("Шаблон");
	КонецЕсли;
	
	ПутьКАрхивуШаблона    = КаталогКонтента + "template.zip";
	
	ДвоичныеДанныеШаблона.Записать(ПутьКАрхивуШаблона);
	
	Попытка
		ФайлАрхива = Новый ЧтениеZIPФайла(ПутьКАрхивуШаблона);
		ФайлАрхива.ИзвлечьВсе(КаталогКонтента, РежимВосстановленияПутейФайловZIP.Восстанавливать); 
		ФайлАрхива.Закрыть(); 				
	Исключение
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
	
	Попытка
		УдалитьФайлы(ПутьКАрхивуШаблона);
	Исключение
	КонецПопытки;	
	
	// Плагины
	
	МассивОбщихРесурсов = Новый Массив();
	МассивОбщихРесурсов.Добавить(ОбъектыСУЗ.ПолучитьСтруктуруРесурсаМодулей());
	
	ОбщегоНазначенияСУКлиентСервер.ВыгрузитьРесурсыВКэш(МассивОбщихРесурсов, КаталогРесурсов);	
	
	// tree.js
	
	СписокСодержания = "<ul>" + Символы.ПС;
	
	Для каждого ЭлементДляЭкспорта Из ЭлементыДляЭкспорта Цикл
		
		Если ТипЗнч(ЭлементДляЭкспорта.СсылкаНаЭлемент) = Тип("СправочникСсылка.СодержаниеСУЗ") Тогда
			ЭлектронныйРесурс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементДляЭкспорта.СсылкаНаЭлемент, "Владелец");
			ЭлементСодержания = ЭлементДляЭкспорта.СсылкаНаЭлемент;
		Иначе
			ЭлектронныйРесурс = ЭлементДляЭкспорта.СсылкаНаЭлемент;
			ЭлементСодержания = Справочники.СодержаниеСУЗ.ПустаяСсылка();
		КонецЕсли;
		
		ДанныеЭлектронногоРесурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлектронныйРесурс, "Наименование, ПоказыватьПоследнююВерсию, ПредпочитатьПоставщика, Карта");
		
		Если ДанныеЭлектронногоРесурса.ПоказыватьПоследнююВерсию Тогда
			ПредпочитаемыйПоставщик = ДанныеЭлектронногоРесурса.ПредпочитатьПоставщика;
		Иначе
			ПредпочитаемыйПоставщик = Неопределено;
		КонецЕсли;
		
		СсылкаЭлектронныйРесурс = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(ЭлектронныйРесурс);
		
		ВыгрузитьОбъектСУЗ(ЭлектронныйРесурс, Справочники.СодержаниеСУЗ.ПустаяСсылка(), ПредпочитаемыйПоставщик);
		
		ВыгрузитьОбъектСУЗ(?(ЗначениеЗаполнено(ДанныеЭлектронногоРесурса.Карта), ДанныеЭлектронногоРесурса.Карта, Справочники.КартыСУЗ.АвтоКарта), Справочники.СодержаниеСУЗ.ПустаяСсылка(), ПредпочитаемыйПоставщик, Новый Структура("ПредметКарты, ИмяПредметаКарты", ЭлектронныйРесурс, "KnowledgeBase"));
					
		СписокСодержания = СписокСодержания + "<li id="""+Строка(ЭлектронныйРесурс.УникальныйИдентификатор())+""" link="""+ СсылкаЭлектронныйРесурс +""" rel=""book""  type=""book"">" + "<a href=""#"">" + ДанныеЭлектронногоРесурса.Наименование  + "</a>" + Символы.ПС;
		
		// Выбираем элементы содержания

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СодержаниеСУЗ.Ссылка КАК Ссылка,
			|	СодержаниеСУЗ.СсылкаНаЭлемент КАК СсылкаНаЭлемент,
			|	СодержаниеСУЗ.Наименование,
			|	СодержаниеСУЗ.ЭтоГруппа,
			|	СодержаниеСУЗ.Карта,
			|	СодержаниеСУЗ.Родитель,
			|	СодержаниеСУЗ.Владелец КАК ЭлектронныйРесурс
			|ИЗ
			|	Справочник.СодержаниеСУЗ КАК СодержаниеСУЗ
			|ГДЕ
			|	СодержаниеСУЗ.Ссылка В ИЕРАРХИИ(&ЭлементСодержания)
			|	И СодержаниеСУЗ.Владелец = &ЭлектронныйРесурс
			|	И СодержаниеСУЗ.ПометкаУдаления = ЛОЖЬ
			|
			|УПОРЯДОЧИТЬ ПО
			|	СодержаниеСУЗ.Код ИЕРАРХИЯ";

		Запрос.УстановитьПараметр("ЭлементСодержания", ЭлементСодержания);
		Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);

		Результат = Запрос.Выполнить();

		ДеревоЭлементовСодержания = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		МассивЭлементовСодержания.Добавить(ЭлектронныйРесурс);
		
		ДобавитьЭлементСодержанияВСписок(СписокСодержания, ДеревоЭлементовСодержания.Строки, ПредпочитаемыйПоставщик);
		
		СписокСодержания = СписокСодержания + "</li>" + Символы.ПС;
		
	КонецЦикла;
	
	СписокСодержания = СписокСодержания + "</ul>";
	
	СписокСодержания = "document.write('" + ОбщегоНазначенияСУКлиентСервер.JSСтрока(СписокСодержания) + "');";
	
	ФайлСодержанияТекстовыйДокумент = Новый ТекстовыйДокумент;
	ФайлСодержанияТекстовыйДокумент.УстановитьТекст(СписокСодержания);
	ФайлСодержанияТекстовыйДокумент.Записать(КаталогДанных + "tree.js",  КодировкаТекста.UTF8);	
	
	// Получаем НастройкиЭР (если есть, значит публикуем один электронный ресурс)
	
	НастройкиЭР = Неопределено;
	
	Если ЭлементыДляЭкспорта.Количество() = 1 Тогда
		
		Если ТипЗнч(ЭлементыДляЭкспорта[0].СсылкаНаЭлемент) = Тип("СправочникСсылка.СодержаниеСУЗ") Тогда
			НастройкиЭР = ЭлементыДляЭкспорта[0].СсылкаНаЭлемент.Владелец;
		Иначе
			НастройкиЭР = ЭлементыДляЭкспорта[0].СсылкаНаЭлемент;
		КонецЕсли;
		
	КонецЕсли;	
	
	// search.js
	//
	
	Если НастройкиЭР = Неопределено
		ИЛИ НастройкиЭР.СкрытьСодержание
		ИЛИ НастройкиЭР.Тип = Перечисления.ТипыЭлектронныхРесурсовСУЗ.Тест Тогда
		
		ПоискРазрешен = Ложь; // Переопределеяем реквизит
		
	КонецЕсли;
	
	ХэшСуммаПоиска = 0;
	КоличествоЭлементовДляПоиска = 0;
	
	Если ПоискРазрешен Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДанныеДляПолнотекстовогоПоискаСУЗ.ЭлектронныйРесурс,
			|	ДанныеДляПолнотекстовогоПоискаСУЗ.ЭлементСодержания,
			|	ДанныеДляПолнотекстовогоПоискаСУЗ.СсылкаНаОбъектСУЗ,
			|	ДанныеДляПолнотекстовогоПоискаСУЗ.ЭлементПодборки,
			|	ДанныеДляПолнотекстовогоПоискаСУЗ.ЭлементГлоссария,
			|	ДанныеДляПолнотекстовогоПоискаСУЗ.Данные,
			|	ДанныеДляПолнотекстовогоПоискаСУЗ.Наименование
			|ИЗ
			|	РегистрСведений.ДанныеДляПолнотекстовогоПоискаСУЗ КАК ДанныеДляПолнотекстовогоПоискаСУЗ
			|ГДЕ
			|	(ДанныеДляПолнотекстовогоПоискаСУЗ.ЭлементСодержания В (&МассивЭлементовСодержания)
			|			ИЛИ ДанныеДляПолнотекстовогоПоискаСУЗ.СсылкаНаОбъектСУЗ В (&МассивВыгруженныхОбъектов))
			|	И ДанныеДляПолнотекстовогоПоискаСУЗ.Метка <> ""ДоступноПриНаличииПраваИзмененияЭР""
			|	И ДанныеДляПолнотекстовогоПоискаСУЗ.ЭлектронныйРесурс = &ЭлектронныйРесурс";
		
			
		Запрос.УстановитьПараметр("ЭлектронныйРесурс", НастройкиЭР.Ссылка);
		Запрос.УстановитьПараметр("МассивЭлементовСодержания", МассивЭлементовСодержания);
		Запрос.УстановитьПараметр("МассивВыгруженныхОбъектов", МассивВыгруженныхОбъектов);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ФайлПоиска = "// Поиск" + Символы.ПС + Символы.ПС;
		
		ФайлПоиска = ФайлПоиска + "var oSearchData = [" + Символы.ПС;	
		
		Номер = 1;
		
		Для каждого ЭлементСодержания Из МассивЭлементовСодержания Цикл
			
			ВыборкаДетальныеЗаписи.Сбросить();
			
			Если ТипЗнч(ЭлементСодержания) = Тип("СправочникСсылка.СодержаниеСУЗ")
				И НЕ ЭлементСодержания.ЭтоГруппа
				И ТипЗнч(ЭлементСодержания.СсылкаНаЭлемент) = Тип("СправочникСсылка.ПодборкиСУЗ")
				И (ПодборкаБезСтраниц(ЭлементСодержания.СсылкаНаЭлемент) 
				ИЛИ Справочники.ПодборкиСУЗ.ЕдинственныйЭлементПодборки(ЭлементСодержания.СсылкаНаЭлемент) <> Неопределено) Тогда
				
				Данные = "";
				
				Пока ВыборкаДетальныеЗаписи.НайтиСледующий(Новый Структура("ЭлементСодержания", ЭлементСодержания)) Цикл
					Данные = Данные + " " + ВыборкаДетальныеЗаписи.Данные;
				КонецЦикла;			
				
				ДобавитьЭлементВФайлПоиска(
					ФайлПоиска,
					ЭлементСодержания.Наименование,
					Данные,
					Номер,
					ВыборкаДетальныеЗаписи.ЭлектронныйРесурс,
					ЭлементСодержания,
					,
					,
					ЭлементСодержания.СсылкаНаЭлемент
				);
				
				
				
			Иначе
				
				Пока ВыборкаДетальныеЗаписи.НайтиСледующий(Новый Структура("ЭлементСодержания", ЭлементСодержания)) Цикл
					
					ДобавитьЭлементВФайлПоиска(
						ФайлПоиска,
						ВыборкаДетальныеЗаписи.Наименование,
						ВыборкаДетальныеЗаписи.Данные,
						Номер,
						ВыборкаДетальныеЗаписи.ЭлектронныйРесурс,
						ВыборкаДетальныеЗаписи.ЭлементСодержания,
						ВыборкаДетальныеЗаписи.ЭлементПодборки,
						ВыборкаДетальныеЗаписи.ЭлементГлоссария,
						ВыборкаДетальныеЗаписи.СсылкаНаОбъектСУЗ
					);
					
					
					
				КонецЦикла;				
				
			КонецЕсли;
			
		
		КонецЦикла;
		
		ВыборкаДетальныеЗаписи.Сбросить();
		
		Пока ВыборкаДетальныеЗаписи.НайтиСледующий(Новый Структура("ЭлементСодержания", Справочники.СодержаниеСУЗ.ПустаяСсылка())) Цикл
			
			ДобавитьЭлементВФайлПоиска(
				ФайлПоиска,
				ВыборкаДетальныеЗаписи.Наименование,
				ВыборкаДетальныеЗаписи.Данные,
				Номер,
				ВыборкаДетальныеЗаписи.ЭлектронныйРесурс,
				ВыборкаДетальныеЗаписи.ЭлементСодержания,
				ВыборкаДетальныеЗаписи.ЭлементПодборки,
				ВыборкаДетальныеЗаписи.ЭлементГлоссария,
				ВыборкаДетальныеЗаписи.СсылкаНаОбъектСУЗ
			);			
			
			
			
		КонецЦикла;
		
		Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
			ФайлПоиска = Лев(ФайлПоиска, СтрДлина(ФайлПоиска) - 1); // Убираем последнюю запятую
		КонецЕсли;
		
		ФайлПоиска = ФайлПоиска + Символы.ПС + "];" + Символы.ПС + Символы.ПС;
		
		ФайлСодержанияТекстовыйДокумент = Новый ТекстовыйДокумент;
		ФайлСодержанияТекстовыйДокумент.УстановитьТекст(ФайлПоиска);
		ФайлСодержанияТекстовыйДокумент.Записать(КаталогДанных + "search.js",  КодировкаТекста.UTF8);	
		
		ХэшПоиска = Новый ХешированиеДанных(ХешФункция.CRC32);
		ХэшПоиска.Добавить(ФайлПоиска);
		
		ХэшСуммаПоиска = ХэшПоиска.ХешСумма;		
		
		КоличествоЭлементовДляПоиска = Номер - 1;
		
	КонецЕсли;
		
	// settings.js
	//
	
	СкрытьСодержание = Ложь;
	СтартоваяСсылка = "";
	СкрытьКоманднуюПанель = Ложь;

	Если НастройкиЭР <> Неопределено Тогда
		
		Если НастройкиЭР.Тип = Перечисления.ТипыЭлектронныхРесурсовСУЗ.Тест Тогда
			СкрытьКоманднуюПанель = Истина;	
		КонецЕсли;
		
		ЕдинственныйЭлементСодержания = Справочники.СводыЗнанийСУЗ.ЕдинственныйЭлементСодержания(НастройкиЭР);
		
		Если ЗначениеЗаполнено(ЕдинственныйЭлементСодержания) Тогда
			
			Если СвойстваПакета.РазмещениеКнопкиВыхода = Перечисления.ВариантыРазмещенияКнопкиВыходаСУЗ.БезКнопки
				ИЛИ СвойстваПакета.РазмещениеКнопкиВыхода = Перечисления.ВариантыРазмещенияКнопкиВыходаСУЗ.СправаФиксированная
				ИЛИ СвойстваПакета.РазмещениеКнопкиВыхода = Перечисления.ВариантыРазмещенияКнопкиВыходаСУЗ.СлеваФиксированная
				ИЛИ СвойстваПакета.РазмещениеКнопкиВыхода = Перечисления.ВариантыРазмещенияКнопкиВыходаСУЗ.СправаИсчезающая
				ИЛИ СвойстваПакета.РазмещениеКнопкиВыхода = Перечисления.ВариантыРазмещенияКнопкиВыходаСУЗ.СлеваИсчезающая Тогда
				
				СкрытьКоманднуюПанель = Истина;
				
			КонецЕсли;
			
			СтартоваяСсылка  = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(ЕдинственныйЭлементСодержания);			
			СкрытьСодержание = Истина;
			
		Иначе
			
			СтартоваяСсылка  = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(НастройкиЭР);			
			СкрытьСодержание = НастройкиЭР.СкрытьСодержание;
			
		КонецЕсли;		
		
	КонецЕсли;
	
	ФайлНастроек = "var oSettings = {
	|	title  : """ + ОбщегоНазначенияСУКлиентСервер.JSСтрока(СвойстваПакета.Наименование) + """,
	|	id  : """ + СвойстваПакета.Код + """,
	|	version  : """ + СвойстваПакета.Версия + """,
	|	sequentiallyNavigation  : " + ?(НастройкиЭР = Неопределено, "false", БулевоВСтроку(НастройкиЭР.ПоследовательнаяНавигация)) + ",
	|	blockNotCompleted  : " + ?(НастройкиЭР = Неопределено, "false", БулевоВСтроку(НастройкиЭР.БлокироватьНепройденное)) + ",
	|	hideTableOfContents : " + БулевоВСтроку(СкрытьСодержание) + ",
	|	glossary : """ + ?(НастройкиЭР = Неопределено ИЛИ НЕ ЗначениеЗаполнено(НастройкиЭР.Глоссарий), "", ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(НастройкиЭР.Глоссарий, "new")) + """,
	|	help : """ + ?(НастройкиЭР = Неопределено ИЛИ НЕ ЗначениеЗаполнено(НастройкиЭР.СправочнаяИнформация), "",ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(НастройкиЭР.СправочнаяИнформация, "new")) + """,
	|	start : """ + СтартоваяСсылка + """,
	|	countElements  : " + ЧислоВСтроку(ЭлементыДляЭкспорта.Количество()) + ",
	|	saveFrequency : ""often"", 
	|	layout : ""auto"",
	|	api : """+ ТипAPI() +""",
	|	fullStatistic : "+ БулевоВСтроку(?(ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.SCORM_1_3, Ложь, Истина)) +",
	|	search : "+ОбщегоНазначенияСУ.ДанныеВJSON(Новый Структура("allow, hash, countElements", ПоискРазрешен, ХэшСуммаПоиска, КоличествоЭлементовДляПоиска))+",
	|	userData : "+НастройкиПользовательскихДанных(НастройкиЭР, ТипПубликации, СкрытьСодержание)+",
	|	closeButton: """+ Перечисления.ВариантыРазмещенияКнопкиВыходаСУЗ.ЗначениеВСтроку(СвойстваПакета.РазмещениеКнопкиВыхода) +""",
	|	hideToolbar : " + БулевоВСтроку(СкрытьКоманднуюПанель) + "
	|};" + Символы.ПС + Символы.ПС;
		
	// saveFrequency: once, medium, often
	
	ФайлДанныхТекстовыйДокумент = Новый ТекстовыйДокумент();
	ФайлДанныхТекстовыйДокумент.УстановитьТекст(ФайлНастроек);
	
	ФайлДанныхТекстовыйДокумент.Записать(КаталогДанных + "settings.js",  КодировкаТекста.UTF8); 
	
	// styles.css
	//
	
	ФайлСтилейТекстовыйДокумент = Новый ТекстовыйДокумент();
	
	Если ЗначениеЗаполнено(ПользовательскиеСтили) Тогда		
		ФайлСтилейТекстовыйДокумент.УстановитьТекст(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПользовательскиеСтили, "ТекстШаблона"));		
	КонецЕсли;
	
	ФайлСтилейТекстовыйДокумент.Записать(КаталогДанных + "styles.css",  КодировкаТекста.UTF8); 
	
	// i18n.js
	//
	
	Если ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.WS Тогда		
		ЯзыкИнтерфейса = Справочники.ПубликацииВебКабинетаСУ.ЯзыкОсновнойПубликации();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЯзыкИнтерфейса) ИЛИ ЯзыкИнтерфейса = Перечисления.ЯзыкиВебКабинетаСУ.Авто Тогда
		ЯзыкИнтерфейса = Перечисления.ЯзыкиВебКабинетаСУ.ruRU;
	КонецЕсли;
	
	ФайлЯзыкаТекстовыйДокумент = Новый ТекстовыйДокумент();
	
	ФайлЯзыкаТекстовыйДокумент.УстановитьТекст(ПолучитьМакет(ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ЯзыкИнтерфейса)).ПолучитьТекст());
	
	ФайлЯзыкаТекстовыйДокумент.Записать(КаталогДанных + "i18n.js",  КодировкаТекста.UTF8);	
	
	// data.js
	//
	
	ФайлДанных = "// Данные объектов" + Символы.ПС + Символы.ПС;
	
	// TOC
	
	ФайлДанных = ФайлДанных + "var oTOC = [" + Символы.ПС;

	Если МассивЭлементовСодержания.Количество() > 0 Тогда
		
		Номер = 0;
		
		Для каждого СтрокаЭС Из МассивЭлементовСодержания Цикл
			
			Если ТипЗнч(СтрокаЭС) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
				
				ФайлДанных = ФайлДанных + Символы.ПС + "{
				|	id : """ + Строка(СтрокаЭС.УникальныйИдентификатор()) + """,
				|	idObject : """ + Строка(СтрокаЭС.УникальныйИдентификатор()) + """,
				|	nameObject : ""knowledgeBase"",
				|	link : """ + ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(СтрокаЭС) + """,
				|	title: """ + ОбщегоНазначенияСУКлиентСервер.JSСтрока(СтрокаЭС.Наименование) + """,
				|	isFolder : false,
				|	complete : false,
				|	parent : """",
				|	number : " + ЧислоВСтроку(Номер) + ",
				|	parameters: """",
				|	attemptLimit: 0,
				|	attemptAbsoluteDurationLimit: """",
				|	completionThreshold: 0,
				|	dataFromLMS: """",
				|	timeLimitAction: """"				
				|},";
				
			КонецЕсли;
				
			Если ТипЗнч(СтрокаЭС) = Тип("СправочникСсылка.СодержаниеСУЗ") Тогда
				
				ФайлДанных = ФайлДанных + Символы.ПС + "{
				|	id : """ + Строка(СтрокаЭС.УникальныйИдентификатор()) + """,
				|	idObject : """ + ?(СтрокаЭС.ЭтоГруппа, "", Строка(СтрокаЭС.СсылкаНаЭлемент.УникальныйИдентификатор())) + """,
				|	nameObject : """ + ?(СтрокаЭС.ЭтоГруппа, "", ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ОбъектыСУЗ.ПолучитьТипОбъектаСУЗ(СтрокаЭС.СсылкаНаЭлемент)))+""",
				|	link : """ + ?(СтрокаЭС.ЭтоГруппа, ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(СтрокаЭС), ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(СтрокаЭС.СсылкаНаЭлемент))  + """,
				|	title: """ + ОбщегоНазначенияСУКлиентСервер.JSСтрока(СтрокаЭС.Наименование) + """,
				|	isFolder : " + БулевоВСтроку(СтрокаЭС.ЭтоГруппа) + ",
				|	complete : false,
				|	parent : """ + ?(ЗначениеЗаполнено(СтрокаЭС.Родитель), Строка(СтрокаЭС.Родитель.УникальныйИдентификатор()), Строка(СтрокаЭС.Владелец.УникальныйИдентификатор())) + """,
				|	number : " + ЧислоВСтроку(Номер) + ",
				|	parameters: """ + ОбщегоНазначенияСУКлиентСервер.JSСтрока(СтрокаЭС.ПараметрыЗапуска) + """,
				|	attemptLimit: " + ?(СтрокаЭС.ЭтоГруппа, 0, ЧислоВСтроку(СтрокаЭС.КоличествоПопыток)) + ",
				|	attemptAbsoluteDurationLimit: """ + ОбщегоНазначенияСУКлиентСервер.JSСтрока(СтрокаЭС.ПродолжительностьПопытки) + """,
				|	completionThreshold: """ + Формат(СтрокаЭС.ПорогВыполнения, "ЧРД=.; ЧРГ=0; ЧН=0; ЧО=1") + """,
				|	dataFromLMS: """ + ОбщегоНазначенияСУКлиентСервер.JSСтрока(СтрокаЭС.ДанныеИнициализации) + """,
				|	timeLimitAction: """ + ?(СтрокаЭС.ЭтоГруппа, "", ОбщегоНазначенияСУКлиентСервер.JSСтрока(Перечисления.ДействияПослеИстеченияВремениВыполненияОбъектаSCORM.ЗначениеSCORM(СтрокаЭС.ДействиеПослеИстеченияВремени))) + """
				|},";
				
			КонецЕсли;
			
			Номер = Номер + 1;
			
		КонецЦикла;
		
		ФайлДанных = Лев(ФайлДанных, СтрДлина(ФайлДанных) - 1); // Убираем последнюю запятую
		
	КонецЕсли;
	
	ФайлДанных = ФайлДанных + Символы.ПС + "];" + Символы.ПС + Символы.ПС;
	
	// links
	
	ФайлДанных = ФайлДанных + "var oLinks = {" + Символы.ПС;
	
	Если МассивСсылок.Количество() > 0 Тогда
	
		Для каждого Ссылка Из МассивСсылок Цикл
			
			ИдентификаторСсылки = ПолучитьИдентификаторОбъекта("link", Ссылка);
			
			ФайлДанных = ФайлДанных + Символы.ПС + ИдентификаторСсылки + " : {
			|	idObject : """ + ?(ЗначениеЗаполнено(Ссылка.СсылкаНаОбъектСУЗ), Строка(Ссылка.СсылкаНаОбъектСУЗ.УникальныйИдентификатор()), "") + """,
			|	nameObject : """ + ?(ЗначениеЗаполнено(Ссылка.СсылкаНаОбъектСУЗ), ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ОбъектыСУЗ.ПолучитьТипОбъектаСУЗ(Ссылка.СсылкаНаОбъектСУЗ)), "") + """,
			|	window : """ + ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(Ссылка.ЦелевоеОкно) + """,
			|	itemCollection : """ + ?(ЗначениеЗаполнено(Ссылка.ЭлементПодборки), Строка(Ссылка.ЭлементПодборки.УникальныйИдентификатор()), "") + """,
			|	anchor : """ + Ссылка.Якорь + """,
			|	extLink  : """ + Ссылка.ВнешняяСсылка + """
			|},";
		
		КонецЦикла;
		
		ФайлДанных = Лев(ФайлДанных, СтрДлина(ФайлДанных) - 1); // Убираем последнюю запятую
		
	КонецЕсли;
		
	ФайлДанных = ФайлДанных + Символы.ПС + "};" + Символы.ПС + Символы.ПС;
	
	// files
	
	ФайлДанных =  ФайлДанных + "var oFiles = {" + Символы.ПС;
	
	Если МассивРесурсов.Количество() > 0 Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ФайлыСУЗ.Ссылка,
			|	ФайлыСУЗ.Владелец КАК Ресурс
			|ИЗ
			|	Справочник.ФайлыСУЗ КАК ФайлыСУЗ
			|ГДЕ
			|	ФайлыСУЗ.ЭтоГруппа = ЛОЖЬ
			|	И ФайлыСУЗ.Владелец В(&МассивРесурсов)";

		Запрос.УстановитьПараметр("МассивРесурсов", МассивРесурсов);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

			ИдентификаторФайла = ПолучитьИдентификаторОбъекта("file", ВыборкаДетальныеЗаписи.Ссылка);
			
			ФайлДанных = ФайлДанных + Символы.ПС + ИдентификаторФайла + " : {
			|	idRes : """ + ВыборкаДетальныеЗаписи.Ресурс.УникальныйИдентификатор() + """,
			|	path : """ + Справочники.ФайлыСУЗ.ПолучитьОтносительныйПутьКФайлу(ВыборкаДетальныеЗаписи.Ссылка, ПолучитьПараметрыЭкспорта()) + """
			|},";
			
		КонецЦикла;
		
		ФайлДанных = Лев(ФайлДанных, СтрДлина(ФайлДанных) - 1); // Убираем последнюю запятую
		
	КонецЕсли;
	
	ФайлДанных = ФайлДанных + Символы.ПС + "};" + Символы.ПС + Символы.ПС;
	
	// Collection
	
	ФайлДанных =  ФайлДанных + "var oCollections = {" + Символы.ПС;
	
	Если МассивПодборок.Количество() > 0 Тогда
		
		Для каждого Подборка Из МассивПодборок Цикл
			
			// Получаем идентификатор подборки
			
			ИдентификаторПодборки = ПолучитьИдентификаторОбъекта("collection", Подборка);
			
			// Формируем описание сложностей
			
			ОписаниеСложностей = "";

			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	СложностиТестовСУЗ.Ссылка,
				|	СложностиТестовСУЗ.ВремяТеста,
				|	СложностиТестовСУЗ.КоличествоГруппЭлементов,
				|	СложностиТестовСУЗ.Наименование
				|ИЗ
				|	Справочник.СложностиТестовСУЗ КАК СложностиТестовСУЗ
				|ГДЕ
				|	СложностиТестовСУЗ.Владелец = &Подборка
				|	И СложностиТестовСУЗ.ПометкаУдаления = ЛОЖЬ";

			Запрос.УстановитьПараметр("Подборка", Подборка);

			Результат = Запрос.Выполнить();

			Если НЕ Результат.Пустой() Тогда
			
				ВыборкаДетальныеЗаписи = Результат.Выбрать();

				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					ИдентификаторСложности = ПолучитьИдентификаторОбъекта("level", ВыборкаДетальныеЗаписи.Ссылка);

					ОписаниеСложностей = ОписаниеСложностей + Символы.ПС + ИдентификаторСложности + " : {
					|	name  : """ + ОбщегоНазначенияСУКлиентСервер.JSСтрока(ВыборкаДетальныеЗаписи.Наименование) + """,
					|	timeQuiz  : " + ЧислоВСтроку(ОбъектыSCORM.ПолучитьКоличествоСекундИзДаты(ВыборкаДетальныеЗаписи.ВремяТеста)) + ",
					|	countQuestions  : " + ЧислоВСтроку(ВыборкаДетальныеЗаписи.КоличествоГруппЭлементов) + "
					|},";
					
				КонецЦикла;

				ОписаниеСложностей = Лев(ОписаниеСложностей, СтрДлина(ОписаниеСложностей) - 1); // Убираем последнюю запятую
				
			КонецЕсли;	
			
			// Формируем описание страниц подборки
			
			ОписаниеСтраниц = "";
			
			СтраницыПодборки = ТаблицаСтраницПодборок.НайтиСтроки(Новый Структура("Подборка", Подборка));  
			
			Если СтраницыПодборки.Количество() > 0 Тогда
				
				Для каждого Строка Из СтраницыПодборки Цикл
					
					// Подгруппы
					
					Подгруппы = "";
					
					Если Строка.Подгруппы.Количество() > 0 Тогда
						
						Для каждого Подгруппа Из Строка.Подгруппы Цикл
							
							ПодгруппаJSОбъект = "{id : ""%1"", countQuestions : %2},";    												
							ПодгруппаJSОбъект = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПодгруппаJSОбъект, Строка(Подгруппа.Ссылка.УникальныйИдентификатор()), Подгруппа.КоличествоВопросов);
							
							Подгруппы = Подгруппы + ПодгруппаJSОбъект;
							
						КонецЦикла;
						
						Подгруппы = Лев(Подгруппы, СтрДлина(Подгруппы) - 1); // Убираем последнюю запятую 
						
					КонецЕсли;
					
					// Вопросы страницы
					
					ВопросыСтраницы = "";
					
					Если Строка.ЭтоГруппа Тогда
						
						ОписаниеВопросовСтраницы = Справочники.ПодборкиСУЗ.ВсеЭлементы(Подборка, Строка.СсылкаНаСтраницу, Тип("СправочникСсылка.ВопросыСУЗ"));
						
						ОписаниеВопросовСтраницы.Колонки.Добавить("ЭлементПодборкиИзРубрикатора");
						
					ИначеЕсли Строка.СсылкаНаСтраницу = Подборка Тогда
						
						ОписаниеВопросовСтраницы = Справочники.ПодборкиСУЗ.ВсеЭлементы(Подборка,, Тип("СправочникСсылка.ВопросыСУЗ"));
						
						ОписаниеВопросовСтраницы.Колонки.Добавить("ЭлементПодборкиИзРубрикатора");
						
					Иначе
						
						ОписаниеВопросовСтраницы = Новый ТаблицаЗначений;
						ОписаниеВопросовСтраницы.Колонки.Добавить("Ссылка");
						ОписаниеВопросовСтраницы.Колонки.Добавить("СсылкаНаОбъектСУЗ");
						ОписаниеВопросовСтраницы.Колонки.Добавить("ВесВопроса");
						ОписаниеВопросовСтраницы.Колонки.Добавить("Родитель");
						ОписаниеВопросовСтраницы.Колонки.Добавить("ЭлементПодборкиИзРубрикатора");
						
						Если ТипЗнч(Строка.СсылкаНаОбъектСУЗ) = Тип("СправочникСсылка.ВопросыСУЗ") Тогда
						
							НоваяСтрока = ОписаниеВопросовСтраницы.Добавить();
							НоваяСтрока.Ссылка = Строка.СсылкаНаСтраницу;
							НоваяСтрока.СсылкаНаОбъектСУЗ = Строка.СсылкаНаОбъектСУЗ;
							НоваяСтрока.ВесВопроса = Строка.ВесВопроса;							
							НоваяСтрока.Родитель = Справочники.ЭлементыПодборкиСУЗ.ПустаяСсылка();
						    НоваяСтрока.ЭлементПодборкиИзРубрикатора = Строка.ЭлементПодборкиИзРубрикатора;
							
						КонецЕсли;
						
					КонецЕсли;
					
					Если ОписаниеВопросовСтраницы.Количество() > 0 Тогда
						
						Для каждого ОписаниеВопроса Из ОписаниеВопросовСтраницы Цикл
							
							ОписаниеВопросаJSОбъект = "{id : ""%1"",  weight : %2, parentGroup : ""%3"", rubricGroup: ""%4""},";
							
							ИдентификаторЭлементыПодборкиИзРубрикатора = ?(
								ЗначениеЗаполнено(ОписаниеВопроса.ЭлементПодборкиИзРубрикатора),
								Строка(ОписаниеВопроса.ЭлементПодборкиИзРубрикатора.УникальныйИдентификатор()),
								"");
							
							ОписаниеВопросаJSОбъект = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								ОписаниеВопросаJSОбъект,
								Строка(ОписаниеВопроса.СсылкаНаОбъектСУЗ.УникальныйИдентификатор()),
								ЧислоВСтроку(ОписаниеВопроса.ВесВопроса),
								Строка(ОписаниеВопроса.Родитель.УникальныйИдентификатор()),
								ИдентификаторЭлементыПодборкиИзРубрикатора);
							
							ВопросыСтраницы = ВопросыСтраницы + ОписаниеВопросаJSОбъект;
							
						КонецЦикла;
						
						ВопросыСтраницы = Лев(ВопросыСтраницы, СтрДлина(ВопросыСтраницы) - 1); // Убираем последнюю запятую 
						
					КонецЕсли;
					
					// Собираем описание страницы
					
					СтраницаJSОбъект = "{id : ""%1"", countQuestions : %2, subgroups : [%3], questions : [%4], type: ""%5""},";
					СтраницаJSОбъект = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтраницаJSОбъект, Строка(Строка.СсылкаНаСтраницу.УникальныйИдентификатор()), Строка.КоличествоВопросов, Подгруппы, ВопросыСтраницы, Строка.ТипЭлемента);
					
					ОписаниеСтраниц = ОписаниеСтраниц + СтраницаJSОбъект;
				
				КонецЦикла;
				
				ОписаниеСтраниц = Лев(ОписаниеСтраниц, СтрДлина(ОписаниеСтраниц) - 1); // Убираем последнюю запятую
				
			КонецЕсли;
			
			// Формируем описание элементов подборки из рубрикатора
			
			ОписаниеЭлементовПодборки = "";
	
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЭлементыПодборкиИзРубрикатораСУЗ.Ссылка,
				|	ЭлементыПодборкиИзРубрикатораСУЗ.КоличествоЭлементов,
				|	ЭлементыПодборкиИзРубрикатораСУЗ.РазрешенныйВес
				|ИЗ
				|	Справочник.ЭлементыПодборкиИзРубрикатораСУЗ КАК ЭлементыПодборкиИзРубрикатораСУЗ
				|ГДЕ
				|	ЭлементыПодборкиИзРубрикатораСУЗ.Владелец = &Подборка
				|	И ЭлементыПодборкиИзРубрикатораСУЗ.ПометкаУдаления = ЛОЖЬ";
			
			Запрос.УстановитьПараметр("Подборка", Подборка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если НЕ РезультатЗапроса.Пустой() Тогда
			
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ОписаниеЭлемента =  "{id : ""%1"", countElements : %2, allowWeight : %3}";
					ОписаниеЭлемента  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						ОписаниеЭлемента,
						Строка(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор()),
						ВыборкаДетальныеЗаписи.КоличествоЭлементов,
						ВыборкаДетальныеЗаписи.РазрешенныйВес);
					ОписаниеЭлементовПодборки = ОписаниеЭлементовПодборки + ОписаниеЭлемента + ", "; 
				КонецЦикла;
				
				ОписаниеЭлементовПодборки = Лев(ОписаниеЭлементовПодборки, СтрДлина(ОписаниеЭлементовПодборки) - 1); // Убираем последнюю запятую
			
			КонецЕсли;
						
			// Формируем описание комментариев к тесту
			
			Комментарии = "";
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	КомментарииКТестамСУЗ.НачалоДиапазонаБаллов,
				|	КомментарииКТестамСУЗ.КонецДиапазонаБаллов,
				|	КомментарииКТестамСУЗ.Комментарий,
				|	КомментарииКТестамСУЗ.Поставщик,
				|	КомментарииКТестамСУЗ.Ресурс
				|ИЗ
				|	Справочник.КомментарииКТестамСУЗ КАК КомментарииКТестамСУЗ
				|ГДЕ
				|	КомментарииКТестамСУЗ.Владелец = &Подборка
				|	И КомментарииКТестамСУЗ.ПометкаУдаления = ЛОЖЬ";

			Запрос.УстановитьПараметр("Подборка", Подборка);

			Результат = Запрос.Выполнить();

			Если НЕ Результат.Пустой() Тогда
				
				ТаблицаДиапазонов = Результат.Выгрузить(); // Выбираем все комментарии
				
				Для каждого СтрокаТД Из ТаблицаДиапазонов Цикл
					Комментарии = Комментарии + ПолучитьПредставлениеКомментария(СтрокаТД, ПредпочитаемыйПоставщикБазы)  + ","
				КонецЦикла;
				
				Комментарии = Лев(Комментарии, СтрДлина(Комментарии) - 1); // Убираем последнюю запятую
				
			КонецЕсли;
			
			// Формируем описание психологических комментариев
			
			КомментарииПсихологические = "";
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	КомментарииКТестамСУЗ.НачалоДиапазонаБаллов,
				|	КомментарииКТестамСУЗ.КонецДиапазонаБаллов,
				|	КомментарииКТестамСУЗ.Комментарий,
				|	КомментарииКТестамСУЗ.Поставщик,
				|	КомментарииКТестамСУЗ.Ресурс
				|ИЗ
				|	Справочник.КомментарииКТестамСУЗ КАК КомментарииКТестамСУЗ
				|ГДЕ
				|	КомментарииКТестамСУЗ.Владелец = &Подборка
				|	И КомментарииКТестамСУЗ.ПометкаУдаления = ЛОЖЬ";

			Запрос.УстановитьПараметр("Подборка", Подборка);

			Результат = Запрос.Выполнить();

			Если НЕ Результат.Пустой() Тогда
				
				ТаблицаДиапазонов = Результат.Выгрузить(); // Выбираем все комментарии
				
				Для каждого СтрокаТД Из ТаблицаДиапазонов Цикл
					КомментарииПсихологические = КомментарииПсихологические + ПолучитьПредставлениеКомментария(СтрокаТД, ПредпочитаемыйПоставщикБазы) + ","
				КонецЦикла;
				
				КомментарииПсихологические = Лев(КомментарииПсихологические, СтрДлина(КомментарииПсихологические) - 1); // Убираем последнюю запятую
				
			КонецЕсли;
			
			// Формируем ОбщийФинальныйКомментарий
			
			ФинальныйКомментарий        = ОбщегоНазначенияСУКлиентСервер.JSСтрока(Подборка.ОбщийФинальныйКомментарий);
			РесурсФинальногоКомментария = ПолучитьПредставлениеРесурсаДляJSСкрипта(Подборка.ОбщийФинальныйРесурс,,ПредпочитаемыйПоставщикБазы);
			
			ОбщийФинальныйКомментарий   = "{comment : ""%1"", res_html : ""%2"", res_script : ""%3""}";
			ПодготовитьТекстыКомментариев(ФинальныйКомментарий);
			ОбщийФинальныйКомментарий   = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОбщийФинальныйКомментарий, ФинальныйКомментарий, РесурсФинальногоКомментария.Представление, РесурсФинальногоКомментария.Скрипт);
			
            // Собираем общее описание подоборки
					
			ФайлДанных = ФайлДанных + Символы.ПС + ИдентификаторПодборки + " : {
			|	isQuiz : " + ?(Подборка.ЭтоТест, "true", "false") + ",
			|	isStartPage : " + ?(Подборка.ПоказыватьСтартовуюСтраницу, "true", "false") + ",
			|	noPages : " + БулевоВСтроку(ПодборкаБезСтраниц(Подборка)) + ",
			|	timeQuiz : " + ЧислоВСтроку(ОбъектыSCORM.ПолучитьКоличествоСекундИзДаты(Подборка.ВремяТеста)) + ",
			|	timerFormat : """ + ?(НЕ ЗначениеЗаполнено(Подборка.ФорматТаймера) ИЛИ Подборка.ФорматТаймера = Перечисления.ФорматыТаймераСУЗ.Минуты, "M", "MS") + """,
			|	countAttemptQuiz : " + ЧислоВСтроку(Подборка.КоличествоПопыток) + ",
			|	randomQuestions : " + ?((Подборка.ПеремешиватьГруппыЭлементов ИЛИ Подборка.ВыбиратьЭлементыИзРубрикатора), "true", "false") + ",
			|	autoNextQuestion : " + ?(Подборка.ПереходитьВпередАвтоматически, "true", "false") + ",
			|	showNavigation : " + ?(Подборка.ПоказыватьНавигацию, "true", "false") + ",
			|	countQuestions : " + ЧислоВСтроку(Подборка.КоличествоГруппЭлементов) + ",
			|	typeQuiz : """ + ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(Подборка.НазначениеТестирования) + """,
			|	noFullAnswers : " + ?(Подборка.ИсключитьОткрытыеВопросы, "true", "false") + ",
			|	infoFinalPage : """ + ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(Подборка.ИнформацияНаФинальнойСтранице) + """,
			|	levels : {" + ОписаниеСложностей + "},
			|	finalComment : " + ОбщийФинальныйКомментарий + ",
			|	comments : [" + Комментарии + "],
			|	psychologicComments : [" + КомментарииПсихологические + "],
			|	pages : [" + ОписаниеСтраниц + "],
			|	rubricGroups : [" + ОписаниеЭлементовПодборки + "]
			|},";
		
		КонецЦикла;
		
		ФайлДанных = Лев(ФайлДанных, СтрДлина(ФайлДанных) - 1); // Убираем последнюю запятую
		
	КонецЕсли;
	
	ФайлДанных = ФайлДанных + Символы.ПС + "};" + Символы.ПС + Символы.ПС;
	
	// Questions
	
	ФайлДанных =  ФайлДанных + "var oQuestions = {" + Символы.ПС;
	
	Если МассивВопросов.Количество() > 0 Тогда
		
		Для каждого Вопрос Из МассивВопросов Цикл
			
			// Формируем переменные
			
			ИдентификаторВопроса = ПолучитьИдентификаторОбъекта("question", Вопрос);	
			
			ТаблицаКатегорийВариантовОтветов = Новый ТаблицаЗначений;
			ТаблицаКатегорийВариантовОтветов.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.КатегорииВариантовОтветовНаВопросСУЗ"));
			
			МассивПолучаемыхРеквизитов = Новый Массив();
			МассивПолучаемыхРеквизитов.Добавить("ТекстовыеДанные");
			МассивПолучаемыхРеквизитов.Добавить("ФорматированныйДокумент");
			МассивПолучаемыхРеквизитов.Добавить("ВерныйКомментарий");
			МассивПолучаемыхРеквизитов.Добавить("ОшибочныйКомментарий");
			
			////////////////////////////////////////////////////////////////////////
			ВыборкаВсехДанныхВопроса = ОбъектыСУЗ.ПолучитьДанные(Вопрос,,Истина,МассивПолучаемыхРеквизитов);
			////////////////////////////////////////////////////////////////////////
			
			// Формируем описание вариантов ответов
			
			ОписаниеВариантов = "";

			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ВариантыОтветовНаВопросСУЗ.Ссылка,
				|	ВариантыОтветовНаВопросСУЗ.Родитель,
				|	ВариантыОтветовНаВопросСУЗ.ВернаяГруппаФасетов,
				|	ВариантыОтветовНаВопросСУЗ.Верный,
				|	ВариантыОтветовНаВопросСУЗ.Категория,
				|	ВариантыОтветовНаВопросСУЗ.РесурсДляВерногоКомментария,
				|	ВариантыОтветовНаВопросСУЗ.РесурсДляОшибочногоКомментария,
				|	ВариантыОтветовНаВопросСУЗ.БаллПриПсихологическомТестировании,
				|	ВариантыОтветовНаВопросСУЗ.Код,
				|	ВариантыОтветовНаВопросСУЗ.Родитель.Код КАК КодГруппы
				|ИЗ
				|	Справочник.ВариантыОтветовНаВопросСУЗ КАК ВариантыОтветовНаВопросСУЗ
				|ГДЕ
				|	ВариантыОтветовНаВопросСУЗ.Владелец = &Вопрос
				|	И ВариантыОтветовНаВопросСУЗ.ЭтоГруппа = ЛОЖЬ
				|	И ВариантыОтветовНаВопросСУЗ.ПометкаУдаления = ЛОЖЬ";

			Запрос.УстановитьПараметр("Вопрос", Вопрос);

			Результат = Запрос.Выполнить();

			Если НЕ Результат.Пустой() Тогда
				
				ТаблицаВариантов = Результат.Выгрузить();
				ТаблицаВариантов.Колонки.Добавить("Порядок");
				
				Для каждого Строка Из ТаблицаВариантов Цикл
					Строка.Порядок = ?(ЗначениеЗаполнено(Строка.Родитель), Число(Строка(Строка.КодГруппы) + Строка(Строка.Код)), Число(Строка(Строка.Код) + Строка(Строка.Код)));
				КонецЦикла;
				
				// Если в будущем порядок вопросов будет изменен, то он должен быть тот же,
				// Что и при выгрузке самого вопроса, чтобы порядок вариантов был одинаковым.
				
				ТаблицаВариантов.Сортировать("Порядок");

				НомерВарианта = 1;
				
				Для каждого ВыборкаДетальныеЗаписи Из ТаблицаВариантов Цикл
					
					// Получаем структуру комментариев варианта
					
					ВерныйКомментарийКВарианту    = "{comment: ""%1"", res_html : ""%2"", res_script : ""%3""}";
					ОшибочныйКомментарийКВарианту = "{comment: ""%1"", res_html : ""%2"", res_script : ""%3""}";
					
					МассивПараметровВерногоКомментария    = Новый Массив();
					МассивПараметровОшибочногоКомментария = Новый Массив();
					
					ВыборкаВсехДанныхВопроса.Сбросить();
					
					Если ВыборкаВсехДанныхВопроса.НайтиСледующий(ВыборкаДетальныеЗаписи.Ссылка, "КодДанных") Тогда
						
						МассивПараметровВерногоКомментария.Добавить(ОбщегоНазначенияСУКлиентСервер.JSСтрока(ВыборкаВсехДанныхВопроса.ВерныйКомментарий));
						МассивПараметровОшибочногоКомментария.Добавить(ОбщегоНазначенияСУКлиентСервер.JSСтрока(ВыборкаВсехДанныхВопроса.ОшибочныйКомментарий));
											
					КонецЕсли;
					
					СтруктураВерногоРесурса = ПолучитьПредставлениеРесурсаДляJSСкрипта(ВыборкаДетальныеЗаписи.РесурсДляВерногоКомментария,,ПредпочитаемыйПоставщикБазы);
					
					МассивПараметровВерногоКомментария.Добавить(СтруктураВерногоРесурса.Представление);
					МассивПараметровВерногоКомментария.Добавить(СтруктураВерногоРесурса.Скрипт);
					
					СтруктураОшибочногоРесурса = ПолучитьПредставлениеРесурсаДляJSСкрипта(ВыборкаДетальныеЗаписи.РесурсДляОшибочногоКомментария,,ПредпочитаемыйПоставщикБазы);
						
					МассивПараметровОшибочногоКомментария.Добавить(СтруктураОшибочногоРесурса.Представление);
					МассивПараметровОшибочногоКомментария.Добавить(СтруктураОшибочногоРесурса.Скрипт);
					
					ВерныйКомментарийКВарианту = ПодставитьПараметрыВСтрокуИзМассива(ВерныйКомментарийКВарианту, МассивПараметровВерногоКомментария);
					ОшибочныйКомментарийКВарианту = ПодставитьПараметрыВСтрокуИзМассива(ОшибочныйКомментарийКВарианту, МассивПараметровОшибочногоКомментария);
					
					// Формируем данные варианта
					
					ВариантJSОбъект = "{id : ""%1"", number : %2, code : %3, group : ""%4"", groupFacet : ""%5"", isTrue : %6, category : ""%7"", trueComment : %8, errorComment : %9, psychologicScore : %10, textVariant : ""%11""},";
					
					МассивПараметровВарианта = Новый Массив();
					МассивПараметровВарианта.Добавить(Строка(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор()));
					МассивПараметровВарианта.Добавить(ЧислоВСтроку(НомерВарианта));
					МассивПараметровВарианта.Добавить(ЧислоВСтроку(ВыборкаДетальныеЗаписи.Порядок));
					МассивПараметровВарианта.Добавить(Строка(ВыборкаДетальныеЗаписи.Родитель.УникальныйИдентификатор()));
					МассивПараметровВарианта.Добавить(Строка(ВыборкаДетальныеЗаписи.ВернаяГруппаФасетов.УникальныйИдентификатор()));
					МассивПараметровВарианта.Добавить(?(ВыборкаДетальныеЗаписи.Верный, "true", "false"));
					МассивПараметровВарианта.Добавить(Строка(ВыборкаДетальныеЗаписи.Категория.УникальныйИдентификатор()));
					МассивПараметровВарианта.Добавить(ВерныйКомментарийКВарианту);
					МассивПараметровВарианта.Добавить(ОшибочныйКомментарийКВарианту);
					МассивПараметровВарианта.Добавить(ЧисловСтроку(ВыборкаДетальныеЗаписи.БаллПриПсихологическомТестировании));
					
					Если Вопрос.ТипВопроса = Перечисления.ТипыВопросовСУЗ.ПоШаблону Тогда
						
						ВыборкаВсехДанныхВопроса.Сбросить();
						
						Если ВыборкаВсехДанныхВопроса.НайтиСледующий(ВыборкаДетальныеЗаписи.Ссылка, "КодДанных") Тогда
							МассивПараметровВарианта.Добавить(ОбщегоНазначенияСУКлиентСервер.JSСтрока(НРег(ВыборкаВсехДанныхВопроса.ТекстовыеДанные)));
						КонецЕсли;
						
					Иначе
						
						МассивПараметровВарианта.Добавить("");
						
					КонецЕсли;
							
					ВариантJSОбъект = ПодставитьПараметрыВСтрокуИзМассива(ВариантJSОбъект, МассивПараметровВарианта);
					
					ОписаниеВариантов = ОписаниеВариантов + ВариантJSОбъект;
					
					НомерВарианта = НомерВарианта + 1;
					
					Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Категория)
						И ТаблицаКатегорийВариантовОтветов.Найти(ВыборкаДетальныеЗаписи.Категория, "Ссылка") = Неопределено Тогда
						
						НоваяКатегорияСтрока = ТаблицаКатегорийВариантовОтветов.Добавить();
						НоваяКатегорияСтрока.Ссылка = ВыборкаДетальныеЗаписи.Категория;
							
					КонецЕсли;
					
					
				КонецЦикла;

				ОписаниеВариантов = Лев(ОписаниеВариантов, СтрДлина(ОписаниеВариантов) - 1); // Убираем последнюю запятую
				
			КонецЕсли;
			
			// Формируем описание групп вариантов
			
			ОписаниеГруппВариантов = "";

			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ВариантыОтветовНаВопросСУЗ.Ссылка,
				|	ВариантыОтветовНаВопросСУЗ.КоличествоДоступныхВариантов,
				|	ВариантыОтветовНаВопросСУЗ.ПредлагатьВыборВариантов,
				|	ВариантыОтветовНаВопросСУЗ.Код КАК Код
				|ИЗ
				|	Справочник.ВариантыОтветовНаВопросСУЗ КАК ВариантыОтветовНаВопросСУЗ
				|ГДЕ
				|	ВариантыОтветовНаВопросСУЗ.Владелец = &Вопрос
				|	И ВариантыОтветовНаВопросСУЗ.ПометкаУдаления = ЛОЖЬ
				|	И ВариантыОтветовНаВопросСУЗ.ЭтоГруппа = ИСТИНА
				|
				|УПОРЯДОЧИТЬ ПО
				|	Код";

			Запрос.УстановитьПараметр("Вопрос", Вопрос);

			Результат = Запрос.Выполнить();

			Если НЕ Результат.Пустой() Тогда
				
				ВыборкаДетальныеЗаписи = Результат.Выбрать();
                НомерГруппы = 1;
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					ГруппаВариантовJSОбъект = "{id : ""%1"", number : %2, countVariants : %3, selectVariants : %4},";
					
					ГруппаВариантовJSОбъект = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ГруппаВариантовJSОбъект,
                                                  Строка(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор()),
												  ЧислоВСтроку(НомерГруппы),
												  ЧислоВСтроку(ВыборкаДетальныеЗаписи.КоличествоДоступныхВариантов),
												  ?(ВыборкаДетальныеЗаписи.ПредлагатьВыборВариантов, "true", "false"));

					ОписаниеГруппВариантов = ОписаниеГруппВариантов + ГруппаВариантовJSОбъект;
					
					НомерГруппы = НомерГруппы + 1;
					
				КонецЦикла;

				ОписаниеГруппВариантов = Лев(ОписаниеГруппВариантов, СтрДлина(ОписаниеГруппВариантов) - 1); // Убираем последнюю запятую
				
			КонецЕсли;
			
			// Формируем описание категорий вариантов ответов
			
			ОписаниеКатегорийВариантов = "";
			
			Если ТаблицаКатегорийВариантовОтветов.Количество() > 0 Тогда
			
				ТаблицаКатегорийВариантовОтветов.Сортировать("Ссылка");
				
				КоличествоКатегорийВариантов = ТаблицаКатегорийВариантовОтветов.Количество();
				
				Для Сч=0 По КоличествоКатегорийВариантов-1 Цикл
					
					КатегорияИзТаблицы = ТаблицаКатегорийВариантовОтветов.Получить(Сч);
					НомерКатегории    = Сч + 1;
					
					КатегорияВариантовJSОбъект = "{id : ""%1"", number : %2},";
					
					КатегорияВариантовJSОбъект = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(КатегорияВариантовJSОбъект,
			                                         Строка(КатегорияИзТаблицы.Ссылка.УникальныйИдентификатор()),
												     ЧислоВСтроку(НомерКатегории));
					
					ОписаниеКатегорийВариантов = ОписаниеКатегорийВариантов + КатегорияВариантовJSОбъект;
					
				КонецЦикла;
				
				ОписаниеКатегорийВариантов = Лев(ОписаниеКатегорийВариантов, СтрДлина(ОписаниеКатегорийВариантов) - 1); // Убираем последнюю запятую
				
			КонецЕсли;
			
			// Формируем описание фасетов
			
			ОписаниеФасетов = "";
			
			Если Вопрос.ФасетныйВопрос Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ФасетыВопросовСУЗ.Ссылка,
					|	ФасетыВопросовСУЗ.ЗначенияФасета.(
					|		НомерСтроки,
					|		ТекстВарианта
					|	) КАК Значения,
					|	ФасетыВопросовСУЗ.Родитель
					|ИЗ
					|	Справочник.ФасетыВопросовСУЗ КАК ФасетыВопросовСУЗ
					|ГДЕ
					|	ФасетыВопросовСУЗ.ПометкаУдаления = ЛОЖЬ
					|	И ФасетыВопросовСУЗ.ЭтоГруппа = ЛОЖЬ
					|	И ФасетыВопросовСУЗ.Владелец = &Вопрос";

				Запрос.УстановитьПараметр("Вопрос", Вопрос);
					
				Результат = Запрос.Выполнить();

				Если НЕ Результат.Пустой() Тогда
					
					ВыборкаДетальныеЗаписи = Результат.Выбрать();

					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						
						ЗначенияФасета = "";
						
						ТаблицаЗначенийФасета = ВыборкаДетальныеЗаписи.Значения.Выгрузить();
						
						Если ТаблицаЗначенийФасета.Количество() > 0 Тогда
							
							ТаблицаЗначенийФасета.Сортировать("НомерСтроки");
							
							Для каждого Строка Из ТаблицаЗначенийФасета Цикл
							
								ЗначенияФасета = ЗначенияФасета + """" + ОбщегоНазначенияСУКлиентСервер.JSСтрока(Строка.ТекстВарианта) + """,";
							
							КонецЦикла;
							
							ЗначенияФасета = Лев(ЗначенияФасета, СтрДлина(ЗначенияФасета) - 1); // Убираем последнюю запятую
							
						КонецЕсли;
						
						ФасетJSОбъект = "{id : ""%1"", group : ""%2"", values : [%3]},";
						
						ФасетJSОбъект   = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ФасетJSОбъект, Строка(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор()), Строка(ВыборкаДетальныеЗаписи.Родитель.УникальныйИдентификатор()), ЗначенияФасета);
						
						ОписаниеФасетов = ОписаниеФасетов + ФасетJSОбъект;
						
					КонецЦикла;

				КонецЕсли;
				
				ОписаниеФасетов = Лев(ОписаниеФасетов, СтрДлина(ОписаниеФасетов) - 1); // Убираем последнюю запятую
				
			КонецЕсли;
			
			// Получаем ответ на вопрос
			
			ОтветНаВопрос = "";
			
			ВыборкаВсехДанныхВопроса.Сбросить();
					
			Если ВыборкаВсехДанныхВопроса.НайтиСледующий("Ответ", "КодДанных") Тогда
				
				Если Вопрос.ИспользуетсяФорматированныйДокумент Тогда
					Вложения = Новый Структура();
					ТекстОтвета = "";
					ТекстОтвета = ОбщегоНазначенияСУ.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ВыборкаВсехДанныхВопроса.ФорматированныйДокумент.Получить(), Вопрос.УникальныйИдентификатор(), "Ответ").ПредставлениеHTML;
				Иначе
					ТекстОтвета = ВыборкаВсехДанныхВопроса.ТекстовыеДанные;
				КонецЕсли;
				
				ТекстОтвета = ОбщегоНазначенияСУ.ВыделитьТелоHTMLДокумента(ТекстОтвета);
				
				Если ЗначениеЗаполнено(СокрЛП(ОбщегоНазначенияСУ.ВыделитьТекстHTMLДокумента(ТекстОтвета))) Тогда
				
					ОтветНаВопрос = ОбщегоНазначенияСУКлиентСервер.JSСтрока(ТекстОтвета);
					
				КонецЕсли;
				
			КонецЕсли;
			
			// Получаем подсказку
			
			Подсказка = "";
			
			ВыборкаВсехДанныхВопроса.Сбросить();
					
			Если ВыборкаВсехДанныхВопроса.НайтиСледующий("Подсказка", "КодДанных") Тогда
				
				Если Вопрос.ИспользуетсяФорматированныйДокумент Тогда
					Вложения = Новый Структура();
					ТекстПодсказки = "";
					ТекстПодсказки = ОбщегоНазначенияСУ.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ВыборкаВсехДанныхВопроса.ФорматированныйДокумент.Получить(), Вопрос.УникальныйИдентификатор(), "Подсказка").ПредставлениеHTML;
				Иначе
					ТекстПодсказки = ВыборкаВсехДанныхВопроса.ТекстовыеДанные;
				КонецЕсли;
				
				Подсказка = ОбщегоНазначенияСУКлиентСервер.JSСтрока(ОбщегоНазначенияСУ.ВыделитьТелоHTMLДокумента(ТекстПодсказки));
				
			КонецЕсли;
			
			// Получаем идентификатор программного продукта
			
			ПрограммныйПродуктИдентификатор = "";
			
			Если ЗначениеЗаполнено(Вопрос.ПрограммныйПродукт) Тогда
				
				МассивПрограммныхПродуктов.Добавить(Вопрос.ПрограммныйПродукт);
				
				ПрограммныйПродуктИдентификатор = Строка(Вопрос.ПрограммныйПродукт.УникальныйИдентификатор()); 
				
			КонецЕсли;
			
			// Описание этапов работы с программным продуктом
			
			ОписаниеЭтапов = "";
			
			Если Вопрос.ЭтапыРаботыВПрограмме.Количество() > 0 Тогда

				Для каждого СтрокаТЧЭ Из Вопрос.ЭтапыРаботыВПрограмме Цикл

					ЭтапJSОбъект = "{code : ""%1"", name: ""%2"", number : %3, type: ""%4"", description: ""%5""},";

					ЭтапJSОбъект = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ЭтапJSОбъект,
										ОбщегоНазначенияСУКлиентСервер.JSСтрока(СтрокаТЧЭ.Код),
										ОбщегоНазначенияСУКлиентСервер.JSСтрока(СтрокаТЧЭ.Имя),
										ЧислоВСтроку(СтрокаТЧЭ.НомерСтроки),
										ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(СтрокаТЧЭ.Тип),
										ОбщегоНазначенияСУКлиентСервер.JSСтрока(СтрокаТЧЭ.Описание));

					ОписаниеЭтапов = ОписаниеЭтапов + ЭтапJSОбъект;

				КонецЦикла;

				ОписаниеЭтапов = Лев(ОписаниеЭтапов, СтрДлина(ОписаниеЭтапов) - 1); // Убираем последнюю запятую

			КонецЕсли;
			
			// Описание параметров
			
			ОписаниеПараметров = "";
			
			Если Вопрос.Параметры.Количество() > 0 Тогда

				Для каждого СтрокаТЧП Из Вопрос.Параметры Цикл

					ПараметрJSОбъект = "{code : ""%1"", value: ""%2"", typeValue: ""%3"", toProgram : %4, number: %5},";

					ЗначениеСтрока = СтрокаТЧП.Значение;
					
					Если СтрокаТЧП.ЗаполняетсяПрограммой Тогда
						
						ЗначениеСтрока = Неопределено;
						
					Иначе
						
						Если ТипЗнч(СтрокаТЧП.Значение) = Тип("Булево") Тогда
							ЗначениеСтрока = БулевоВСтроку(СтрокаТЧП.Значение);	
						ИначеЕсли ТипЗнч(СтрокаТЧП.Значение) = Тип("Число") Тогда
							ЗначениеСтрока = ЧислоВСтроку(СтрокаТЧП.Значение);
						ИначеЕсли ТипЗнч(СтрокаТЧП.Значение) = Тип("Дата") Тогда						
							ЗначениеСтрока = ДатаВСтроку(СтрокаТЧП.Значение);
						КонецЕсли;
						
					КонецЕсли;						
					
					ПараметрJSОбъект = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПараметрJSОбъект,
										ОбщегоНазначенияСУКлиентСервер.JSСтрока(СтрокаТЧП.Код),
										ОбщегоНазначенияСУКлиентСервер.JSСтрока(ЗначениеСтрока),
										Строка(ТипЗнч(СтрокаТЧП.Значение)),
										БулевоВСтроку(СтрокаТЧП.ЗаполняетсяПрограммой),
										ЧислоВСтроку(СтрокаТЧП.НомерСтроки));

					ОписаниеПараметров = ОписаниеПараметров + ПараметрJSОбъект;

				КонецЦикла;

				ОписаниеПараметров = Лев(ОписаниеПараметров, СтрДлина(ОписаниеПараметров) - 1); // Убираем последнюю запятую

			КонецЕсли;
			
			// Комментарии
		
			ОписаниеКомментариев = "";
			
			Если Вопрос.Комментарии.Количество() > 0 Тогда

				Для каждого СтрокаТЧК Из Вопрос.Комментарии Цикл

					КомментарийJSОбъект = "{code : ""%1"", number : %2, text: ""%3""},";

					КомментарийJSОбъект = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(КомментарийJSОбъект,
										ОбщегоНазначенияСУКлиентСервер.JSСтрока(СтрокаТЧК.Код),
										ЧислоВСтроку(СтрокаТЧК.НомерСтроки),
										ОбщегоНазначенияСУКлиентСервер.JSСтрока(СтрокаТЧК.Текст));

					ОписаниеКомментариев = ОписаниеКомментариев + КомментарийJSОбъект;

				КонецЦикла;

				ОписаниеКомментариев = Лев(ОписаниеКомментариев, СтрДлина(ОписаниеКомментариев) - 1); // Убираем последнюю запятую

			КонецЕсли;
			
			// Элементы для повторного прохождения
			
			СвязанныеЭлементы = "";
			Если ЗначениеЗаполнено(АвтоРубрикатор) Тогда
				РубрикиЭлемента = РегистрыСведений.РубрикиОбъектовСУЗ.РубрикиЭлемента(АвтоРубрикатор, Вопрос);
				Если РубрикиЭлемента.Количество() > 0 тогда
					Для каждого РубрикаВопроса Из РубрикиЭлемента Цикл
						СвязанныеЭлементы = СвязанныеЭлементы + """" + Строка(РубрикаВопроса.УникальныйИдентификатор()) + """,";
					КонецЦикла;
					СвязанныеЭлементы = Лев(СвязанныеЭлементы, СтрДлина(СвязанныеЭлементы) - 1); // Убираем последнюю запятую
				КонецЕсли;
			КонецЕсли;
			
            // Собираем общее описание вопроса
			
			ТипВопроса = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(Вопрос.ТипВопроса);
			
			ФайлДанных = ФайлДанных + Символы.ПС + ИдентификаторВопроса + " : {
			|	description : """ + ОбщегоНазначенияСУКлиентСервер.JSСтрока(Вопрос.Наименование) + """,
			|	scoreMethod : """ + ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(Вопрос.МетодРасчетаРезультата) + """,
			|	type : """ + ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(Вопрос.ТипВопроса) + """,
			|	typeViewVariants : """ + ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(Вопрос.ОтображениеВариантов) + """,
			|	consecutiveVariants : " + ?(Вопрос.ПоследовательныйВыводВариантов, "true", "false") + ",
			|	isFacet : " + ?(Вопрос.ФасетныйВопрос, "true", "false") + ",
			|	isFreeAnswer : " + ?(Вопрос.РазрешенРазвернутыйОтвет, "true", "false") + ",
			|	isPsychologic : " + ?(Найти(ТипВопроса, "Психологический") > 0, "true", "false") + ",
			|	penalty : " + ЧислоВСтроку(Вопрос.ШтрафЗаПодсказку) + ",
			|	randomizedVariants : " + ?(Вопрос.ПеремешиватьВарианты, "true", "false") + ",
			|	variants : [" + ОписаниеВариантов + "],
			|	groupsVariants : [" + ОписаниеГруппВариантов + "],
			|	categoresVariants : [" + ОписаниеКатегорийВариантов + "],
			|	facets : [" + ОписаниеФасетов + "],
			|	answer : """+ОтветНаВопрос+""",
			|	help : """+Подсказка+""",
			|   programm : """+ПрограммныйПродуктИдентификатор+""",
			|   stages: ["+ОписаниеЭтапов+"],
			|   parameters: ["+ОписаниеПараметров+"],
			|   comments: ["+ОписаниеКомментариев+"],
			|   related: ["+СвязанныеЭлементы+"]
			|},";
			
		КонецЦикла;
		
		ФайлДанных = Лев(ФайлДанных, СтрДлина(ФайлДанных) - 1); // Убираем последнюю запятую
		
	КонецЕсли;
	
	ФайлДанных = ФайлДанных + Символы.ПС + "};" + Символы.ПС + Символы.ПС;
	
	// Programs
	
	ФайлДанных =  ФайлДанных + "var oPrograms = {" + Символы.ПС;
	
	Если МассивПрограммныхПродуктов.Количество() > 0 Тогда
		
		Для каждого ПрограммныйПродукт Из МассивПрограммныхПродуктов Цикл
			
			ИдентификаторПрограммногоПродукта = ПолучитьИдентификаторОбъекта("program", ПрограммныйПродукт);
			
			Обработка = Справочники.ПрограммныеПродуктыСУЗ.ОписаниеОбработки(ПрограммныйПродукт.Обработка, ПредпочитаемыйПоставщик);
			
			ОбработкаJSОбъект = "{safely : %1, verAPI : %2, data : ""%3"", name : ""%4""}";
			
			ОбработкаJSОбъект = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОбработкаJSОбъект, БулевоВСтроку(Обработка.Безопасно), Обработка.ВерсияAPI, Обработка.Данные, ОбщегоНазначенияСУКлиентСервер.JSСтрока(Обработка.Имя));
			
			ФайлДанных = ФайлДанных + Символы.ПС + ИдентификаторПрограммногоПродукта + " : {
			|	id : """+Строка(ПрограммныйПродукт.УникальныйИдентификатор())+""",
			|	name : """+ПрограммныйПродукт.Наименование+""",
			|   type: """ + ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ПрограммныйПродукт.Тип) + """,
			|   processor: "+ОбработкаJSОбъект+"
			|},";
		
		КонецЦикла;
		
		ФайлДанных = Лев(ФайлДанных, СтрДлина(ФайлДанных) - 1); // Убираем последнюю запятую
		
	КонецЕсли;
	
	ФайлДанных = ФайлДанных + Символы.ПС + "};" + Символы.ПС + Символы.ПС;
	
	// oElements (элементы содержания всех курсов, в т.ч. зависимых)
	
	ФайлДанных =  ФайлДанных + "var oElements = [" + Символы.ПС;
	
	Если МассивЭлектронныхКурсов.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СодержаниеСУЗ.Ссылка,
			|	СодержаниеСУЗ.ЭтоГруппа,
			|	СодержаниеСУЗ.СсылкаНаЭлемент
			|ИЗ
			|	Справочник.СодержаниеСУЗ КАК СодержаниеСУЗ
			|ГДЕ
			|	СодержаниеСУЗ.ПометкаУдаления = ЛОЖЬ
			|	И СодержаниеСУЗ.Владелец В(&МассивЭлектронныхКурсов)";
		
		Запрос.УстановитьПараметр("МассивЭлектронныхКурсов", МассивЭлектронныхКурсов);
		
		ТаблицаЭлементовСодержания = Запрос.Выполнить().Выгрузить();
		
		Если ТаблицаЭлементовСодержания.Количество() > 0 Тогда
			
			Для каждого СтрокаТЭС Из ТаблицаЭлементовСодержания Цикл
			
				ФайлДанных = ФайлДанных + Символы.ПС + "
				|	{
				|		id : """ + Строка(СтрокаТЭС.Ссылка.УникальныйИдентификатор()) + """,
				|		idObject : """ + ?(СтрокаТЭС.ЭтоГруппа, "", Строка(СтрокаТЭС.СсылкаНаЭлемент.УникальныйИдентификатор())) + """,
				|		nameObject : """ + ?(СтрокаТЭС.ЭтоГруппа, "", ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ОбъектыСУЗ.ПолучитьТипОбъектаСУЗ(СтрокаТЭС.СсылкаНаЭлемент)))+""",
				|		link : """ + ?(СтрокаТЭС.ЭтоГруппа, ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(СтрокаТЭС.Ссылка), ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(СтрокаТЭС.СсылкаНаЭлемент))  + """,
				|		isFolder : " + БулевоВСтроку(СтрокаТЭС.ЭтоГруппа) + "
				|	},";
		
			КонецЦикла;
			
			ФайлДанных = Лев(ФайлДанных, СтрДлина(ФайлДанных) - 1); // Убираем последнюю запятую
			
		КонецЕсли;			
		
	КонецЕсли;	
	
	ФайлДанных = ФайлДанных + Символы.ПС + "];" + Символы.ПС + Символы.ПС;
	
	// Записываем файл данных
	
	ФайлДанныхТекстовыйДокумент = Новый ТекстовыйДокумент();
	ФайлДанныхТекстовыйДокумент.УстановитьТекст(ФайлДанных);
	
	ФайлДанныхТекстовыйДокумент.Записать(КаталогДанных + "data.js",  КодировкаТекста.UTF8);
	
	// endQuiz.html
	//
	
	ТестовыйДокументЭлемента = Новый ТекстовыйДокумент;;
	ТестовыйДокументЭлемента.Прочитать(КаталогРесурсов + "template.html",  КодировкаТекста.UTF8);
	
	ТекстЭлемента = ТестовыйДокументЭлемента.ПолучитьТекст();
	
	ОписаниеОбъекта = ПолучитьОписаниеОбъектаJS("endQuiz", "collection", Истина, Ложь, Неопределено);

	ТекстЭлемента = СтрЗаменить(ТекстЭлемента, "<!--{{ext_script}}-->", "
	|<script type=""text/javascript"">var descriptionObject = {"+ОписаниеОбъекта+"};</script>");
		
	ТекстЭлемента = СтрЗаменить(ТекстЭлемента, "<!--{{title}}-->", НСтр("ru = 'Тестирование завершено'"));	
	ТекстЭлемента = СтрЗаменить(ТекстЭлемента, "<!--{{body}}-->", "");	
	
	СтилиФинальнойСтраницыТеста = "";
	СтилиФинальнойСтраницыТеста = СтилиФинальнойСтраницыТеста + Справочники.ШаблоныСУЗ.ПредставлениеИнформации.ТаблицыСтилей;
	СтилиФинальнойСтраницыТеста = СтилиФинальнойСтраницыТеста + Символы.ПС + Справочники.ШаблоныСУЗ.ПодборкиПоУмолчанию.ТаблицыСтилей;
	СтилиФинальнойСтраницыТеста = СтилиФинальнойСтраницыТеста + Символы.ПС + Справочники.ДополнительныеШаблоныСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор("8763d7bf-1a1c-11de-ac82-005056c00008")).ТекстСтилей;
	
	ТекстЭлемента = СтрЗаменить(ТекстЭлемента, "/*{{style}}*/", СтилиФинальнойСтраницыТеста);
	
	ТекстЭлемента = СтрЗаменить(ТекстЭлемента, "/*{{script}}*/", "");
	
	ТестовыйДокументЭлемента.УстановитьТекст(ТекстЭлемента);
	
	ТестовыйДокументЭлемента.Записать(КаталогРесурсов + "endQuiz.html",  КодировкаТекста.UTF8);
	
	
	// Устанавливаем пароль
	//
	
	Если (ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.HTML ИЛИ ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.SCORM_1_3)
		И (ЗначениеЗаполнено(ПарольПреподавателя) ИЛИ ЗначениеЗаполнено(ПарольПользователя)) Тогда
		
		СтрокиДляЗамены = Новый Соответствие;
		
		Хеширование = Новый ХешированиеДанных(ХешФункция.SHA1);
		Хеширование.Добавить(ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(4002580234));
		
		ХэшПустогоПароля = Base64Строка(Хеширование.ХешСумма);
		
		Если ЗначениеЗаполнено(ПарольПреподавателя)
			И СохранятьАктивность
			И ВключитьИнтерфейсПреподавателя Тогда
			
			Хеширование = Новый ХешированиеДанных(ХешФункция.SHA1);
			Хеширование.Добавить(ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(ПарольПреподавателя));
			
			ХэшПароляПреподавателя = Base64Строка(Хеширование.ХешСумма);
			
			СтрокиДляЗамены.Вставить("teacher"+ХэшПустогоПароля, "teacher"+ХэшПароляПреподавателя);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПарольПользователя) Тогда
			
			Хеширование = Новый ХешированиеДанных(ХешФункция.SHA1);
			Хеширование.Добавить(ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(ПарольПользователя));
			
			ХэшПароляПользователя = Base64Строка(Хеширование.ХешСумма);
			
			СтрокиДляЗамены.Вставить("user"+ХэшПустогоПароля, "user"+ХэшПароляПользователя);			
			
		КонецЕсли;
		
		Если ДляТестирования Тогда			
			ПутьКФайлуЗамены = КаталогКонтента + "app\common\crypto-js\auth.js";
		Иначе
			ПутьКФайлуЗамены = КаталогКонтента + "app\common\js\common.js";
		КонецЕсли;
		
		ПутьКФайлуЗамены = ОбщегоНазначенияСУКлиентСервер.ПривестиСлэши(ПутьКФайлуЗамены);		
		
		ТекстовыйДокументФайлаДляЗамены = Новый ТекстовыйДокумент();
		ТекстовыйДокументФайлаДляЗамены.Прочитать(ПутьКФайлуЗамены, КодировкаТекста.UTF8);
		ТекстДляЗамены = ТекстовыйДокументФайлаДляЗамены.ПолучитьТекст();
		
		Для каждого ЭлементДляЗамены Из СтрокиДляЗамены Цикл		
			ТекстДляЗамены = СтрЗаменить(ТекстДляЗамены, ЭлементДляЗамены.Ключ, ЭлементДляЗамены.Значение);
		КонецЦикла;
		
		ТекстДляЗамены = ПолучитьМакет("Предупреждение").ПолучитьТекст() + ТекстДляЗамены;
		
		ТекстовыйДокументФайлаДляЗамены.УстановитьТекст(ТекстДляЗамены);
		ТекстовыйДокументФайлаДляЗамены.Записать(ПутьКФайлуЗамены);
		
	КонецЕсли;
		
	// Добавляем браузер
	//
	
	Если ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.HTML Тогда
		
		ИмяМакетаСБразуером = "БраузерGoogleChrome";
		
		Если ВключитьБраузер И Метаданные.Обработки.ПубликацияЭлектронныхРесурсовСУЗ.Макеты.Найти(ИмяМакетаСБразуером) <> Неопределено Тогда
		
			ДлительныеОперации.СообщитьПрогресс(0,  НСтр("ru = 'Добавляем браузер...'"));
			
			//Распаковываем браузер
			
			КаталогСБраузером     = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(РабочийКаталог + "browser");
			ПутьКАрхивуСБраузером = КаталогСБраузером + "browser.zip";
			
			СоздатьКаталог(КаталогСБраузером);
			
			ПолучитьМакет(ИмяМакетаСБразуером).Записать(ПутьКАрхивуСБраузером);
			
			Попытка
				ФайлАрхива = Новый ЧтениеZIPФайла(ПутьКАрхивуСБраузером);
				ФайлАрхива.ИзвлечьВсе(КаталогСБраузером, РежимВосстановленияПутейФайловZIP.Восстанавливать); 
				ФайлАрхива.Закрыть(); 				
			Исключение
				ВызватьИсключение ОписаниеОшибки();
			КонецПопытки;
			
			Попытка
				УдалитьФайлы(ПутьКАрхивуСБраузером);
			Исключение
			КонецПопытки;		
			
			//Копируем прорамму запуска
			
			Если ВключитьИнтерфейсПреподавателя И СохранятьАктивность Тогда
				
				ПолучитьМакет("СтартоваяПрограмма").Записать(РабочийКаталог + "Открыть.exe");
				ПолучитьМакет("СтартоваяПрограммаДляПреподавателя").Записать(РабочийКаталог + "Проверить.exe");
				
			Иначе
				
				ПолучитьМакет("СтартоваяПрограмма").Записать(РабочийКаталог + СвойстваПакета.ИмяФайлаПакета + ".exe");
				
			КонецЕсли;		
			
		Иначе
			
			Если ВключитьИнтерфейсПреподавателя И СохранятьАктивность Тогда
				
				ПолучитьМакет("СтартовыйФайлДляПреподавателя").Записать(КаталогКонтента + "check.html");
				
			КонецЕсли;
			
		КонецЕсли;
		
			
	КонецЕсли;
	
	// Упаковываем пакет
	//
	
	ДлительныеОперации.СообщитьПрогресс(0,  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Архивация: %1'"), СвойстваПакета.Наименование));
	
	Если ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.HTML И ВключитьБраузер Тогда
		КаталогДляУпаковки = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(РабочийКаталог);	
	Иначе
		КаталогДляУпаковки = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(КаталогКонтента);	
	КонецЕсли;
	
	// Считаем хэш
	
	ФайлыКурса = НайтиФайлы(КаталогДляУпаковки, "*", Истина);
	
	Хэш = Новый ХешированиеДанных(ХешФункция.CRC32);	
	
	Для каждого Файл Из ФайлыКурса Цикл
		Если НЕ Файл.ЭтоКаталог() И Файл.Существует() Тогда
			Хэш.ДобавитьФайл(Файл.ПолноеИмя);	
		КонецЕсли;
	КонецЦикла;
	
	СвойстваПакета.КонтрольнаяСумма = Хэш.ХешСумма;
	
	// Сохраняем информационный файл info.xml в каталог ресурсов
	
	ПубликацияXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/2/KnowledgeSources", "Публикация");
	ПубликацияXDTO     = ФабрикаXDTO.Создать(ПубликацияXDTOТип);
	
	ПубликацияXDTO.Наименование            = СвойстваПакета.Наименование;
	ПубликацияXDTO.Идентификатор           = СвойстваПакета.Код;
	ПубликацияXDTO.ТипЭлектронногоРесурса  = ТипЗнч(ЭлектронныйРесурс);
	ПубликацияXDTO.Версия                  = СвойстваПакета.Версия;
	ПубликацияXDTO.КонтрольнаяСумма        = СвойстваПакета.КонтрольнаяСумма;
	ПубликацияXDTO.ДатаПубликации          = ТекущаяДатаСеанса();
	ПубликацияXDTO.ВерсияКонфигурации      = ЭлектронныеРесурсыСУЗ.ВерсияПодсистемы();
	ПубликацияXDTO.ВерсияAPI               = "1.0";
	ПубликацияXDTO.ДатаЭлектронногоРесурса = СвойстваПакета.ДатаИзменения;
	ПубликацияXDTO.Описание                = Описание;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(КаталогДанных + "info.xml");

	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ПубликацияXDTO);
	
	ЗаписьXML.Закрыть();
	
	// Сохраняем манифест SCORM
	
	Если ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.SCORM_1_3 Тогда
		
		МанифестSCORMXDTOТип  = ФабрикаXDTO.Тип("http://www.imsglobal.org/xsd/imscp_v1p1", "manifestType");
		МанифестSCORMXDTO     = ФабрикаXDTO.Создать(МанифестSCORMXDTOТип);
		
		МанифестSCORMXDTO.identifier = СвойстваПакета.Код;
		МанифестSCORMXDTO.version    = СвойстваПакета.Версия;
		
		МетаданныеМанифестаSCORMТип  = ФабрикаXDTO.Тип("http://www.imsglobal.org/xsd/imscp_v1p1", "metadataType");
		МетаданныеМанифестаSCORMXDTO = ФабрикаXDTO.Создать(МетаданныеМанифестаSCORMТип);
		
		МетаданныеМанифестаSCORMXDTO.schema = "ADL SCORM";
		МетаданныеМанифестаSCORMXDTO.schemaversion = "2004 4th Edition";
		
		МанифестSCORMXDTO.metadata = МетаданныеМанифестаSCORMXDTO; 
		
		ОрганизацииSCORMТип  = ФабрикаXDTO.Тип("http://www.imsglobal.org/xsd/imscp_v1p1", "organizationsType");
		ОрганизацииSCORMXDTO = ФабрикаXDTO.Создать(ОрганизацииSCORMТип);
		
		ОрганизацииSCORMXDTO.default = "organization_" + СтрЗаменить(СвойстваПакета.Код, "-", "");
		
		ОрганизацияSCORMТип  = ФабрикаXDTO.Тип("http://www.imsglobal.org/xsd/imscp_v1p1", "organizationType");
		ОрганизацияSCORMXDTO = ФабрикаXDTO.Создать(ОрганизацияSCORMТип);
		
		ОрганизацияSCORMXDTO.identifier = "organization_" + СтрЗаменить(СвойстваПакета.Код, "-", "");
		ОрганизацияSCORMXDTO.title = СвойстваПакета.Наименование;
		
		
		ОсновнойЭлементОрганизацииSCORMТип  = ФабрикаXDTO.Тип("http://www.imsglobal.org/xsd/imscp_v1p1", "itemType");
		ОсновнойЭлементОрганизацииSCORM = ФабрикаXDTO.Создать(ОсновнойЭлементОрганизацииSCORMТип);
		
		ОсновнойЭлементОрганизацииSCORM.identifier = "item_" + СтрЗаменить(СвойстваПакета.Код, "-", "");
		ОсновнойЭлементОрганизацииSCORM.identifierref = "res_" + СтрЗаменить(СвойстваПакета.Код, "-", "");
		ОсновнойЭлементОрганизацииSCORM.title = СвойстваПакета.Наименование;
		// ОсновнойЭлементОрганизацииSCORM.parameters = "?api=scorm";
		
		ОрганизацияSCORMXDTO.item.Добавить(ОсновнойЭлементОрганизацииSCORM);
		
		
		ОрганизацииSCORMXDTO.organization.Добавить(ОрганизацияSCORMXDTO);
		
		МанифестSCORMXDTO.organizations = ОрганизацииSCORMXDTO;
		
		
		РесурсыПакетаSCORMТип = ФабрикаXDTO.Тип("http://www.imsglobal.org/xsd/imscp_v1p1", "resourcesType");
		РесурсыПакетаSCORM = ФабрикаXDTO.Создать(РесурсыПакетаSCORMТип);
		
		ОсновнойРесурсПакетаSCORMТип = ФабрикаXDTO.Тип("http://www.imsglobal.org/xsd/imscp_v1p1", "resourceType");
		ОсновнойРесурсПакетаSCORM = ФабрикаXDTO.Создать(ОсновнойРесурсПакетаSCORMТип);
		
		ОсновнойРесурсПакетаSCORM.identifier = "res_" + СтрЗаменить(СвойстваПакета.Код, "-", "");
		ОсновнойРесурсПакетаSCORM.type = "webcontent";
		ОсновнойРесурсПакетаSCORM.scormType = "sco";
		ОсновнойРесурсПакетаSCORM.href = "index.html?api=scorm";
		
		РесурсыПакетаSCORM.resource.Добавить(ОсновнойРесурсПакетаSCORM);
		
		ФайлРесурсаSCORMXDTOТип = ФабрикаXDTO.Тип("http://www.imsglobal.org/xsd/imscp_v1p1", "fileType");
		
		Для каждого Файл Из ФайлыКурса Цикл
			
			Если Файл.ЭтоКаталог() Тогда
				Продолжить;
			КонецЕсли;
			
			ОтносительныйПутьКФайлу = СтрЗаменить(Файл.ПолноеИмя, КаталогКонтента, "");
			
			ОтносительныйПутьКФайлу = СтрЗаменить(ОтносительныйПутьКФайлу, "\", "/");
			
			ФайлРесурсаSCORMXDTO = ФабрикаXDTO.Создать(ФайлРесурсаSCORMXDTOТип);
			
			ФайлРесурсаSCORMXDTO.href = ОтносительныйПутьКФайлу;
			
			ОсновнойРесурсПакетаSCORM.file.Добавить(ФайлРесурсаSCORMXDTO);
			
		КонецЦикла;
		
		МанифестSCORMXDTO.resources = РесурсыПакетаSCORM;
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.ОткрытьФайл(КаталогКонтента + "imsmanifest.xml");
		
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, МанифестSCORMXDTO, "manifest");
		
		ЗаписьXML.Закрыть();
		
		// Заменяем префикс пространства имен "http://www.adlnet.org/xsd/adlcp_v1p3"
		
		ТекстовыйДокументМанифеста = Новый ТекстовыйДокумент();
		ТекстовыйДокументМанифеста.Прочитать(КаталогКонтента + "imsmanifest.xml",  КодировкаТекста.UTF8);
		
		ТекстМанифеста = ТекстовыйДокументМанифеста.ПолучитьТекст();
		
		НомерСимволаПИ = Найти(ТекстМанифеста, "=""http://www.adlnet.org/xsd/adlcp_v1p3""");
		
		Если НомерСимволаПИ > 0 Тогда
			
			СтрокаЛевее = "";
			adlcpПрефикс = "";
			
			НомерСимвола = НомерСимволаПИ -1 ;
			
			Пока НомерСимвола > 0 Цикл
				
				СтрокаЛевее = Сред(ТекстМанифеста, НомерСимвола, 1) + СтрокаЛевее;
				
				Если Найти(СтрокаЛевее, "xmlns:") > 0 Тогда
					
					adlcpПрефикс = Сред(ТекстМанифеста, НомерСимвола + 6, НомерСимволаПИ - (НомерСимвола + 6));
					
					Прервать;
					
				КонецЕсли;
				
				НомерСимвола = НомерСимвола - 1;
				
			КонецЦикла;
			
			ТекстМанифеста = СтрЗаменить(ТекстМанифеста, "xmlns:" + adlcpПрефикс + "=", "xmlns:adlcp=");
			ТекстМанифеста = СтрЗаменить(ТекстМанифеста, adlcpПрефикс + ":", "adlcp:");
			
		КонецЕсли;
		
		ТекстовыйДокументМанифеста.УстановитьТекст(ТекстМанифеста);
		ТекстовыйДокументМанифеста.Записать(КаталогКонтента + "imsmanifest.xml",  КодировкаТекста.UTF8);
		
	КонецЕсли;
	
	// Запаковываем пакет или копируем в каталог для сохранения
	
	Если ЗначениеЗаполнено(СвойстваПакета.КаталогДляСохранения) Тогда		
		
		СвойстваПакета.АдресВоВременномХранилище = "";
		СвойстваПакета.Размер                    = 0;
		
	Иначе
		
		ИмяАрхива = ПолучитьИмяВременногоФайла(".zip");
			
		Архиватор = Новый ЗаписьZipФайла(ИмяАрхива);
		
		Попытка
			
			Архиватор.Добавить(КаталогДляУпаковки + "*", РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
			Архиватор.Записать();
			
		Исключение
			
			СтрокаСообщения = НСтр("ru = 'Ошибка при запаковке файлов архива: %1 из каталог: %2'");
			СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, ИмяАрхива, КаталогДляУпаковки);
			
			ВызватьИсключение СтрокаСообщения;
			
		КонецПопытки;
		
		ДвоичныеДанныеАрхива = Новый ДвоичныеДанные(ИмяАрхива);
		
		СвойстваПакета.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанныеАрхива, УникальныйИдентификаторФормы);
		СвойстваПакета.Размер                    = ДвоичныеДанныеАрхива.Размер();
		
		Попытка
			УдалитьФайлы(ИмяАрхива);
			УдалитьФайлы(КаталогДляУпаковки);
		Исключение
		КонецПопытки;		
		
	КонецЕсли;		
	
КонецПроцедуры

// Выгрузка объектов

Процедура ДобавитьЭлементСодержанияВСписок(СписокСодержания, СтрокиДерева, ПредпочитаемыйПоставщик)
	
	Если СтрокиДерева.Количество() > 0 Тогда
		
		СписокСодержания = СписокСодержания + "<ul>" + Символы.ПС;
		
		Для каждого Строка Из СтрокиДерева Цикл
			
			// Делаем проверки
			
			Если НЕ Строка.ЭтоГруппа И НЕ ЗначениеЗаполнено(Строка.СсылкаНаЭлемент) Тогда
				Продолжить;
			КонецЕсли;
			
			// Выгружаем элемент содержания
			
			ВыгрузитьЭлементСодержания(Строка, ПредпочитаемыйПоставщик);
			
			// Получаем данные элемента содержания
			
			СсылкаНаЭлементСодержания = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(Строка.Ссылка);
			НаименованиеРаздела       = ?(ЗначениеЗаполнено(Строка.Наименование), Строка.Наименование, "<>");

			// Помещаем элемент содержания в файл
			
			СписокСодержания = СписокСодержания + "<li id="""+Строка(Строка.Ссылка.УникальныйИдентификатор())+""" link="""+ СсылкаНаЭлементСодержания +""" rel="""+?(Строка.ЭтоГруппа, "folder", "page")+""" type="""+?(Строка.ЭтоГруппа, "folder", "page")+""" >" + "<a href=""#"">" + НаименованиеРаздела + "</a>" + Символы.ПС;
			
			ДобавитьЭлементСодержанияВСписок(СписокСодержания, Строка.Строки, ПредпочитаемыйПоставщик); // Рекурсия
			
			СписокСодержания = СписокСодержания + "</li>" + Символы.ПС;
			
		КонецЦикла;
		
		СписокСодержания = СписокСодержания + "</ul>";
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьЭлементСодержания(Данные, ПредпочитаемыйПоставщик)
	
	// Данные содержат свойства: Ссылка, Наименование, СсылкаНаЭлемент, ЭтоГруппа, Карта
	
	Если Данные.ЭтоГруппа Тогда
		
		ВыгрузитьОбъектСУЗ(?(ЗначениеЗаполнено(Данные.Карта), Данные.Карта, Справочники.КартыСУЗ.АвтоКарта), Данные.Ссылка, ПредпочитаемыйПоставщик, Новый Структура("ПредметКарты, ИмяПредметаКарты", Данные.Ссылка, "Folder"));
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(Данные.СсылкаНаЭлемент) Тогда
			Возврат;
		КонецЕсли;
		
		ВыгрузитьОбъектСУЗ(Данные.СсылкаНаЭлемент, Данные.Ссылка, ПредпочитаемыйПоставщик);
		
	КонецЕсли;
	
	МассивЭлементовСодержания.Добавить(Данные.Ссылка);
	
КонецПроцедуры

Процедура ВыгрузитьОбъектСУЗ(Знач СсылкаНаЭлемент, Знач ЭлементСодержания, Знач ПредпочитаемыйПоставщик, Знач ДопСвойстваСсылки = Неопределено, Знач ДокументСессииОбъект = Неопределено, ВыгруженныеРанееЭлементы = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
		Возврат;
	КонецЕсли;
	
	ДлительныеОперации.СообщитьПрогресс(0,  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Выгружено элементов: %1'"), Строка(МассивВыгруженныхОбъектов.Количество())));
	
	// Получаем недостающие реквизиты
	//
	
	Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
		ЭлектронныйРесурсОбъекта = СсылкаНаЭлемент;
	Иначе
		ЭлектронныйРесурсОбъекта = ?(ЗначениеЗаполнено(ЭлементСодержания), ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементСодержания, "Владелец"), Неопределено);	
	КонецЕсли;
	
	// Запоминаем информацию о выгрузке объектов для последующего использования
	//
	
	МассивВыгруженныхОбъектов.Добавить(СсылкаНаЭлемент);
	
	Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.СводыЗнанийСУЗ")
		И МассивЭлектронныхКурсов.Найти(СсылкаНаЭлемент) = Неопределено Тогда
		
		МассивЭлектронныхКурсов.Добавить(СсылкаНаЭлемент);
		
	КонецЕсли;
	
	Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.РесурсыСУЗ")
		И МассивРесурсов.Найти(СсылкаНаЭлемент) = Неопределено Тогда
		
		МассивРесурсов.Добавить(СсылкаНаЭлемент);
		
	КонецЕсли;
	
	Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.ФайлыСУЗ")
		И МассивРесурсов.Найти(СсылкаНаЭлемент.Владелец) = Неопределено Тогда
		
		МассивРесурсов.Добавить(СсылкаНаЭлемент.Владелец);
		
	КонецЕсли;
	
	Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.ПодборкиСУЗ")
		И МассивПодборок.Найти(СсылкаНаЭлемент) = Неопределено Тогда
		
		МассивПодборок.Добавить(СсылкаНаЭлемент);
		
	КонецЕсли;
	
	// Получаем параметры выгрузки
	//
	
	ПараметрыЭкспорта = ПолучитьПараметрыЭкспорта(ДокументСессииОбъект);
	
	Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.ПодборкиСУЗ") Тогда
		
		Если ПараметрыЭкспорта.ДокументСессииОбъект <> Неопределено Тогда
			ДопСвойстваСсылки.Вставить("НомерДокументаСессии", -1);
		КонецЕсли;
		
		Если ДопСвойстваСсылки = Неопределено ИЛИ НЕ ДопСвойстваСсылки.Свойство("НомерГруппыПодборки") Тогда // Основная ссылка на подборку
			
			Если СсылкаНаЭлемент.ПоказыватьСтартовуюСтраницу Тогда
				НомерСтраницы = 0;
			Иначе
				НомерСтраницы = 1;
			КонецЕсли;
			
			ДопСвойстваСсылки = Новый Структура("НомерГруппыПодборки", НомерСтраницы);
			
		Иначе
			
			НомерСтраницы = ДопСвойстваСсылки.НомерГруппыПодборки;
			
		КонецЕсли;
				
	КонецЕсли;
	
	// Получаем представление объекта
	//
	
	АдресОбъекта = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(СсылкаНаЭлемент,,,ДопСвойстваСсылки);
	
	// Проверяем, не выгружали ли объект ранее
	
	Если ВыгруженныеРанееЭлементы = Неопределено Тогда
		ВыгруженныеРанееЭлементы = Новый Массив;
	Иначе
		Если ВыгруженныеРанееЭлементы.Найти(АдресОбъекта) <> Неопределено Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ВыгруженныеРанееЭлементы.Добавить(АдресОбъекта); // Запоминаем выгружаемый объект
	
	ПараметрыСсылки    = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(АдресОбъекта);
	КонтекстВыполнения = ОбъектыСУЗ.ЗаполнитьКонтекстВыполненияОбъекта(, ЭлементСодержания,,,,,,,ПараметрыЭкспорта);
	СтруктураДанных    = ОбъектыСУЗ.ПолучитьПредставление(СсылкаНаЭлемент, ПараметрыСсылки, КонтекстВыполнения);
	
	// Запоминаем выгруженные вопросы
	
	Для каждого Вопрос Из КонтекстВыполнения.ПараметрыЭкспорта.Вопросы Цикл
	
		Если МассивВопросов.Найти(Вопрос) = Неопределено Тогда
			МассивВопросов.Добавить(Вопрос);
		КонецЕсли;
	
	КонецЦикла;
	
	// Создаем файл объекта
	//
	
	// Получаем имя файла
	
	Идентификатор = "";
	ИмяОбъекта    = "";
	
	Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.ПодборкиСУЗ") И НомерСтраницы > 0 Тогда
		
		Если (СсылкаНаЭлемент.ТипНавигации = Перечисления.ТипыНавигацииПодборкиСУЗ.БезНавигации
			ИЛИ СсылкаНаЭлемент.ТипНавигации = Перечисления.ТипыНавигацииПодборкиСУЗ.НаОднойСтранице) И НЕ СсылкаНаЭлемент.ЭтоТест Тогда
			
			ЭлементПодборки = СсылкаНаЭлемент;

		Иначе
			
			Если ПараметрыЭкспорта.ДокументСессииОбъект = Неопределено Тогда
				ГруппыЭлементовПодборки = Справочники.ПодборкиСУЗ.ПолучитьГруппыЭлементовПодборки(СсылкаНаЭлемент);
			Иначе
				ГруппыЭлементовПодборки = ПараметрыЭкспорта.ДокументСессииОбъект.ПолучитьГруппыЭлементовПодборки();
			КонецЕсли;
			
			Если ГруппыЭлементовПодборки.Количество() > 0 Тогда
			
				ЭлементПодборки = ГруппыЭлементовПодборки[НомерСтраницы - 1].Ссылка;
				
			Иначе
				
				ЭлементПодборки = СсылкаНаЭлемент;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ИмяОбъекта = "collectionPage";
		Идентификатор = Строка(ЭлементПодборки.УникальныйИдентификатор());
		
		ДопСвойстваСсылки.Вставить("Подборка", СсылкаНаЭлемент);
		
		// Запоминаем элемент подборки
		
		Если ТаблицаСтраницПодборок.НайтиСтроки(Новый Структура("СсылкаНаСтраницу, Подборка", ЭлементПодборки, СсылкаНаЭлемент)).Количество() = 0 Тогда
		
			НоваяСтрокаТСП = ТаблицаСтраницПодборок.Добавить();
			
			НоваяСтрокаТСП.Подборка           = СсылкаНаЭлемент;
			НоваяСтрокаТСП.НомерСтраницы      = НомерСтраницы;
			НоваяСтрокаТСП.СсылкаНаСтраницу   = ЭлементПодборки;
			НоваяСтрокаТСП.КоличествоВопросов = 0;
			НоваяСтрокаТСП.Подгруппы          = Новый Массив;
			НоваяСтрокаТСП.ЭтоГруппа          = Ложь;
			
			Если ТипЗнч(ЭлементПодборки) = Тип("СправочникСсылка.ЭлементыПодборкиСУЗ")  Тогда
				
				НоваяСтрокаТСП.ТипЭлемента = "group";
				НоваяСтрокаТСП.ЭтоГруппа   = ЭлементПодборки.ЭтоГруппа;
				
				Если ЭлементПодборки.ЭтоГруппа Тогда
					
					НоваяСтрокаТСП.КоличествоВопросов = ЭлементПодборки.КоличествоВопросов;

					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	ЭлементыПодборкиСУЗ.Ссылка,
						|	ЭлементыПодборкиСУЗ.КоличествоВопросов
						|ИЗ
						|	Справочник.ЭлементыПодборкиСУЗ КАК ЭлементыПодборкиСУЗ
						|ГДЕ
						|	ЭлементыПодборкиСУЗ.Родитель = &Родитель
						|	И ЭлементыПодборкиСУЗ.ЭтоГруппа = ИСТИНА";

					Запрос.УстановитьПараметр("Родитель", ЭлементПодборки);

					Результат = Запрос.Выполнить();

					Если НЕ Результат.Пустой() Тогда
					
						ВыборкаДетальныеЗаписи = Результат.Выбрать();

						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							СтруктураПодгруппы = Новый Структура("Ссылка, КоличествоВопросов", ВыборкаДетальныеЗаписи.Ссылка, ВыборкаДетальныеЗаписи.КоличествоВопросов);
							НоваяСтрокаТСП.Подгруппы.Добавить(СтруктураПодгруппы);
						КонецЦикла;
						
					КонецЕсли;
					
				Иначе
					
					НоваяСтрокаТСП.СсылкаНаОбъектСУЗ = ЭлементПодборки.СсылкаНаОбъектСУЗ; 
					НоваяСтрокаТСП.ВесВопроса = ЭлементПодборки.ВесВопроса;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ТипЗнч(ЭлементПодборки) = Тип("СправочникСсылка.ВопросыСУЗ")  Тогда
				
				НоваяСтрокаТСП.ТипЭлемента       = "question";
				НоваяСтрокаТСП.СсылкаНаОбъектСУЗ = ЭлементПодборки;
				НоваяСтрокаТСП.ЭтоГруппа         = Ложь;
				НоваяСтрокаТСП.ВесВопроса        = 1;
				
				Если ПараметрыЭкспорта.ДокументСессииОбъект <> Неопределено Тогда
					
					СтрокаВопрос = ПараметрыЭкспорта.ДокументСессииОбъект.Вопросы.Найти(ЭлементПодборки, "Вопрос");
					
					Если СтрокаВопрос <> Неопределено Тогда
						НоваяСтрокаТСП.ВесВопроса = СтрокаВопрос.ВесВопроса;
						НоваяСтрокаТСП.ЭлементПодборкиИзРубрикатора = СтрокаВопрос.ЭлементПодборкиИзРубрикатора;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.КартыСУЗ") Тогда
		
		ИмяОбъекта    = ПараметрыСсылки.object;
		Идентификатор = ПараметрыСсылки.idTargetMap;
		
	Иначе
		
		ИмяОбъекта    = ПараметрыСсылки.object;
		Идентификатор = ПараметрыСсылки.id;
		
	КонецЕсли;
	
	ПолноеИмяФайла = КаталогРесурсов + ПолучитьИдентификаторОбъекта(ИмяОбъекта, Идентификатор, ДопСвойстваСсылки) + ".html";

	// Получаем описание объекта для размещения в файле объекта
	
	Если (ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.HTML
		ИЛИ ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.SCORM_1_3) 
		И ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.РесурсыСУЗ") И СсылкаНаЭлемент.SCO Тогда
		
		ТекстЗначение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Публикуемый электронный ресурс содержит SCORM пакет.
			|Пакет SCORM не может быть опубликован в формат ""%1""'"), Строка(ТипПубликации));
		
		ВызватьИсключение ТекстЗначение;
		
	КонецЕсли;
	
	ОписаниеОбъекта = ПолучитьОписаниеОбъектаJS(
		Идентификатор,
		ИмяОбъекта,
		?(ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.ПодборкиСУЗ") И СсылкаНаЭлемент.ЭтоТест, Истина, Ложь),
		?(ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.РесурсыСУЗ") И СсылкаНаЭлемент.SCO, Истина, Ложь),
		СсылкаНаЭлемент
	);
		
	// Создаем файл объекта	

	ТестовыйДокументЭлемента = Новый ТекстовыйДокумент;;
	ТестовыйДокументЭлемента.Прочитать(КаталогРесурсов + "template.html",  КодировкаТекста.UTF8);
	
	ТекстЭлемента = ТестовыйДокументЭлемента.ПолучитьТекст();
	
	// Вставляем тексты в файл объекта
	
	СсылкиНаСкрипты = "<script type=""text/javascript"">var descriptionObject = {"+ОписаниеОбъекта+"};</script>";
	
	ТекстЭлемента = СтрЗаменить(ТекстЭлемента, "<!--{{ext_script}}-->", СсылкиНаСкрипты);
	ТекстЭлемента = СтрЗаменить(ТекстЭлемента, "<!--{{title}}-->", СсылкаНаЭлемент.Наименование);	
	ТекстЭлемента = СтрЗаменить(ТекстЭлемента, "<!--{{body}}-->", СтруктураДанных.Представление);	
	ТекстЭлемента = СтрЗаменить(ТекстЭлемента, "/*{{style}}*/", СтруктураДанных.Стили);
	
	Если ЗначениеЗаполнено(СокрЛП(СтруктураДанных.Скрипт)) Тогда
		ТекстЭлемента = СтрЗаменить(ТекстЭлемента, "/*{{script}}*/", СтруктураДанных.Скрипт);
	КонецЕсли;
	
	// Выгружаем зависимые ресурсы
	
	Если ТипЗнч(СсылкаНаЭлемент) <> Тип("СправочникСсылка.РесурсыСУЗ") Тогда
		
		Для каждого СсылкаНаОбъект Из СтруктураДанных.Ресурсы Цикл
			Если СсылкаНаОбъект.Ссылка <> СсылкаНаЭлемент
				И ЗначениеЗаполнено(СсылкаНаОбъект.Ссылка) Тогда 
					ВыгрузитьОбъектСУЗ(СсылкаНаОбъект.Ссылка, ЭлементСодержания, ПредпочитаемыйПоставщик,,,ВыгруженныеРанееЭлементы); // Рекурсия
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Для каждого СсылкаНаОбъект Из СтруктураДанных.СписокСсылок Цикл
		
		Если ЗначениеЗаполнено(СсылкаНаОбъект.СсылкаНаОбъектСУЗ)
			И МассивВыгруженныхОбъектов.Найти(СсылкаНаОбъект.СсылкаНаОбъектСУЗ) = Неопределено
			И СсылкаНаОбъект.СсылкаНаОбъектСУЗ <> СсылкаНаЭлемент Тогда
			
			ВыгрузитьОбъектСУЗ(СсылкаНаОбъект.СсылкаНаОбъектСУЗ, ЭлементСодержания, ПредпочитаемыйПоставщик,,, ВыгруженныеРанееЭлементы); // Рекурсия
			
		КонецЕсли;
		
		Если МассивСсылок.Найти(СсылкаНаОбъект) = Неопределено Тогда
			МассивСсылок.Добавить(СсылкаНаОбъект);
		КонецЕсли;
		
	КонецЦикла;
	
	// Записываем файл объекта
	
	ТестовыйДокументЭлемента.УстановитьТекст(ТекстЭлемента);
	
	ТестовыйДокументЭлемента.Записать(ПолноеИмяФайла,  КодировкаТекста.UTF8);
	
	// Выгружаем подчиненные объекты
	//
	
	// Ресурсы объекта
	
	ОбщегоНазначенияСУКлиентСервер.ВыгрузитьРесурсыВКэш(СтруктураДанных.Ресурсы, КаталогРесурсов, ПредпочитаемыйПоставщик, ЭлектронныйРесурсОбъекта,, ПараметрыЭкспорта);
	
	// Страницы подборки
	
	Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.ПодборкиСУЗ") Тогда
		
		Если СсылкаНаЭлемент.ЭтоТест И НомерСтраницы = 0 Тогда // Получаем ДокументСессииОбъект
			
			// Начинаем новый тест. Создаем виртуальный документ прохождения теста.
			
			СсылкаНачалаТеста          = "?action=newDocument&id="+Строка(СсылкаНаЭлемент.УникальныйИдентификатор())+"&level=default&numGroup=1&object=collection&window=this";
			ПараметрыСсылкиНачалаТеста = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(СсылкаНачалаТеста);			
			КонтекстВыполнения = ОбъектыСУЗ.ЗаполнитьКонтекстВыполненияОбъекта(,ЭлементСодержания,,,,,,,ПараметрыЭкспорта);			
			РезультатДействия = ОбъектыСУЗ.ВыполнитьДействие(ПараметрыСсылкиНачалаТеста, КонтекстВыполнения);															 
			ДокументСессииОбъект = РезультатДействия.ДокументСессииОбъект;			
			ПараметрыЭкспорта.ДокументСессииОбъект = ДокументСессииОбъект;
			
		КонецЕсли;
		
		Если НомерСтраницы < 2 Тогда
			
			Если ПараметрыЭкспорта.ДокументСессииОбъект <> Неопределено Тогда
				ГруппыЭлементовПодборки = ПараметрыЭкспорта.ДокументСессииОбъект.ПолучитьГруппыЭлементовПодборки();
			Иначе
				ГруппыЭлементовПодборки = Справочники.ПодборкиСУЗ.ПолучитьГруппыЭлементовПодборки(СсылкаНаЭлемент);
			КонецЕсли;
			
			НомерСледующейСтраницы = НомерСтраницы + 1;			
			
			Пока НомерСледующейСтраницы <= ГруппыЭлементовПодборки.Количество() Цикл				
				ДопСвойстваСсылкиСледСтраницы = Новый Структура("НомерГруппыПодборки", НомерСледующейСтраницы);
				ВыгрузитьОбъектСУЗ(СсылкаНаЭлемент, ЭлементСодержания, ПредпочитаемыйПоставщик, ДопСвойстваСсылкиСледСтраницы, ДокументСессииОбъект, ВыгруженныеРанееЭлементы); // Рекурсия
				НомерСледующейСтраницы = НомерСледующейСтраницы + 1;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Элементы электронного ресурсы
	
	Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
		
		Для каждого СтрокаТЧ Из СсылкаНаЭлемент.СкрытыеРесурсы Цикл
			ВыгрузитьОбъектСУЗ(СтрокаТЧ.Ресурс, ЭлементСодержания, ПредпочитаемыйПоставщик, ДопСвойстваСсылки, ДокументСессииОбъект, ВыгруженныеРанееЭлементы); // Рекурсия 
		КонецЦикла;
		
		Если ЗначениеЗаполнено(СсылкаНаЭлемент.Глоссарий) Тогда
			ВыгрузитьОбъектСУЗ(СсылкаНаЭлемент.Глоссарий, ЭлементСодержания, ПредпочитаемыйПоставщик, ДопСвойстваСсылки, ДокументСессииОбъект, ВыгруженныеРанееЭлементы); // Рекурсия 
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СсылкаНаЭлемент.СправочнаяИнформация) Тогда
			ВыгрузитьОбъектСУЗ(СсылкаНаЭлемент.СправочнаяИнформация, ЭлементСодержания, ПредпочитаемыйПоставщик, ДопСвойстваСсылки, ДокументСессииОбъект, ВыгруженныеРанееЭлементы); // Рекурсия 
		КонецЕсли;
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СодержаниеСУЗ.Ссылка КАК Ссылка,
			|	СодержаниеСУЗ.СсылкаНаЭлемент КАК СсылкаНаЭлемент,
			|	СодержаниеСУЗ.Наименование,
			|	СодержаниеСУЗ.ЭтоГруппа,
			|	СодержаниеСУЗ.Карта,
			|	СодержаниеСУЗ.Родитель,
			|	СодержаниеСУЗ.Владелец КАК ЭлектронныйРесурс
			|ИЗ
			|	Справочник.СодержаниеСУЗ КАК СодержаниеСУЗ
			|ГДЕ
			|	СодержаниеСУЗ.Владелец = &ЭлектронныйРесурс
			|	И СодержаниеСУЗ.ПометкаУдаления = ЛОЖЬ";

		Запрос.УстановитьПараметр("ЭлектронныйРесурс", СсылкаНаЭлемент);

		ТаблицаЭС = Запрос.Выполнить().Выгрузить();

		Для каждого Строка Из ТаблицаЭС Цикл
			
			Если ЗначениеЗаполнено(Строка.СсылкаНаЭлемент) Тогда
				ВыгрузитьОбъектСУЗ(Строка.СсылкаНаЭлемент, Строка.Ссылка, ПредпочитаемыйПоставщик);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Зависимые ресурсы
	
	Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.РесурсыСУЗ") Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗависимыеРесурсыСУЗ.Ресурс
			|ИЗ
			|	Справочник.ЗависимыеРесурсыСУЗ КАК ЗависимыеРесурсыСУЗ
			|ГДЕ
			|	ЗависимыеРесурсыСУЗ.Владелец = &СсылкаНаЭлемент
			|	И ЗависимыеРесурсыСУЗ.ПометкаУдаления = ЛОЖЬ";

		Запрос.УстановитьПараметр("СсылкаНаЭлемент", СсылкаНаЭлемент);

		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.Ресурс <> СсылкаНаЭлемент
				И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ресурс) Тогда
					ВыгрузитьОбъектСУЗ(ВыборкаДетальныеЗаписи.Ресурс, ЭлементСодержания, ПредпочитаемыйПоставщик, ДопСвойстваСсылки, ДокументСессииОбъект, ВыгруженныеРанееЭлементы); // Рекурсия 
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// Файлы с опцией "ОткрыватьПоСсылке", так как они могут открываться сразу, без ресурса по ссылке на них
	
	Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.РесурсыСУЗ") Тогда		
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ФайлыСУЗ.Ссылка КАК Файл
			|ИЗ
			|	Справочник.ФайлыСУЗ КАК ФайлыСУЗ
			|ГДЕ
			|	ФайлыСУЗ.Владелец = &Ресурс
			|	И ФайлыСУЗ.ПометкаУдаления = ЛОЖЬ
			|	И ФайлыСУЗ.ОткрыватьПоСсылке = ИСТИНА";
		
		Запрос.УстановитьПараметр("Ресурс", СсылкаНаЭлемент);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ВыгрузитьОбъектСУЗ(ВыборкаДетальныеЗаписи.Файл, ЭлементСодержания, ПредпочитаемыйПоставщик, ДопСвойстваСсылки, ДокументСессииОбъект, ВыгруженныеРанееЭлементы); // Рекурсия 
		КонецЦикла;
	
	КонецЕсли;
	
	// Карты
	
	// Второй уровень карт и карты подборок не выгружаем, так как они ссылаются на отдельные объекты,
	// А в автономных курсах их нет.
	
	// Страницы и термины глоссария
	
	Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.ГлоссарииСУЗ") И ДопСвойстваСсылки = Неопределено Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СодержаниеГлоссарияСУЗ.Ссылка,
			|	СодержаниеГлоссарияСУЗ.ТерминГлоссария.БукваДляПоиска КАК БукваДляПоиска,
			|	СодержаниеГлоссарияСУЗ.ТерминГлоссария,
			|	СодержаниеГлоссарияСУЗ.ТерминГлоссария.Синонимы.(
			|		Представление,
			|		БукваДляПоиска
			|	) КАК Синонимы
			|ИЗ
			|	Справочник.СодержаниеГлоссарияСУЗ КАК СодержаниеГлоссарияСУЗ
			|ГДЕ
			|	СодержаниеГлоссарияСУЗ.Владелец = &Глоссарий";

		Запрос.УстановитьПараметр("Глоссарий", СсылкаНаЭлемент);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ДопСвойстваСсылкиСтраницыГлоссария = Новый Структура("БукваДляПоиска", ВыборкаДетальныеЗаписи.БукваДляПоиска);
			ВыгрузитьОбъектСУЗ(СсылкаНаЭлемент, ЭлементСодержания, ПредпочитаемыйПоставщик, ДопСвойстваСсылкиСтраницыГлоссария, ДокументСессииОбъект, ВыгруженныеРанееЭлементы); // Рекурсия 
			
			ВыгрузитьОбъектСУЗ(ВыборкаДетальныеЗаписи.ТерминГлоссария, ЭлементСодержания, ПредпочитаемыйПоставщик, ДопСвойстваСсылки, ДокументСессииОбъект, ВыгруженныеРанееЭлементы); // Рекурсия 
			
			ВыборкаСинонимов = ВыборкаДетальныеЗаписи.Синонимы.Выбрать();
			
			Пока ВыборкаСинонимов.Следующий() Цикл
				ДопСвойстваСсылкиСинонима = Новый Структура("БукваДляПоиска", ВыборкаСинонимов.БукваДляПоиска);
				ВыгрузитьОбъектСУЗ(СсылкаНаЭлемент, ЭлементСодержания, ПредпочитаемыйПоставщик, ДопСвойстваСсылкиСинонима, ДокументСессииОбъект, ВыгруженныеРанееЭлементы); // Рекурсия 
			КонецЦикла;
			
		КонецЦикла;
		
		ДопСвойстваСсылкиНаВсеТерминыГлоссария = Новый Структура("БукваДляПоиска", "все");
		ВыгрузитьОбъектСУЗ(СсылкаНаЭлемент, ЭлементСодержания, ПредпочитаемыйПоставщик, ДопСвойстваСсылкиНаВсеТерминыГлоссария, ДокументСессииОбъект, ВыгруженныеРанееЭлементы); // Рекурсия 
		
	КонецЕсли;
	
КонецПроцедуры

// Вспомогательные инструменты

Процедура ДобавитьСлешЕслиНужно(НовыйПуть)
	Если Прав(НовыйПуть, 1) <> "\" И Прав(НовыйПуть,1) <> "/" Тогда
		НовыйПуть = НовыйПуть + "\";
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьИдентификаторОбъекта(Знач ИмяОбъекта, Знач СсылкаНаОбъект, Знач ДопСвойстваСсылки = Неопределено)
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("Строка") Тогда
		ИдентификаторОбъекта = СсылкаНаОбъект;
	Иначе
		ИдентификаторОбъекта = Строка(СсылкаНаОбъект.УникальныйИдентификатор());
	КонецЕсли;
	
	Если ДопСвойстваСсылки <> Неопределено И ДопСвойстваСсылки.Свойство("Подборка") И ИмяОбъекта = "collectionPage" Тогда
		ИдентификаторОбъекта = Строка(ДопСвойстваСсылки.Подборка.УникальныйИдентификатор()) + "_" + ИдентификаторОбъекта;
	КонецЕсли;
	
	ИдентификаторОбъекта = СтрЗаменить(ИдентификаторОбъекта, "-", "");
	
	ИдентификаторОбъекта = ИмяОбъекта + "_" + ИдентификаторОбъекта;
	
	Если ДопСвойстваСсылки <> Неопределено И ДопСвойстваСсылки.Свойство("УровеньКарты") Тогда
		ИдентификаторОбъекта = ИдентификаторОбъекта + "_" + ДопСвойстваСсылки.УровеньКарты;
	КонецЕсли;
	
	Если ДопСвойстваСсылки <> Неопределено И ДопСвойстваСсылки.Свойство("БукваДляПоиска") Тогда
		
		Если НРег(ДопСвойстваСсылки.БукваДляПоиска) = "все" Тогда
			ИдентификаторОбъекта = ИдентификаторОбъекта + "_all";
		Иначе
			ИдентификаторОбъекта = ИдентификаторОбъекта + "_" + ЧислоВСтроку(КодСимвола(ДопСвойстваСсылки.БукваДляПоиска));
		КонецЕсли;
		
	КонецЕсли;
	
	
	Возврат ИдентификаторОбъекта;
	
КонецФункции

Функция ПолучитьПараметрыЭкспорта(ДокументСессииОбъект = Неопределено)
	
	ФорматыВидео = Неопределено;
	
	Если ПредпочитатьФорматВидеоWEBM Тогда
		ФорматыВидео = Новый Массив;
		ФорматыВидео.Добавить("WEBM");
		ФорматыВидео = Новый ФиксированныйМассив(ФорматыВидео);
	КонецЕсли;
	
	Возврат Новый Структура("ДокументСессииОбъект, Вопросы, ДляТестирования, ФорматыВидео", ДокументСессииОбъект, Новый Массив, ДляТестирования, ФорматыВидео);
	
КонецФункции

Функция ПолучитьПредставлениеРесурсаДляJSСкрипта(Ресурс, ЭлектронныйРесурс = Неопределено, ПредпочитаемыйПоставщик = Неопределено)
	
	Если ЗначениеЗаполнено(Ресурс) Тогда
	
		АдресОбъекта       = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(Ресурс);
	    ПараметрыЭкспорта  = ПолучитьПараметрыЭкспорта();
		
		ПараметрыСсылки    = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(АдресОбъекта);
		КонтекстВыполнения = ОбъектыСУЗ.ЗаполнитьКонтекстВыполненияОбъекта(,,,,,,,,ПараметрыЭкспорта);
		
		СтруктураРесурса   = ОбъектыСУЗ.ПолучитьПредставление(Ресурс, ПараметрыСсылки, КонтекстВыполнения);
		
		СтруктураРесурса.Представление = ОбщегоНазначенияСУКлиентСервер.JSСтрока(СтруктураРесурса.Представление);
		СтруктураРесурса.Скрипт = ОбщегоНазначенияСУКлиентСервер.JSСтрока(СтруктураРесурса.Скрипт);
		
		ОбщегоНазначенияСУКлиентСервер.ВыгрузитьРесурсыВКэш(СтруктураРесурса.Ресурсы, КаталогРесурсов, ПредпочитаемыйПоставщик, ЭлектронныйРесурс,, ПараметрыЭкспорта);
		
	Иначе
		
		СтруктураРесурса = Новый Структура("Представление, Скрипт", "", "");
		
	КонецЕсли;
	
	Возврат СтруктураРесурса;
	
КонецФункции

Функция ПолучитьПредставлениеКомментария(ДанныеКомментария, ПредпочитаемыйПоставщикБазы)
	
	ДанныеКомментария.Комментарий = ОбщегоНазначенияСУКлиентСервер.JSСтрока(ДанныеКомментария.Комментарий);
	
	ПриоритетКомментария = "0";
	
	Если ПредпочитаемыйПоставщикБазы = ДанныеКомментария.Поставщик Тогда
		ПриоритетКомментария = "1";
	КонецЕсли;
	
	Комментарий = "{minScore : %1, maxScore : %2, comment : ""%3"", res_html : ""%4"", res_script : ""%5"", priority : %6}";
	
	СтруктураРесурса = ПолучитьПредставлениеРесурсаДляJSСкрипта(ДанныеКомментария.Ресурс,, ПредпочитаемыйПоставщикБазы);
	
	ПодготовитьТекстыКомментариев(ДанныеКомментария.Комментарий);
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Комментарий, ДанныеКомментария.НачалоДиапазонаБаллов, ДанныеКомментария.КонецДиапазонаБаллов, ДанныеКомментария.Комментарий, СтруктураРесурса.Представление, СтруктураРесурса.Скрипт, ПриоритетКомментария);
	
КонецФункции

Процедура ПодготовитьТекстыКомментариев(КомментарийДляОбработки)

	КомментарийДляОбработки = СтрЗаменить(КомментарийДляОбработки, "%", "&#37;");
	
КонецПроцедуры

Функция ПолучитьОписаниеОбъектаJS(ИдентификаторСтраницы, ТипСтраницы, ПроходитТестирование, SCO, Ресурс)
	
	СтруктураНастроек = Новый Структура;
	
	Если SCO Тогда
		НастройкиSCORM = Справочники.РесурсыСУЗ.НастройкиПакетаSCORM(Ресурс);		
		СтруктураНастроек.Вставить("isDefault", НастройкиSCORM.ЭтоНастройкиПоУмолчанию);
		Для каждого СтрокаТН Из НастройкиSCORM.ТаблицаНастроек Цикл
			СтруктураНастроек.Вставить(ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(СтрокаТН.Параметр),
				СтрокаТН.Используется);
		КонецЦикла;			
	КонецЕсли;
	
	ОписаниеОбъекта = "idPage : '%1', typePage : '%2', isQuiz : %3, SCO : %4, SCORMSettings: %5";
	ОписаниеОбъекта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ОписаниеОбъекта, 
		ИдентификаторСтраницы,
		ТипСтраницы,
		?(ПроходитТестирование, "true", "false"),
		?(SCO, "true", "false"),
		ОбщегоНазначенияСУ.ДанныеВJSON(СтруктураНастроек));
	
	Возврат ОписаниеОбъекта;
	
КонецФункции

Функция ЧислоВСтроку(Число)
	Возврат ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(Число)	
КонецФункции

Функция БулевоВСтроку(Значение)
	Возврат ?(Значение, "true", "false");
КонецФункции

Функция ДатаВСтроку(Значение)
	Возврат ЧислоВСтроку(ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(Значение)); 	
КонецФункции	

Функция ПодставитьПараметрыВСтрокуИзМассива(Знач СтрокаПодстановки, Знач МассивПараметров) Экспорт
	
	СтрокаРезультата = СтрокаПодстановки;
	
	Сч = МассивПараметров.Количество();

	Пока Сч > 0 Цикл
		
		Строка = МассивПараметров.Получить(Сч - 1);

		СтрокаРезультата = СтрЗаменить(СтрокаРезультата, "%"+Строка(Сч), Строка);
			
		Сч = Сч - 1;
		
	КонецЦикла;	
	
	Возврат СтрокаРезультата;
	
КонецФункции

Функция НастройкиПользовательскихДанных(НастройкиЭР, ТипПубликации, СкрытьСодержание) Экспорт
	
	Если НастройкиЭР = Неопределено ИЛИ СкрытьСодержание Тогда		
		Возврат ОбщегоНазначенияСУ.ДанныеВJSON(Новый Структура("personal, favorite", Новый Структура("allow", ЛОЖЬ), Новый Структура("allow", Ложь)));
	КонецЕсли;
		
	Если ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.WS Тогда		
		Возврат "undefined";		
	КонецЕсли;
	
	ДанныеДляВозврата = Новый Структура("personal, favorite", Новый Структура("allow", ЛОЖЬ), Новый Структура("allow", ИСТИНА));
	
	ДанныеДляВозврата.personal.allow = РегистрыСведений.ИспользованиеДополнительныхМатериаловСУЗ.МожноИспользоватьДополнительныеМатериалы(НастройкиЭР.Ссылка);
		
	Возврат ОбщегоНазначенияСУ.ДанныеВJSON(ДанныеДляВозврата);
	
КонецФункции

Функция ТипAPI() Экспорт
	
	Если ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.HTML Тогда
		
		Если СохранятьАктивность Тогда
			Возврат "local";
		Иначе
			Возврат "empty";
		КонецЕсли;
		
	Иначе
		
		Возврат НРег(ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ТипПубликации));
		 
	КонецЕсли;	
	
КонецФункции

Процедура ДобавитьЭлементВФайлПоиска(ФайлПоиска, Наименование, Данные, Номер, ЭлектронныйРесурс, ЭлементСодержания, ЭлементПодборки, ЭлементГлоссария, СсылкаНаОбъектСУЗ)
	
	АдресОбъекта = Неопределено;
	
	Если ЗначениеЗаполнено(ЭлементПодборки) Тогда
		АдресОбъекта = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(ЭлементПодборки);
	ИначеЕсли ЗначениеЗаполнено(ЭлементГлоссария) Тогда
		АдресОбъекта = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(ЭлементГлоссария);
	ИначеЕсли ЗначениеЗаполнено(ЭлементСодержания) Тогда
		АдресОбъекта = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(ЭлементСодержания);
	ИначеЕсли ЗначениеЗаполнено(СсылкаНаОбъектСУЗ) Тогда
		АдресОбъекта = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(СсылкаНаОбъектСУЗ);
	ИначеЕсли ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		АдресОбъекта = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(ЭлектронныйРесурс);
	КонецЕсли;		
	
	Если ЗначениеЗаполнено(АдресОбъекта) Тогда
		
		ИмяОбъекта = ОбщегоНазначенияСУКлиентСервер.JSСтрока(Наименование, Истина, Истина);
		ДанныеОбъекта = ОбщегоНазначенияСУКлиентСервер.JSСтрока(Данные, Истина, Истина);
		
		Если ЗначениеЗаполнено(ИмяОбъекта) Тогда
			
			ФайлПоиска = ФайлПоиска + Символы.ПС + "{
			|	name   : """ + ИмяОбъекта + """,
			|	data   : """ + ДанныеОбъекта + """,
			|	link   : """ + АдресОбъекта + """,
			|	number : " + ЧислоВСтроку(Номер) + "
			|},";
			
			Номер = Номер + 1;					
			
		КонецЕсли;
		
	КонецЕсли;			
	
КонецПроцедуры

Функция ПодборкаБезСтраниц(Подборка)
	
	Возврат ?((Подборка.ТипНавигации = Перечисления.ТипыНавигацииПодборкиСУЗ.БезНавигации ИЛИ Подборка.ТипНавигации = Перечисления.ТипыНавигацииПодборкиСУЗ.НаОднойСтранице ИЛИ Подборка.ТипНавигации = Перечисления.ТипыНавигацииПодборкиСУЗ.Слайды) И НЕ Подборка.ЭтоТест, Истина, Ложь);
	
КонецФункции

#КонецЕсли