
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая()
		И Параметры.Свойство("ЗначениеКопирования") 
		И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		
		ШаблонСообщения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ЗначениеКопирования, "ФорматированныйДокумент").Получить();
	
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормы();	
	ЗаполнитьТаблицуПеременных();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ШаблонСообщения = ТекущийОбъект.ФорматированныйДокумент.Получить();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НЕ ЗаполнитьПеременныеВручную Тогда
		ТекущийОбъект.Переменные.Очистить();
		ТекущийОбъект.ДополнительныеПеременные.Очистить();
		Для каждого СтрокаТП Из Переменные Цикл	
			Если ТипЗнч(СтрокаТП.Переменная) = Тип("ПланВидовХарактеристикСсылка.ПеременныеШаблоновСообщенийСУО") Тогда
				НоваяСтрокаТЧ = ТекущийОбъект.Переменные.Добавить();
				НоваяСтрокаТЧ.Переменная = СтрокаТП.Переменная;
			КонецЕсли;	
			Если ТипЗнч(СтрокаТП.Переменная) = Тип("СправочникСсылка.ВидыКонтактнойИнформации")
				ИЛИ ТипЗнч(СтрокаТП.Переменная) = Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения") Тогда
				НоваяСтрокаТЧ = ТекущийОбъект.ДополнительныеПеременные.Добавить();
				НоваяСтрокаТЧ.Переменная = СтрокаТП.Переменная;
				НоваяСтрокаТЧ.ИмяПеременной = СтрокаТП.Код;
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;
	ТекущийОбъект.ФорматированныйДокумент = Новый ХранилищеЗначения(ШаблонСообщения, Новый СжатиеДанных(9));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ТипШаблонаПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
	ЗаполнитьТаблицуПеременных();
КонецПроцедуры

&НаКлиенте
Процедура ТипАвтоматическойРассылкиПриИзменении(Элемент)
	ЗаполнитьТаблицуПеременных();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ВставитьПеременнуюВТекст(Команда)
	ВставитьПеременнуюВШаблон();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПеременные

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ  Переменные

&НаКлиенте
Процедура ПеременныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВставитьПеременнуюВШаблон();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаполнитьТаблицуПеременных()
	
	Переменные.Очистить();
	
	// Переменные, которые есть всегда
	
	НоваяПеременная = Переменные.Добавить();
	НоваяПеременная.Переменная = "Полное имя адресата";
	НоваяПеременная.Код = "ПолноеИмяАдресата";
	НоваяПеременная.Подсказка = НСтр("ru = 'Полное имя пользователя, которому отправляется сообщение'");
	
	НоваяПеременная = Переменные.Добавить();
	НоваяПеременная.Переменная = "Логин адресата";
	НоваяПеременная.Код = "ЛогинАдресата";
	НоваяПеременная.Подсказка = НСтр("ru = 'Логин пользователя, которому отправляется сообщение'");
	
	НоваяПеременная = Переменные.Добавить();
	НоваяПеременная.Переменная = "Отправитель";
	НоваяПеременная.Код = "Отправитель";
	НоваяПеременная.Подсказка = НСтр("ru = 'Для личных сообщений Отправитель указан в настройках программы, поле «Автор автоматических рассылок для личных сообщений». Для сообщений на электронную почту Отправитель указан в настройках системной учетной записи электронной почты'");
	
	// Переменные автоматических рассылок
	
	Если Объект.ТипШаблона = Перечисления.ТипыШаблоновСообщенийСУО.АвтоматическаяРассылка Тогда
		
		ТаблицаПеременныхАР = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ТаблицаПеременныхАвтоматическойРассылки(Объект.ТипАвтоматическойРассылки);
		
		Для каждого СтрокаТП Из ТаблицаПеременныхАР Цикл
			НоваяПеременная = Переменные.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяПеременная, СтрокаТП); 
			НоваяПеременная.Код = НоваяПеременная.Код;
		КонецЦикла;		
		
				
	КонецЕсли;
	
	// Переменные сброса пароля
	
	Если Объект.ТипШаблона = Перечисления.ТипыШаблоновСообщенийСУО.СбросПароля Тогда
		
		НоваяПеременная = Переменные.Добавить();
		НоваяПеременная.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НовыйПароль;
		НоваяПеременная.Код = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КодПеременной(НоваяПеременная.Переменная);
		НоваяПеременная.Подсказка = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПодсказкаКПеременной(НоваяПеременная.Переменная);	
		
	КонецЕсли;
	
	// Объединение дубликатов пользователей
	
	Если Объект.ТипШаблона = Перечисления.ТипыШаблоновСообщенийСУО.ОбъединениеДубликатовПользователей Тогда
		
		НоваяПеременная = Переменные.Добавить();
		НоваяПеременная.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ОбъединенныеЛогины;
		НоваяПеременная.Код = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КодПеременной(НоваяПеременная.Переменная);
		НоваяПеременная.Подсказка = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПодсказкаКПеременной(НоваяПеременная.Переменная);	
		
	КонецЕсли;	
	
	// Дополнительные переменные
	
	МожноВыводитьДопПеременные = Ложь;
	
	Если ЗначениеЗаполнено(Объект.ТипШаблона) Тогда
		Если Объект.ТипШаблона = Перечисления.ТипыШаблоновСообщенийСУО.АвтоматическаяРассылка Тогда
			Если ЗначениеЗаполнено(Объект.ТипАвтоматическойРассылки)
				И Объект.ТипАвтоматическойРассылки <> Перечисления.ТипыАвтоматическихРассылокСУО.ПриглашениеНаОткрытоеМероприятие
				И Объект.ТипАвтоматическойРассылки <> Перечисления.ТипыАвтоматическихРассылокСУО.ПриглашениеНаОткрытуюПрограммуОбучения
				И Объект.ТипАвтоматическойРассылки <> Перечисления.ТипыАвтоматическихРассылокСУО.ВажнаяНовость
				И Объект.ТипАвтоматическойРассылки <> Перечисления.ТипыАвтоматическихРассылокСУО.КонтрольНепрочитанныхЛичныхСообщений
				И Объект.ТипАвтоматическойРассылки <> Перечисления.ТипыАвтоматическихРассылокСУО.КонтрольНепрочитанныхТемФорума Тогда
				МожноВыводитьДопПеременные = Истина;
			КонецЕсли;
		Иначе
			МожноВыводитьДопПеременные = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если МожноВыводитьДопПеременные Тогда
		
		// Виды контактной информации
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВидыКонтактнойИнформации.Наименование,
			|	ВидыКонтактнойИнформации.Ссылка,
			|	"""" КАК Подсказка
			|ИЗ
			|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
			|ГДЕ
			|	ВидыКонтактнойИнформации.Родитель = &РодительПользователи
			|	И ВидыКонтактнойИнформации.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("РодительПользователи", Справочники.ВидыКонтактнойИнформации.СправочникПользователи);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяПеременная = Переменные.Добавить();
			НоваяПеременная.Переменная = ВыборкаДетальныеЗаписи.Ссылка;
			НоваяПеременная.Код = ВыборкаДетальныеЗаписи.Наименование;
			НоваяПеременная.Подсказка = ВыборкаДетальныеЗаписи.Подсказка;	
		КонецЦикла;

		// Дополнительные реквизиты
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДополнительныеРеквизитыИСведения.Заголовок,
			|	ДополнительныеРеквизитыИСведения.Подсказка,
			|	ДополнительныеРеквизитыИСведения.Ссылка
			|ИЗ
			|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
			|ГДЕ
			|	ДополнительныеРеквизитыИСведения.ПометкаУдаления = ЛОЖЬ
			|	И ДополнительныеРеквизитыИСведения.НаборСвойств = &НаборСвойств";
		
		Запрос.УстановитьПараметр("НаборСвойств", УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Пользователи"));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяПеременная = Переменные.Добавить();
			НоваяПеременная.Переменная = ВыборкаДетальныеЗаписи.Ссылка;
			НоваяПеременная.Код = ВыборкаДетальныеЗаписи.Заголовок;
			НоваяПеременная.Подсказка = ВыборкаДетальныеЗаписи.Подсказка;	
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	Элементы.ТипАвтоматическойРассылки.Видимость = ?(Объект.ТипШаблона = Перечисления.ТипыШаблоновСообщенийСУО.АвтоматическаяРассылка, Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВставитьПеременнуюВШаблон()
	
	ТекущиеДанные = Элементы.Переменные.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КодПеременной = "{{" + ТекущиеДанные.Код + "}}";
	НачалоВыделения = 0;
	КонецВыделения = 0;
	
	Элементы.ШаблонСообщения.ПолучитьГраницыВыделения(НачалоВыделения, КонецВыделения);
	ВставленныйТекст = ШаблонСообщения.Вставить(КонецВыделения, КодПеременной);
	ТекущийЭлемент = Элементы.ШаблонСообщения;
	Модифицированность = Истина;
	
КонецПроцедуры


#КонецОбласти