
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьПравоРедактирования = УправлениеДоступом.ЕстьРоль("ДобавлениеИзменениеПрограммОбученияСУО");
	
	Если НЕ ЕстьПравоРедактирования Тогда
		Текст = НСтр("ru = 'Отказано в доступе'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура МероприятиеПриИзменении(Элемент)
	
	Если ПустаяСтрока(Объект.Наименование) И ЗначениеЗаполнено(Объект.Мероприятие) Тогда 
		Объект.Наименование = Строка(Объект.Мероприятие);
	КонецЕсли;

КонецПроцедуры

