#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

Перем ПометкаУдаленияИзменена;
	
#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Делаем проверки
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеОПроведенииМероприятия = УправлениеОбучениемСУОПовтИсп.ДанныеМероприятия(ПроведениеОбучения, "Проведен, Мероприятие");
	
	ДокументПроведениеОбученияПроведен = ДанныеОПроведенииМероприятия.Проведен;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ ДокументПроведениеОбученияПроведен Тогда
		Текст = НСтр("ru = 'Проведите основной документ обучения ""%1""'");
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, ПроведениеОбучения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	// Получаем даты проведения
	
	ДатаНачалаПроведенияЗапланированная = Документы.ПроведениеОбученияСУО.ДатаНачалаПроведения(ПроведениеОбучения, Сценарий);
	
	Если ЗначениеЗаполнено(ДатаНачалаПроведенияЗапланированная) Тогда
		ДатаНачалаПроведения = ДатаНачалаПроведенияЗапланированная;
	Иначе
		ДатаНачалаПроведения = Дата("00010101");
	КонецЕсли;
	
	ДатаОкончанияПроведенияЗапланированная = Документы.ПроведениеОбученияСУО.ДатаОкончанияПроведения(ПроведениеОбучения, Сценарий);
	
	Если ЗначениеЗаполнено(ДатаОкончанияПроведенияЗапланированная) Тогда
		ДатаОкончанияПроведения = ДатаОкончанияПроведенияЗапланированная;
	Иначе
		ДатаОкончанияПроведения = Дата("00010101");
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Ссылка)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления") <> ПометкаУдаления Тогда
		
		ПометкаУдаленияИзменена = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаленияИзменена Тогда
		ОбновитьПроведениеОбучения();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	МероприятиеОтменено = Документы.ПроведениеПреподавателемОбученияСУО.Отменено(Ссылка);
	
	Движения.ПроведениеПреподавателямиОбученияСУО.Записывать = Истина;
	Движения.ПреподавателиОбученияСУО.Записывать             = Истина;
	Движения.РасписаниеПреподавателейСУО.Записывать          = Истина;
	Движения.БиблиотекаПользователейСУО.Записывать           = Истина;
	
	Если НЕ МероприятиеОтменено Тогда
		
		ДанныеПроведенияОбучения = УправлениеОбучениемСУОПовтИсп.ДанныеМероприятия(ПроведениеОбучения, 
			"БезСценария,
			|НаОсновеМероприятия,
			|НаОсновеЭлектронногоРесурса,
			|Мероприятие,
			|ЭлектронныйРесурс,
			|Наименование, 
			|ВидОбучения, 
			|Статус, 
			|ЦветЗапланированногоМероприятияНаКалендареПреподавателя, 
			|ЦветАктивногоМероприятияНаКалендареПреподавателя, 
			|ЦветЗавершенногоМероприятияНаКалендареПреподавателя, 
			|ЦветОтмененногоМероприятияНаКалендареПреподавателя,
			|ДатаНачалаПроведения,
			|ДатаОкончанияПроведения,
			|ДатаНачалаДоступа,
			|ДатаКонтроля,
			|ПродолжительностьВСекундах,
			|ВариантПродолжительности");
		
		Если ТипЗнч(Сценарий) = Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда			
			ДанныеОМероприятии = УправлениеОбучениемСУОПовтИсп.ДанныеМероприятия(Сценарий, "Значимость, ШкалаОценки, Вид, ШкалаОценки, МестоПроведения, ПродолжительностьВСекундах");
			ВидОбучения        = ДанныеОМероприятии.Вид;
		Иначе
			ДанныеОМероприятии = Неопределено;
			ВидОбучения        = Документы.ПроведениеОбученияСУО.ВидОбучения(ДанныеПроведенияОбучения, Сценарий);
		КонецЕсли;		
		
		Если НЕ ЗначениеЗаполнено(РодительскоеПроведение) Тогда
			
			Движение = Движения.ПроведениеПреподавателямиОбученияСУО.Добавить();
			
			Движение.ПроведениеОбучения          = ПроведениеОбучения;
			Движение.Сценарий                    = Сценарий;
			Движение.Преподаватель               = Пользователь;
			
			Движение.Проведено                   = Проведено;
			Движение.ДатаНачалаПроведения        = ДатаНачалаПроведения;
			Движение.ДатаОкончанияПроведения     = ДатаОкончанияПроведения;
			Движение.Дата                        = Дата;
			
			Движение.Вид                         = ВидОбучения;
			
			Движение.ПродолжительностьВЧасах     = Документы.ПроведениеОбученияСУО.Продолжительность(ДанныеПроведенияОбучения) / 3600; 
			Движение.НаОсновеЭлектронногоРесурса = ДанныеПроведенияОбучения.НаОсновеЭлектронногоРесурса;
			Движение.ТолькоПросмотрВедомости     = ?(ДанныеПроведенияОбучения.НаОсновеМероприятия, Справочники.КаталогМероприятийСУО.ПреподавателюДоступенТолькоПросмотрВедомости(ДанныеПроведенияОбучения.Мероприятие, Роль), ТолькоПросмотрВедомости);
			Движение.Статус                      = Документы.ПроведениеПреподавателемОбученияСУО.СтатусПроцессаПреподавания(ЭтотОбъект);
			
		КонецЕсли;
		
		// Расписание преподавателей
		
		Если НЕ ВидОбучения.Общее Тогда
		
			Движение = Движения.РасписаниеПреподавателейСУО.Добавить();
			
			Движение.ПроведениеОбучения       = ПроведениеОбучения;
			
			Движение.Сценарий                    = Сценарий;
			
			Движение.Роль                        = Роль;
			
			Движение.Преподаватель               = Пользователь;
			Движение.Проведено                   = Проведено;
			Движение.ДатаНачалаПроведения        = ДатаНачалаПроведения;
			Движение.ДатаОкончанияПроведения     = ДатаОкончанияПроведения;
			
			Движение.Вид                         = ВидОбучения;
			
			Движение.РодительскоеПроведение      = РодительскоеПроведение;
			Движение.НаОсновеЭлектронногоРесурса = ДанныеПроведенияОбучения.НаОсновеЭлектронногоРесурса;
			
			Движение.ЦветНаКалендаре = Документы.ПроведениеОбученияСУО.ЦветНаКалендаре(ДанныеПроведенияОбучения, ВидОбучения, Перечисления.ТипыУчебныхАктивностейСУО.Преподавание);
			
						
		КонецЕсли;
		
		// Преподаватели мероприятий
		
		Движение = Движения.ПреподавателиОбученияСУО.Добавить();
		
		Движение.ПроведениеОбучения      = ПроведениеОбучения;
		Движение.Сценарий                = Сценарий;
		Движение.Преподаватель           = Пользователь;
		
		Движение.Роль                    = Роль;
		Движение.Проведено               = Проведено;
		Движение.ДатаНачалаПроведения    = ДатаНачалаПроведения;
		Движение.ДатаОкончанияПроведения = ДатаОкончанияПроведения;
		Движение.СкрыватьОтУченика       = ?(ДанныеПроведенияОбучения.НаОсновеМероприятия, Справочники.КаталогМероприятийСУО.ПреподавательСкрытОтУченика(ДанныеПроведенияОбучения.Мероприятие, Роль), СкрыватьОтУченика);
		
		// Библиотека пользователя

		ВыборкаРесурсовДляБиблиотеки = УправлениеОбучениемСУОПовтИсп.ВыборкаДанныхДляЗаполненияБиблиотекиПользователя(ДанныеПроведенияОбучения.Мероприятие, ПроведениеОбучения);		
		ДатаРазмещенияМатериала = ?(ЗначениеЗаполнено(ДатаНачалаПроведения), ДатаНачалаПроведения, Дата);		
		РегистрыСведений.БиблиотекаПользователейСУО.БиблиотекаПользователейЗаполнитьДвижения(Движения, Пользователь, ДатаРазмещенияМатериала, ВыборкаРесурсовДляБиблиотеки, Неопределено, ДанныеПроведенияОбучения.Статус, Ложь);
		
	КонецЕсли;
	
	Движения.Записать();
	
	Если ЗначениеЗаполнено(РодительскоеПроведение) Тогда
		ПерезаписатьРодительскоеПроведение(РежимЗаписиДокумента.Проведение)
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ЗначениеЗаполнено(РодительскоеПроведение) Тогда
		ПерезаписатьРодительскоеПроведение(РежимЗаписиДокумента.ОтменаПроведения)
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ПерезаписатьРодительскоеПроведение(РежимЗаписи)
		
	РодительскоеПроведениеОбъект = РодительскоеПроведение.ПолучитьОбъект();
	
	Попытка 
		РодительскоеПроведениеОбъект.Заблокировать();
	Исключение
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСТР("ru = 'Не удалось заблокировать объект %1'"),
			Строка(РодительскоеПроведениеОбъект));
	КонецПопытки;
		
	РодительскоеПроведениеОбъект.Записать(РежимЗаписи);
	РодительскоеПроведениеОбъект.Разблокировать();
	
КонецПроцедуры

Процедура ОбновитьПроведениеОбучения()
	
	РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(ПроведениеОбучения,,Истина,,3);
	
КонецПроцедуры

#КонецОбласти

ПометкаУдаленияИзменена = Ложь;

#КонецЕсли
