
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.РежимПодбора Тогда
		ЗакрыватьПриВыборе = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Список

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Если Параметры.РежимПодбора Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ВладелецФорма = ОбщегоНазначенияСУКлиент.НайтиВладельцаУправляемойФормы(ВладелецФормы);
		
		Если ВладелецФорма <> Неопределено Тогда
			ВладелецФорма.ОбработатьПодбор(Значение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

