#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ЗначениеВЧисло(Значение) Экспорт
	
	Если Значение = Перечисления.СтатусыПрохожденияОбъектовСУО.Зачислен Тогда
		Возврат 1;
	КонецЕсли;
	
	Если Значение = Перечисления.СтатусыПрохожденияОбъектовСУО.Проходит Тогда
		Возврат 2;
	КонецЕсли;
	
	Если Значение = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил Тогда
		Возврат 3;
	КонецЕсли;
	
	Если Значение = Перечисления.СтатусыПрохожденияОбъектовСУО.НеЗавершил Тогда
		Возврат 4;
	КонецЕсли;
	
	Если Значение = Перечисления.СтатусыПрохожденияОбъектовСУО.НеДопущен Тогда
		Возврат 5;
	КонецЕсли;
	
	Если Значение = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат Тогда
		Возврат 6;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ЧислоВЗначение(ЗначениеЧисло) Экспорт
	
	Если ЗначениеЧисло = 1 Тогда
		Возврат Перечисления.СтатусыПрохожденияОбъектовСУО.Зачислен;
	КонецЕсли;
	
	Если ЗначениеЧисло = 2 Тогда
		Возврат Перечисления.СтатусыПрохожденияОбъектовСУО.Проходит;
	КонецЕсли;
	
	Если ЗначениеЧисло = 3 Тогда
		Возврат Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил;
	КонецЕсли;
	
	Если ЗначениеЧисло = 4 Тогда
		Возврат Перечисления.СтатусыПрохожденияОбъектовСУО.НеЗавершил;
	КонецЕсли;
	
	Если ЗначениеЧисло = 5 Тогда
		Возврат Перечисления.СтатусыПрохожденияОбъектовСУО.НеДопущен;
	КонецЕсли;
	
	Если ЗначениеЧисло = 6 Тогда
		Возврат Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат;
	КонецЕсли;
	
	Возврат Перечисления.СтатусыПрохожденияОбъектовСУО.ПустаяСсылка();	
	
КонецФункции

Функция ПредставлениеЗначения(Значение) Экспорт
	
	Если Значение = Перечисления.СтатусыПрохожденияОбъектовСУО.Зачислен Тогда
		Возврат НСтр("ru = 'Новое'");
	КонецЕсли;
	
	Если Значение = Перечисления.СтатусыПрохожденияОбъектовСУО.Проходит Тогда
		Возврат НСтр("ru = 'Активно'");
	КонецЕсли;
	
	Если Значение = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил Тогда
		Возврат НСтр("ru = 'Окончено'");
	КонецЕсли;
	
	Если Значение = Перечисления.СтатусыПрохожденияОбъектовСУО.НеЗавершил Тогда
		Возврат НСтр("ru = 'Не окончено'");
	КонецЕсли;

	Если Значение = Перечисления.СтатусыПрохожденияОбъектовСУО.НеДопущен Тогда
		Возврат НСтр("ru = 'Не допущен'");
	КонецЕсли;
	
	Если Значение = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат Тогда
		Возврат НСтр("ru = 'Автомат'");
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ЧислоВПредставление(ЗначениеЧисло) Экспорт
	Возврат ПредставлениеЗначения(ЧислоВЗначение(ЗначениеЧисло));
КонецФункции


#КонецЕсли