
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВсеНовости = Параметры.Все;
	
	УстановитьДоступностьЭлементовФормы();

	Элементы.СоздатьНовость.Видимость  = ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Документы.НовостьСУО);
	Элементы.ИзменитьНовость.Видимость = ПравоДоступа("Изменение", Метаданные.Документы.НовостьСУО);
	Элементы.УдалитьНовость.Видимость  = ПравоДоступа("ИнтерактивнаяПометкаУдаления", Метаданные.Документы.НовостьСУО);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ВсеНовостиПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНовости

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Новости

&НаКлиенте
Процедура НовостиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Новость", Элемент.ТекущиеДанные.Регистратор);
	ОткрытьФорму("Документ.НовостьСУО.Форма.ФормаПросмотраНовости", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура СоздатьНовость(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьНовостьПродолжение", ЭтотОбъект);		
	ОткрытьФорму("Документ.НовостьСУО.ФормаОбъекта", Новый Структура("БыстроеСоздание", Истина),,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовостьПродолжение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры	

&НаКлиенте
Процедура ИзменитьНовость(Команда)
	
	ТекущиеДанные = Элементы.Новости.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ПоказатьЗначение(,ТекущиеДанные.Регистратор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНовости(Команда)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНовость(Команда)
	
	ТекущиеДанные = Элементы.Новости.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьНовостьПродолжение", ЭтотОбъект, ТекущиеДанные.Регистратор);		
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Удалить новость?'"), РежимДиалогаВопрос.ДаНет, 0);

КонецПроцедуры

&НаКлиенте
Процедура УдалитьНовостьПродолжение(Ответ, Новость) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
	    Возврат;
	КонецЕсли;	
	
	УдалитьНовостьНаСервере(Новость);
	
КонецПроцедуры	

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Новости.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	Новости.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", Пользователи.ТекущийПользователь());
	Новости.Параметры.УстановитьЗначениеПараметра("ВсеНовости", ВсеНовости);
	Новости.Параметры.УстановитьЗначениеПараметра("ТекущаяДатаМинусМесяц", ДобавитьМесяц(ТекущаяДата(), -1));
	
КонецПроцедуры

&НаСервере
Процедура УдалитьНовостьНаСервере(Новость)
	
	НовостьОбъект = Новость.ПолучитьОбъект();
	НовостьОбъект.УстановитьПометкуУдаления(Истина);
	
	НовостьОбъект.Записать();
	
	Элементы.Новости.Обновить();
	
КонецПроцедуры

#КонецОбласти

