
////////////////////////////////////////////////////////////////////////////////
// ОБОЗРЕВАТЕЛЬ

// Процедура позволяет открыть обозреватель электронных
// Ресурсов для просмотра электронного ресурса (свода знаний).
//
Процедура ОткрытьОбозреватель(СводЗнаний=Неопределено,
	                          АдресОбъекта=Неопределено,
							  СкрытьНавигационноеДерево=Ложь,
							  ЭлементСодержания=Неопределено,
							  ПрохождениеОбучения=Неопределено,
							  Задание=Неопределено,
							  Вариант=Неопределено,
							  ДочернееОкно=Ложь,
							  РежимПросмотра=Ложь,
							  ТекущийПользователь=Неопределено,
							  РежимОткрытияОкна=Неопределено,
							  Заголовок=Неопределено,
							  Окно=Неопределено) Экспорт
							  
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СводЗнаний", СводЗнаний);
	ПараметрыФормы.Вставить("АдресОбъекта", АдресОбъекта);
	ПараметрыФормы.Вставить("СкрытьНавигационноеДерево", СкрытьНавигационноеДерево);
	ПараметрыФормы.Вставить("ЭлементСодержания", ЭлементСодержания);
	ПараметрыФормы.Вставить("ПрохождениеОбучения", ПрохождениеОбучения);
	ПараметрыФормы.Вставить("Задание", Задание);
	ПараметрыФормы.Вставить("Вариант", Вариант);
	ПараметрыФормы.Вставить("ДочернееОкно", ДочернееОкно);
	ПараметрыФормы.Вставить("РежимПросмотра", РежимПросмотра);
	ПараметрыФормы.Вставить("ТекущийПользователь", ТекущийПользователь);
	ПараметрыФормы.Вставить("Заголовок", Заголовок);
	
	ОткрытьФорму("ОбщаяФорма.ОбозревательОбъектовСУЗ", ПараметрыФормы,,,Окно,,,РежимОткрытияОкна);
	
КонецПроцедуры

Процедура РедактироватьЭлектронныйРесурс(Знач ЭлектронныйРесурс) Экспорт
	
	Если  ТипЗнч(ЭлектронныйРесурс) = Тип("ДанныеФормыСтруктура") Тогда
		ПоказатьЗначение(, ЭлектронныйРесурс.Ссылка);
	КонецЕсли;
	
	Если ТипЗнч(ЭлектронныйРесурс) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
		ПоказатьЗначение(, ЭлектронныйРесурс);
	КонецЕсли;
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБМЕН МАТЕРИАЛАМИ

Функция ПолучитьКаталогиСКурсами()
	
	МассивПутей = Новый Массив;
	ВерсияКонфигурации = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().ВерсияКонфигурации;
	ВерсияПодсистемыЭР = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().ЭлектронныеРесурсы.Версия;
	
	ИмяКаталогаВерсииКонфигурации = СтрЗаменить(ВерсияКонфигурации, ".", "_");
	
	// Добавляем каталоги с курсами в AppData 
		
	ПутьККаталогуAppData = ОбщегоНазначенияСУКлиент.КаталогAppData();	
	
	Если ПутьККаталогуAppData <> Неопределено Тогда
		
		ОсновнойКаталогСКурсами = Новый Файл(ПутьККаталогуAppData + "1C\Courses");
		
		Если ОсновнойКаталогСКурсами.Существует() Тогда
			
			МассивФайловИнформаторов = НайтиФайлы(ОсновнойКаталогСКурсами.ПолноеИмя, "*.suz", Истина); // Находим все файлы информаторы
			
			Для каждого ФайлИнформатор Из МассивФайловИнформаторов Цикл
			
				ПутьККаталогуМассив = СтрРазделить(ФайлИнформатор.Путь, "\", Ложь);
				ВерсияКаталога = СтрЗаменить(ПутьККаталогуМассив[ПутьККаталогуМассив.Количество() - 1], "_", ".");
				Если СтрРазделить(ВерсияКаталога, ".", Ложь).Количество() <> 4 Тогда
					Продолжить;
				КонецЕсли;
				
				Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ВерсияКаталога, ВерсияПодсистемыЭР) > -1 Тогда
					МассивПутей.Добавить(
						ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ФайлИнформатор.Путь));
				КонецЕсли;
			
			КонецЦикла;
				
		КонецЕсли;
			
	КонецЕсли;	
		
	// Добавляем каталоги с курсами из шаблонов конфигураций
	
	КаталогиШаблоновКонфигураций = ОбщегоНазначенияСУКлиент.КаталогиШаблоновКонфигураций(ПутьККаталогуAppData);
	
	МассивИменКонфигураций = Новый Массив();
	МассивИменКонфигураций.Добавить("CourseConstructor");
	МассивИменКонфигураций.Добавить("CorpUniversity");
	МассивИменКонфигураций.Добавить("Examinator");
	
	Если СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().ЭтоБазоваяВерсияКонфигурации Тогда
		МассивИменКонфигураций.Добавить("CourseConstructorBase");
	КонецЕсли;
	
	Для каждого ПутьККаталогуШаблонов Из КаталогиШаблоновКонфигураций Цикл
	
		КаталогШаблонаКонфигурации = ПутьККаталогуШаблонов + "1c\SDO\KnowledgeBases\" + ИмяКаталогаВерсииКонфигурации + "\";

		ФайлКаталогШаблонаКонфигурации = Новый Файл(КаталогШаблонаКонфигурации);
		
		Если ФайлКаталогШаблонаКонфигурации.Существует() И ФайлКаталогШаблонаКонфигурации.ЭтоКаталог() Тогда
			МассивПутей.Добавить(КаталогШаблонаКонфигурации);
		КонецЕсли;		
		
		Для каждого ИмяКонфигурации Из МассивИменКонфигураций Цикл		
			
			КаталогШаблонаКонфигурации = ПутьККаталогуШаблонов + "1c\" + ИмяКонфигурации+ "\" + ИмяКаталогаВерсииКонфигурации + "\KnowledgeBases\";

			ФайлКаталогШаблонаКонфигурации = Новый Файл(КаталогШаблонаКонфигурации);
			
			Если ФайлКаталогШаблонаКонфигурации.Существует() И ФайлКаталогШаблонаКонфигурации.ЭтоКаталог() Тогда
				МассивПутей.Добавить(КаталогШаблонаКонфигурации);
			КонецЕсли;		
			
			КаталогШаблонаКонфигурации = ПутьККаталогуШаблонов + "1c\SDO\" + ИмяКонфигурации+ "\" + ИмяКаталогаВерсииКонфигурации + "\KnowledgeBases\";

			ФайлКаталогШаблонаКонфигурации = Новый Файл(КаталогШаблонаКонфигурации);
			
			Если ФайлКаталогШаблонаКонфигурации.Существует() И ФайлКаталогШаблонаКонфигурации.ЭтоКаталог() Тогда
				МассивПутей.Добавить(КаталогШаблонаКонфигурации);
			КонецЕсли;		
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат МассивПутей;		
		
КонецФункции

Процедура УстановитьЭлектронныеРесурсы() Экспорт
	
	#Если НЕ ВебКлиент Тогда
		
	Если НЕ СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().ИнформационнаяБазаФайловая Тогда
		Возврат; // В режиме клиент-сервер следует использовать загрузку вручную через обмен материалами.
	КонецЕсли;
	
	Если НЕ ОбщегоНазначенияКлиент.ЭтоWindowsКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	МассивКаталоговСШаблонами = ПолучитьКаталогиСКурсами(); // На клиенте
	
	НайденныеПакетыДанных = Новый Массив();
	
	Для каждого КаталогПакетовДанных Из МассивКаталоговСШаблонами Цикл
		
		МассивТиповПД = Новый Массив();
		МассивТиповПД.Добавить(0); // Обычный пакет данных.
		МассивТиповПД.Добавить(1); // Дополнение к установленному пакету данных.
		МассивТиповПД.Добавить(2); // Пакет только с объектами помеченными на удаление.
		
		Для каждого ТипПД Из МассивТиповПД Цикл	
		
			МассивФайловИнформаторов = НайтиФайлы(КаталогПакетовДанных, Строка(ТипПД) + ".*.suz"); // Находим все файлы информаторы
			
			// Оставляем только те файлы, которые пригодны для импорта.
			
			МассивИменФайловИнформаторов = Новый Массив();
			
			Для каждого ФайлИнформатор Из МассивФайловИнформаторов Цикл
				МассивИменФайловИнформаторов.Добавить(ФайлИнформатор.ИмяБезРасширения);
			КонецЦикла;
			
			МассивИменФайловИнформаторов = ОбъектыСУЗ.ПолучитьМассивИменФайловИнформаторовПригодныхДляИмпорта(МассивИменФайловИнформаторов);
			
			Индекс = МассивФайловИнформаторов.Количество();
			
			Пока Индекс > 0 Цикл
				
				ФайлИнформатор = МассивФайловИнформаторов[Индекс-1];
				ИмяБезРасширения = ФайлИнформатор.ИмяБезРасширения;
				
				Если МассивИменФайловИнформаторов.Найти(ИмяБезРасширения) = Неопределено Тогда
					МассивФайловИнформаторов.Удалить(Индекс-1);
				КонецЕсли;
				
				Индекс = Индекс - 1;
				
			КонецЦикла;
			
			// Обходим файлы и импортируем их
			
			Для каждого ФайлИнформатор Из МассивФайловИнформаторов Цикл
			
				ТекстИнформатора = Новый ТекстовыйДокумент;
				ТекстИнформатора.Прочитать(ФайлИнформатор.ПолноеИмя);
				ПутьКПакетуДанных = ФайлИнформатор.Путь + ТекстИнформатора.ПолучитьСтроку(1);
				
				ФайлПакетаДанных = Новый Файл(ПутьКПакетуДанных);
				
				Если ФайлПакетаДанных.Существует() Тогда
					
					// Получаем путь к основному пакету данных
					
					ПутьКПакетуДанныхНаСервере = ПутьКПакетуДанных;
						
					ОписаниеПакета = ОбъектыСУЗ.ПолучитьОписаниеПакетаДанных(ПутьКПакетуДанныхНаСервере);
					
					Если ОписаниеПакета.Отказ Тогда
						Текст = НСтр("ru = 'Ошибка при анализе пакета данных ""%1"": '") + ОписаниеПакета.ОписаниеОшибки;
						Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, ОписаниеПакета.Наименование);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
						Продолжить;
					КонецЕсли;
					

					// Ищем старые пакеты данных
					
					МассивСтарыхПакетовДанных = Новый Массив();
					
					Если ТекстИнформатора.КоличествоСтрок() > 2 Тогда
					
						ВтораяСтрока = ТекстИнформатора.ПолучитьСтроку(2);
						
						Если ВтораяСтрока = "[old]" Тогда
							
							Для НомерСтроки = 3 По ТекстИнформатора.КоличествоСтрок() Цикл
								
								ПутьКСтаромуПакетуДанных = ФайлИнформатор.Путь + ТекстИнформатора.ПолучитьСтроку(НомерСтроки);
									
								ПутьКСтаромуПакетуДанныхНаСервере = ПутьКСтаромуПакетуДанных;
								
								МассивСтарыхПакетовДанных.Добавить(ПутьКСтаромуПакетуДанныхНаСервере);
							
							КонецЦикла;
							
						КонецЕсли;
						
					КонецЕсли;
					
					// Открываем форму импорта
					
					// ИмяФормыДляИмпорта = "ФормаИмпортаПакетаXML";
					
					ПараметрыПакета = Новый Структура();
					ПараметрыПакета.Вставить("ВыполняетсяЗагрузка", Ложь);
					ПараметрыПакета.Вставить("Загружен", Ложь);
					ПараметрыПакета.Вставить("ПутьКФайлуПакета", ПутьКПакетуДанныхНаСервере);
					ПараметрыПакета.Вставить("СтарыеПакеты", Новый ФиксированныйМассив(МассивСтарыхПакетовДанных));
					ПараметрыПакета.Вставить("Наименование", ОписаниеПакета.Наименование);
					ПараметрыПакета.Вставить("Код", ОписаниеПакета.Код);
					
					НайденныеПакетыДанных.Добавить(ПараметрыПакета);
										
				Иначе
					
					Текст = НСтр("ru = 'Ошибка при чтении пакета данных: Файл ""%1"" не найден'");
					Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, ФайлПакетаДанных.Путь);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
					Продолжить;
					
				КонецЕсли;
				
			
			КонецЦикла;
			
		КонецЦикла;
	
	КонецЦикла;

	Если НайденныеПакетыДанных.Количество() > 0 Тогда
		ЗагрузитьНайденныеПакетыДанных(НайденныеПакетыДанных);	
	КонецЕсли;	
	
	#КонецЕсли

КонецПроцедуры

Процедура ЗагрузитьНайденныеПакетыДанных(НайденныеПакетыДанных)
	
	// Помечаем, что ни один пакет не загружается в настоящее время
	
	Для каждого ПараметрыПакета Из НайденныеПакетыДанных Цикл
		ПараметрыПакета.ВыполняетсяЗагрузка = Ложь;	
	КонецЦикла;
	
	// Загружаем следующий по очереди пакет
	
	Для каждого ПараметрыПакета Из НайденныеПакетыДанных Цикл

		Если ПараметрыПакета.Загружен Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыПакета.Загружен = Истина;
		ПараметрыПакета.ВыполняетсяЗагрузка = Истина;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьНайденныеПакетыДанныхПродолжение", ЭтотОбъект, НайденныеПакетыДанных);
		
		Текст = НСтр("ru = 'Выполнить импорт пакета данных ""%1""?'");
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, ПараметрыПакета.Наименование);
		ПоказатьВопрос(ОписаниеОповещения, Текст, РежимДиалогаВопрос.ДаНет, 0);
	
		Прервать; // Ждем еще одного вызова из ЗагрузитьСледующийПакетДанных
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьНайденныеПакетыДанныхПродолжение(Ответ, НайденныеПакетыДанных) Экспорт
	
	// Ищем пакет, который загружается
	
	Для каждого ПараметрыПакета Из НайденныеПакетыДанных Цикл
		Если ПараметрыПакета.ВыполняетсяЗагрузка Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;		
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьСледующийПакетДанныхАТекущийНеПредлагать", ЭтотОбъект, НайденныеПакетыДанных);	
		
		Текст = НСтр("ru = 'Предлагать в дальнейшем импорт пакета данных ""%1""?'");
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, ПараметрыПакета.Наименование);
		ПоказатьВопрос(ОписаниеОповещения, Текст, РежимДиалогаВопрос.ДаНет, 0);
		
	Иначе
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьСледующийПакетДанных", ЭтотОбъект, НайденныеПакетыДанных);		
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ПутьКФайлуПакета", ПараметрыПакета.ПутьКФайлуПакета);
		ПараметрыФормы.Вставить("СтарыеПакеты", ПараметрыПакета.СтарыеПакеты);		
		
		ОткрытьФорму("ПланОбмена.ОбменМатериаламиСУЗ.Форма.ФормаИмпортаПакетаXML", ПараметрыФормы,,,,,ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры	

Процедура ЗагрузитьСледующийПакетДанныхАТекущийНеПредлагать(Ответ, НайденныеПакетыДанных) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		
		// Ищем пакет, который загружается
		
		Для каждого ПараметрыПакета Из НайденныеПакетыДанных Цикл
			Если ПараметрыПакета.ВыполняетсяЗагрузка Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;	
		
		ОбъектыСУЗ.ЗапретитьВДальнейшемАвтоматическийИмпорт(ПараметрыПакета);
		
	КонецЕсли;

	ЗагрузитьНайденныеПакетыДанных(НайденныеПакетыДанных);
	
КонецПроцедуры

Процедура ЗагрузитьСледующийПакетДанных(РезультатЗакрытия, НайденныеПакетыДанных) Экспорт
	ЗагрузитьНайденныеПакетыДанных(НайденныеПакетыДанных);	
КонецПроцедуры	
