#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// УЧАСТНИКИ

// Возвращает участников программы обучения
// 
Функция Участники(ПроведениеПрограммыОбучения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчастникиПрограммОбученияСУО.Регистратор КАК Прохождение,
		|	УчастникиПрограммОбученияСУО.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.УчастникиПрограммОбученияСУО КАК УчастникиПрограммОбученияСУО
		|ГДЕ
		|	УчастникиПрограммОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения";

	Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);

	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
	
КонецФункции

Функция ПрохожденияПрограммыОбучения(ПроведениеПрограммыОбучения, ЗначениеПометкаУдаления = Неопределено, МассивПользователей = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрохождениеПрограммыОбученияСУО.Ссылка КАК Прохождение,
		|	ПрохождениеПрограммыОбученияСУО.Пользователь,
		|	ПрохождениеПрограммыОбученияСУО.УчебнаяГруппа,
		|	ПрохождениеПрограммыОбученияСУО.Пользователь.Наименование КАК Наименование,
		|	ПрохождениеПрограммыОбученияСУО.Проведен
		|ИЗ
		|	Документ.ПрохождениеПрограммыОбученияСУО КАК ПрохождениеПрограммыОбученияСУО
		|ГДЕ
		|	ПрохождениеПрограммыОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения
		|	И &ОтборУдаленных
		|	И &ОтборПользователей";

	Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);

	Если ЗначениеПометкаУдаления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборУдаленных", "ИСТИНА");
	Иначе		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборУдаленных", "ПрохождениеПрограммыОбученияСУО.ПометкаУдаления = &ЗначениеПометкаУдаления");
		Запрос.Параметры.Вставить("ЗначениеПометкаУдаления", ЗначениеПометкаУдаления);
	КонецЕсли;
	
	Если МассивПользователей = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПользователей", "ИСТИНА");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПользователей", "ПрохождениеПрограммыОбученияСУО.Пользователь В (&МассивПользователей)");
		Запрос.Параметры.Вставить("МассивПользователей", МассивПользователей);
	КонецЕсли;	
	
	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
	
КонецФункции

Функция КоличествоУчастниковПрограммыОбучения(ПроведениеПрограммыОбучения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(УчастникиПрограммОбученияСУО.Пользователь) КАК КоличествоПользователей
		|ИЗ
		|	РегистрСведений.УчастникиПрограммОбученияСУО КАК УчастникиПрограммОбученияСУО
		|ГДЕ
		|	УчастникиПрограммОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения";

	Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	ВыборкаДетальныеЗаписи.Следующий();

	Возврат ВыборкаДетальныеЗаписи.КоличествоПользователей;
	
КонецФункции

Функция ПрохождениеПрограммыОбучения(ПроведениеПрограммыОбучения, Пользователь) Экспорт

	// Важно! Информация о прохождении берется именно из списка
	// Документов "ПрохождениеПрограммыОбученияСУО", а не из регистров.
	// То есть функция возвращает любое прохождение, даже помеченное на удаление.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрохождениеПрограммыОбученияСУО.Ссылка КАК Прохождение
		|ИЗ
		|	Документ.ПрохождениеПрограммыОбученияСУО КАК ПрохождениеПрограммыОбученияСУО
		|ГДЕ
		|	ПрохождениеПрограммыОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения
		|	И ПрохождениеПрограммыОбученияСУО.Пользователь = &Пользователь
		|	И ПрохождениеПрограммыОбученияСУО.Отменено = ЛОЖЬ";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе
	
		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ВыборкаДетальныеЗаписи.Прохождение;
		
	КонецЕсли;
		
КонецФункции

Функция ВозможныеУчастникиПрограммыОбучения(ПроведениеПрограммыОбучения) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ПроведениеПрограммыОбучения.ОткрытоДляРуководителей Тогда
		
		Если ПроведениеПрограммыОбучения.ОткрытоДляВсех Тогда

			Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	РуководителиСУО.Пользователь КАК Пользователь
				|ИЗ
				|	РегистрСведений.РуководителиСУО КАК РуководителиСУО";

		Иначе
			
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	РуководителиСУО.Пользователь
				|ИЗ
				|	Документ.ПроведениеПрограммыОбученияСУО.УчебныеГруппы КАК ПроведениеПрограммыОбученияСУОУчебныеГруппы
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РуководителиСУО КАК РуководителиСУО
				|		ПО ПроведениеПрограммыОбученияСУОУчебныеГруппы.УчебнаяГруппа = РуководителиСУО.ОбъектРуководства
				|ГДЕ
				|	ПроведениеПрограммыОбученияСУОУчебныеГруппы.Ссылка = &ПроведениеПрограммыОбучения
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	РуководителиСУО.Пользователь
				|ИЗ
				|	Документ.ПроведениеПрограммыОбученияСУО.Организации КАК ПроведениеПрограммыОбученияСУООрганизации
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РуководителиСУО КАК РуководителиСУО
				|		ПО ПроведениеПрограммыОбученияСУООрганизации.Организация = РуководителиСУО.ОбъектРуководства
				|ГДЕ
				|	ПроведениеПрограммыОбученияСУООрганизации.Ссылка = &ПроведениеПрограммыОбучения
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	РуководителиСУО.Пользователь
				|ИЗ
				|	Документ.ПроведениеПрограммыОбученияСУО.ПодразделенияПредприятия КАК ПроведениеПрограммыОбученияСУОПодразделенияПредприятия
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РуководителиСУО КАК РуководителиСУО
				|		ПО ПроведениеПрограммыОбученияСУОПодразделенияПредприятия.ПодразделениеПредприятия = РуководителиСУО.ОбъектРуководства
				|ГДЕ
				|	ПроведениеПрограммыОбученияСУОПодразделенияПредприятия.Ссылка = &ПроведениеПрограммыОбучения";
				
			Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);
				
		КонецЕсли;
		
	Иначе
		
		Если ПроведениеПрограммыОбучения.ОткрытоДляВсех Тогда

			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Пользователи.Ссылка КАК Пользователь
				|ИЗ
				|	Справочник.Пользователи КАК Пользователи
				|ГДЕ
				|	Пользователи.ПометкаУдаления = ЛОЖЬ";

		Иначе
			
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	УчебныеГруппыСУОСостав.Пользователь
				|ИЗ
				|	Документ.ПроведениеПрограммыОбученияСУО.УчебныеГруппы КАК ПроведениеПрограммыОбученияСУОУчебныеГруппы
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчебныеГруппыСУО.Состав КАК УчебныеГруппыСУОСостав
				|		ПО ПроведениеПрограммыОбученияСУОУчебныеГруппы.УчебнаяГруппа = УчебныеГруппыСУОСостав.Ссылка
				|ГДЕ
				|	ПроведениеПрограммыОбученияСУОУчебныеГруппы.Ссылка = &ПроведениеПрограммыОбучения";
				
			Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);
				
		КонецЕсли;
		
	КонецЕсли;
		
	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
	
КонецФункции

Функция ЕстьОтмененныеПрохождения(ПроведениеПрограммыОбучения, Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПрохождениеПрограммыОбученияСУО.Ссылка КАК Прохождение
		|ИЗ
		|	Документ.ПрохождениеПрограммыОбученияСУО КАК ПрохождениеПрограммыОбученияСУО
		|ГДЕ
		|	ПрохождениеПрограммыОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения
		|	И ПрохождениеПрограммыОбученияСУО.Пользователь = &Пользователь
		|	И ПрохождениеПрограммыОбученияСУО.Отменено = ИСТИНА";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);

	Результат = Запрос.Выполнить();

	Возврат НЕ Результат.Пустой();
		
КонецФункции

// СВОЙСТВА

Функция СценарийОбучения(ПроведениеПрограммыОбучения) Экспорт
	
	Если ТипЗнч(ПроведениеПрограммыОбучения) = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО") Тогда
		ПроведениеПрограммыОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеПрограммыОбучения, "Ссылка, ПрограммаОбучения, БезСценария");
	Иначе
		ПроведениеПрограммыОбученияСвойства = ПроведениеПрограммыОбучения;
	КонецЕсли;
	
	Если ПроведениеПрограммыОбученияСвойства.БезСценария Тогда
		Возврат ПроведениеПрограммыОбученияСвойства.Ссылка;
	КонецЕсли;
	
	Возврат ПроведениеПрограммыОбученияСвойства.ПрограммаОбучения;
	
КонецФункции

Функция ШкалаОценки(Знач ПроведениеПрограммыОбучения) Экспорт
	
	Если ТипЗнч(ПроведениеПрограммыОбучения) = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО") Тогда
		ПроведениеПрограммыОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеПрограммыОбучения, "БезСценария, ПрограммаОбучения");
	Иначе
		ПроведениеПрограммыОбученияСвойства = ПроведениеПрограммыОбучения;
	КонецЕсли;
	
	Если ПроведениеПрограммыОбученияСвойства.БезСценария Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроведениеПрограммыОбученияСвойства.ПрограммаОбучения, "ШкалаОценки");
	Иначе
		Возврат Справочники.ШкалыОценокСУО.ШкалаОценокПоУмолчанию();
	КонецЕсли;
	
КонецФункции

Функция ПрограммаОбучения(Знач ПроведениеПрограммыОбучения) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроведениеПрограммыОбучения, "ПрограммаОбучения");
КонецФункции

Функция Наименование(Знач ПроведениеПрограммыОбучения) Экспорт
	
	Если ТипЗнч(ПроведениеПрограммыОбучения) = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО") Тогда
		ПроведениеПрограммыОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеПрограммыОбучения, "БезСценария, ПрограммаОбучения, Наименование");
	Иначе
		ПроведениеПрограммыОбученияСвойства = ПроведениеПрограммыОбучения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПроведениеПрограммыОбученияСвойства.Наименование)
		ИЛИ ПроведениеПрограммыОбученияСвойства.БезСценария Тогда
		Возврат ПроведениеПрограммыОбученияСвойства.Наименование;
	Иначе
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроведениеПрограммыОбученияСвойства.ПрограммаОбучения, "Наименование");
	КонецЕсли;		
	
КонецФункции

// ПРОВЕДЕНИЕ ОБУЧЕНИЯ

Процедура ЗаполнитьПрохожденияПодчиненныхМероприятий(ПроведениеПрограммыОбучения) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ПроведениеПрограммыОбучения) Тогда
		Текст = НСтр("ru = 'Параметр ""Проведение программы обучения"" не заполнен'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);			
		Возврат;
	КонецЕсли;
	
	ПрограммаОбучения = ПроведениеПрограммыОбучения.ПрограммаОбучения;
	
	Если НЕ ЗначениеЗаполнено(ПрограммаОбучения) Тогда
		Текст = НСтр("ru = 'Укажите программу обучения'");
		Поле = "ПрограммаОбучения";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,Поле);			
		Возврат;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СодержаниеПрограммыОбученияСУО.Мероприятие
		|ИЗ
		|	Справочник.СодержаниеПрограммыОбученияСУО КАК СодержаниеПрограммыОбученияСУО
		|ГДЕ
		|	СодержаниеПрограммыОбученияСУО.Владелец = &ПрограммаОбучения
		|	И СодержаниеПрограммыОбученияСУО.ПометкаУдаления = ЛОЖЬ
		|	И СодержаниеПрограммыОбученияСУО.ЭтоГруппа = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	СодержаниеПрограммыОбученияСУО.РеквизитДопУпорядочивания";

	Запрос.УстановитьПараметр("ПрограммаОбучения", ПрограммаОбучения);

	Результат = Запрос.Выполнить();

	ТаблицаМероприятий = Результат.Выгрузить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроведениеОбученияСУО.Ссылка КАК ПроведениеОбучения,
		|	ПроведениеОбученияСУО.Мероприятие
		|ИЗ
		|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
		|ГДЕ
		|	ПроведениеОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения";

	Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);

	Результат = Запрос.Выполнить();

	ТаблицаПроведенийМероприятий = Результат.Выгрузить();
	
	НачатьТранзакцию();
	
	Для каждого Строка Из ТаблицаМероприятий Цикл
		
		ПроведениеОбучения = ТаблицаПроведенийМероприятий.Найти(Строка.Мероприятие, "Мероприятие");
		
		Если ПроведениеОбучения = Неопределено Тогда // Пропускаем уже созданные ранее Проведения обучения
			
			ПроведениеОбученияОбъект = Документы.ПроведениеОбученияСУО.СоздатьДокумент();
			ПроведениеОбученияОбъект.Дата = ТекущаяДата();
			ПроведениеОбученияОбъект.ПроведениеПрограммыОбучения = ПроведениеПрограммыОбучения;
			ПроведениеОбученияОбъект.Мероприятие = Строка.Мероприятие;
			ПроведениеОбученияОбъект.Записать(РежимЗаписиДокумента.Запись);
			
		КонецЕсли;
	
	КонецЦикла;

	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Функция ПроведенияОбучения(ПроведениеПрограммыОбучения, Знач ВключатьПомеченныеНаУдаление = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроведениеОбученияСУО.Ссылка КАК ПроведениеОбучения,
		|	ПроведениеОбученияСУО.Ссылка КАК Ссылка,
		|	ПроведениеОбученияСУО.Мероприятие КАК Мероприятие,
		|	ПроведениеОбученияСУО.ОткрытоеМероприятие КАК ОткрытоДляЗаписи,
		|	ПроведениеОбученияСУО.АвтозачислениеНаОбучение КАК Автозачисление,
		|	ПроведениеОбученияСУО.БезСценария КАК БезСценария,
		|	ПроведениеОбученияСУО.НаОсновеМероприятия КАК НаОсновеМероприятия,
		|	ПроведениеОбученияСУО.НаОсновеЭлектронногоРесурса КАК НаОсновеЭлектронногоРесурса,
		|	ПроведениеОбученияСУО.ЭлектронныйРесурс КАК ЭлектронныйРесурс,
		|	ПроведениеОбученияСУО.Проведен КАК Проведен,
		|	ПроведениеОбученияСУО.Дата КАК Дата,
		|	ПроведениеОбученияСУО.ПорядковыйНомер КАК ПорядковыйНомер,
		|	ПроведениеОбученияСУО.АктивироватьАвтоматически КАК АктивироватьАвтоматически,
		|	ВЫБОР
		|		КОГДА ГОД(ПроведениеОбученияСУО.ДатаНачалаПроведения) > 1
		|			ТОГДА ПроведениеОбученияСУО.ДатаНачалаПроведения
		|		ИНАЧЕ ПроведениеОбученияСУО.ДатаНачалаДоступа
		|	КОНЕЦ КАК ДатаНачалаОбучения,
		|	ВЫБОР
		|		КОГДА ГОД(ПроведениеОбученияСУО.ДатаНачалаПроведения) > 1
		|				И (ЧАС(ПроведениеОбученияСУО.ДатаНачалаПроведения) > 0
		|					ИЛИ МИНУТА(ПроведениеОбученияСУО.ДатаНачалаПроведения) > 0)
		|			ТОГДА ПроведениеОбученияСУО.ДатаНачалаПроведения
		|		КОГДА ГОД(ПроведениеОбученияСУО.ДатаНачалаДоступа) > 1
		|				И (ЧАС(ПроведениеОбученияСУО.ДатаНачалаДоступа) > 0
		|					ИЛИ МИНУТА(ПроведениеОбученияСУО.ДатаНачалаДоступа) > 0)
		|			ТОГДА ПроведениеОбученияСУО.ДатаНачалаДоступа
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВремяНачалаОбучения,
		|	ВЫБОР
		|		КОГДА ГОД(ПроведениеОбученияСУО.ДатаОкончанияПроведения) > 1
		|			ТОГДА ПроведениеОбученияСУО.ДатаОкончанияПроведения
		|		ИНАЧЕ ПроведениеОбученияСУО.ДатаКонтроля
		|	КОНЕЦ КАК ДатаОкончанияОбучения,
		|	ВЫБОР
		|		КОГДА ГОД(ПроведениеОбученияСУО.ДатаОкончанияПроведения) > 1
		|				И (ЧАС(ПроведениеОбученияСУО.ДатаОкончанияПроведения) <> 23
		|					И МИНУТА(ПроведениеОбученияСУО.ДатаОкончанияПроведения) <> 59)
		|			ТОГДА ПроведениеОбученияСУО.ДатаОкончанияПроведения
		|		КОГДА ГОД(ПроведениеОбученияСУО.ДатаКонтроля) > 1
		|				И (ЧАС(ПроведениеОбученияСУО.ДатаКонтроля) <> 23
		|					И МИНУТА(ПроведениеОбученияСУО.ДатаКонтроля) <> 59)
		|			ТОГДА ПроведениеОбученияСУО.ДатаКонтроля
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВремяОкончанияОбучения,
		|	ВЫБОР
		|		КОГДА ПроведениеОбученияСУО.Наименование <> """"
		|			ТОГДА ПроведениеОбученияСУО.Наименование
		|		КОГДА ПроведениеОбученияСУО.НаОсновеЭлектронногоРесурса
		|			ТОГДА ПроведениеОбученияСУО.ЭлектронныйРесурс
		|		КОГДА ПроведениеОбученияСУО.НаОсновеМероприятия
		|			ТОГДА ПроведениеОбученияСУО.Мероприятие
		|		ИНАЧЕ ""Обучение""
		|	КОНЕЦ КАК Наименование,
		|	ВЫБОР
		|		КОГДА ПроведениеОбученияСУО.НаОсновеМероприятия
		|			ТОГДА ПроведениеОбученияСУО.Мероприятие.Вид
		|		ИНАЧЕ ПроведениеОбученияСУО.ВидОбучения
		|	КОНЕЦ КАК Вид,
		|	ПроведениеОбученияСУО.Статус КАК Статус,
		|	ПроведениеОбученияСУО.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
		|ГДЕ
		|	&ОтборПометкаУдаления
		|	И ПроведениеОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядковыйНомер,
		|	Дата";

	Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);

	Если ВключатьПомеченныеНаУдаление Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПометкаУдаления", "ИСТИНА");
	Иначе		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПометкаУдаления", "ПроведениеОбученияСУО.ПометкаУдаления = ЛОЖЬ");
	КонецЕсли;
	
	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
	
КонецФункции

Функция Пустая(ПроведениеПрограммыОбучения, Знач ИсключитьОтмененныеИПомеченныеНаУдаление = Ложь) Экспорт

	Запрос = Новый Запрос;
	
	Если ИсключитьОтмененныеИПомеченныеНаУдаление Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПроведениеОбученияСУО.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
			|ГДЕ
			|	ПроведениеОбученияСУО.ПометкаУдаления = ЛОЖЬ
			|	И ПроведениеОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения
			|	И ПроведениеОбученияСУО.Статус <> &СтатусОтменено";

		Запрос.УстановитьПараметр("СтатусОтменено", Перечисления.СтатусыПроведенияОбъектовСУО.Отменено);
		
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПроведениеОбученияСУО.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
			|ГДЕ
			|	ПроведениеОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения";
		
	КонецЕсли;
		
	Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);

	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ПоследнийПорядковыйНомер(Знач ПроведениеПрограммыОбучения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПроведениеОбученияСУО.ПорядковыйНомер КАК ПорядковыйНомер
		|ИЗ
		|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
		|ГДЕ
		|	ПроведениеОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядковыйНомер УБЫВ";
	
	Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 1;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	ВыборкаДетальныеЗаписи.Следующий();

	Возврат ВыборкаДетальныеЗаписи.ПорядковыйНомер;
	
КонецФункции

Функция ПолучитьПродолжительностьПрограммыОбучения(ПроведениеПрограммыОбучения) Экспорт
	
	ОбщаяПродолжительность = 0;
	
	ТаблицаМероприятий = ПроведенияОбучения(ПроведениеПрограммыОбучения);
	
	Для каждого Строка Из ТаблицаМероприятий Цикл
		ПродолжительностьОбучения = Документы.ПроведениеОбученияСУО.Продолжительность(Строка.ПроведениеОбучения); 	
		ОбщаяПродолжительность = ОбщаяПродолжительность + ПродолжительностьОбучения;
	КонецЦикла;
	
	Возврат ОбщаяПродолжительность;
	
КонецФункции

Функция ПервоеПроведенияОбучения(Знач ПроведениеПрограммыОбучения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПроведениеОбученияСУО.Ссылка КАК ПроведениеОбучения,
		|	ПроведениеОбученияСУО.ДатаНачалаПроведения КАК ДатаНачала,
		|	ПроведениеОбученияСУО.СкрытьВремяПроведения КАК СкрытьВремя
		|ИЗ
		|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
		|ГДЕ
		|	ПроведениеОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения
		|	И ПроведениеОбученияСУО.ВариантПродолжительности = &ВариантПродолжительности
		|	И ПроведениеОбученияСУО.ДатаНачалаПроведения <> &ПустаяДата
		|	И ПроведениеОбученияСУО.Статус <> &СтатусОтменено
		|	И ПроведениеОбученияСУО.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачала";
	
	Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);
	Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101"));
	Запрос.УстановитьПараметр("ВариантПродолжительности", Перечисления.ПродолжительностьОбученияСУО.Фиксированная);
	Запрос.УстановитьПараметр("СтатусОтменено", Перечисления.СтатусыПроведенияОбъектовСУО.Отменено);
	
	ТаблицаОбучений = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПроведениеОбученияСУО.Ссылка КАК ПроведениеОбучения,
		|	ПроведениеОбученияСУО.ДатаНачалаДоступа КАК ДатаНачала,
		|	ПроведениеОбученияСУО.СкрытьВремяПроведения КАК СкрытьВремя
		|ИЗ
		|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
		|ГДЕ
		|	ПроведениеОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения
		|	И ПроведениеОбученияСУО.ВариантПродолжительности = &ВариантПродолжительности
		|	И ПроведениеОбученияСУО.ДатаНачалаДоступа <> &ПустаяДата
		|	И ПроведениеОбученияСУО.Статус <> &СтатусОтменено
		|	И ПроведениеОбученияСУО.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачала";
	
	Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);
	Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101"));
	Запрос.УстановитьПараметр("ВариантПродолжительности", Перечисления.ПродолжительностьОбученияСУО.Фиксированная);
	Запрос.УстановитьПараметр("СтатусОтменено", Перечисления.СтатусыПроведенияОбъектовСУО.Отменено);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Запрос.Выполнить().Выгрузить(), ТаблицаОбучений);
	
	Если ТаблицаОбучений.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаОбучений.Сортировать("ДатаНачала");
	
	РезультатСтруктура = УправлениеОбучениемСУО.ПервоеПроведенияОбученияПустаяСтруктура();
	РезультатСтруктура.Вставить("ПроведениеОбучения", ТаблицаОбучений[0].ПроведениеОбучения);
	РезультатСтруктура.Вставить("ДатаНачала", ТаблицаОбучений[0].ДатаНачала);
	РезультатСтруктура.Вставить("СкрытьВремя", ТаблицаОбучений[0].СкрытьВремя);
	
	Возврат РезультатСтруктура;
	
КонецФункции

// ПРЕПОДАВАТЕЛИ

Функция Преподаватели(Знач ПроведениеПрограммыОбучения) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроведениеОбученияСУО.Ссылка КАК ПроведениеОбучения
		|ПОМЕСТИТЬ ПроведенияОбученияПрограммы
		|ИЗ
		|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
		|ГДЕ
		|	ПроведениеОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения
		|	И ПроведениеОбученияСУО.Статус <> &СтатусОтменено
		|	И ПроведениеОбученияСУО.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПроведениеПреподавателемОбученияСУО.Пользователь КАК Пользователь
		|ИЗ
		|	Документ.ПроведениеПреподавателемОбученияСУО КАК ПроведениеПреподавателемОбученияСУО
		|ГДЕ
		|	ПроведениеПреподавателемОбученияСУО.ПометкаУдаления = ЛОЖЬ
		|	И ПроведениеПреподавателемОбученияСУО.ПроведениеОбучения В
		|			(ВЫБРАТЬ
		|				ПроведенияОбученияПрограммы.ПроведениеОбучения
		|			ИЗ
		|				ПроведенияОбученияПрограммы)";
	
	Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);
	Запрос.УстановитьПараметр("СтатусОтменено", Перечисления.СтатусыПроведенияОбъектовСУО.Отменено);
	 
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
	
КонецФункции

// ДОПОЛНИТЕЛЬНО

Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт

  Результат = Новый Массив;

  Результат.Добавить("ПрограммаОбучения");

  Возврат Результат;

КонецФункции

#КонецОбласти


#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("ПрограммаОбучения");
	Поля.Добавить("БезСценария");
	Поля.Добавить("Наименование");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтандартнаяОбработка = Ложь;
	
	НаименованиеСценария = "";
	
	Если Данные.БезСценария Тогда
		НаименованиеСценария = Данные.Наименование;
	Иначе
		НаименованиеСценария = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные.ПрограммаОбучения, "Наименование");
	КонецЕсли;
	
	Представление = НаименованиеСценария;
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		
		Если Параметры.Свойство("Ключ") Тогда
			Возврат;
		КонецЕсли;
		
		Если Параметры.Свойство("ЗначениеКопирования") Тогда
			Возврат;
		КонецЕсли;			
		
		Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьКаталогОбученийСУО") Тогда
			// Нельзя создавать программу по сценарию без расширенного режима
			Если НЕ Параметры.Свойство("ЗначенияЗаполнения") Тогда
				Параметры.Вставить("ЗначенияЗаполнения", Новый Структура);				
			КонецЕсли;
			Параметры.ЗначенияЗаполнения.Вставить("БезСценария", Истина);
			Параметры.ЗначенияЗаполнения.Вставить("ПрограммаОбучения", Неопределено);
			ПоказатьФормуСоздания = Ложь;
		КонецЕсли;		
		
		ПоказатьФормуСоздания = Истина;
		
		Если Параметры.Свойство("ЗначенияЗаполнения")
			И (Параметры.ЗначенияЗаполнения.Свойство("БезСценария")
			ИЛИ Параметры.ЗначенияЗаполнения.Свойство("ПрограммаОбучения")) Тогда
			
			ПоказатьФормуСоздания = Ложь;
			
		КонецЕсли;
		
		Если Параметры.Свойство("Основание") Тогда
			ПоказатьФормуСоздания = Ложь;
		КонецЕсли;
		
		
		Если ПоказатьФормуСоздания Тогда			
			СтандартнаяОбработка = Ложь;			
			ВыбраннаяФорма = "ФормаСоздания";			
		КонецЕсли;		
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
