#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Перем ВозможныеУчастники; // Документы "ПрохождениеПрограммыОбученияСУО" участников мероприятия.

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	// {{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КаталогПрограммОбученияСУО") Тогда
		// Заполнение шапки
		ПрограммаОбучения = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	// }}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Проверяем основные реквизиты
	
	Если БезСценария Тогда
		
		Если НЕ ЗначениеЗаполнено(Наименование) Тогда
			
			Текст = НСтр("ru = 'Укажите наименование программы обучения'");
			Поле = "Наименование";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);			
			
		КонецЕсли;		
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(ПрограммаОбучения) Тогда
			
			Текст = НСтр("ru = 'Укажите программу обучения'");
			Поле = "ПрограммаОбучения";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);			
			
		КонецЕсли;		
		
	КонецЕсли;	
	
	// Проверяем корректность дат
		
	Если ОткрытаяПрограмма Тогда // Открытое
		
		Если ЗначениеЗаполнено(ДатаОткрытияЗаписи)
			И НЕ ЗначениеЗаполнено(ДатаЗакрытияЗаписи) Тогда
			
			Текст = НСтр("ru = 'Укажите дату закрытия записи'");
			Поле = "ДатаЗакрытияЗаписи";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДатаОткрытияЗаписи)
			И ЗначениеЗаполнено(ДатаЗакрытияЗаписи) Тогда
			
			Текст = НСтр("ru = 'Укажите дату открытия записи'");
			Поле = "ДатаОткрытияЗаписи";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДатаОткрытияЗаписи)
			И ЗначениеЗаполнено(ДатаЗакрытияЗаписи)
			И ДатаЗакрытияЗаписи < ДатаОткрытияЗаписи Тогда
			
			Текст = НСтр("ru = 'Дата закрытия записи на мероприятие не может быть меньше даты открытия записи на мероприятие'");
			Поле = "ДатаЗакрытияЗаписи";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;

	// Учебные группы
	
	Если ОбщегоНазначенияСУКлиентСервер.ЕстьСовпаденияВКоллекцииЗначений(УчебныеГруппы, "УчебнаяГруппа") Тогда
		Текст = НСтр("ru = 'Укажите различные учебные группы'");
		Поле = "УчебныеГруппы";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);			
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	
	Если НЕ ОткрытаяПрограмма Тогда
		ТребуетсяЗаявка = Ложь;
		УчебныеГруппы.Очистить();
	КонецЕсли;
	
	Если ОткрытоДляВсех Тогда
		УчебныеГруппы.Очистить();
	КонецЕсли;
	
	ДатаИзменения = ТекущаяДатаСеанса();
	
	ДополнительныеСвойства.Вставить("СоздатьАвтоматическуюРассылку", Ложь);
		
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ Проведен Тогда
		ДополнительныеСвойства.СоздатьАвтоматическуюРассылку = Истина;	
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И ОткрытаяПрограмма Тогда
		ДополнительныеСвойства.СоздатьАвтоматическуюРассылку = Истина;	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
 	
	Движения.ОткрытыеПрограммыОбученияСУО.Записывать  = Истина;
		
	Если Статус <> Перечисления.СтатусыПроведенияОбъектовСУО.Отменено Тогда
	
		// ОткрытоеОбучениеСУО
		
		Если ОткрытаяПрограмма Тогда
		
			ВозможныеУчастники = ПолучитьВозможныхУчастников();

			Для каждого Строка Из ВозможныеУчастники Цикл
			
				Движение = Движения.ОткрытыеПрограммыОбученияСУО.Добавить();
				
				Движение.Пользователь                = Строка.Пользователь;
				Движение.ПроведениеПрограммыОбучения = Ссылка;
				
				Движение.ДатаОткрытияЗаписи          = ДатаОткрытияЗаписи;
				Движение.ДатаЗакрытияЗаписи          = ДатаЗакрытияЗаписи;
				Движение.ТребуетсяЗаявка             = ТребуетсяЗаявка;
				Движение.ОткрытоДляРуководителей     = ОткрытоДляРуководителей;
			
			КонецЦикла;
		
		КонецЕсли;

	КонецЕсли;
		
	Движения.Записать();
	
	Если Статус <> Перечисления.СтатусыПроведенияОбъектовСУО.Отменено Тогда
				
		// Зачисляем пользователей на мероприятия программы обучения
		
		ЗачислитьПользователейНаОбучения();
		
		// Рассылки
		
		Если ДополнительныеСвойства.Свойство("СоздатьАвтоматическуюРассылку")
			И ДополнительныеСвойства.СоздатьАвтоматическуюРассылку Тогда
			
			ВозможныеУчастники = Неопределено;
			
			Если ОткрытаяПрограмма Тогда
				ВозможныеУчастники = ПолучитьВозможныхУчастников();
			КонецЕсли;
			
			УправлениеОбучениемСУО.СоздатьАвтоматическуюРассылку(ЭтотОбъект, ВозможныеУчастники);

		КонецЕсли;			
		
	КонецЕсли;
	
	ОбновитьПодчиненныеДокументы(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбновитьПодчиненныеДокументы(РежимЗаписиДокумента.ОтменаПроведения);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ОбновитьПодчиненныеДокументы(РежимЗаписи)
		
	ОбновлятьПодчиненныеДокументы = УправлениеОбучениемСУО.МожноОбновлятьПодчиненныеДокументы(ЭтотОбъект);
	ЭтоИнтерактивнаяЗапись = ДополнительныеСвойства.Свойство("ЭтоИнтерактивнаяЗапись") И ДополнительныеСвойства.ЭтоИнтерактивнаяЗапись;
	
	Запрос = Новый Запрос;
	
	Если ОбновлятьПодчиненныеДокументы Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПрохождениеПрограммыОбученияСУО.Ссылка
			|ИЗ
			|	Документ.ПрохождениеПрограммыОбученияСУО КАК ПрохождениеПрограммыОбученияСУО
			|ГДЕ
			|	ПрохождениеПрограммыОбученияСУО.ПометкаУдаления = ЛОЖЬ
			|	И ПрохождениеПрограммыОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения";
		
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПрохождениеПрограммыОбученияСУО.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПрохождениеПрограммыОбученияСУО КАК ПрохождениеПрограммыОбученияСУО
			|ГДЕ
			|	ПрохождениеПрограммыОбученияСУО.ПометкаУдаления = ЛОЖЬ
			|	И ПрохождениеПрограммыОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения
			|	И ПрохождениеПрограммыОбученияСУО.Проведен = ЛОЖЬ";		
		
	КонецЕсли;
		
	Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", Ссылка);

	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Для каждого Результат Из МассивРезультатов Цикл
	
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокументы(ВыборкаДетальныеЗаписи, РежимЗаписи, ЭтоИнтерактивнаяЗапись, 3, Ссылка);
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗачислитьПользователейНаОбучения()
	
	ТаблицаМероприятийПрограммыОбучения = Документы.ПроведениеПрограммыОбученияСУО.ПроведенияОбучения(Ссылка);
	ТаблицаУчастниковПрограммыОбучения  = Документы.ПроведениеПрограммыОбученияСУО.ПрохожденияПрограммыОбучения(Ссылка);
	МассивПроведенийОбучения = ТаблицаМероприятийПрограммыОбучения.ВыгрузитьКолонку("ПроведениеОбучения");
	ТаблицаПрохожденийОбучений = Документы.ПроведениеОбученияСУО.ПрохожденияОбучения(МассивПроведенийОбучения, Ложь);
	ЭтоИнтерактивнаяЗапись = ДополнительныеСвойства.Свойство("ЭтоИнтерактивнаяЗапись") И ДополнительныеСвойства.ЭтоИнтерактивнаяЗапись;
	
	Для каждого СтрокаУПО Из ТаблицаУчастниковПрограммыОбучения Цикл
		Для каждого СтрокаМПО Из ТаблицаМероприятийПрограммыОбучения Цикл
			Если НЕ СтрокаМПО.Проведен Тогда
				Продолжить;
			КонецЕсли;
			СтрокиТПО = ТаблицаПрохожденийОбучений.НайтиСтроки(Новый Структура("ПроведениеОбучения, Пользователь", СтрокаМПО.ПроведениеОбучения, СтрокаУПО.Пользователь));
			Если СтрокиТПО.Количество() = 0 Тогда
				УправлениеОбучениемСУО.ЗачислитьУчастникаНаОбучение(СтрокаМПО.ПроведениеОбучения,,СтрокаУПО.Пользователь,СтрокаУПО.УчебнаяГруппа,,,,,,ЭтоИнтерактивнаяЗапись,Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьВозможныхУчастников()
	
	Если ВозможныеУчастники = Неопределено Тогда
		Возврат Документы.ПроведениеПрограммыОбученияСУО.ВозможныеУчастникиПрограммыОбучения(Ссылка);
	Иначе
		Возврат ВозможныеУчастники;
	КонецЕсли;
	
КонецФункции

#КонецОбласти


#КонецЕсли