////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы библиотеки СтандартныеПодсистемы (БСП).
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Сведения о библиотеке (или конфигурации).

// Заполняет основные сведения о библиотеке или основной конфигурации.
// Библиотека, имя которой имя совпадает с именем конфигурации в метаданных, определяется как основная конфигурация.
// 
// Параметры:
//  Описание - Структура - сведения о библиотеке:
//
//   * Имя                 - Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//   * Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//   * ТребуемыеПодсистемы - Массив - имена других библиотек (Строка), от которых зависит данная библиотека.
//                                    Обработчики обновления таких библиотек должны быть вызваны ранее
//                                    обработчиков обновления данной библиотеки.
//                                    При циклических зависимостях или, напротив, отсутствии каких-либо зависимостей,
//                                    порядок вызова обработчиков обновления определяется порядком добавления модулей
//                                    в процедуре ПриДобавленииПодсистем общего модуля ПодсистемыКонфигурацииПереопределяемый.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя = Метаданные.Имя;;
	Описание.Версия = Метаданные.Версия;
	
	// Требуется библиотека стандартных подсистем.
	Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики обновления информационной базы.

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
//  Обработчики - ТаблицаЗначений - описание полей, см. в процедуре
//                ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.РежимВыполнения     = "Монопольно";
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	// Обработчики, выполняемые при каждом обновлении ИБ
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьЗаполнениеПредопределеннымиДанными";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.Приоритет = 2;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьЗаполнениеОбязательныхДанных";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.Приоритет = 1;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.1.50";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии30150";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.3.11";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии30311";	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.4.3";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии3043";	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.6.4";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии3064";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.7.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии3071";	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.7.23";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии30723";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.7.38";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии30738";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.7.52";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии30752";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.58";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии30958";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.62";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии30962";	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.85";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии30985";	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.101";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии309101";	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.103";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии309103";	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.110";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии309110";	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.121";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии309121";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.133";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии309133";	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.135";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии309135";	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.139";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии309139";	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.142";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии309142";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.148";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии309148";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.151";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии309151";	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.155";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии309155";		
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.10.5";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии30105";	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.10.34";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии301034";	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.10.36";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии301036";	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.11.6";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии30116";	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.11.16";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии301116";	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.11.36";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии301136";		
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.11.37";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии301137";		
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.11.82";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии301182";	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.11.87";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии301187";	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.11.93";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии301193";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.11.100";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии3011100";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.11.110";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии3011110";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.11.116";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии3011116";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.11.117";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии3011117";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.12.51";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии301251";	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.12.57";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии301257";	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.12.62";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии301262";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.12.70";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии301270";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.12.71";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии301271";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.12.82";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии301282";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.12.84";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии301284";		
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.12.87";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии301287";		
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.14.10";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУО.ВыполнитьОбновлениеДоВерсии301410";
		
	
КонецПроцедуры

// Вызывается перед процедурами-обработчиками обновления данных ИБ.
//
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
		
КонецПроцедуры

// Вызывается после завершения обновления данных ИБ.
// 
// Параметры:
//   ПредыдущаяВерсия       - Строка - версия до обновления. "0.0.0.0" для "пустой" ИБ.
//   ТекущаяВерсия          - Строка - версия после обновления.
//   ВыполненныеОбработчики - ДеревоЗначений - список выполненных процедур-обработчиков обновления,
//                                             сгруппированных по номеру версии.
//   ВыводитьОписаниеОбновлений - Булево - если установить Истина, то будет выведена форма
//                                с описанием обновлений. По умолчанию, Истина.
//                                Возвращаемое значение.
//   МонопольныйРежим           - Булево - Истина, если обновление выполнялось в монопольном режиме.
//
// Пример обхода выполненных обработчиков обновления:
//
//	Для Каждого Версия Из ВыполненныеОбработчики.Строки Цикл
//		
//		Если Версия.Версия = "*" Тогда
//			// Обработчик, который может выполнятся при каждой смене версии.
//		Иначе
//			// Обработчик, который выполняется для определенной версии.
//		КонецЕсли;
//		
//		Для Каждого Обработчик Из Версия.Строки Цикл
//			...
//		КонецЦикла;
//		
//	КонецЦикла;
//
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
		
	
		
		
КонецПроцедуры

// Вызывается при подготовке табличного документа с описанием изменений в программе.
//
// Параметры:
//   Макет - ТабличныйДокумент - описание обновления всех библиотек и конфигурации.
//           Макет можно дополнить или заменить.
//           См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры

Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
КонецПроцедуры

Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Вызывается при первоначальном заполнении информационной базы.
//
Процедура ВыполнитьЗаполнениеПредопределеннымиДанными(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт

	// Заполняем начальные данные СУО
	
	ДвоичныеДанные = ПолучитьОбщийМакет(Метаданные.ОбщиеМакеты.ДанныеНачальногоЗаполненияСУО);
	
	ПутьКВременномуФайлуXML = ПолучитьИмяВременногоФайла(".xml");
	
	ДвоичныеДанные.Записать(ПутьКВременномуФайлуXML);
	
	ЧтениеXML = Новый ЧтениеXML();
	ЧтениеXML.ОткрытьФайл(ПутьКВременномуФайлуXML);		
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Пока ВозможностьЧтенияXML(ЧтениеXML) Цикл 
			
			ТекущийОбъект = ПрочитатьXML(ЧтениеXML);
			ТекущийОбъект.ОбменДанными.Загрузка = Истина;
			ТекущийОбъект.Записать();
			
		КонецЦикла;	
		
	КонецЦикла;	
	
	ЧтениеXML.Закрыть();  		
	
	УдалитьФайлы(ПутьКВременномуФайлуXML);
	
	// Устанавливаем характеристики плана обмена по умолчанию
	
	ПланОбменаОбъект = ПланыОбмена.ОбменМатериаламиСУЗ.ЭтотУзел().ПолучитьОбъект();
	ПланОбменаОбъект.Код                 = ОбъектыСУЗ.ПолучитьПараметрыГлавногоУзла("Код");
	ПланОбменаОбъект.Наименование        = ОбъектыСУЗ.ПолучитьПараметрыГлавногоУзла("Наименование");
	ПланОбменаОбъект.ЭтоПакетДляЭкспорта = Истина;
	ПланОбменаОбъект.Записать();
	
	// Устанавливаем константы по умолчанию
	
	Константы.ИспользоватьАнкетирование.Установить(Ложь);
	Константы.ИспользоватьЗаметки.Установить(Ложь);
	Константы.ИспользоватьНапоминанияПользователя.Установить(Ложь);
	Константы.ПоказыватьУрокиПоРаботеСКонструкторомСУЗ.Установить(Истина);
	Константы.ИспользоватьЛичныйКабинетСУО.Установить(Истина);
	
	Если Найти(Метаданные.Имя, "ОбразовательнаяОрганизация") = 1 Тогда
		Константы.ИспользоватьДополнительныеРеквизитыИСведения.Установить(Ложь);
	КонецЕсли;
	
	// Создаем шаблон восстановления пароля
	
	ШаблонВосстановлениеПароля = Справочники.ШаблоныСообщенийСУО.ПолучитьСсылку(Новый УникальныйИдентификатор("e6998a38-dc31-11e7-a753-005056c00008"));
	
	Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ШаблонВосстановлениеПароля) Тогда		
		ШаблонВосстановлениеПароляОбъект = ШаблонВосстановлениеПароля.ПолучитьОбъект();
	Иначе
		ШаблонВосстановлениеПароляОбъект = Справочники.ШаблоныСообщенийСУО.СоздатьЭлемент();
		ШаблонВосстановлениеПароляОбъект.УстановитьСсылкуНового(ШаблонВосстановлениеПароля);
	КонецЕсли;
	
	ШаблонВосстановлениеПароляОбъект.ТипШаблона = Перечисления.ТипыШаблоновСообщенийСУО.АвтоматическаяРассылка;
	ШаблонВосстановлениеПароляОбъект.ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ВосстановлениеПароля;
	ШаблонВосстановлениеПароляОбъект.Наименование = НСтр("ru = 'Восстановление пароля'");
	ШаблонВосстановлениеПароляОбъект.Заголовок = НСтр("ru = 'Восстановление пароля'");
	
	НоваяСтрокаТЧ = ШаблонВосстановлениеПароляОбъект.Переменные.Добавить();
	НоваяСтрокаТЧ.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.АдресДляПерехода;
	
	НоваяСтрокаТЧ = ШаблонВосстановлениеПароляОбъект.Переменные.Добавить();
	НоваяСтрокаТЧ.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь;
	
	НоваяСтрокаТЧ = ШаблонВосстановлениеПароляОбъект.Переменные.Добавить();
	НоваяСтрокаТЧ.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КодПодтверждения;
	
	ТекстШаблонаПисьмаHTML = НСтр("ru = '
	   |<html>
       |<head>
       |<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"" />
       |<meta http-equiv=""X-UA-Compatible"" content=""IE=Edge"" />
       |<meta name=""format-detection"" content=""telephone=no"" />
       |<style type=""text/css"">
       |body{margin:0;padding:8px;}
       |p{line-height:1.15;margin:0;white-space:pre-wrap;}
       |ol,ul{margin-top:0;margin-bottom:0;}
       |img{border:none;}
       |li>p{display:inline;}
       |</style>
       |</head>
       |<body>
       |<p>Здравствуйте, {{Пользователь}}!</p>
       |<p>Ваш код восстановления пароля: {{КодПодтверждения}}</p>
       |<p>Для изменения пароля перейдите по <a href=""{{АдресДляПерехода}}"">ссылке</a>.</p>
       |</p>
       |</body>
       |</html>'");
	
	ФорматированныйДокумент = Новый ФорматированныйДокумент;
	ФорматированныйДокумент.УстановитьHTML(ТекстШаблонаПисьмаHTML, Новый Структура);
	
	ШаблонВосстановлениеПароляОбъект.ФорматированныйДокумент = Новый ХранилищеЗначения(ФорматированныйДокумент);
	
	ШаблонВосстановлениеПароляОбъект.Записать();
	
	// Группы доступа
	
	// ВебКабинетСлужебныйПользователь: 3968e7c4-03ab-11e5-be5c-f0def149b112
	// МенеджерПоОбучению: 06100792-4d41-45aa-9a9a-739afb00b846
	// Методист: e4d7e2de-ff80-40f0-9f9a-e13074abe599
	// Преподаватель: 6148c944-7e4e-4ace-96fd-3188b101609e
	// Учащийся: 825f1cde-de85-4b67-a4eb-55f17fa1e5cd

	МассивИдентификаторовПрофилей = Новый Массив;
	
	МассивИдентификаторовПрофилей.Добавить(Новый Структура("УникальныйИдентификатор, Наименование", Новый УникальныйИдентификатор("3968e7c4-03ab-11e5-be5c-f0def149b112"), НСтр("ru = 'Служебный пользователь веб-кабинета'")));
	МассивИдентификаторовПрофилей.Добавить(Новый Структура("УникальныйИдентификатор, Наименование", Новый УникальныйИдентификатор("06100792-4d41-45aa-9a9a-739afb00b846"), НСтр("ru = 'Менеджеры по обучению'")));
	МассивИдентификаторовПрофилей.Добавить(Новый Структура("УникальныйИдентификатор, Наименование", Новый УникальныйИдентификатор("e4d7e2de-ff80-40f0-9f9a-e13074abe599"), НСтр("ru = 'Методисты'")));
	МассивИдентификаторовПрофилей.Добавить(Новый Структура("УникальныйИдентификатор, Наименование", Новый УникальныйИдентификатор("6148c944-7e4e-4ace-96fd-3188b101609e"), НСтр("ru = 'Преподаватели'")));
	МассивИдентификаторовПрофилей.Добавить(Новый Структура("УникальныйИдентификатор, Наименование", Новый УникальныйИдентификатор("825f1cde-de85-4b67-a4eb-55f17fa1e5cd"), НСтр("ru = 'Обучающиеся'")));
	
	ГруппаПоУмолчаниюУстановлена = ЗначениеЗаполнено(Константы.ГруппаДоступаДляНовыхПользователейСУО.Получить());
	
	Для каждого СтруктураДанных Из МассивИдентификаторовПрофилей Цикл
	
		Профиль = Справочники.ПрофилиГруппДоступа.НайтиПоРеквизиту("ИдентификаторПоставляемыхДанных", СтруктураДанных.УникальныйИдентификатор);
		
		Если НЕ ЗначениеЗаполнено(Профиль) Тогда
			Продолжить;
		КонецЕсли;
		
		ГруппаДоступа = Справочники.ГруппыДоступа.НайтиПоРеквизиту("Профиль", Профиль);		
		
		Если НЕ ЗначениеЗаполнено(ГруппаДоступа) Тогда
			НоваяГруппа = Справочники.ГруппыДоступа.СоздатьЭлемент();
			НоваяГруппа.Наименование = Профиль.Наименование;
			НоваяГруппа.Профиль = Профиль;
			НоваяГруппа.Записать();
			ГруппаДоступа = НоваяГруппа.Ссылка;
		КонецЕсли;

		Если НЕ ГруппаПоУмолчаниюУстановлена
			И СтруктураДанных.УникальныйИдентификатор = МассивИдентификаторовПрофилей[4].УникальныйИдентификатор Тогда
			
			Константы.ГруппаДоступаДляНовыхПользователейСУО.Установить(ГруппаДоступа);
			
		КонецЕсли;		
				
	КонецЦикла;
	
	// Виды обучения
	
	Если Найти(Метаданные.Имя, "КорпоративныйУниверситет") = 1 Тогда		
		
		// Скрываем предопределенный
		
		ВидОбученияЭлектронноеОбучениеОбъект = Справочники.ВидыМероприятийСУО.НаОсновеЭлектронногоРесурса.ПолучитьОбъект();
		ВидОбученияЭлектронноеОбучениеОбъект.Скрыть = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВидОбученияЭлектронноеОбучениеОбъект);		
		
		// Создаем новый обычный
		
		ВидОбученияЭлектронноеОбучениеОбъект = Справочники.ВидыМероприятийСУО.СоздатьЭлемент();
		ВидОбученияЭлектронноеОбучениеОбъект.Электронное = Истина;
		ВидОбученияЭлектронноеОбучениеОбъект.ТребуетсяПреподаватель = Истина;
		ВидОбученияЭлектронноеОбучениеОбъект.ВыставляетсяОценка = Истина;
		ВидОбученияЭлектронноеОбучениеОбъект.ЗавершаетУчащийся = Истина;
		ВидОбученияЭлектронноеОбучениеОбъект.ПоказыватьРезультатыТестирования = Истина;
		ВидОбученияЭлектронноеОбучениеОбъект.ПоказыватьРезультатыТестированияПослеЗавершения = Истина;
		ВидОбученияЭлектронноеОбучениеОбъект.ПоказыватьОценкуВРезультатахТестирования = Истина;
		ВидОбученияЭлектронноеОбучениеОбъект.Наименование = НСтр("ru = 'Электронное обучение'");
		ВидОбученияЭлектронноеОбучениеОбъект.ВремяИзученияЭлектронныхКурсов = Перечисления.ВариантыОтображенияВремениИзученияЭлектронногоРесурсаСУО.НеПоказывать;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВидОбученияЭлектронноеОбучениеОбъект);
		
	КонецЕсли;

	// Виды контактной информации	
	
	УстановитьВидыКонтактнойИнформации();	
	
	// Веб-кабинет
	
	Константы.РедакцияВебКабинетаСУ.Установить(Перечисления.РедакцииВебКабинетаСУ.Редакция30);
	
КонецПроцедуры

Процедура ВыполнитьЗаполнениеОбязательныхДанных(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
		
	// Заполняем начальные данные СУЗ
	
	ПланыОбмена.ОбменМатериаламиСУЗ.ВыполнитьИмпортБазовогоПакетаДанныхСУЗ();
	
	// Устанавливаем обязательные константы
	
	// Примечание: константа всегда должна быть установлена в значение Истина,
	// Так как в противном случае не будет работать отчет ПрохожденияЭлектронныхРесурсовСУЗ
	
	Константы.ИспользоватьГруппыПользователей.Установить(Истина);
	
	УправлениеОбучениемСУО.УстановитьФункциональныйПрофиль();
		
	ОтправитьСтатистикуИспользования("Обновление");
	
КонецПроцедуры

Процедура УстановитьВидыКонтактнойИнформации()
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Другое");
	ПараметрыВида.Вид = "ДругаяИнформацияОрганизации";
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.Порядок = 2;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Адрес");
	ПараметрыВида.Вид = "ПочтовыйАдресОрганизации";
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.Порядок = 2;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Телефон");
	ПараметрыВида.Вид = "ТелефонОрганизации";
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.Порядок = 2;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Факс");
	ПараметрыВида.Вид = "ФаксОрганизации";
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.Порядок = 2;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Адрес");
	ПараметрыВида.Вид = "ФактАдресОрганизации";
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.Порядок = 2;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("АдресЭлектроннойПочты");
	ПараметрыВида.Вид = "EmailОрганизации";
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.Порядок = 2;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Адрес");
	ПараметрыВида.Вид = "ЮрАдресОрганизации";
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.Порядок = 2;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	
КонецПроцедуры

// Отправляет разработчику анонимную статистику использования продукта.
// Данная процедура не передает никакую персональную информацию.
// Она необходима, чтобы сделать продукт лучше.
// Пожалуйста, не модифицируйте данную процедуру.
// При необходимости отключите ее вызовы полностью,
// это не повлияет на функциональность продукта.
//
Процедура ОтправитьСтатистикуИспользования(ИмяСобытия) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВерсияФорматаДанных = "1";
	
	// Получаем данные для сохранения
	//
	
	СтруктураДанных = Новый Структура;
	
	// Событие
	
	СтруктураДанных.Вставить("Событие", Новый Структура("Дата, Имя, Версия", ТекущаяДатаСеанса(), ИмяСобытия, ВерсияФорматаДанных));
	
	// Конфигурация
	
	СтруктураДанных.Вставить("Конфигурация", Новый Структура("Имя, Версия", Метаданные.Имя, Метаданные.Версия));	
	
	// База
	
	СтруктураДанных.Вставить("База", Новый Структура);	
	
	СтруктураДанных.База.Вставить("ИдентификаторБазы", СтандартныеПодсистемыСервер.ИдентификаторИнформационнойБазы());
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	СтруктураДанных.База.Вставить("ФункциональныйПрофиль", Новый Структура);
	
	СтруктураДанных.База.ФункциональныйПрофиль.Вставить("Экзаменатор", ПолучитьФункциональнуюОпцию("ЭкзаменаторЭР"));
	СтруктураДанных.База.ФункциональныйПрофиль.Вставить("ПолныйИнтерфейс", ПолучитьФункциональнуюОпцию("ПолныйИнтерфейсСУО"));
	СтруктураДанных.База.ФункциональныйПрофиль.Вставить("ОбразовательнаяОрганизация", ПолучитьФункциональнуюОпцию("ОбразовательнаяОрганизацияОО"));
	
	//----------------------------------//
	
	СтруктураДанных.База.Вставить("ИнформационнаяБазаФайловая", ОбщегоНазначения.ИнформационнаяБазаФайловая());
	
	// Платформа и система
	
	СтруктураДанных.Вставить("Платформа", Новый Структура);
	
	СистемнаяИнформация = Новый СистемнаяИнформация();

	
	СтруктураДанных.Платформа.Вставить("ЭтоУчебнаяПлатформа", СтандартныеПодсистемыСервер.ЭтоУчебнаяПлатформа());
	СтруктураДанных.Платформа.Вставить("ВерсияОС", СистемнаяИнформация.ВерсияОС);
	СтруктураДанных.Платформа.Вставить("ВерсияПриложения", СистемнаяИнформация.ВерсияПриложения);
	СтруктураДанных.Платформа.Вставить("ИдентификаторКлиента", СистемнаяИнформация.ИдентификаторКлиента);
	СтруктураДанных.Платформа.Вставить("ИнформацияПрограммыПросмотра", СистемнаяИнформация.ИнформацияПрограммыПросмотра);
	СтруктураДанных.Платформа.Вставить("ОперативнаяПамять", СистемнаяИнформация.ОперативнаяПамять);
	СтруктураДанных.Платформа.Вставить("Процессор", СистемнаяИнформация.Процессор);
	СтруктураДанных.Платформа.Вставить("ТипПлатформы", СистемнаяИнформация.ТипПлатформы);
	
	// Веб-кабинет
	
	СтруктураДанных.Вставить("ВебКабинет", Неопределено);
	
	Если ВебКабинетСУ.Используется() Тогда
		
		СтруктураДанных.ВебКабинет = Новый Структура;
		
		ПубликацииВебКабинета = Новый Массив;		
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПубликацииВебКабинетаСУ.АдресВебСервера КАК Адрес,
			|	ПубликацииВебКабинетаСУ.РегистрационныйНомер КАК Номер
			|ИЗ
			|	Справочник.ПубликацииВебКабинетаСУ КАК ПубликацииВебКабинетаСУ";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ПубликацииВебКабинета.Добавить(Новый Структура("АдресВебСервера, РегистрационныйНомер", ВыборкаДетальныеЗаписи.Адрес, ВыборкаДетальныеЗаписи.Номер));
		КонецЦикла;
	
		СтруктураДанных.ВебКабинет.Вставить("Публикации", ПубликацииВебКабинета);
		
	КонецЕсли;	
	
	// Пользователь
	
	СтруктураДанных.Вставить("Пользователь", Неопределено);
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Если ЗначениеЗаполнено(ТекущийПользователь) Тогда
		
		СтруктураДанных.Пользователь = Новый Структура;
		
		СтруктураДанных.Пользователь.Вставить("Идентификатор", Пользователи.ТекущийПользователь().УникальныйИдентификатор());
		
		//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
		
		СтруктураДанных.Пользователь.Вставить("БазовыеРоли", Новый Массив);
		
		ПраваПользователя = ОбучениеСУОПовтИсп.СписокБазовыхПравПользователя();
		
		Для каждого Роль Из ПраваПользователя Цикл	
			СтруктураДанных.Пользователь.БазовыеРоли.Добавить(ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(Роль));	
		КонецЦикла;	

		//----------------------------------//		
		
	КонецЕсли;
	
	// Электронные ресурсы
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СводыЗнанийСУЗ.Ссылка) КАК Количество
		|ИЗ
		|	Справочник.СводыЗнанийСУЗ КАК СводыЗнанийСУЗ
		|ГДЕ
		|	СводыЗнанийСУЗ.ПометкаУдаления = ЛОЖЬ
		|	И СводыЗнанийСУЗ.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	СтруктураДанных.Вставить("ЭлектронныеРесурсы", Новый Структура);
	СтруктураДанных.ЭлектронныеРесурсы.Вставить("Количество", ВыборкаДетальныеЗаписи.Количество);
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	// Обучение
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПроведениеОбученияСУО.Ссылка) КАК Количество
		|ИЗ
		|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
		|ГДЕ
		|	ПроведениеОбученияСУО.ПометкаУдаления = ЛОЖЬ
		|	И ПроведениеОбученияСУО.Проведен = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	СтруктураДанных.Вставить("Обучение", Новый Структура);
	СтруктураДанных.Обучение.Вставить("КоличествоПроведений", ВыборкаДетальныеЗаписи.Количество);	
	
	//----------------------------------//
	
	// Отсылаем данные
	//
	
	СтруктураДанныхJSON = ОбщегоНазначенияСУ.ДанныеВJSON(СтруктураДанных);	
	
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI("https://sdo.1c.ru/conf/statistics/base/hs/put/data");	
	HTTPСоединение = Новый HTTPСоединение(СтруктураURI.Хост, СтруктураURI.Порт,,,, 10, Новый ЗащищенноеСоединениеOpenSSL()); 
		
	HTTPЗапрос = Новый HTTPЗапрос(СтруктураURI.ПутьНаСервере);
	HTTPЗапрос.УстановитьТелоИзСтроки(СтруктураДанныхJSON, КодировкаТекста.UTF8);
	
	Попытка
		ОтветСервера = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		// Не требуется
	КонецПопытки;	
	
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.1.50
// 
//
Процедура ВыполнитьОбновлениеДоВерсии30150() Экспорт
	
	// Заполняем начальные данные СУО (в прошлых версиях была ошибка с их отсутствием)
	//
	
	ДвоичныеДанные = ПолучитьОбщийМакет(Метаданные.ОбщиеМакеты.ДанныеНачальногоЗаполненияСУО);
	
	ПутьКВременномуФайлуXML = ПолучитьИмяВременногоФайла(".xml");
	
	ДвоичныеДанные.Записать(ПутьКВременномуФайлуXML);
	
	ЧтениеXML = Новый ЧтениеXML();
	ЧтениеXML.ОткрытьФайл(ПутьКВременномуФайлуXML);		
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Пока ВозможностьЧтенияXML(ЧтениеXML) Цикл 
			
			ТекущийОбъект = ПрочитатьXML(ЧтениеXML);
			ТекущийОбъект.ОбменДанными.Загрузка = Истина;
			ТекущийОбъект.Записать();
			
		КонецЦикла;	
		
	КонецЦикла;	
	
	ЧтениеXML.Закрыть();  		
	
	УдалитьФайлы(ПутьКВременномуФайлуXML);	
	
	// Устанавливаем реквизиты БезСценария и НаОсновеМероприятия
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроведениеОбученияСУО.Ссылка,
		|	ПроведениеОбученияСУО.НаОсновеЭлектронногоРесурса,
		|	ПроведениеОбученияСУО.НаОсновеМероприятия,
		|	ПроведениеОбученияСУО.БезСценария
		|ИЗ
		|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.НаОсновеЭлектронногоРесурса
			ИЛИ ВыборкаДетальныеЗаписи.НаОсновеМероприятия
			ИЛИ ВыборкаДетальныеЗаписи.БезСценария Тогда
			
			Продолжить; // Если хотя бы одно значение установлено, значит обновление было уже сделано ранее
			
		КонецЕсли;
		
		ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		ДокументОбъект.НаОсновеМероприятия = Истина;
		
		Попытка
			ДокументОбъект.Записать();
		Исключение
		КонецПопытки;

	КонецЦикла;
	
	// Устанавливаем статус документов ПроведениеМероприятияСУО (при обновлении с Экзаменатора)
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроведениеОбученияСУО.Ссылка
		|ИЗ
		|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО";

	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Для каждого Результат Из МассивРезультатов Цикл
	
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			
			Если ЗначениеЗаполнено(ДокументОбъект.Статус) Тогда
				Продолжить;
			КонецЕсли;
			
			ДокументОбъект.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Активно;
			
			Попытка
				ДокументОбъект.Записать();
			Исключение
			КонецПопытки;
			
		КонецЦикла;
	
	КонецЦикла;
	
	// Заполняем реквизит Сценарий для прохождений обучения и проведения обучения преподавателем.
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрохождениеОбученияСУО.Ссылка,
		|	ПрохождениеОбученияСУО.ПроведениеОбучения
		|ИЗ
		|	Документ.ПрохождениеОбученияСУО КАК ПрохождениеОбученияСУО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПроведениеПреподавателемОбученияСУО.Ссылка,
		|	ПроведениеПреподавателемОбученияСУО.ПроведениеОбучения
		|ИЗ
		|	Документ.ПроведениеПреподавателемОбученияСУО КАК ПроведениеПреподавателемОбученияСУО";

	МассивРезультатов = Запрос.ВыполнитьПакет(); // Выбираем все документы, а не только проведенные
	
	Для каждого Результат Из МассивРезультатов Цикл
	
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			
			Если ЗначениеЗаполнено(ДокументОбъект.Сценарий) Тогда
				Продолжить; // Если заполнено, то пропускаем
			КонецЕсли;
			
			ДокументОбъект.Сценарий = Документы.ПроведениеОбученияСУО.СценарийОбучения(ВыборкаДетальныеЗаписи.ПроведениеОбучения);
				
			РежимЗаписи = РежимЗаписиДокумента.Запись; // Будет проведен ниже
				
			Попытка
				ДокументОбъект.Записать(РежимЗаписи);
			Исключение
			КонецПопытки;
			
		КонецЦикла;
	
	КонецЦикла;	
	
	// Устанавливаем реквизит РодительскоеПроведение в документе проведения обучения преподавателем.
	// В редакции 2.0 была ошибка с тем, что при зачислении преподавателя не проставлялся этот реквизит.
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроведениеПреподавателемОбученияСУО.Ссылка,
		|	ПроведениеПреподавателемОбученияСУО.Проведен,
		|	ПроведениеПреподавателемОбученияСУО.ПроведениеОбучения,
		|	ПроведениеПреподавателемОбученияСУО.Сценарий КАК Мероприятие,
		|	ПроведениеПреподавателемОбученияСУО.Пользователь КАК Преподаватель,
		|	ПроведениеПреподавателемОбученияСУО.Сценарий.Владелец.Мероприятие КАК ОбщееМероприятие
		|ИЗ
		|	Документ.ПроведениеПреподавателемОбученияСУО КАК ПроведениеПреподавателемОбученияСУО
		|ГДЕ
		|	ПроведениеПреподавателемОбученияСУО.РодительскоеПроведение = ЗНАЧЕНИЕ(Документ.ПроведениеПреподавателемОбученияСУО.ПустаяСсылка)
		|	И ПроведениеПреподавателемОбученияСУО.Сценарий.Владелец.Предопределенный = ЛОЖЬ
		|	И ТИПЗНАЧЕНИЯ(ПроведениеПреподавателемОбученияСУО.Сценарий) = ТИП(Справочник.КаталогМероприятийСУО)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПроведениеПреподавателемОбученияОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		ПроведениеПреподавателемОбученияОбъект.РодительскоеПроведение = Документы.ПроведениеОбученияСУО.ПроведениеОбученияПреподавателем(ВыборкаДетальныеЗаписи.ПроведениеОбучения, ВыборкаДетальныеЗаписи.ОбщееМероприятие, ВыборкаДетальныеЗаписи.Преподаватель);
		
		Если ВыборкаДетальныеЗаписи.Проведен Тогда
			ПроведениеПреподавателемОбученияОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ПроведениеПреподавателемОбученияОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;		
		
	КонецЦикла;	
	
	// Устанавливаем реквизит ЗавершатьАвтоматически у вида обучения
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыМероприятийСУО.Ссылка
		|ИЗ
		|	Справочник.ВидыМероприятийСУО КАК ВидыМероприятийСУО
		|ГДЕ
		|	ВидыМероприятийСУО.ТребуетсяПреподаватель = ЛОЖЬ
		|	И ВидыМероприятийСУО.Электронное = ИСТИНА
		|	И ВидыМероприятийСУО.Общее = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ВидОбученияОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ВидОбученияОбъект.ЗавершатьАвтоматически = Истина;
		ВидОбученияОбъект.Записать();
		
	КонецЦикла;	
	
	// Перепроводим документы
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветНаВопросСУЗ.Ссылка
		|ИЗ
		|	Документ.ОтветНаВопросСУЗ КАК ОтветНаВопросСУЗ
		|ГДЕ
		|	ОтветНаВопросСУЗ.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПроведениеОбученияСУО.Ссылка
		|ИЗ
		|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
		|ГДЕ
		|	ПроведениеОбученияСУО.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПрохождениеОбученияСУО.Ссылка
		|ИЗ
		|	Документ.ПрохождениеОбученияСУО КАК ПрохождениеОбученияСУО
		|ГДЕ
		|	ПрохождениеОбученияСУО.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПроведениеПреподавателемОбученияСУО.Ссылка
		|ИЗ
		|	Документ.ПроведениеПреподавателемОбученияСУО КАК ПроведениеПреподавателемОбученияСУО
		|ГДЕ
		|	ПроведениеПреподавателемОбученияСУО.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СессияЭлектронногоРесурсаСУЗ.Ссылка
		|ИЗ
		|	Документ.СессияЭлектронногоРесурсаСУЗ КАК СессияЭлектронногоРесурсаСУЗ
		|ГДЕ
		|	СессияЭлектронногоРесурсаСУЗ.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПопыткаВыполненияПодборкиВопросовСУЗ.Ссылка
		|ИЗ
		|	Документ.ПопыткаВыполненияПодборкиВопросовСУЗ КАК ПопыткаВыполненияПодборкиВопросовСУЗ
		|ГДЕ
		|	ПопыткаВыполненияПодборкиВопросовСУЗ.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СообщениеСУО.Ссылка
		|ИЗ
		|	Документ.СообщениеСУО КАК СообщениеСУО
		|ГДЕ
		|	СообщениеСУО.Проведен = ИСТИНА";

	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Для каждого Результат Из МассивРезультатов Цикл
	
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
			
			Попытка
				ДокументОбъект.Записать(РежимЗаписи);
			Исключение
			КонецПопытки;
			
		КонецЦикла;
	
	КонецЦикла;
		
	// Устанавливаем предопределенные данные
	//
	
	ТаблицаЭлементов = Новый ТаблицаЗначений;
	ТаблицаЭлементов.Колонки.Добавить("ИмяСправочника");
	ТаблицаЭлементов.Колонки.Добавить("ИмяПредопределенныхДанных");
	ТаблицаЭлементов.Колонки.Добавить("Ссылка");

	// Ресурсы
	
	НоваяСтрока = ТаблицаЭлементов.Добавить();
	НоваяСтрока.ИмяСправочника = "РесурсыСУЗ";
	НоваяСтрока.ИмяПредопределенныхДанных = "Общие";
	НоваяСтрока.Ссылка = Справочники.РесурсыСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор("d695eaae-665f-490a-b848-e5869a31db78"));	
	
	НоваяСтрока = ТаблицаЭлементов.Добавить();
	НоваяСтрока.ИмяСправочника = "РесурсыСУЗ";
	НоваяСтрока.ИмяПредопределенныхДанных = "Служебные";
	НоваяСтрока.Ссылка = Справочники.РесурсыСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор("73368130-dc8b-4371-8a20-0889e28ab080"));
	
	НоваяСтрока = ТаблицаЭлементов.Добавить();
	НоваяСтрока.ИмяСправочника = "РесурсыСУЗ";
	НоваяСтрока.ИмяПредопределенныхДанных = "Модули";
	НоваяСтрока.Ссылка = Справочники.РесурсыСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор("2cbae7d8-3285-40c0-be45-4585f10a46f5"));
	
	НоваяСтрока = ТаблицаЭлементов.Добавить();
	НоваяСтрока.ИмяСправочника = "РесурсыСУЗ";
	НоваяСтрока.ИмяПредопределенныхДанных = "Общий";
	НоваяСтрока.Ссылка = Справочники.РесурсыСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор("7595ea2e-32f6-4c37-aec2-62f31d95026e"));
	
	НоваяСтрока = ТаблицаЭлементов.Добавить();
	НоваяСтрока.ИмяСправочника = "РесурсыСУЗ";
	НоваяСтрока.ИмяПредопределенныхДанных = "";  // Портал - Нет предопределенного
	НоваяСтрока.Ссылка = Справочники.РесурсыСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор("2e2b6a99-7a95-4e4e-8aa5-c767af226770"));
	
	НоваяСтрока = ТаблицаЭлементов.Добавить();
	НоваяСтрока.ИмяСправочника = "РесурсыСУЗ";
	НоваяСтрока.ИмяПредопределенныхДанных = ""; // Редактор - Нет предопределенного
	НоваяСтрока.Ссылка = Справочники.РесурсыСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор("cb2b57b4-5a59-4e36-bd22-f7e1a8934747"));
	
	// СводыЗнанийСУЗ
	
	НоваяСтрока = ТаблицаЭлементов.Добавить();
	НоваяСтрока.ИмяСправочника = "СводыЗнанийСУЗ";
	НоваяСтрока.ИмяПредопределенныхДанных = ""; // Нет предопределенного
	НоваяСтрока.Ссылка = Справочники.СводыЗнанийСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор("3a125a4b-57db-4283-b226-ec20ba1f9903"));	
	
	НоваяСтрока = ТаблицаЭлементов.Добавить();
	НоваяСтрока.ИмяСправочника = "СводыЗнанийСУЗ";
	НоваяСтрока.ИмяПредопределенныхДанных = ""; // Нет предопределенного
	НоваяСтрока.Ссылка = Справочники.СводыЗнанийСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор("b326f543-365f-47e2-993e-83a430d6e688"));		
	
	// СтраницыСУЗ
	
	НоваяСтрока = ТаблицаЭлементов.Добавить();
	НоваяСтрока.ИмяСправочника = "СтраницыСУЗ";
	НоваяСтрока.ИмяПредопределенныхДанных = "Общие";
	НоваяСтрока.Ссылка = Справочники.СтраницыСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор("9f2af56b-7f58-40e8-bc33-242b1a1c5f6c"));	
	
	// ШаблоныСУЗ
	
	НоваяСтрока = ТаблицаЭлементов.Добавить();
	НоваяСтрока.ИмяСправочника = "ШаблоныСУЗ";
	НоваяСтрока.ИмяПредопределенныхДанных = "ПредставлениеИнформации";
	НоваяСтрока.Ссылка = Справочники.ШаблоныСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор("775e8cfc-7b89-4e36-b666-6539a63c61b1"));	
	
	НоваяСтрока = ТаблицаЭлементов.Добавить();
	НоваяСтрока.ИмяСправочника = "ШаблоныСУЗ";
	НоваяСтрока.ИмяПредопределенныхДанных = "ВопросыПоУмолчанию";
	НоваяСтрока.Ссылка = Справочники.ШаблоныСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор("0fe1e975-8371-44a5-814c-05a4169fa4d2"));	
	
	НоваяСтрока = ТаблицаЭлементов.Добавить();
	НоваяСтрока.ИмяСправочника = "ШаблоныСУЗ";
	НоваяСтрока.ИмяПредопределенныхДанных = "ГлоссарииПоУмолчанию";
	НоваяСтрока.Ссылка = Справочники.ШаблоныСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор("8e132ce6-8fb1-4e03-9cea-c0ad03ef19c0"));	
	
	НоваяСтрока = ТаблицаЭлементов.Добавить();
	НоваяСтрока.ИмяСправочника = "ШаблоныСУЗ";
	НоваяСтрока.ИмяПредопределенныхДанных = "КартыПоУмолчанию";
	НоваяСтрока.Ссылка = Справочники.ШаблоныСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор("fb7bf3bd-6ef2-404c-b42b-a440aea94ed1"));	
	
	НоваяСтрока = ТаблицаЭлементов.Добавить();
	НоваяСтрока.ИмяСправочника = "ШаблоныСУЗ";
	НоваяСтрока.ИмяПредопределенныхДанных = "ПодборкиПоУмолчанию";
	НоваяСтрока.Ссылка = Справочники.ШаблоныСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор("82648ad6-0c45-48eb-9091-bc0c5ddf0102"));	
	
	НоваяСтрока = ТаблицаЭлементов.Добавить();
	НоваяСтрока.ИмяСправочника = "ШаблоныСУЗ";
	НоваяСтрока.ИмяПредопределенныхДанных = "РесурсыПоУмолчанию";
	НоваяСтрока.Ссылка = Справочники.ШаблоныСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор("d6fb55d6-401b-4fd9-8149-6f46d545fb41"));	
	
	НоваяСтрока = ТаблицаЭлементов.Добавить();
	НоваяСтрока.ИмяСправочника = "ШаблоныСУЗ";
	НоваяСтрока.ИмяПредопределенныхДанных = "СводыЗнанийПоУмолчанию";
	НоваяСтрока.Ссылка = Справочники.ШаблоныСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор("e35dc33a-658f-43ea-a5b5-4275b173a5d7"));	
	
	НоваяСтрока = ТаблицаЭлементов.Добавить();
	НоваяСтрока.ИмяСправочника = "ШаблоныСУЗ";
	НоваяСтрока.ИмяПредопределенныхДанных = "СтраницыПоУмолчанию";
	НоваяСтрока.Ссылка = Справочники.ШаблоныСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор("a6f80cfb-b558-4a3e-a204-28e5a6252c54"));	
	
	НоваяСтрока = ТаблицаЭлементов.Добавить();
	НоваяСтрока.ИмяСправочника = "ШаблоныСУЗ";
	НоваяСтрока.ИмяПредопределенныхДанных = "ТерминыПоУмолчанию";
	НоваяСтрока.Ссылка = Справочники.ШаблоныСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор("f746701f-d8b4-4aa9-ace7-cab3d68e11f5"));	
	
	НоваяСтрока = ТаблицаЭлементов.Добавить();
	НоваяСтрока.ИмяСправочника = "ШаблоныСУЗ";
	НоваяСтрока.ИмяПредопределенныхДанных = "ФайлыПоУмолчанию";
	НоваяСтрока.Ссылка = Справочники.ШаблоныСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор("cae4f256-377c-45e9-a2e8-b4c365141f56"));	
	
	НоваяСтрока = ТаблицаЭлементов.Добавить();
	НоваяСтрока.ИмяСправочника = "ШаблоныСУЗ";
	НоваяСтрока.ИмяПредопределенныхДанных = "ФреймыПоУмолчанию";
	НоваяСтрока.Ссылка = Справочники.ШаблоныСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор("987d7934-5677-411d-8afe-0bc0a9cd8265"));	
	
	// КартыСУЗ
	
	НоваяСтрока = ТаблицаЭлементов.Добавить();
	НоваяСтрока.ИмяСправочника = "КартыСУЗ";
	НоваяСтрока.ИмяПредопределенныхДанных = "АвтоКарта";
	НоваяСтрока.Ссылка = Справочники.КартыСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор("3d264ff6-6322-4f12-992d-13c79911ec61"));	
	
	// Виды обучения
	
	НоваяСтрока = ТаблицаЭлементов.Добавить();
	НоваяСтрока.ИмяСправочника = "ВидыМероприятийСУО";
	НоваяСтрока.ИмяПредопределенныхДанных = "НаОсновеЭлектронногоРесурса";
	НоваяСтрока.Ссылка = Справочники.ВидыМероприятийСУО.ПолучитьСсылку(Новый УникальныйИдентификатор("23baaad2-7492-11e4-8663-f0def149b112"));	
	
	// Записываем таблицу
	
	Для каждого СтрокаТаблица Из ТаблицаЭлементов Цикл
		
		Если НЕ ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(СтрокаТаблица.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблица.ИмяПредопределенныхДанных) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Справочник.Ссылка
				|ИЗ
				|	Справочник."+СтрокаТаблица.ИмяСправочника+" КАК Справочник
				|ГДЕ
				|	Справочник.Предопределенный = ИСТИНА
				|	И Справочник.ИмяПредопределенныхДанных = &ИмяПредопределенныхДанных";
				
			Запрос.Параметры.Вставить("ИмяПредопределенныхДанных", СтрокаТаблица.ИмяПредопределенныхДанных); 
				
			РезультатЗапроса = Запрос.Выполнить();
			
			Если НЕ РезультатЗапроса.Пустой() Тогда
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
			
		СправочникОбъект = СтрокаТаблица.Ссылка.ПолучитьОбъект();
	    СправочникОбъект.ИмяПредопределенныхДанных = СтрокаТаблица.ИмяПредопределенныхДанных;
		СправочникОбъект.Записать();
		
	КонецЦикла;
	
	// Переносим ТЧ ГруппыПодчиненныхЭлементов
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СводыЗнанийСУЗУдалитьГруппыПодчиненныхЭлементов.Группа,
		|	СводыЗнанийСУЗУдалитьГруппыПодчиненныхЭлементов.Ссылка
		|ИЗ
		|	Справочник.СводыЗнанийСУЗ.УдалитьГруппыПодчиненныхЭлементов КАК СводыЗнанийСУЗУдалитьГруппыПодчиненныхЭлементов
		|ГДЕ
		|	СводыЗнанийСУЗУдалитьГруппыПодчиненныхЭлементов.Ссылка.ЭтоГруппа = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодборкиСУЗУдалитьГруппыПодчиненныхЭлементов.Ссылка,
		|	ПодборкиСУЗУдалитьГруппыПодчиненныхЭлементов.Группа
		|ИЗ
		|	Справочник.ПодборкиСУЗ.УдалитьГруппыПодчиненныхЭлементов КАК ПодборкиСУЗУдалитьГруппыПодчиненныхЭлементов
		|ГДЕ
		|	ПодборкиСУЗУдалитьГруппыПодчиненныхЭлементов.Ссылка.ЭтоГруппа = ЛОЖЬ";
		
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Для каждого Результат Из МассивРезультатов Цикл
	
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Группа) Тогда
				Продолжить;
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.ГруппыОбъектовСУЗ.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.СсылкаНаОбъектСУЗ.Установить(ВыборкаДетальныеЗаписи.Ссылка);
			НаборЗаписей.Отбор.Группа.Установить(ВыборкаДетальныеЗаписи.Группа);
			
			НоваяЗапись = НаборЗаписей.Добавить();
			
			НоваяЗапись.СсылкаНаОбъектСУЗ = ВыборкаДетальныеЗаписи.Ссылка;
			НоваяЗапись.Группа = ВыборкаДетальныеЗаписи.Группа;
			
			НаборЗаписей.Записать();
			
		КонецЦикла;
	
	КонецЦикла;	
	
	// Удаляем настройки всех пользователей
	//
	
	ОчищаемыеНастройки = Новый Массив;
	ОчищаемыеНастройки.Добавить("НастройкиВнешнегоВида");
	ОчищаемыеНастройки.Добавить("ПерсональныеНастройки");
	ОчищаемыеНастройки.Добавить("ДанныеФорм");
	
	МассивПользователей = Новый Массив;
	ТаблицаПользователей = Новый ТаблицаЗначений;
	ТаблицаПользователей.Колонки.Добавить("Пользователь");
	ТаблицаПользователей = Обработки.НастройкиПользователей.ПользователиДляКопирования("", ТаблицаПользователей, Ложь);
	
	Для Каждого СтрокаТаблицы Из ТаблицаПользователей Цикл
		МассивПользователей.Добавить(СтрокаТаблицы.Пользователь);
	КонецЦикла;
	
	Обработки.НастройкиПользователей.УдалитьНастройкиПользователей(ОчищаемыеНастройки, МассивПользователей);	
	
	// Управление доступом
	
	МассивИдентификаторовГД = Новый Массив;
	МассивИдентификаторовГД.Добавить("01cfa992-bba3-4b59-9c9a-78d0785a6174");
	МассивИдентификаторовГД.Добавить("195355ea-89b9-4f9a-9557-99f10fb8a9a0");
	МассивИдентификаторовГД.Добавить("52b657ff-f6f7-4ecc-a54f-fb987c6ac30c");
	МассивИдентификаторовГД.Добавить("a179ec2c-c47e-4b9b-aeae-cd00fe934794");
	МассивИдентификаторовГД.Добавить("8a3f2a98-2cd9-47bb-9d10-7ba070412c9b");
	МассивИдентификаторовГД.Добавить("d86539f8-bfad-4c8c-8276-2cbc5979134c");
	МассивИдентификаторовГД.Добавить("3b014f3d-6771-4b7d-8702-38cb3311b8ee");
	МассивИдентификаторовГД.Добавить("af6a22bb-c4f0-4495-8fe4-69a842bfd500");
	МассивИдентификаторовГД.Добавить("49ded625-fb0a-43aa-8863-dfd300091043");
	МассивИдентификаторовГД.Добавить("c4e5188b-37de-4cff-bee5-c148764e67c2");
	МассивИдентификаторовГД.Добавить("f21dc82e-df1d-4dac-80dd-2707f3cc4771");
	МассивИдентификаторовГД.Добавить("cf286963-7643-4659-8424-0f94718c4aac");
	
	Для каждого ИдентификаторГД Из МассивИдентификаторовГД Цикл
	
		ГруппаДоступаСсылка = Справочники.ГруппыДоступа.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторГД));
		
		Если НЕ ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ГруппаДоступаСсылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ГруппаДоступаОбъект = ГруппаДоступаСсылка.ПолучитьОбъект();
		
		ГруппаДоступаОбъект.УстановитьПометкуУдаления(Ложь);		
		
		Если ИдентификаторГД = "a179ec2c-c47e-4b9b-aeae-cd00fe934794" Тогда // Менеджеры по обучению
			ГруппаДоступаОбъект.Профиль = Справочники.ПрофилиГруппДоступа.ПоставляемыйПрофильПоИдентификатору("06100792-4d41-45aa-9a9a-739afb00b846");
		КонецЕсли;
		
		Если ИдентификаторГД = "8a3f2a98-2cd9-47bb-9d10-7ba070412c9b" Тогда // Методисты 
			ГруппаДоступаОбъект.Профиль = Справочники.ПрофилиГруппДоступа.ПоставляемыйПрофильПоИдентификатору("e4d7e2de-ff80-40f0-9f9a-e13074abe599");
		КонецЕсли;
		
		Если ИдентификаторГД = "d86539f8-bfad-4c8c-8276-2cbc5979134c" Тогда // Преподаватели
			ГруппаДоступаОбъект.Профиль = Справочники.ПрофилиГруппДоступа.ПоставляемыйПрофильПоИдентификатору("6148c944-7e4e-4ace-96fd-3188b101609e");
		КонецЕсли;
		
		Если ИдентификаторГД = "3b014f3d-6771-4b7d-8702-38cb3311b8ee" Тогда // Руководитель 
			ГруппаДоступаОбъект.Профиль = Справочники.ПрофилиГруппДоступа.ПоставляемыйПрофильПоИдентификатору("825f1cde-de85-4b67-a4eb-55f17fa1e5cd");
		КонецЕсли;
		
		Если ИдентификаторГД = "af6a22bb-c4f0-4495-8fe4-69a842bfd500" Тогда // Учащиеся
			ГруппаДоступаОбъект.Профиль = Справочники.ПрофилиГруппДоступа.ПоставляемыйПрофильПоИдентификатору("825f1cde-de85-4b67-a4eb-55f17fa1e5cd");
		КонецЕсли;
		
		Если ИдентификаторГД = "49ded625-fb0a-43aa-8863-dfd300091043" Тогда // Методист образовательной организации
			ГруппаДоступаОбъект.Профиль = Справочники.ПрофилиГруппДоступа.ПоставляемыйПрофильПоИдентификатору("e4d7e2de-ff80-40f0-9f9a-e13074abe599");
		КонецЕсли;
		
		Если ИдентификаторГД = "c4e5188b-37de-4cff-bee5-c148764e67c2" Тогда // Организатор учебного процесса
			ГруппаДоступаОбъект.Профиль = Справочники.ПрофилиГруппДоступа.ПоставляемыйПрофильПоИдентификатору("06100792-4d41-45aa-9a9a-739afb00b846");
		КонецЕсли;
		
		Если ИдентификаторГД = "f21dc82e-df1d-4dac-80dd-2707f3cc4771" Тогда // Преподаватель образовательной организации
			ГруппаДоступаОбъект.Профиль = Справочники.ПрофилиГруппДоступа.ПоставляемыйПрофильПоИдентификатору("6148c944-7e4e-4ace-96fd-3188b101609e");
		КонецЕсли;
		
		Если ИдентификаторГД = "cf286963-7643-4659-8424-0f94718c4aac" Тогда // Студент
			ГруппаДоступаОбъект.Профиль = Справочники.ПрофилиГруппДоступа.ПоставляемыйПрофильПоИдентификатору("825f1cde-de85-4b67-a4eb-55f17fa1e5cd");
		КонецЕсли;
		
		ГруппаДоступаОбъект.Записать();
	
	КонецЦикла;
	
	МассивИдентификаторовПГД = Новый Массив;	
	МассивИдентификаторовПГД.Добавить("bce10f2d-ee64-4785-85fa-9ddb1ed094f3");
	МассивИдентификаторовПГД.Добавить("fab781ea-bde0-4b91-9c80-3e22775d4e86");
	МассивИдентификаторовПГД.Добавить("0b85dd05-cb44-4ba5-8e6f-8f8f53cd30c2");
	МассивИдентификаторовПГД.Добавить("06100792-4d41-45aa-9a9a-739afb00b846");
	МассивИдентификаторовПГД.Добавить("e4d7e2de-ff80-40f0-9f9a-e13074abe599");
	МассивИдентификаторовПГД.Добавить("6148c944-7e4e-4ace-96fd-3188b101609e");
	МассивИдентификаторовПГД.Добавить("d20b2b5a-979d-4e6a-b38e-600187beb670");
	МассивИдентификаторовПГД.Добавить("825f1cde-de85-4b67-a4eb-55f17fa1e5cd");
	МассивИдентификаторовПГД.Добавить("ce6e82e0-91f6-40a6-be7e-ac18cc35495e");
	МассивИдентификаторовПГД.Добавить("ac5fbb25-dfba-4f83-b490-be349ef6c48a");
	МассивИдентификаторовПГД.Добавить("2b368bba-9879-4a55-ac1e-c5829b28890c");
	МассивИдентификаторовПГД.Добавить("e54ba762-7026-4a46-b7c1-cba0e35da2cf");
	
	Для каждого ИдентификаторПГД Из МассивИдентификаторовПГД Цикл
	
		ПрофильГруппДоступаСсылка = Справочники.ПрофилиГруппДоступа.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторПГД));
		
		Если НЕ ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ПрофильГруппДоступаСсылка) Тогда
			Продолжить;
		КонецЕсли;		
		
		ПрофильГруппДоступаОбъект = ПрофильГруппДоступаСсылка.ПолучитьОбъект();
		
		Если НЕ ПрофильГруппДоступаОбъект.ЭтоГруппа Тогда
			ПрофильГруппДоступаОбъект.Роли.Очистить();
			ПрофильГруппДоступаОбъект.Записать();
		КонецЕсли;		
	
	КонецЦикла;
		
	РегистрыСведений.СоставыГруппПользователей.ОбновитьДанныеРегистра(Истина);
	

	
КонецПроцедуры

// Выполняет обновление до версии 3.0.3.11
// 
//
Процедура ВыполнитьОбновлениеДоВерсии30311() Экспорт

	// Удаляем настройки формы списка Электронных ресурсов для всех пользователей
	
	ХранилищеСистемныхНастроек.Удалить("Справочник.СводыЗнанийСУЗ.Форма.ФормаСписка/НастройкиФормы", Неопределено, Неопределено);
	
	// Устанавливаем константы
	
	Константы.ПоказыватьУрокиПоРаботеСКонструкторомСУЗ.Установить(Истина);
	
	// Обновляем оценки, так как алгоритм изменился
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрохождениеОбученияСУО.Ссылка
		|ИЗ
		|	Документ.ПрохождениеОбученияСУО КАК ПрохождениеОбученияСУО
		|ГДЕ
		|	ПрохождениеОбученияСУО.Проведен = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбучениеСУО.ПриПрохожденииМероприятия(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;	
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.4.3
// 
//
Процедура ВыполнитьОбновлениеДоВерсии3043() Экспорт
	
	// Устанавливаем константу МаксимальныйРазмерФайлаСУЗ
	
	МаксимальныйРазмерФайла = Константы.МаксимальныйРазмерФайлаСУЗ.Получить();
	
	Если ЗначениеЗаполнено(МаксимальныйРазмерФайла) Тогда
		МаксимальныйРазмерФайла = МаксимальныйРазмерФайла / 1048576; // Раньше было в байтах
	Иначе
		МаксимальныйРазмерФайла = 300;		
	КонецЕсли;
	
	Константы.МаксимальныйРазмерФайлаСУЗ.Установить(МаксимальныйРазмерФайла);	
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.5.1
// 
//
Процедура ВыполнитьОбновлениеДоВерсии3051() Экспорт
	
	// Меняем ссылки на страницах с элементов содержания на объекты и актуализируем справочник СсылкиОбъектовСУЗ
	
	МассивСтраниц = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеСтраницыСУЗ.ФорматированныйДокумент,
		|	ДанныеСтраницыСУЗ.СсылкаНаОбъектСУЗ,
		|	ДанныеСтраницыСУЗ.Поставщик,
		|	ДанныеСтраницыСУЗ.Версия,
		|	ДанныеСтраницыСУЗ.КодДанных,
		|	""ДанныеСтраницыСУЗ"" КАК ИмяРегистра
		|ИЗ
		|	РегистрСведений.ДанныеСтраницыСУЗ КАК ДанныеСтраницыСУЗ
		|ГДЕ
		|	ДанныеСтраницыСУЗ.КодДанных = ""ТекстСтраницы""";
	
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Для каждого Результат Из МассивРезультатов Цикл
	
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
			ФорматированныйДокумент = ВыборкаДетальныеЗаписи.ФорматированныйДокумент.Получить();
			
			// Делаем проверки
			
			Если ТипЗнч(ФорматированныйДокумент) <> Тип("ФорматированныйДокумент") Тогда
				Продолжить;
			КонецЕсли;	
			
			// Обрабатываем ссылки на в форматированном документе	
			
			ТекстHTML = "";
			Вложения = Неопределено;
			
			ФорматированныйДокумент.ПолучитьHTML(ТекстHTML, Вложения);		
			
			ЧтениеHTML = Новый ЧтениеHTML;
			ЧтениеHTML.УстановитьСтроку(ТекстHTML);
			
			ПостроительDOM = Новый ПостроительDOM;
			ДокументHTML = ПостроительDOM.Прочитать(ЧтениеHTML);
					
			Гиперссылки = ДокументHTML.ПолучитьЭлементыПоИмени("a");
			
			ОбновитьФорматированныйДокумент = Ложь;
			
			Для каждого ЭлементВебСсылки Из Гиперссылки Цикл
				
				// Получаем реквизиты ссылки
				
				ОбъектСУЗ = Неопределено;
				
				СтруктураСсылки = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(ЭлементВебСсылки.Гиперссылка);
				
				Действие = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "action");
				ИдентификаторОбъекта = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "id");
				ЦелевоеОкно = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "window");
				
				Если ЗначениеЗаполнено(Действие) И ЗначениеЗаполнено(ИдентификаторОбъекта) И Действие = "openKnowledgeBaseElementLink" Тогда
					
					ЭлементСодержания = Справочники.СодержаниеСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторОбъекта));
					
					Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ЭлементСодержания) Тогда				
						
						ОбновитьФорматированныйДокумент = Истина;
						
						ЭлементВебСсылки.Гиперссылка = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(ЭлементСодержания, ЦелевоеОкно);
						
					КонецЕсли;
					
				КонецЕсли;		
				
			КонецЦикла;
			
			Если ОбновитьФорматированныйДокумент Тогда
				
				ЗаписьHTML = Новый ЗаписьHTML;
				ЗаписьHTML.УстановитьСтроку();

				ЗаписьDOM = Новый ЗаписьDOM;
				ЗаписьDOM.Записать(ДокументHTML, ЗаписьHTML); 

				ТекстHTML = ЗаписьHTML.Закрыть();
				
				ФорматированныйДокумент.УстановитьHTML(ТекстHTML, Вложения);
				
		
				НаборЗаписей = РегистрыСведений[ВыборкаДетальныеЗаписи.ИмяРегистра].СоздатьНаборЗаписей();
				
				НаборЗаписей.Отбор.СсылкаНаОбъектСУЗ.Установить(ВыборкаДетальныеЗаписи.СсылкаНаОбъектСУЗ);
				НаборЗаписей.Отбор.Поставщик.Установить(ВыборкаДетальныеЗаписи.Поставщик);
				НаборЗаписей.Отбор.Версия.Установить(ВыборкаДетальныеЗаписи.Версия);
				НаборЗаписей.Отбор.КодДанных.Установить(ВыборкаДетальныеЗаписи.КодДанных);
				
				НаборЗаписей.Прочитать();
				
				НаборЗаписей[0].ФорматированныйДокумент = Новый ХранилищеЗначения(ФорматированныйДокумент);
				
				НаборЗаписей.Записать();
				
			КонецЕсли;		
			
			Если МассивСтраниц.Найти(ВыборкаДетальныеЗаписи.СсылкаНаОбъектСУЗ) = Неопределено Тогда
				МассивСтраниц.Добавить(ВыборкаДетальныеЗаписи.СсылкаНаОбъектСУЗ);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для каждого СсылкаНаСтраницу Из МассивСтраниц Цикл
		
		ФорматированныйДокумент = ОбъектыСУЗ.ПолучитьДанные(СсылкаНаСтраницу, "ТекстСтраницы", Истина, "ФорматированныйДокумент"); 

		Гиперссылки = ОбщегоНазначенияСУ.ГиперссылкиФорматированногоДокумента(ФорматированныйДокумент);
		
		РазработкаСУЗ.ОбновитьГиперссылкиОбъектаСУЗ(СсылкаНаСтраницу, Гиперссылки);
	
	КонецЦикла;
	
	// Обновляем гиперссылки ресурсов
	
	РазработкаСУЗ.ОбновитьГиперссылкиРесурса(); // Всех ресурсов
	
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.6.4
// 
//
Процедура ВыполнитьОбновлениеДоВерсии3064() Экспорт
	
	// Перепроводим документы
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветНаВопросСУЗ.Ссылка
		|ИЗ
		|	Документ.ОтветНаВопросСУЗ КАК ОтветНаВопросСУЗ
		|ГДЕ
		|	ОтветНаВопросСУЗ.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПрохождениеОбученияСУО.Ссылка
		|ИЗ
		|	Документ.ПрохождениеОбученияСУО КАК ПрохождениеОбученияСУО
		|ГДЕ
		|	ПрохождениеОбученияСУО.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СессияЭлектронногоРесурсаСУЗ.Ссылка
		|ИЗ
		|	Документ.СессияЭлектронногоРесурсаСУЗ КАК СессияЭлектронногоРесурсаСУЗ
		|ГДЕ
		|	СессияЭлектронногоРесурсаСУЗ.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПопыткаВыполненияАктивногоРесурсаSCORM.Ссылка
		|ИЗ
		|	Документ.ПопыткаВыполненияАктивногоРесурсаSCORM КАК ПопыткаВыполненияАктивногоРесурсаSCORM
		|ГДЕ
		|	ПопыткаВыполненияАктивногоРесурсаSCORM.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПопыткаВыполненияСтатичногоОбъектаСУЗ.Ссылка
		|ИЗ
		|	Документ.ПопыткаВыполненияСтатичногоОбъектаСУЗ КАК ПопыткаВыполненияСтатичногоОбъектаСУЗ
		|ГДЕ
		|	ПопыткаВыполненияСтатичногоОбъектаСУЗ.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПопыткаВыполненияПодборкиВопросовСУЗ.Ссылка
		|ИЗ
		|	Документ.ПопыткаВыполненияПодборкиВопросовСУЗ КАК ПопыткаВыполненияПодборкиВопросовСУЗ
		|ГДЕ
		|	ПопыткаВыполненияПодборкиВопросовСУЗ.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СессияЭлектронногоРесурсаСУЗ.Ссылка
		|ИЗ
		|	Документ.СессияЭлектронногоРесурсаСУЗ КАК СессияЭлектронногоРесурсаСУЗ
		|ГДЕ
		|	СессияЭлектронногоРесурсаСУЗ.Проведен = ИСТИНА";

	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Для каждого Результат Из МассивРезультатов Цикл
	
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
			
			Попытка
				ДокументОбъект.Записать(РежимЗаписи);
			Исключение
			КонецПопытки;
			
		КонецЦикла;
	
	КонецЦикла;
	
	// Обновляем индекс
	//
	
	ОбъектыСУЗ.ОбновитьДанныеДляИндексирования();
	
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.7.1
// 
//
Процедура ВыполнитьОбновлениеДоВерсии3071() Экспорт
	
	// Заполняем реквизит ЕдинственныйФайлРесурса	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РесурсыСУЗ.Ссылка
		|ИЗ
		|	Справочник.РесурсыСУЗ КАК РесурсыСУЗ
		|ГДЕ
		|	РесурсыСУЗ.ПометкаУдаления = ЛОЖЬ
		|	И РесурсыСУЗ.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ВладелецОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		ЕдинственныйФайлРесурса = Справочники.РесурсыСУЗ.ЕдинственныйФайлРесурса(ВыборкаДетальныеЗаписи.Ссылка);
		
		Если ЗначениеЗаполнено(ЕдинственныйФайлРесурса) Тогда
			ВладелецОбъект.ЕдинственныйФайл = ЕдинственныйФайлРесурса;
		Иначе
			ВладелецОбъект.ЕдинственныйФайл = Неопределено;
		КонецЕсли;
		
		ВладелецОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.7.23
// 
//
Процедура ВыполнитьОбновлениеДоВерсии30723() Экспорт
	
	// Заполняем переменные рассылок корректно
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РассылкаСообщенийСУО.Ссылка
		|ИЗ
		|	Документ.РассылкаСообщенийСУО КАК РассылкаСообщенийСУО
		|ГДЕ
		|	РассылкаСообщенийСУО.Проведен = ИСТИНА
		|	И РассылкаСообщенийСУО.Дата > &ДатаПоявленияОшибки";
	
	Запрос.УстановитьПараметр("ДатаПоявленияОшибки", Дата("20161110"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		ДокументОбъект.ЗаполнитьПеременные();
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;		
		
	КонецЦикла;

	
КонецПроцедуры

// Выполняет обновление до версии 3.0.7.38
//
Процедура ВыполнитьОбновлениеДоВерсии30738() Экспорт
	
	// Заменяем автора у прикрепленных к заданию файлов
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПопыткаВыполненияЗаданияСУОПрисоединенныеФайлы.Ссылка,
		|	ПопыткаВыполненияЗаданияСУОПрисоединенныеФайлы.ВладелецФайла
		|ИЗ
		|	Справочник.ПопыткаВыполненияЗаданияСУОПрисоединенныеФайлы КАК ПопыткаВыполненияЗаданияСУОПрисоединенныеФайлы";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НовыйАвтор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальныеЗаписи.ВладелецФайла, "ПрохождениеОбучения.Пользователь");
		
		ФайлОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ФайлОбъект.Автор = НовыйАвтор;
		ФайлОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.7.52
//
Процедура ВыполнитьОбновлениеДоВерсии30752() Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка,
		|	Пользователи.Комментарий
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Комментарий) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураКомментария = Неопределено;
		
		Попытка
			СтруктураКомментария = ОбщегоНазначенияСУ.JSONВДанные(ВыборкаДетальныеЗаписи.Комментарий);
		Исключение
		КонецПопытки;
		
		Если ТипЗнч(СтруктураКомментария) <> Тип("Структура")
			ИЛИ НЕ СтруктураКомментария.Свойство("userData") Тогда
			Продолжить;
		КонецЕсли;		
		
		ПользовательОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ПользовательОбъект.Комментарий = ""; // Удаляем комментарий
		ПользовательОбъект.ОбменДанными.Загрузка = Истина;
		ПользовательОбъект.Записать();
			
	КонецЦикла;	

	
КонецПроцедуры

// Выполняет обновление до версии 3.0.9.58
//
Процедура ВыполнитьОбновлениеДоВерсии30958() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПолучитьФункциональнуюОпцию("ПолныйИнтерфейсСУО") Тогда
		Константы.РасширеннаяФункциональностьСУО.Установить(Истина);		
	Иначе
		Константы.РасширеннаяФункциональностьСУО.Установить(Ложь);		
	КонецЕсли;	
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.9.62
//
Процедура ВыполнитьОбновлениеДоВерсии30962() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ВидОбученияЭлектронноеОбучениеОбъект = Справочники.ВидыМероприятийСУО.НаОсновеЭлектронногоРесурса.ПолучитьОбъект();
	Исключение
	    ЗаписьЖурналаРегистрации(ОбщегоНазначенияСУКлиентСервер.СобытиеЖурналаРегистрацииЭлектронныхКурсов(), УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;	
	
	ВидОбученияЭлектронноеОбучениеОбъект.ПоказыватьРезультатыТестирования = Истина;
	ВидОбученияЭлектронноеОбучениеОбъект.ПоказыватьОценкуВРезультатахТестирования = Истина;
	ВидОбученияЭлектронноеОбучениеОбъект.ЗакрытьДоступКМатериаламПослеЗавершения = Истина;
	ВидОбученияЭлектронноеОбучениеОбъект.ОбменДанными.Загрузка = Истина;
	ВидОбученияЭлектронноеОбучениеОбъект.Записать();				
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.9.85
//
Процедура ВыполнитьОбновлениеДоВерсии30985() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ШкалаНеОценивается = Справочники.ШкалыОценокСУО.ПолучитьСсылку(Новый УникальныйИдентификатор("e127fba9-b63b-11e6-9008-8ca9823f12e0"));		
	
	Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ШкалаНеОценивается, Ложь) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ШкалыОценокСУО.Ссылка
			|ИЗ
			|	Справочник.ШкалыОценокСУО КАК ШкалыОценокСУО
			|ГДЕ
			|	ШкалыОценокСУО.ИмяПредопределенныхДанных = &ИмяПредопределенныхДанных";
		
		Запрос.УстановитьПараметр("ИмяПредопределенныхДанных", "НеОценивается");
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() И НЕ ЗначениеЗаполнено(ШкалаНеОценивается.ИмяПредопределенныхДанных) Тогда
			ШкалаНеОцениваетсяОбъект = ШкалаНеОценивается.ПолучитьОбъект();
			ШкалаНеОцениваетсяОбъект.ИмяПредопределенныхДанных = "НеОценивается";
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ШкалаНеОцениваетсяОбъект);
		КонецЕсли;
		
	Иначе
		
		ШкалаНеОцениваетсяОбъект = Справочники.ШкалыОценокСУО.СоздатьЭлемент();
		ШкалаНеОцениваетсяОбъект.УстановитьСсылкуНового(ШкалаНеОценивается);
		
		ШкалаНеОцениваетсяОбъект.ИмяПредопределенныхДанных = "НеОценивается";
		ШкалаНеОцениваетсяОбъект.Наименование = НСтр("ru = 'Не оценивается'");
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ШкалаНеОцениваетсяОбъект);
		
		ОценкаСсылка = Справочники.ЭлементыШкалыОценокСУО.ПолучитьСсылку(Новый УникальныйИдентификатор("e7e7ae95-b63b-11e6-9008-8ca9823f12e0"));
		
		Если НЕ ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ОценкаСсылка, Ложь) Тогда
			ОценкаОбъект = Справочники.ЭлементыШкалыОценокСУО.СоздатьЭлемент();
			ОценкаОбъект.УстановитьСсылкуНового(ОценкаСсылка);
			ОценкаОбъект.Владелец = ШкалаНеОценивается;
			ОценкаОбъект.Наименование = НСтр("ru = 'Зачет'");
			
			Для ЗначениеБалла = 0 По 100 Цикл
			
				НоваяСтрокаТЧ = ОценкаОбъект.ЗначенияБаллов.Добавить();
				НоваяСтрокаТЧ.Значение = ЗначениеБалла;
			
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОценкаОбъект);
			
		КонецЕсли;
		
		
	КонецЕсли;
	
	
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.9.101
//
Процедура ВыполнитьОбновлениеДоВерсии309101() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныСертификатовСУО.Ссылка,
		|	ШаблоныСертификатовСУО.Текст
		|ИЗ
		|	Справочник.ШаблоныСертификатовСУО КАК ШаблоныСертификатовСУО
		|ГДЕ
		|	ШаблоныСертификатовСУО.ФорматHTML = ЛОЖЬ
		|	И ШаблоныСертификатовСУО.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(СокрЛП(ВыборкаДетальныеЗаписи.Текст)) Тогда
			Продолжить;
		КонецЕсли;
		СертификатОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		СертификатОбъект.ФорматHTML = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(СертификатОбъект);
	КонецЦикла;
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.9.103
//
Процедура ВыполнитьОбновлениеДоВерсии309103() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФотографииПользователейСУО.Пользователь
		|ИЗ
		|	РегистрСведений.ФотографииПользователейСУО КАК ФотографииПользователейСУО";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ФотографииПользователейСУО.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Пользователь.Установить(ВыборкаДетальныеЗаписи.Пользователь); 

		НаборЗаписей.Прочитать();

		НоваяЗапись = НаборЗаписей[0]; 
		НоваяЗапись.ЕстьАватар = ?(НоваяЗапись.Аватар.Получить() = Неопределено, Ложь, Истина); 
		НаборЗаписей.Записать(); 
		
	КонецЦикла;			
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.9.110
//
Процедура ВыполнитьОбновлениеДоВерсии309110() Экспорт

	УстановитьВидыКонтактнойИнформации();
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.9.121
//
Процедура ВыполнитьОбновлениеДоВерсии309121() Экспорт

	// Перепроводим документы для заполнения реквизита Задание
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПопыткаВыполненияАктивногоРесурсаSCORM.Ссылка,
		|	ПопыткаВыполненияАктивногоРесурсаSCORM.СводЗнаний КАК ЭлектронныйРесурс,
		|	ПопыткаВыполненияАктивногоРесурсаSCORM.ПрохождениеОбучения,
		|	ПопыткаВыполненияАктивногоРесурсаSCORM.Задание
		|ИЗ
		|	Документ.ПопыткаВыполненияАктивногоРесурсаSCORM КАК ПопыткаВыполненияАктивногоРесурсаSCORM
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПопыткаВыполненияСтатичногоОбъектаСУЗ.Ссылка,
		|	ПопыткаВыполненияСтатичногоОбъектаСУЗ.СводЗнаний КАК ЭлектронныйРесурс,
		|	ПопыткаВыполненияСтатичногоОбъектаСУЗ.Задание,
		|	ПопыткаВыполненияСтатичногоОбъектаСУЗ.ПрохождениеОбучения
		|ИЗ
		|	Документ.ПопыткаВыполненияСтатичногоОбъектаСУЗ КАК ПопыткаВыполненияСтатичногоОбъектаСУЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПопыткаВыполненияПодборкиВопросовСУЗ.Ссылка,
		|	ПопыткаВыполненияПодборкиВопросовСУЗ.ПрохождениеОбучения,
		|	ПопыткаВыполненияПодборкиВопросовСУЗ.Задание,
		|	ПопыткаВыполненияПодборкиВопросовСУЗ.СводЗнаний КАК ЭлектронныйРесурс
		|ИЗ
		|	Документ.ПопыткаВыполненияПодборкиВопросовСУЗ КАК ПопыткаВыполненияПодборкиВопросовСУЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СессияЭлектронногоРесурсаСУЗ.Ссылка,
		|	СессияЭлектронногоРесурсаСУЗ.ЭлектронныйРесурс,
		|	СессияЭлектронногоРесурсаСУЗ.ПрохождениеОбучения,
		|	СессияЭлектронногоРесурсаСУЗ.Задание
		|ИЗ
		|	Документ.СессияЭлектронногоРесурсаСУЗ КАК СессияЭлектронногоРесурсаСУЗ";

	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Для каждого Результат Из МассивРезультатов Цикл	
		ВыборкаДетальныеЗаписи = Результат.Выбрать();		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЗаданиеПравильное = ОбъектыСУЗ.ЗаданиеПопытки(ВыборкаДетальныеЗаписи.ПрохождениеОбучения, ВыборкаДетальныеЗаписи.ЭлектронныйРесурс, ВыборкаДетальныеЗаписи.Задание);
			Если ВыборкаДетальныеЗаписи.Задание <> ЗаданиеПравильное Тогда
				ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				ДокументОбъект.Задание = ЗаданиеПравильное;
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);			
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;		
	
	// Перепроводим документы для заполнения реквизита Задание
	// Примечание: еще требуется обновить документы ПрохождениеОбученияСУО,
	// но они будут обновлены в обработчике ВыполнитьОбновлениеДоВерсии309133
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПопыткаВыполненияАктивногоРесурсаSCORM.Ссылка,
		|	1 КАК Важность
		|ИЗ
		|	Документ.ПопыткаВыполненияАктивногоРесурсаSCORM КАК ПопыткаВыполненияАктивногоРесурсаSCORM
		|ГДЕ
		|	ПопыткаВыполненияАктивногоРесурсаSCORM.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПопыткаВыполненияСтатичногоОбъектаСУЗ.Ссылка,
		|	1 КАК Важность
		|ИЗ
		|	Документ.ПопыткаВыполненияСтатичногоОбъектаСУЗ КАК ПопыткаВыполненияСтатичногоОбъектаСУЗ
		|ГДЕ
		|	ПопыткаВыполненияСтатичногоОбъектаСУЗ.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПопыткаВыполненияПодборкиВопросовСУЗ.Ссылка,
		|	1 КАК Важность
		|ИЗ
		|	Документ.ПопыткаВыполненияПодборкиВопросовСУЗ КАК ПопыткаВыполненияПодборкиВопросовСУЗ
		|ГДЕ
		|	ПопыткаВыполненияПодборкиВопросовСУЗ.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СессияЭлектронногоРесурсаСУЗ.Ссылка,
		|	2 КАК Важность
		|ИЗ
		|	Документ.СессияЭлектронногоРесурсаСУЗ КАК СессияЭлектронногоРесурсаСУЗ
		|ГДЕ
		|	СессияЭлектронногоРесурсаСУЗ.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтветНаВопросСУЗ.Ссылка,
		|	1 КАК Важность
		|ИЗ
		|	Документ.ОтветНаВопросСУЗ КАК ОтветНаВопросСУЗ
		|ГДЕ
		|	ОтветНаВопросСУЗ.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПроведениеПреподавателемОбученияСУО.Ссылка,
		|	1 КАК Важность
		|ИЗ
		|	Документ.ПроведениеПреподавателемОбученияСУО КАК ПроведениеПреподавателемОбученияСУО
		|ГДЕ
		|	ПроведениеПреподавателемОбученияСУО.Проведен = ИСТИНА
		|	И ПроведениеПреподавателемОбученияСУО.Проведено = ЛОЖЬ";

	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Для каждого Результат Из МассивРезультатов Цикл	
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(
				ВыборкаДетальныеЗаписи.Ссылка, РежимЗаписиДокумента.Проведение, Ложь, 0, ВыборкаДетальныеЗаписи.Важность);
		КонецЦикла;	
	КонецЦикла;	
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.9.133
//
Процедура ВыполнитьОбновлениеДоВерсии309133() Экспорт
	
	// Перепроводим документы для заполнения реквизита СтатусПроцессаОбучения
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрохождениеОбученияСУО.Ссылка,
		|	ВЫБОР
		|		КОГДА ПрохождениеОбученияСУО.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПроцессаОбученияСУО.Активно)
		|				ИЛИ ПрохождениеОбученияСУО.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПроцессаОбученияСУО.Новое)
		|			ТОГДА 2
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Важность
		|ИЗ
		|	Документ.ПрохождениеОбученияСУО КАК ПрохождениеОбученияСУО
		|ГДЕ
		|	ПрохождениеОбученияСУО.Проведен = ИСТИНА";

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(
			ВыборкаДетальныеЗаписи.Ссылка, РежимЗаписиДокумента.Проведение, Ложь, 0, ВыборкаДетальныеЗаписи.Важность);
	КонецЦикла;
		
КонецПроцедуры

// Выполняет обновление до версии 3.0.9.135
//
Процедура ВыполнитьОбновлениеДоВерсии309135() Экспорт
	
	// Перепроводим документы для заполнения реквизита СтатусПроцессаОбучения
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПопыткаВыполненияЗаданияСУО.Ссылка
		|ИЗ
		|	Документ.ПопыткаВыполненияЗаданияСУО КАК ПопыткаВыполненияЗаданияСУО
		|ГДЕ
		|	ПопыткаВыполненияЗаданияСУО.Проведен = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(
			ВыборкаДетальныеЗаписи.Ссылка, РежимЗаписиДокумента.Проведение, Ложь, 0, 1);
	КонецЦикла;
		
КонецПроцедуры

// Выполняет обновление до версии 3.0.9.139
//
Процедура ВыполнитьОбновлениеДоВерсии309139() Экспорт
	
	// Исправляем стобалльную шкалу с пропущенной цифрой 9
	
	ДвоичныеДанные = ПолучитьОбщийМакет(Метаданные.ОбщиеМакеты.ДанныеНачальногоЗаполненияСУО);
	
	ПутьКВременномуФайлуXML = ПолучитьИмяВременногоФайла(".xml");
	
	ДвоичныеДанные.Записать(ПутьКВременномуФайлуXML);
	
	ЧтениеXML = Новый ЧтениеXML();
	ЧтениеXML.ОткрытьФайл(ПутьКВременномуФайлуXML);		
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Пока ВозможностьЧтенияXML(ЧтениеXML) Цикл 
			
			ТекущийОбъект = ПрочитатьXML(ЧтениеXML);
			
			Если ТипЗнч(ТекущийОбъект) = Тип("СправочникОбъект.ЭлементыШкалыОценокСУО") Тогда			
				ТекущийОбъект.ОбменДанными.Загрузка = Истина;
				ТекущийОбъект.Записать();
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЦикла;	
	
	ЧтениеXML.Закрыть();  		
	
	УдалитьФайлы(ПутьКВременномуФайлуXML);
		
КонецПроцедуры

// Выполняет обновление до версии 3.0.9.142
//
Процедура ВыполнитьОбновлениеДоВерсии309142() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПроведениеОбученияЭЗ.Ссылка КАК ПроведениеОбучения
		|ИЗ
		|	Документ.ПроведениеОбученияСУО.ЭлектронныеЗадания КАК ПроведениеОбученияЭЗ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПроведениеОбученияОбъект = ВыборкаДетальныеЗаписи.ПроведениеОбучения.ПолучитьОбъект();
		ЕстьВесБольшеНуля = Ложь;
		
		Для каждого СтрокаТЧ Из ПроведениеОбученияОбъект.ЭлектронныеЗадания Цикл		
			Если СтрокаТЧ.Вес > 0 Тогда
				ЕстьВесБольшеНуля = Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если ЕстьВесБольшеНуля Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого СтрокаТЧ Из ПроведениеОбученияОбъект.ЭлектронныеЗадания Цикл
			СтрокаТЧ.Вес = 1;
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ПроведениеОбученияОбъект);
		
	КонецЦикла;	
	
	// Перепроводим документы для заполнения реквизита ПроходнойБалл
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПопыткаВыполненияЗаданияСУО.Ссылка
		|ИЗ
		|	Документ.ПопыткаВыполненияЗаданияСУО КАК ПопыткаВыполненияЗаданияСУО
		|ГДЕ
		|	ПопыткаВыполненияЗаданияСУО.Проведен = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(
			ВыборкаДетальныеЗаписи.Ссылка, РежимЗаписиДокумента.Проведение, Ложь, 0, 1);
	КонецЦикла;
	
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.9.148
//
Процедура ВыполнитьОбновлениеДоВерсии309148() Экспорт
	
	// Заполняем реквизит ПродолжительностьДоступаВДнях
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерииПинКодовСУО.Ссылка
		|ИЗ
		|	Справочник.СерииПинКодовСУО КАК СерииПинКодовСУО
		|ГДЕ
		|	СерииПинКодовСУО.ЭтоГруппа = ЛОЖЬ
		|	И СерииПинКодовСУО.ПродолжительностьДоступаВДнях = 0
		|	И СерииПинКодовСУО.УдалитьПродолжительностьДоступаВСекундах > 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СерияОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		СерияОбъект.ПродолжительностьДоступаВДнях = Окр(СерияОбъект.УдалитьПродолжительностьДоступаВСекундах / 60 / 60 / 24, 0, РежимОкругления.Окр15как20);
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(СерияОбъект);
	КонецЦикла;
		
КонецПроцедуры

// Выполняет обновление до версии 3.0.9.151
//
Процедура ВыполнитьОбновлениеДоВерсии309151() Экспорт
		
	// Устанавливаем ФО ИспользоватьПинКодыСУО через ФО ИспользоватьВебКабинетСУ
	
	УстановитьПривилегированныйРежим(Истина);
	Константы.ИспользоватьВебКабинетСУ.Установить(Константы.ИспользоватьВебКабинетСУ.Получить());
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.9.155
//
Процедура ВыполнитьОбновлениеДоВерсии309155() Экспорт
	
	// Удаляем дубли документов ПопыткаВыполненияЗаданияСУО, которые возникли
	// из-за того, что для обучений у которых есть только один один электронный
	// ресурс или созданное на основе электронного ресурса не заполнялась таблица
	// заданий при проведении документа ПопыткаВыполненияЗаданияСУО. Это приводило
	// к отсутствию движений, а значит документ создавался каждый раз, как только
	// пользователь начинал изучать электронный курс.
	
	// Ищем все попытки выполнения заданий у которых заполнен реквизит ЭлектронныйРесурс
	// проведения обучения. Отбираем те, число которых больше 1 для каждого прохождения обучения.
	// Далее отбираем все документы ПопыткаВыполненияЗаданияСУО этих прохождений обучений.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПопыткаВыполненияЗаданияСУО.ПрохождениеОбучения,
		|	КОЛИЧЕСТВО(ПопыткаВыполненияЗаданияСУО.Ссылка) КАК КоличествоДокументов
		|ПОМЕСТИТЬ Дубли
		|ИЗ
		|	Документ.ПопыткаВыполненияЗаданияСУО КАК ПопыткаВыполненияЗаданияСУО
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ПопыткаВыполненияЗаданияСУО.Задание) = ТИП(Справочник.СводыЗнанийСУЗ)
		|	И ПопыткаВыполненияЗаданияСУО.Задание = ПопыткаВыполненияЗаданияСУО.ПроведениеОбучения.ЭлектронныйРесурс
		|	И ПопыткаВыполненияЗаданияСУО.ПометкаУдаления = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	ПопыткаВыполненияЗаданияСУО.ПрохождениеОбучения
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(ПопыткаВыполненияЗаданияСУО.Ссылка) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПопыткаВыполненияЗаданияСУО.Ссылка,
		|	ПопыткаВыполненияЗаданияСУО.ПрохождениеОбучения КАК ПрохождениеОбучения,
		|	ПопыткаВыполненияЗаданияСУО.Дата КАК Дата
		|ИЗ
		|	Дубли КАК Дубли
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПопыткаВыполненияЗаданияСУО КАК ПопыткаВыполненияЗаданияСУО
		|		ПО (ПопыткаВыполненияЗаданияСУО.ПрохождениеОбучения = Дубли.ПрохождениеОбучения)
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ПопыткаВыполненияЗаданияСУО.Задание) = ТИП(Справочник.СводыЗнанийСУЗ)
		|	И ПопыткаВыполненияЗаданияСУО.Задание = ПопыткаВыполненияЗаданияСУО.ПроведениеОбучения.ЭлектронныйРесурс
		|	И ПопыткаВыполненияЗаданияСУО.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПрохождениеОбучения,
		|	Дата УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТекущееПрохождениеОбучения = Неопределено;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.ПрохождениеОбучения <> ТекущееПрохождениеОбучения Тогда
			ТекущееПрохождениеОбучения = ВыборкаДетальныеЗаписи.ПрохождениеОбучения;
			РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(ВыборкаДетальныеЗаписи.Ссылка, РежимЗаписиДокумента.Проведение, Ложь,,0);
			Продолжить; // Пропускаем последнюю попытку
		КонецЕсли;
		
		ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ДокументОбъект.УстановитьПометкуУдаления(Истина);
		
	КонецЦикла;	
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.10.5
//
Процедура ВыполнитьОбновлениеДоВерсии30105() Экспорт
		
	// Переносим мероприятия из скрытого каталога в общий
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КаталогМероприятийСУО.Ссылка
		|ИЗ
		|	Справочник.КаталогМероприятийСУО КАК КаталогМероприятийСУО
		|ГДЕ
		|	КаталогМероприятийСУО.Владелец = &СкрытаяСхема";
	
	Запрос.УстановитьПараметр("СкрытаяСхема", Справочники.СхемыМероприятийСУО.ОбщаяСкрытая);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МероприятиеОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		МероприятиеОбъект.Владелец = Справочники.СхемыМероприятийСУО.Общая;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(МероприятиеОбъект);
	КонецЦикла;
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.10.34
//
Процедура ВыполнитьОбновлениеДоВерсии301034() Экспорт
	
	// Заполняем реквизит КоличествоБаллов оценки
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭлементыШкалыОценокСУО.Ссылка
		|ИЗ
		|	Справочник.ЭлементыШкалыОценокСУО КАК ЭлементыШкалыОценокСУО
		|ГДЕ
		|	ЭлементыШкалыОценокСУО.КоличествоБаллов = 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОценкаОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ОценкаОбъект.КоличествоБаллов = Справочники.ШкалыОценокСУО.БаллыИзОценкиСтараяВерсия(ВыборкаДетальныеЗаписи.Ссылка);
		ОценкаОбъект.Записать();
	КонецЦикла;	

КонецПроцедуры

// Выполняет обновление до версии 3.0.10.36
//
Процедура ВыполнитьОбновлениеДоВерсии301036() Экспорт
	РегистрыСведений.НастройкиУчебныхМатериаловСУО.УстановитьНастройки();	
КонецПроцедуры

// Выполняет обновление до версии 3.0.11.6
//
Процедура ВыполнитьОбновлениеДоВерсии30116() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Наименование,
		|	Пользователи.Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РегистрыСведений.ФИОПользователейСУО.ДобавитьСведения(ВыборкаДетальныеЗаписи.Ссылка, ВыборкаДетальныеЗаписи.Наименование);
	КонецЦикла;
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.11.16
//
Процедура ВыполнитьОбновлениеДоВерсии301116() Экспорт
	
	// Устанавливаем редакцию веб-кабинета по умолчанию
	
	УстановленнаяРедакция = Константы.РедакцияВебКабинетаСУ.Получить();
	
	Если НЕ ЗначениеЗаполнено(УстановленнаяРедакция) Тогда
		Константы.РедакцияВебКабинетаСУ.Установить(Перечисления.РедакцииВебКабинетаСУ.Редакция20);
	КонецЕсли;
	
	// Устанавливаем редакцию публикаций
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПубликацииВебКабинетаСУ.Ссылка
		|ИЗ
		|	Справочник.ПубликацииВебКабинетаСУ КАК ПубликацииВебКабинетаСУ
		|ГДЕ
		|	ПубликацииВебКабинетаСУ.Редакция = &ПустаяРедакция";
	
	Запрос.УстановитьПараметр("ПустаяРедакция", Перечисления.РедакцииВебКабинетаСУ.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПубликацияОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ПубликацияОбъект.Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция20;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ПубликацияОбъект);
	КонецЦикла;
		
КонецПроцедуры

// Выполняет обновление до версии 3.0.11.36
//
Процедура ВыполнитьОбновлениеДоВерсии301136() Экспорт
	
	// Убираем нижний колонтитул
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПубликацииВебКабинетаСУ.Ссылка
		|ИЗ
		|	Справочник.ПубликацииВебКабинетаСУ КАК ПубликацииВебКабинетаСУ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПубликацияОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ПубликацияОбъект.НижнийКолонтитул = "";
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ПубликацияОбъект);
	КонецЦикла;
		
КонецПроцедуры

// Выполняет обновление до версии 3.0.11.37
//
Процедура ВыполнитьОбновлениеДоВерсии301137() Экспорт
	
	// Устанавливаем время у вида обучения
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыМероприятийСУО.Ссылка
		|ИЗ
		|	Справочник.ВидыМероприятийСУО КАК ВидыМероприятийСУО";
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВидОбученияОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Если ЗначениеЗаполнено(ВидОбученияОбъект.ВремяИзученияЭлектронныхКурсов) Тогда
			Продолжить;
		КонецЕсли;
		ВидОбученияОбъект.ВремяИзученияЭлектронныхКурсов = Перечисления.ВариантыОтображенияВремениИзученияЭлектронногоРесурсаСУО.НеПоказывать;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВидОбученияОбъект);		
	КонецЦикла;
		
КонецПроцедуры

// Выполняет обновление до версии 3.0.11.82
//
Процедура ВыполнитьОбновлениеДоВерсии301182() Экспорт
	
	// Устанавливаем функциональную опцию ИспользоватьЛичныйКабинетСУО
	
	Константы.ИспользоватьЛичныйКабинетСУО.Установить(
		НЕ ПолучитьФункциональнуюОпцию("ИспользоватьВебКабинетСУ"));	
		
КонецПроцедуры

// Выполняет обновление до версии 3.0.11.87
//
Процедура ВыполнитьОбновлениеДоВерсии301187() Экспорт
	
	// Заполняем реквизит ЭлектронныйРесурс регистра ИмпортированныеЭлементыПакетаSCORM
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИмпортированныеЭлементыПакетаSCORM.СсылкаНаЭлемент,
		|	ИмпортированныеЭлементыПакетаSCORM.ИдентификаторПакета
		|ИЗ
		|	РегистрСведений.ИмпортированныеЭлементыПакетаSCORM КАК ИмпортированныеЭлементыПакетаSCORM
		|ГДЕ
		|	ИмпортированныеЭлементыПакетаSCORM.ИмяЭлемента = &ИмяЭлементаЭР";
	
	Запрос.УстановитьПараметр("ИмяЭлементаЭР", "organization");
	
	ТаблицаЭР = Запрос.Выполнить().Выгрузить(); // Идентификаторы пакетов электронных ресурсов
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИмпортированныеЭлементыПакетаSCORM.СсылкаНаЭлемент,
		|	ИмпортированныеЭлементыПакетаSCORM.ИдентификаторПакета
		|ИЗ
		|	РегистрСведений.ИмпортированныеЭлементыПакетаSCORM КАК ИмпортированныеЭлементыПакетаSCORM
		|ГДЕ
		|	ИмпортированныеЭлементыПакетаSCORM.ЭлектронныйРесурс = &ЭлектронныйРесурсПустаяСсылка";
	
	Запрос.УстановитьПараметр("ЭлектронныйРесурсПустаяСсылка", Справочники.СводыЗнанийСУЗ.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтрокаТЭР = ТаблицаЭР.Найти(ВыборкаДетальныеЗаписи.ИдентификаторПакета, "ИдентификаторПакета");
		
		Если СтрокаТЭР <> Неопределено
			И ТипЗнч(СтрокаТЭР.СсылкаНаЭлемент) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
		
			НаборЗаписей = РегистрыСведений.ИмпортированныеЭлементыПакетаSCORM.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.СсылкаНаЭлемент.Установить(ВыборкаДетальныеЗаписи.СсылкаНаЭлемент);
			НаборЗаписей.Прочитать();
			НаборЗаписей[0].ЭлектронныйРесурс = СтрокаТЭР.СсылкаНаЭлемент;
			
			НаборЗаписей.Записать();

		КонецЕсли;			
	
	КонецЦикла;
	
		
КонецПроцедуры

// Выполняет обновление до версии 3.0.11.93
//
Процедура ВыполнитьОбновлениеДоВерсии301193() Экспорт
		
	// Устанавливаем частоту сбора статистики публикаций веб-кабинета
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПубликацииВебКабинетаСУ.Ссылка
		|ИЗ
		|	Справочник.ПубликацииВебКабинетаСУ КАК ПубликацииВебКабинетаСУ
		|ГДЕ
		|	ПубликацииВебКабинетаСУ.ЧастотаСбораСтатистики = 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПубликацияОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ПубликацияОбъект.ЧастотаСбораСтатистики = 300;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ПубликацияОбъект);
	КонецЦикла;
		
КонецПроцедуры

// Выполняет обновление до версии 3.0.11.100
//
Процедура ВыполнитьОбновлениеДоВерсии3011100() Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ПометкаУдаления = ЛОЖЬ
		|	И Пользователи.Недействителен = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПараметрыФЗ = Новый Массив;
		ПараметрыФЗ.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		ПараметрыФЗ.Добавить(Неопределено);		
		
		ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных("Справочник.Пользователи", "ВебКабинетСУО.ОбновитьДанныеПользователяВебКабинета", ПараметрыФЗ, Строка(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор()), 0);
		
	КонецЦикла;
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.11.110
//
Процедура ВыполнитьОбновлениеДоВерсии3011110() Экспорт
		
	// Заполняем пустое значение типа ЭР
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СводыЗнанийСУЗ.Ссылка
		|ИЗ
		|	Справочник.СводыЗнанийСУЗ КАК СводыЗнанийСУЗ
		|ГДЕ
		|	СводыЗнанийСУЗ.Тип = &ПустойТип
		|	И СводыЗнанийСУЗ.ЭтоГруппа = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ПустойТип", Перечисления.ТипыЭлектронныхРесурсовСУЗ.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЭлектронныйРесурсОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ЭлектронныйРесурсОбъект.Тип = Перечисления.ТипыЭлектронныхРесурсовСУЗ.ЭлектронныйКурс;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлектронныйРесурсОбъект);
	КонецЦикла;
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.11.116
//
Процедура ВыполнитьОбновлениеДоВерсии3011116() Экспорт
			
	// Заполняем реквизиты ДатаНачалаОбучения и ДатаОкончанияОбучения
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрохождениеОбученияСУО.Ссылка КАК Ссылка,
		|	ПрохождениеОбученияСУО.ДатаПоследнейАктивности КАК ДатаПоследнейАктивности,
		|	ПрохождениеОбученияСУО.ДатаОкончанияПрохождения КАК ДатаОкончанияПрохождения,
		|	ПрохождениеОбученияСУО.ДатаИзменения КАК ДатаИзменения,
		|	ПрохождениеОбученияСУО.ДатаНачалаПрохождения КАК ДатаНачалаПрохождения,
		|	ПрохождениеОбученияСУО.Дата КАК Дата,
		|	ПрохождениеОбученияСУО.Статус КАК Статус
		|ИЗ
		|	Документ.ПрохождениеОбученияСУО КАК ПрохождениеОбученияСУО
		|ГДЕ
		|	ПрохождениеОбученияСУО.ДатаОкончанияОбучения = &ПустаяДата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрохождениеОбученияСУО.Ссылка,
		|	ПрохождениеОбученияСУО.ДатаПоследнейАктивности,
		|	ПрохождениеОбученияСУО.ДатаОкончанияПрохождения,
		|	ПрохождениеОбученияСУО.ДатаИзменения,
		|	ПрохождениеОбученияСУО.ДатаНачалаПрохождения,
		|	ПрохождениеОбученияСУО.Дата,
		|	ПрохождениеОбученияСУО.Статус
		|ИЗ
		|	Документ.ПрохождениеОбученияСУО КАК ПрохождениеОбученияСУО
		|ГДЕ
		|	ПрохождениеОбученияСУО.ДатаНачалаОбучения = &ПустаяДата";
	
	Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПрохождениеОбученияОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		Если НЕ ЗначениеЗаполнено(ПрохождениеОбученияОбъект.ДатаНачалаОбучения) Тогда
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаНачалаПрохождения) Тогда
				ПрохождениеОбученияОбъект.ДатаНачалаОбучения = ВыборкаДетальныеЗаписи.ДатаНачалаПрохождения;
			Иначе
				ПрохождениеОбученияОбъект.ДатаНачалаОбучения = ВыборкаДетальныеЗаписи.Дата;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ПрохождениеОбученияОбъект.ДатаОкончанияОбучения)
			И Документы.ПрохождениеОбученияСУО.Пройдено(ВыборкаДетальныеЗаписи.Статус) Тогда
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаОкончанияПрохождения) Тогда
				ПрохождениеОбученияОбъект.ДатаОкончанияОбучения = ВыборкаДетальныеЗаписи.ДатаОкончанияПрохождения;	
			ИначеЕсли ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаПоследнейАктивности) Тогда
				ПрохождениеОбученияОбъект.ДатаОкончанияОбучения = ВыборкаДетальныеЗаписи.ДатаПоследнейАктивности;
			Иначе
				ПрохождениеОбученияОбъект.ДатаОкончанияОбучения = ВыборкаДетальныеЗаписи.ДатаИзменения;
			КонецЕсли;
			
		КонецЕсли;
			
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ПрохождениеОбученияОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.11.117
//
Процедура ВыполнитьОбновлениеДоВерсии3011117() Экспорт
	
	// Перепроводим документы
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПопыткаВыполненияЗаданияСУО.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПопыткаВыполненияЗаданияСУО КАК ПопыткаВыполненияЗаданияСУО
		|ГДЕ
		|	ПопыткаВыполненияЗаданияСУО.Проведен = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПроведениеПреподавателемОбученияСУО.Ссылка
		|ИЗ
		|	Документ.ПроведениеПреподавателемОбученияСУО КАК ПроведениеПреподавателемОбученияСУО
		|ГДЕ
		|	ПроведениеПреподавателемОбученияСУО.Проведен = ИСТИНА";

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(
			ВыборкаДетальныеЗаписи.Ссылка, РежимЗаписиДокумента.Проведение, Ложь, 0, 0);
	КонецЦикла;
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.12.51
//
Процедура ВыполнитьОбновлениеДоВерсии301251() Экспорт
	
	Если РегистрыСведений.ВремяДоступаПользователейСУО.ЕстьЗаписи() Тогда
		Константы.ИспользоватьОграниченияВремениДоступаКПрограммеСУО.Установить(Истина);
	КонецЕсли;
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.12.57
//
Процедура ВыполнитьОбновлениеДоВерсии301257() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОценкиКачестваОбученияСУО.Регистратор КАК ПрохождениеОбучения,
		|	ОценкиКачестваОбученияСУО.ПроведениеОбучения КАК ПроведениеОбучения
		|ИЗ
		|	РегистрСведений.ОценкиКачестваОбученияСУО КАК ОценкиКачестваОбученияСУО";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(
			ВыборкаДетальныеЗаписи.ПрохождениеОбучения, РежимЗаписиДокумента.Проведение, Ложь, 0, 0);
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(
			ВыборкаДетальныеЗаписи.ПроведениеОбучения, РежимЗаписиДокумента.Проведение, Ложь, 0, 0);
	КонецЦикла;
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.12.62
//
Процедура ВыполнитьОбновлениеДоВерсии301262() Экспорт
	
	РегистрыСведений.НастройкиПользователейСУО.ЗаписатьНастройкиПоУмолчанию();
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.12.70
//
Процедура ВыполнитьОбновлениеДоВерсии301270() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СертификатСУО.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СертификатСУО КАК СертификатСУО
		|ГДЕ
		|	СертификатСУО.Проведен = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(
			ВыборкаДетальныеЗаписи.Ссылка, РежимЗаписиДокумента.Проведение, Ложь, 0, 2);
	КонецЦикла;	
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.12.71
//
Процедура ВыполнитьОбновлениеДоВерсии301271() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПубликацииВебКабинетаСУ.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПубликацииВебКабинетаСУ КАК ПубликацииВебКабинетаСУ
		|ГДЕ
		|	ПубликацииВебКабинетаСУ.Редакция = &Редакция30
		|	И ПубликацииВебКабинетаСУ.ПометкаУдаления = ЛОЖЬ
		|	И ПубликацииВебКабинетаСУ.ОформлениеКомандыПрофиля = &ОформлениеКомандыПрофиляПустая";
	
	Запрос.УстановитьПараметр("Редакция30", Перечисления.РедакцииВебКабинетаСУ.Редакция30);
	Запрос.УстановитьПараметр("ОформлениеКомандыПрофиляПустая", Перечисления.ВариантыОформленияКомандыПрофиляВебКабинетаСУО.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПубликацияВКОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ПубликацияВКОбъект.ОформлениеКомандыПрофиля = Перечисления.ВариантыОформленияКомандыПрофиляВебКабинетаСУО.Фотография;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ПубликацияВКОбъект);
		
	КонецЦикла;	
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.12.82
//
Процедура ВыполнитьОбновлениеДоВерсии301282() Экспорт
	
	Константы.ДатаОбновленияМакетовПубликацииСУЗ.Установить(ТекущаяДатаСеанса());
	
	Попытка
		ВидОбученияЭлектронноеОбучениеОбъект = Справочники.ВидыМероприятийСУО.НаОсновеЭлектронногоРесурса.ПолучитьОбъект();
	Исключение
	    ЗаписьЖурналаРегистрации(ОбщегоНазначенияСУКлиентСервер.СобытиеЖурналаРегистрацииЭлектронныхКурсов(), УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;	
	
	ВидОбученияЭлектронноеОбучениеОбъект.ЗакрытьДоступКМатериаламПослеЗавершения = Ложь;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВидОбученияЭлектронноеОбучениеОбъект);	
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.12.84
//
Процедура ВыполнитьОбновлениеДоВерсии301284() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СессияЭлектронногоРесурсаСУЗ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СессияЭлектронногоРесурсаСУЗ КАК СессияЭлектронногоРесурсаСУЗ
		|ГДЕ
		|	СессияЭлектронногоРесурсаСУЗ.Проведен = ИСТИНА
		|	И СессияЭлектронногоРесурсаСУЗ.ТипСессии = ЗНАЧЕНИЕ(Перечисление.ТипыСессийЭлектронныхРесурсовСУЗ.course)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(
			ВыборкаДетальныеЗаписи.Ссылка, РежимЗаписиДокумента.Проведение, Ложь, 0, 2);
	КонецЦикла;	
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.12.87
//
Процедура ВыполнитьОбновлениеДоВерсии301287() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПопыткаВыполненияЗаданияСУО.ПрохождениеОбучения КАК ПрохождениеОбучения
		|ИЗ
		|	Документ.ПопыткаВыполненияЗаданияСУО КАК ПопыткаВыполненияЗаданияСУО
		|ГДЕ
		|	ПопыткаВыполненияЗаданияСУО.ПроверяетсяПреподавателем = ИСТИНА
		|	И ПопыткаВыполненияЗаданияСУО.ПроверенПреподавателем = ЛОЖЬ
		|	И ПопыткаВыполненияЗаданияСУО.Проведен = ИСТИНА
		|	И ПопыткаВыполненияЗаданияСУО.Отменено = ЛОЖЬ
		|	И ПопыткаВыполненияЗаданияСУО.ПроведениеОбучения.Статус = &СтатусПроведенияОбучения";
	
	Запрос.Параметры.Вставить("СтатусПроведенияОбучения", Перечисления.СтатусыПроведенияОбъектовСУО.Активно);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(
			ВыборкаДетальныеЗаписи.ПрохождениеОбучения, РежимЗаписиДокумента.Проведение, Истина, 0, 2);
	КонецЦикла;	
	
КонецПроцедуры

// Выполняет обновление до версии 3.0.14.10
//
Процедура ВыполнитьОбновлениеДоВерсии301410() Экспорт
	
	// Даты макетов
	
	Константы.ДатаОбновленияМакетовПубликацииСУЗ.Установить(ТекущаяДатаСеанса());
	
	// Перепроводим документы
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПопыткаВыполненияАктивногоРесурсаSCORM.Ссылка КАК Ссылка,
		|	ПопыткаВыполненияАктивногоРесурсаSCORM.Дата КАК Дата
		|ИЗ
		|	Документ.ПопыткаВыполненияАктивногоРесурсаSCORM КАК ПопыткаВыполненияАктивногоРесурсаSCORM
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СессияЭлектронногоРесурсаСУЗ.Ссылка,
		|	СессияЭлектронногоРесурсаСУЗ.Дата
		|ИЗ
		|	Документ.СессияЭлектронногоРесурсаСУЗ КАК СессияЭлектронногоРесурсаСУЗ
		|ГДЕ
		|	СессияЭлектронногоРесурсаСУЗ.ТипСессии = &ТипСессииТест
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СессияЭлектронногоРесурсаСУЗ.Ссылка,
		|	СессияЭлектронногоРесурсаСУЗ.Дата
		|ИЗ
		|	Документ.СессияЭлектронногоРесурсаСУЗ КАК СессияЭлектронногоРесурсаСУЗ
		|ГДЕ
		|	СессияЭлектронногоРесурсаСУЗ.ТипСессии = &ТипСессииSCORM
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПопыткаВыполненияПодборкиВопросовСУЗ.Ссылка,
		|	ПопыткаВыполненияПодборкиВопросовСУЗ.Дата
		|ИЗ
		|	Документ.ПопыткаВыполненияПодборкиВопросовСУЗ КАК ПопыткаВыполненияПодборкиВопросовСУЗ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПопыткаВыполненияЗаданияСУО.Ссылка,
		|	ПопыткаВыполненияЗаданияСУО.Дата
		|ИЗ
		|	Документ.ПопыткаВыполненияЗаданияСУО КАК ПопыткаВыполненияЗаданияСУО
		|ГДЕ
		|	ПопыткаВыполненияЗаданияСУО.Проведен = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрохождениеОбученияСУО.Ссылка,
		|	ПрохождениеОбученияСУО.Дата
		|ИЗ
		|	Документ.ПрохождениеОбученияСУО КАК ПрохождениеОбученияСУО
		|ГДЕ
		|	ПрохождениеОбученияСУО.Проведен = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
	
	
	Запрос.Параметры.Вставить("ТипСессииТест", Перечисления.ТипыСессийЭлектронныхРесурсовСУЗ.quiz);
	Запрос.Параметры.Вставить("ТипСессииSCORM", Перечисления.ТипыСессийЭлектронныхРесурсовСУЗ.SCOPage);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(
			ВыборкаДетальныеЗаписи.Ссылка, РежимЗаписиДокумента.Проведение, Истина, 0, 2);
			
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыМероприятийСУО.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыМероприятийСУО КАК ВидыМероприятийСУО";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РегистрыСведений.ДанныеВебКабинетаСУО_ОН.УдалитьДанные(ВыборкаДетальныеЗаписи.Ссылка);			
		РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.УдалитьОтбор(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	// Имена групп
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыОбъектовСУЗ.Группа КАК Группа,
		|	ГруппыОбъектовСУЗ.СсылкаНаОбъектСУЗ.Наименование КАК Наименование
		|ИЗ
		|	РегистрСведений.ГруппыОбъектовСУЗ КАК ГруппыОбъектовСУЗ
		|ГДЕ
		|	ГруппыОбъектовСУЗ.СсылкаНаОбъектСУЗ.Наименование <> ГруппыОбъектовСУЗ.Группа.Наименование";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ГруппаОбъект = ВыборкаДетальныеЗаписи.Группа.ПолучитьОбъект();
		ГруппаОбъект.Наименование = ВыборкаДетальныеЗаписи.Наименование;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ГруппаОбъект);
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти
