
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура СформироватьСписокСтудентов()
	
	Студенты.Очистить();
	
	Ведомость = РегистрыСведений.УчастникиОбученияСУО.Ведомость(ПроведениеОбучения, Сценарий);
	
	МассивПользователей = Ведомость.ВыгрузитьКолонку("Пользователь");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтудентыООСрезПоследних.Пользователь,
		|	СтудентыООСрезПоследних.УчебнаяГруппа
		|ИЗ
		|	РегистрСведений.СтудентыОО.СрезПоследних КАК СтудентыООСрезПоследних
		|ГДЕ
		|	СтудентыООСрезПоследних.Пользователь В (&МассивПользователей)";

	Запрос.УстановитьПараметр("МассивПользователей", МассивПользователей);

	Результат = Запрос.Выполнить();

	ВыборкаСтудентов = Результат.Выбрать();
	
	// Заполняем таблицы
	//
	
	Пока ВыборкаСтудентов.Следующий() Цикл
		
		Если ЗначениеЗаполнено(УчебнаяГруппаОО) И ВыборкаСтудентов.УчебнаяГруппа <> УчебнаяГруппаОО Тогда
			Продолжить;
		КонецЕсли;
		
		// Ищем данные пользователя в ведомости
		
		НайденныеСтроки = Ведомость.НайтиСтроки(Новый Структура("Пользователь", ВыборкаСтудентов.Пользователь));
		СтрокаВедомости = НайденныеСтроки[0]; // Есть всегда
		
		// Заполняем таблицу студентов
		
		НайденныеСтроки = Студенты.НайтиСтроки(Новый Структура("Пользователь", ВыборкаСтудентов.Пользователь));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			СтрокаСтудента = Студенты.Добавить();                                 
			СтрокаСтудента.Пользователь = ВыборкаСтудентов.Пользователь;
			СтрокаСтудента.ПолноеИмяПользователя  = СтрокаВедомости.ПолноеИмяПользователя;
			
		Иначе
			
			СтрокаСтудента = НайденныеСтроки[0];
			
		КонецЕсли;
		
		Если СтрокаВедомости.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Зачислен Тогда
			СтрокаСтудента.Зачислен = Истина;
		КонецЕсли;
		
		Если СтрокаВедомости.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Проходит Тогда
			СтрокаСтудента.Проходит = Истина;
		КонецЕсли;
		
		Если СтрокаВедомости.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил
			ИЛИ СтрокаВедомости.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат Тогда
			СтрокаСтудента.Завершил = Истина;
		КонецЕсли;
		
		Если СтрокаВедомости.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.НеЗавершил Тогда
			СтрокаСтудента.НеЗавершил = Истина;
		КонецЕсли;
		
		Если СтрокаВедомости.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.НеДопущен Тогда
			СтрокаСтудента.НеДопущен = Истина;
		КонецЕсли;
		
		СтрокаСтудента.Оценка = СтрокаВедомости.ИтоговаяОценка;
		СтрокаСтудента.УчебнаяГруппа = ВыборкаСтудентов.УчебнаяГруппа;
		СтрокаСтудента.Прохождение = СтрокаВедомости.Прохождение;
		
	КонецЦикла;
	
	// Сортируем таблицу студентов
	//
	
	Студенты.Сортировать("ПолноеИмяПользователя");	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Устанавливаем переменные
	
	УчебнаяГруппаОО       = Параметры.УчебнаяГруппаОО;
	ПроведениеОбучения = Параметры.ПроведениеОбучения;
	
	Если ЗначениеЗаполнено(Параметры.Мероприятие) Тогда
		
		Сценарий = Параметры.Мероприятие;
		
	Иначе
		
		ДанныеПроведения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеОбучения, "Мероприятие, ЭлектронныйРесурс, НаОсновеЭлектронногоРесурса");
		
		Сценарий = Документы.ПроведениеОбученияСУО.СценарийОбучения(ПроведениеОбучения);
		
	КонецЕсли;
	
	// Устанавливаем видимость элементов
	
	Элементы.УчебнаяГруппаОтборСтудентов.Видимость = ЗначениеЗаполнено(УчебнаяГруппаОО);
	
	// Загружаем список студентов
	
	СформироватьСписокСтудентов();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	СформироватьСписокСтудентов();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ Студенты

&НаКлиенте
Процедура СтудентыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПоказатьЗначение(,Студенты.НайтиПоИдентификатору(ВыбраннаяСтрока).Прохождение);
	
КонецПроцедуры

