////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

&НаКлиенте
Перем ОписаниеДопустимыхТиповПеретаскивания; // Типы, которые можно перетаскивать

#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем реквизиты формы
	
	Родитель               = ?(НЕ ЗначениеЗаполнено(Параметры.Родитель) ИЛИ Параметры.Родитель.ЭтоГруппа, Параметры.Родитель, Параметры.Родитель.Родитель);
	ЗакрыватьПослеЗагрузки = Параметры.ЗакрыватьПослеЗагрузки;
	ЭлектронныйРесурс      = Параметры.ЭлектронныйРесурс;
	Подборка               = Параметры.Подборка;
	
	ИмяВладельцаФайлов = ""; // Имя объекта, куда загружаются все файлы в форме
	
	Если ЗначениеЗаполнено(Параметры.ЭлектронныйРесурс) Тогда
		ИмяВладельцаФайлов = "ЭлектронныйРесурс"; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Ресурс) Тогда
		ИмяВладельцаФайлов = "Ресурс";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Подборка) Тогда
		ИмяВладельцаФайлов = "Подборка";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИмяВладельцаФайлов) Тогда
		ИмяВладельцаФайлов = "СправочникРесурсы";	
	КонецЕсли;
	
	СпособОткрытияСсылок = "new";
	
	// Настраиваем элементы формы
	
	Элементы.ГруппаЭлементовПодборки.ОграничениеТипа     = Новый ОписаниеТипов("СправочникСсылка.ЭлементыПодборкиСУЗ");
	Элементы.ГруппаФайлов.ОграничениеТипа                = Новый ОписаниеТипов("СправочникСсылка.ФайлыСУЗ");
	Элементы.ГруппаЭлементовСодержания.ОграничениеТипа   = Новый ОписаниеТипов("СправочникСсылка.СодержаниеСУЗ");
	
	Элементы.ФайлыДляЗагрузкиЭлементСодержания.Видимость = ?(ИмяВладельцаФайлов = "ЭлектронныйРесурс", Истина, Ложь);
	Элементы.ФайлыДляЗагрузкиЭлементПодборки.Видимость   = ?(ИмяВладельцаФайлов = "ЭлектронныйРесурс" ИЛИ ИмяВладельцаФайлов = "Подборка", Истина, Ложь);
	Элементы.ФайлыДляЗагрузкиПодборка.Видимость          = ?(ИмяВладельцаФайлов = "ЭлектронныйРесурс" ИЛИ ИмяВладельцаФайлов = "Подборка", Истина, Ложь);
	Элементы.ФайлыДляЗагрузкиСкрыть.Видимость            = ?(ИмяВладельцаФайлов = "ЭлектронныйРесурс" ИЛИ ИмяВладельцаФайлов = "Подборка", Истина, Ложь);
	Элементы.ФайлыДляЗагрузкиСкрыть.ТолькоПросмотр       = Параметры.СкрыватьЭлементы;
	
	Элементы.ГруппаФайлов.Видимость                      = ?(ИмяВладельцаФайлов = "Ресурс", Истина, Ложь);
	Элементы.ГруппаЭлементовПодборки.Видимость           = ?(ИмяВладельцаФайлов = "Подборка", Истина, Ложь);
	Элементы.ЭлектронныйРесурс.Видимость                 = ?(ИмяВладельцаФайлов = "ЭлектронныйРесурс", Истина, Ложь);
	Элементы.Подборка.Видимость                          = ?(ИмяВладельцаФайлов = "Подборка", Истина, Ложь);
	Элементы.ГруппаЭлементовСодержания.Видимость         = ?(ИмяВладельцаФайлов = "ЭлектронныйРесурс", Истина, Ложь);
	
	// Устанавливаем настройки по умолчанию
	
	ДанныеНастроек = ХранилищеСистемныхНастроек.Загрузить(ИмяФормы+"/ТекущиеДанные");
	
	Если ДанныеНастроек = Неопределено Тогда
		
		СоздаватьСсылки         = Истина;
		СохранятьНастройки      = Истина;
		ЗагружатьНовые          = Истина;
		СоздаватьМиниатюрыВидео = Истина;
		
	КонецЕсли;
		
	// Завершаем
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если ВебКлиент Тогда
		
	ПоказатьПредупреждение(,НСтр("ru = 'Загрузка файлов в веб-клиенте не поддерживается'"));
	
	Отказ = Истина;
	
	Возврат;
	
	#Иначе
		
	ДобавитьФайлыВСписокЗагрузки(Параметры.ФайлыДляЗагрузки);
	
	#КонецЕсли

	Элементы.ГруппаПодсказка.Видимость = ?(ЗначениеЗаполнено(Параметры.ЭлектронныйРесурс) И НЕ СкрытьПодсказку, Истина, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ЭлектронныйРесурсОткрытие(Элемент, СтандартнаяОбработка)
	
	#Если НЕ ВебКлиент Тогда
		
	СтандартнаяОбработка = Ложь;
	
	ОбъектыСУЗКлиент.РедактироватьЭлектронныйРесурс(ЭлектронныйРесурс);

	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыДляЗагрузкиПреобразоватьПриИзменении(Элемент)
	
	#Если НЕ ВебКлиент Тогда
		
	ТекущиеДанные = Элементы.ФайлыДляЗагрузки.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьУстановкуПометкиПреобразовать(ТекущиеДанные);
	
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ЗагружатьНовыеПриИзменении(Элемент)
	
	#Если НЕ ВебКлиент Тогда

	УстановитьПризнакЗагрузкиФайлов();
	
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура СоздаватьСсылкиПриИзменении(Элемент)
	
	#Если НЕ ВебКлиент Тогда
		
	УстановитьНастройкиПреобразованияДляВсехФайлов("СоздаватьСсылки", СоздаватьСсылки);
	
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФайлыДляЗагрузки

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ФайлыДляЗагрузки

&НаКлиенте
Процедура ФайлыДляЗагрузкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	#Если НЕ ВебКлиент Тогда
	Отказ = Истина;
	ДобавитьФайлы();
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ФайлыДляЗагрузкиПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	РазработкаСУЗКлиент.ОбработатьСобытиеПроверкаПеретаскивания(ПараметрыПеретаскивания, ОписаниеДопустимыхТиповПеретаскивания, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ФайлыДляЗагрузкиПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	#Если НЕ ВебКлиент Тогда
		
	Если ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(ПараметрыПеретаскивания.Значение);
	Значение    = ПараметрыПеретаскивания.Значение;
	
	// Приводим значение к типу "Массив".
	
	Если ТипЗначения <> Тип("Массив") Тогда
		
		МассивФайлов = Новый Массив();
		МассивФайлов.Добавить(ПараметрыПеретаскивания.Значение);
		
		Значение    = МассивФайлов;
		ТипЗначения = Тип("Массив");
		
	КонецЕсли;
	
	// Примечание: предполагается, что массив содержит элементы одного типа.
	
	Если ОписаниеДопустимыхТиповПеретаскивания.СодержитТип(ТипЗнч(Значение[0])) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДобавитьФайлыВСписокЗагрузки(Значение);
			
	КонецЕсли;

	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ФайлыДляЗагрузкиРесурсПриИзменении(Элемент)
	#Если НЕ ВебКлиент Тогда
	ПриИзмененииЭлементовДляОбновления();
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ФайлыДляЗагрузкиПодборкаПриИзменении(Элемент)
	#Если НЕ ВебКлиент Тогда
	ПриИзмененииЭлементовДляОбновления();
	#КонецЕсли
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ВыполнитьИмпорт(Команда)
	
	#Если НЕ ВебКлиент Тогда
		
	Если ФайлыДляЗагрузки.ПолучитьЭлементы().Количество() = 0 Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Добавьте файлы для загрузки'"));
		Возврат;
	КонецЕсли;
	
	// Создаем рабочий каталог для создания миниатюр
	
	РабочийКаталогМиниатюр = РазработкаСУЗКлиент.ИнициализироватьРабочийКаталогРаботыСВидео();
	
	// Создаем элементы, куда будут помещены файлы
	
	СоздатьЭлементыДляРазмещенияФайлов();
		
	// Загружаем файлы
		
	PPTApp = Неопределено;
	DOCApp = Неопределено;
	
	ЗагрузитьФайлы(, PPTApp, DOCApp);
	
	Если PPTApp <> Неопределено Тогда
		PPTApp.Quit();
	КонецЕсли;	
	
	Если DOCApp <> Неопределено Тогда
		DOCApp.Quit();
	КонецЕсли;	
	
	// Сохраняем настройки
	
	Если СохранятьНастройки Тогда
		
		ДанныеФайловНастроек = ПодготовитьФайлыНастроекДляСохранения(ТекущаяДата());
		
		Для каждого НастройкиФайла Из ДанныеФайловНастроек Цикл
			
			ФайлНастроекОбъект = Новый Файл(НастройкиФайла.Путь + ПолучитьИмяФайлаНастроек());
			
			ТекстовыйДокументФН = Новый ТекстовыйДокумент;	
			ТекстовыйДокументФН.УстановитьТекст(НастройкиФайла.Текст);
			ТекстовыйДокументФН.Записать(ФайлНастроекОбъект.ПолноеИмя);
			
			ФайлНастроекОбъект.УстановитьНевидимость(Истина);
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Обновляем статус файлов
	
	УстановитьПризнакЗагрузкиФайлов();
	
	// Завершаем
	
	Если ЗначениеЗаполнено(РабочийКаталогМиниатюр) Тогда
	
		Попытка
			УдалитьФайлы(РабочийКаталогМиниатюр);
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
	Оповестить("ЭлектронныйРесурсОбновлен", Параметры.ЭлектронныйРесурс, ЭтотОбъект);
	Оповестить("ПодборкаОбновлена", Параметры.Подборка, ЭтотОбъект); 
	Оповестить("РесурсЗаписан", Параметры.Ресурс, ЭтотОбъект);
	
	ПоказатьПредупреждение(,НСтр("ru = 'Загрузка успешно завершена'"));
	
	Если ЗакрыватьПослеЗагрузки Тогда
		Закрыть(Истина);
	КонецЕсли;
	
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуПреобразоватьДляВсех(Команда)
	
	#Если НЕ ВебКлиент Тогда
		
	УстановитьПометкуПреобразовать(Истина);
	
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометкуПреобразоватьДляВсех(Команда)
	
	#Если НЕ ВебКлиент Тогда
		
	УстановитьПометкуПреобразовать(Ложь);

	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКаталог(Команда)
	
	#Если НЕ ВебКлиент Тогда
		
	ПолучитьФайлыДляЗагрузки(РежимДиалогаВыбораФайла.ВыборКаталога);
		
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлы(Команда = Неопределено)
	
	#Если НЕ ВебКлиент Тогда
		
	ПолучитьФайлыДляЗагрузки(РежимДиалогаВыбораФайла.Открытие);
		
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуЗагружатьДляВсех(Команда)
	#Если НЕ ВебКлиент Тогда
	УстановитьПометкуЗагружать(Истина);
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометкуЗагружатьДляВсех(Команда)
	#Если НЕ ВебКлиент Тогда
	УстановитьПометкуЗагружать(Ложь);
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПодсказкуПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Если НЕ ВебКлиент Тогда
	
// ОСНОВНЫЕ

&НаКлиенте
Процедура ПолучитьФайлыДляЗагрузки(РежимДиалога)
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалога);
	ДиалогОткрытияФайла.ПолноеИмяФайла     = "";
	ДиалогОткрытияФайла.Фильтр             = "";
	ДиалогОткрытияФайла.МножественныйВыбор = ?(РежимДиалога = РежимДиалогаВыбораФайла.ВыборКаталога, Ложь, Истина);
	ДиалогОткрытияФайла.Заголовок          = НСтр("ru = 'Выберите элементы для загрузки'");
	
	Если НЕ ДиалогОткрытияФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимДиалога = РежимДиалогаВыбораФайла.ВыборКаталога Тогда
		ВыбранныеФайлы = Новый Массив();
		ВыбранныеФайлы.Добавить(ДиалогОткрытияФайла.Каталог);
	Иначе
		ВыбранныеФайлы = ДиалогОткрытияФайла.ВыбранныеФайлы;
	КонецЕсли;
	
	ДобавитьФайлыВСписокЗагрузки(ВыбранныеФайлы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлыВСписокЗагрузки(Знач ФайлыДляДобавления, СтрокаДерева=Неопределено)
	
	Если ТипЗнч(ФайлыДляДобавления) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаДерева = Неопределено Тогда
		ЭлементыДерева  = ФайлыДляЗагрузки.ПолучитьЭлементы();
		ЭтоКореньДерева = Истина;
	Иначе
		ЭлементыДерева  = СтрокаДерева.ПолучитьЭлементы();
		ЭтоКореньДерева = Ложь;
	КонецЕсли;
	
	МассивКаталогов = Новый Массив();
	
	Для каждого ПутьКФайлу Из ФайлыДляДобавления Цикл
		
		Если ТипЗнч(ПутьКФайлу) = Тип("Файл") Тогда
			ФайлОбъект = ПутьКФайлу;
		Иначе
			ФайлОбъект = Новый Файл(ПутьКФайлу);			
		КонецЕсли;
		
		Если НЕ ФайлОбъект.Существует() Тогда
			Продолжить;
		КонецЕсли;
		
		Если ФайлОбъект.ПолучитьНевидимость() Тогда
			Продолжить;
		КонецЕсли;
		
		// Определяем, не добавлен ли уже файл
		
		ФайлУжеДобавлен = Ложь;
		
		Для каждого ФайлДляЗагрузки Из ЭлементыДерева Цикл
		
			Если ФайлОбъект.ПолноеИмя = ФайлДляЗагрузки.Путь Тогда
				ФайлУжеДобавлен = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ФайлУжеДобавлен Тогда			
			Продолжить;			
		КонецЕсли;
		
		ЭтоКаталог = ФайлОбъект.ЭтоКаталог();
		
		// Определяем картинку
		
		Если ФайлОбъект.ЭтоКаталог() Тогда
			
			Картинка = 2;
			
		Иначе
			
			Картинка = 4;
			
			Если ЭтоПрезентация(ФайлОбъект.Расширение) Тогда
				Картинка = 72;	
			КонецЕсли;
			
			Если ЭтоДокумент(ФайлОбъект.Расширение) Тогда
				Картинка = 68;	
			КонецЕсли;
			
		КонецЕсли;
		
		// Определяем можно ли преобразовать файл
		
		МожноПреобразовать = Ложь;
		
		Если ЭтоКаталог Тогда
			
			Если ЭтоКореньДерева И ИмяВладельцаФайлов = "ЭлектронныйРесурс" Тогда
				МожноПреобразовать = Истина; // Каталог преобразовывается в теорию
			КонецЕсли;
			
		Иначе
			
			Если ЭтоПрезентация(ФайлОбъект.Расширение) ИЛИ ЭтоДокумент(ФайлОбъект.Расширение) Тогда
				МожноПреобразовать = Истина;	
			КонецЕсли;
			
		КонецЕсли;
			
		
		// Формируем строку файла
		
		НоваяСтрока = ЭлементыДерева.Добавить();	
		
		Если ЭтоКаталог Тогда
			НоваяСтрока.Имя                     = ФайлОбъект.Имя; 
			НоваяСтрока.Расширение              = ""; 
		Иначе
			НоваяСтрока.Имя                     = ФайлОбъект.ИмяБезРасширения; 
			НоваяСтрока.Расширение              = ФайлОбъект.Расширение; 
		КонецЕсли;		
		
		НоваяСтрока.Путь                    = ФайлОбъект.ПолноеИмя;
		НоваяСтрока.ПутьККаталогу           = ДобавитьСлешЕслиНужно(ФайлОбъект.Путь);
		НоваяСтрока.ЭлементСодержания       = Неопределено;
		НоваяСтрока.ЭлементПодборки         = Неопределено;
		НоваяСтрока.Картинка                = Картинка;
		НоваяСтрока.МожноПреобразовать      = МожноПреобразовать;
		НоваяСтрока.Преобразовать           = ?(МожноПреобразовать И (ИмяВладельцаФайлов = "ЭлектронныйРесурс" ИЛИ ИмяВладельцаФайлов = "Подборка"), Истина, Ложь);
		НоваяСтрока.СоздаватьСсылки         = ?(СоздаватьСсылки И НЕ ЭтоКаталог И НоваяСтрока.Преобразовать, Истина, Ложь);
		НоваяСтрока.ВариантЗагрузкиКартинок = ПредопределенноеЗначение("Перечисление.ВариантыЗагрузкиКартинокФайловСУЗ.УвеличиватьСтандартные");
		НоваяСтрока.ЭтоКаталог              = ЭтоКаталог;
		НоваяСтрока.Ресурс                  = ?(ИмяВладельцаФайлов = "Ресурс", Параметры.Ресурс, Неопределено);
		НоваяСтрока.Подборка                = ?(ИмяВладельцаФайлов = "Подборка", Параметры.Подборка, Неопределено);
		НоваяСтрока.Загружать               = Истина;
		НоваяСтрока.ДатаИзмененияФайла      = ФайлОбъект.ПолучитьВремяИзменения();
		НоваяСтрока.Скрыть                  = ?(Параметры.СкрыватьЭлементы И ЭтоКореньДерева, Истина, Ложь);
		
		Если МассивКаталогов.Найти(НоваяСтрока.ПутьККаталогу) = Неопределено Тогда
			МассивКаталогов.Добавить(НоваяСтрока.ПутьККаталогу);	
		КонецЕсли;
		
	КонецЦикла;
	
	// Заполняем таблицу настроек из файла на диске
	
	МассивФайловНастроек = Новый Массив();
	
	Для каждого КаталогСтрока Из МассивКаталогов Цикл
	
		ФайлНастроек = Новый Файл(КаталогСтрока + ПолучитьИмяФайлаНастроек());
		
		Если ФайлНастроек.Существует() И НЕ ФайлНастроек.ЭтоКаталог() Тогда
			МассивФайловНастроек.Добавить(ФайлНастроек);	
		КонецЕсли;
			
	КонецЦикла;
	
	Если МассивФайловНастроек.Количество() > 0 Тогда
	
		СтруктураФайлов = Новый Массив(); // Массив файлов с учетом иерархии каталогов
		СписокФайлов    = Новый Массив; // Линейный список файлов для последующего помещения во временное хранилище
		
		ОбщегоНазначенияСУКлиентСервер.СформироватьОписаниеФайлов(МассивФайловНастроек, СтруктураФайлов, СписокФайлов, Истина);
		
		СписокРазмещенныхФайлов = Новый Массив; // Список файлов с описанием места их хранения во временном хранилище.
		
		Состояние(НСтр("ru = 'Пожалуйста, подождите, выполняется передача файлов ...'"));
		
		ПоместитьФайлы(СписокФайлов, СписокРазмещенныхФайлов,, Ложь, УникальныйИдентификатор);
		
		ЗаполнитьТаблицуНастроек(СписокРазмещенныхФайлов);
		
	КонецЕсли;
	
	// Ищем настройки
	
	Если ЭтоКореньДерева Тогда
		НайтиЭлементыДляРазмещенияФайлов();
	Иначе
		НайтиЭлементыДляРазмещенияФайлов(СтрокаДерева.ПолучитьИдентификатор(), СтрокаДерева.Подборка);
	КонецЕсли;
	
	// Ищем подчиненные файлы

	Для каждого ЭлементДерева Из ЭлементыДерева Цикл
		ДобавитьФайлыКаталогаВСписокЗагрузки(ЭлементДерева); 
	КонецЦикла;
	
	// Ищем файлы, которые можно загружать
	
	УстановитьПризнакЗагрузкиФайлов();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНастроек(ФайлыНастроек)
	
	Для каждого ОписаниеФайлаНастроек Из ФайлыНастроек Цикл
		
		ФайлНастроекОбъект = Новый Файл(ОписаниеФайлаНастроек.Имя);
		
		ПутьКФайлуНастроек = ПолучитьИмяВременногоФайла("xml");
		
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ОписаниеФайлаНастроек.Хранение);
		ДвоичныеДанныеФайла.Записать(ПутьКФайлуНастроек);
			
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ПутьКФайлуНастроек);
		
		ФайлНастроекXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportFilesSettings", "Файлы");
		ФайлНастроекXDTO    = ФабрикаXDTO.Создать(ФайлНастроекXDTOТип);
		ФайлНастроекXDTO    = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ФайлНастроекXDTOТип);
		
		Для каждого НастройкиФайла Из ФайлНастроекXDTO.Файл Цикл
			
			ПолныйПутьКФайлу = ФайлНастроекОбъект.Путь + НастройкиФайла.ИмяФайла;
			
			НайденныеСтроки = НастройкиФайлов.НайтиСтроки(Новый Структура("Путь", ПолныйПутьКФайлу));
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				
				НоваяСтрока = НастройкиФайлов.Добавить();
				
				НоваяСтрока.ИмяФайла                = НастройкиФайла.ИмяФайла;
				НоваяСтрока.Путь                    = ПолныйПутьКФайлу;
				НоваяСтрока.ПутьККаталогу           = ФайлНастроекОбъект.Путь;
				НоваяСтрока.ЭтоКаталог              = НастройкиФайла.ЭтоКаталог;
				НоваяСтрока.Преобразовать           = НастройкиФайла.Преобразовать;
				НоваяСтрока.Скрыть                  = ?(Параметры.СкрыватьЭлементы, Истина, НастройкиФайла.Скрыть);
				НоваяСтрока.ДатаЗагрузки            = НастройкиФайла.ДатаЗагрузки;
				НоваяСтрока.Ресурс                  = НастройкиФайла.Ресурс;
				НоваяСтрока.Подборка                = НастройкиФайла.Подборка;
				НоваяСтрока.ВариантЗагрузкиКартинок = ?(НастройкиФайла.ВариантЗагрузкиКартинок = Неопределено, Перечисления.ВариантыЗагрузкиКартинокФайловСУЗ.УвеличиватьСтандартные, НастройкиФайла.ВариантЗагрузкиКартинок);
				НоваяСтрока.СоздаватьСсылки         = ?(НастройкиФайла.СоздаватьСсылки = Неопределено, СоздаватьСсылки, НастройкиФайла.СоздаватьСсылки);
				
				// Примечание: для ссылочных типов не имеет значения, есть ли они реально в базе.
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЧтениеXML.Закрыть();
		
		УдалитьФайлы(ПутьКФайлуНастроек);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НайтиЭлементыДляРазмещенияФайлов(Знач СтрокаДерева=Неопределено, Знач ВладелецФайлов=Неопределено)
	
	// Находим требуемые переменные
	
	Если ТипЗнч(СтрокаДерева) = Тип("Число") Тогда
		СтрокаДерева = ФайлыДляЗагрузки.НайтиПоИдентификатору(СтрокаДерева);
	КонецЕсли;
	
	Если СтрокаДерева = Неопределено Тогда
		ЭлементыДляОбхода = ФайлыДляЗагрузки.ПолучитьЭлементы();
	Иначе
		ЭлементыДляОбхода = СтрокаДерева.ПолучитьЭлементы();
	КонецЕсли;
	
	Если ВладелецФайлов = Неопределено Тогда
		ВладелецФайлов = ПолучитьВладельцаФайловДляЗагрузки();
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФайлов) = Тип("СправочникСсылка.СодержаниеСУЗ") Тогда
		ВладелецФайлов = ВладелецФайлов.СсылкаНаЭлемент;
	КонецЕсли;
	
	// Заполняем элементы для обновления
	
	Для каждого ФайлДляЗагрузки Из ЭлементыДляОбхода Цикл	
		
		ФайлОбъект         = Новый Файл(ФайлДляЗагрузки.Путь);
		ЭлементДляЗагрузки = ВладелецФайлов; // Переназначем, так как в дальнейшем переменная может меняться
		
		ФайлДляЗагрузки.МожноОбновить = Ложь;
		
		// Очищаем старые значения элементов для обновления
		
		ФайлДляЗагрузки.Подборка          = ?(ИмяВладельцаФайлов = "Подборка", Параметры.Подборка, Неопределено);
		ФайлДляЗагрузки.Ресурс            = ?(ИмяВладельцаФайлов = "Ресурс", Параметры.Ресурс, Неопределено);
		ФайлДляЗагрузки.ЭлементСодержания = Неопределено;
		ФайлДляЗагрузки.ЭлементПодборки   = Неопределено;
		
		// Заполняем значения свойств загружаемых файлов из внешнего файла настроек
		
		НайденныеСтроки = НастройкиФайлов.НайтиСтроки(Новый Структура("Путь", ФайлДляЗагрузки.Путь));
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			ЗначенияНастроекИзФайла = НайденныеСтроки[0];
			
			ФайлДляЗагрузки.Преобразовать          = ?(ФайлДляЗагрузки.МожноПреобразовать И ЗначенияНастроекИзФайла.Преобразовать, Истина, Ложь);
			ФайлДляЗагрузки.Скрыть                 = ?(Параметры.СкрыватьЭлементы, Истина, ЗначенияНастроекИзФайла.Скрыть);
			ФайлДляЗагрузки.ДатаПредыдущейЗагрузки = ЗначенияНастроекИзФайла.ДатаЗагрузки;
			
			Если НЕ ФайлДляЗагрузки.ЭтоКаталог И ФайлДляЗагрузки.Преобразовать Тогда
				
				ФайлДляЗагрузки.СоздаватьСсылки         = ЗначенияНастроекИзФайла.СоздаватьСсылки;
				ФайлДляЗагрузки.ВариантЗагрузкиКартинок = ЗначенияНастроекИзФайла.ВариантЗагрузкиКартинок;
				
			КонецЕсли;
			
			Если ИмяВладельцаФайлов = "ЭлектронныйРесурс" Тогда
				ФайлДляЗагрузки.Подборка = ЗначенияНастроекИзФайла.Подборка;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ФайлДляЗагрузки.Ресурс) И ИмяВладельцаФайла(ФайлДляЗагрузки, ЭлементДляЗагрузки) = "Ресурс" Тогда
				ФайлДляЗагрузки.Ресурс = ЗначенияНастроекИзФайла.Ресурс;
			КонецЕсли;
			
			// Примечание: ссылочные значения могут не существовать в базе.
			
			Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ФайлДляЗагрузки.Ресурс)
				ИЛИ ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ФайлДляЗагрузки.Подборка) Тогда
				
				ФайлДляЗагрузки.МожноОбновить = Истина;
				
			КонецЕсли;
			
		Иначе
			
			ЗначенияНастроекИзФайла = Неопределено;
			
		КонецЕсли;
		
		// Заполняем значения свойств загружаемых файлов исходя из имен файлов

		// Ищем элемент содержания электронного ресурса
		
		Если ЗначениеЗаполнено(ЭлементДляЗагрузки) И ТипЗнч(ЭлементДляЗагрузки) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
			
			Если НЕ ЗначениеЗаполнено(ФайлДляЗагрузки.ЭлементСодержания) Тогда
				
				ЭлементСодержания = Неопределено;
				
				Если ЗначениеЗаполнено(ФайлДляЗагрузки.Подборка) Тогда
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	СодержаниеСУЗ.Ссылка
						|ИЗ
						|	Справочник.СодержаниеСУЗ КАК СодержаниеСУЗ
						|ГДЕ
						|	СодержаниеСУЗ.ПометкаУдаления = ЛОЖЬ
						|	И СодержаниеСУЗ.Владелец = &ЭлементДляЗагрузки
						|	И СодержаниеСУЗ.СсылкаНаЭлемент = &Подборка";

					Запрос.УстановитьПараметр("Подборка", ФайлДляЗагрузки.Подборка);
					Запрос.УстановитьПараметр("ЭлементДляЗагрузки", ЭлементДляЗагрузки);

					Результат = Запрос.Выполнить();

					Если НЕ Результат.Пустой() Тогда
					
						ВыборкаДетальныеЗаписи = Результат.Выбрать();

						ВыборкаДетальныеЗаписи.Следующий();
						
						ЭлементСодержания = ВыборкаДетальныеЗаписи.Ссылка;
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ЭлементСодержания) Тогда
					
					ФайлДляЗагрузки.ЭлементСодержания = ЭлементСодержания;
					ФайлДляЗагрузки.Подборка          = ЭлементСодержания.СсылкаНаЭлемент;
					ФайлДляЗагрузки.МожноОбновить     = Истина;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ФайлДляЗагрузки.ЭтоКаталог И ФайлДляЗагрузки.Преобразовать Тогда
				
				// Будет выполнен поиск элементов для обновления для подчиненных файлов
				
				Если ЗначениеЗаполнено(ФайлДляЗагрузки.Подборка) Тогда
					
					НайтиЭлементыДляРазмещенияФайлов(ФайлДляЗагрузки, ФайлДляЗагрузки.Подборка); // Рекурсия
					
				ИначеЕсли ЗначениеЗаполнено(ФайлДляЗагрузки.ЭлементСодержания) Тогда
					
					НайтиЭлементыДляРазмещенияФайлов(ФайлДляЗагрузки, ФайлДляЗагрузки.ЭлементСодержания.СсылкаНаЭлемент); // Рекурсия
					
				КонецЕсли;
				
			Иначе
				
				Если ИмяВладельцаФайла(ФайлДляЗагрузки, ЭлементДляЗагрузки) = "Ресурс" Тогда
					
					// Будет выполнен поиск элемента подборки для обновления ниже.
					
					Если ЗначениеЗаполнено(ФайлДляЗагрузки.Подборка) Тогда
						
						ЭлементДляЗагрузки = ФайлДляЗагрузки.Подборка;
						
					ИначеЕсли ЗначениеЗаполнено(ФайлДляЗагрузки.ЭлементСодержания) Тогда
						
						ЭлементДляЗагрузки = ФайлДляЗагрузки.ЭлементСодержания.СсылкаНаЭлемент; // Подборка
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Ищем элемент подборки
		
		Если ЗначениеЗаполнено(ЭлементДляЗагрузки) И ТипЗнч(ЭлементДляЗагрузки) = Тип("СправочникСсылка.ПодборкиСУЗ") Тогда
			
			Если НЕ ЗначениеЗаполнено(ФайлДляЗагрузки.ЭлементПодборки) Тогда
				
				ЭлементПодборки = Неопределено;
				
				Если ЗначениеЗаполнено(ФайлДляЗагрузки.Ресурс) Тогда

					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	ЭлементыПодборкиСУЗ.Ссылка
						|ИЗ
						|	Справочник.ЭлементыПодборкиСУЗ КАК ЭлементыПодборкиСУЗ
						|ГДЕ
						|	ЭлементыПодборкиСУЗ.ПометкаУдаления = ЛОЖЬ
						|	И ЭлементыПодборкиСУЗ.Владелец = &ЭлементДляЗагрузки
						|	И ЭлементыПодборкиСУЗ.СсылкаНаОбъектСУЗ = &Ресурс";

					Запрос.УстановитьПараметр("Ресурс", ФайлДляЗагрузки.Ресурс);
					Запрос.УстановитьПараметр("ЭлементДляЗагрузки", ЭлементДляЗагрузки);

					Результат = Запрос.Выполнить();

					Если НЕ Результат.Пустой() Тогда
					
						ВыборкаДетальныеЗаписи = Результат.Выбрать();

						ВыборкаДетальныеЗаписи.Следующий();
						
						ЭлементПодборки = ВыборкаДетальныеЗаписи.Ссылка;
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ЭлементПодборки) Тогда
					
					ФайлДляЗагрузки.ЭлементПодборки = ЭлементПодборки;
					ФайлДляЗагрузки.Ресурс          = ЭлементПодборки.СсылкаНаОбъектСУЗ;
					ФайлДляЗагрузки.Подборка        = ЭлементДляЗагрузки;
					ФайлДляЗагрузки.МожноОбновить   = Истина;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ФайлДляЗагрузки.Обновить = ФайлДляЗагрузки.МожноОбновить;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыДляРазмещенияФайлов(Знач СтрокаДерева=Неопределено, Знач ВладелецФайлов=Неопределено)
	
	НачатьТранзакцию();
	
	Если СтрокаДерева = Неопределено Тогда
		ЭлементыДляОбхода = ФайлыДляЗагрузки.ПолучитьЭлементы();
	Иначе
		ЭлементыДляОбхода = СтрокаДерева.ПолучитьЭлементы();
	КонецЕсли;
	
	Если ВладелецФайлов = Неопределено Тогда
		ВладелецФайлов = ПолучитьВладельцаФайловДляЗагрузки();
	КонецЕсли;
	
	Для каждого ФайлДляЗагрузки Из ЭлементыДляОбхода Цикл
		
		ЭлементДляЗагрузки = ВладелецФайлов;
		
		// Создаем элементы
		//
		
		// Создаем ресурс (ресурс должен быть заполнен всегда)
		
		Если ИмяВладельцаФайла(ФайлДляЗагрузки, ЭлементДляЗагрузки) = "Ресурс" Тогда
		
			Если НЕ ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ФайлДляЗагрузки.Ресурс) Тогда
				
				РесурсОбъект = Справочники.РесурсыСУЗ.СоздатьЭлемент();
				
				Если ЗначениеЗаполнено(ФайлДляЗагрузки.Ресурс) Тогда 
					
					// Ссылка есть, но в базе объекта нет
					
					РесурсОбъект.УстановитьСсылкуНового(ФайлДляЗагрузки.Ресурс);
					
				КонецЕсли;
				
				РесурсОбъект.Наименование = ФайлДляЗагрузки.Имя; 
				
				Если ТипЗнч(ЭлементДляЗагрузки) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
					РесурсОбъект.Родитель = Справочники.СводыЗнанийСУЗ.ГруппаДляХраненияПодчиненныхЭлементов(ЭлементДляЗагрузки, Тип("СправочникСсылка.РесурсыСУЗ"));
				КонецЕсли;
				
				Если ТипЗнч(ЭлементДляЗагрузки) = Тип("СправочникСсылка.ПодборкиСУЗ") Тогда
					РесурсОбъект.Родитель = Справочники.ПодборкиСУЗ.ГруппаПодчиненныхЭлементов(ЭлементДляЗагрузки, Тип("СправочникСсылка.РесурсыСУЗ"), Параметры.ЭлектронныйРесурс);
				КонецЕсли;
				
				РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(РесурсОбъект);
				
				РесурсОбъект.Записать();
				
				// Запоминаем ресурс
				
				ФайлДляЗагрузки.Ресурс = РесурсОбъект.Ссылка;
				
			КонецЕсли;
			
		КонецЕсли;
			
		
		Если ТипЗнч(ЭлементДляЗагрузки) = Тип("СправочникСсылка.СводыЗнанийСУЗ")  Тогда
			
			// Создаем подборку
			
			Если НЕ ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ФайлДляЗагрузки.Подборка) Тогда
				
				ПодборкаОбъект = Справочники.ПодборкиСУЗ.СоздатьЭлемент();
				
				Если ЗначениеЗаполнено(ФайлДляЗагрузки.Подборка) Тогда 
					
					// Ссылка есть, но в базе объекта нет
					
					ПодборкаОбъект.УстановитьСсылкуНового(ФайлДляЗагрузки.Подборка);
					
				КонецЕсли;
				
				ПодборкаОбъект.Родитель     = Справочники.СводыЗнанийСУЗ.ГруппаДляХраненияПодчиненныхЭлементов(Параметры.ЭлектронныйРесурс, Тип("СправочникСсылка.ПодборкиСУЗ"));
				ПодборкаОбъект.Наименование = ФайлДляЗагрузки.Имя;
				
				РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ПодборкаОбъект);
				
				// Определяем навигацию подборки
				
				Если ФайлДляЗагрузки.ЭтоКаталог Тогда
					
					ПодборкаОбъект.ТипНавигации = Перечисления.ТипыНавигацииПодборкиСУЗ.Переключатели;
					
				Иначе
					
					Если ФайлДляЗагрузки.Преобразовать И ЭтоПрезентация(ФайлДляЗагрузки.Расширение) Тогда
						ПодборкаОбъект.ТипНавигации = Перечисления.ТипыНавигацииПодборкиСУЗ.Слайды;
					Иначе
						ПодборкаОбъект.ТипНавигации = Перечисления.ТипыНавигацииПодборкиСУЗ.БезНавигации;
					КонецЕсли;
					
				КонецЕсли;
				
				ПодборкаОбъект.Записать();
				
				// Запоминаем подборку
				
				ФайлДляЗагрузки.Подборка = ПодборкаОбъект.Ссылка;
				
			КонецЕсли;
			
			// Размещаем подборку
			
			Если ФайлДляЗагрузки.Скрыть Тогда
				
				// Запоминаем скрытую подборку в электронном ресурсе

				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	СкрытыеРесурсы.Ресурс
					|ИЗ
					|	Справочник.СводыЗнанийСУЗ.СкрытыеРесурсы КАК СкрытыеРесурсы
					|ГДЕ
					|	СкрытыеРесурсы.Ссылка = &ЭлектронныйРесурс
					|	И СкрытыеРесурсы.Ресурс = &Подборка";

				Запрос.УстановитьПараметр("Подборка", ФайлДляЗагрузки.Подборка);
				Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлементДляЗагрузки);

				Результат = Запрос.Выполнить();

				Если Результат.Пустой() Тогда
					
					ЭлектронныйРесурсОбъект = ЭлементДляЗагрузки.ПолучитьОбъект();
					
					НоваяСтрокаТЧ = ЭлектронныйРесурсОбъект.СкрытыеРесурсы.Добавить();
					НоваяСтрокаТЧ.Ресурс = ФайлДляЗагрузки.Подборка;
					
					ЭлектронныйРесурсОбъект.Записать();
					
				КонецЕсли;

				
			Иначе
				
				// Создаем элемент содержания и прикрепляем к нему подборку
				
				Если НЕ ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ФайлДляЗагрузки.ЭлементСодержания) Тогда
					
					ЭлементСодержанияОбъект = Справочники.СодержаниеСУЗ.СоздатьЭлемент();
					
					Если ЗначениеЗаполнено(ФайлДляЗагрузки.ЭлементСодержания) Тогда 
						
						// Ссылка есть, но в базе объекта нет
						
						ЭлементСодержанияОбъект.УстановитьСсылкуНового(ФайлДляЗагрузки.ЭлементСодержания);
						
					КонецЕсли;
					
					ЭлементСодержанияОбъект.Наименование    = ФайлДляЗагрузки.Имя;
					ЭлементСодержанияОбъект.Владелец        = ЭлементДляЗагрузки;
					ЭлементСодержанияОбъект.СсылкаНаЭлемент = ФайлДляЗагрузки.Подборка;
					ЭлементСодержанияОбъект.Родитель        = Родитель;
						
					РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ЭлементСодержанияОбъект);
						
					ЭлементСодержанияОбъект.Записать();
					
					// Запоминаем элемент содержания
					
					ФайлДляЗагрузки.ЭлементСодержания = ЭлементСодержанияОбъект.Ссылка;
					
				КонецЕсли;
				
			КонецЕсли;
			
			// Обрабатываем подчиненные элементы
					
			Если ФайлДляЗагрузки.ЭтоКаталог И ФайлДляЗагрузки.Преобразовать Тогда
				
				СоздатьЭлементыДляРазмещенияФайлов(ФайлДляЗагрузки, ФайлДляЗагрузки.Подборка); // Рекурсия
				
			Иначе
				
				Если ИмяВладельцаФайла(ФайлДляЗагрузки, ЭлементДляЗагрузки) = "Ресурс" Тогда
					
					// Создаем элемент подборки для обновления
					
					ЭлементДляЗагрузки = ФайлДляЗагрузки.Подборка; // Подборка
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Создаем элемент подборки
		
		Если ТипЗнч(ЭлементДляЗагрузки) = Тип("СправочникСсылка.ПодборкиСУЗ") Тогда
			
			Если ФайлДляЗагрузки.Скрыть Тогда

				// Запоминаем скрытый ресурс в подборке

				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	СкрытыеРесурсы.Ресурс
					|ИЗ
					|	Справочник.ПодборкиСУЗ.СкрытыеРесурсы КАК СкрытыеРесурсы
					|ГДЕ
					|	СкрытыеРесурсы.Ссылка = &Подборка
					|	И СкрытыеРесурсы.Ресурс = &Ресурс";

				Запрос.УстановитьПараметр("Ресурс", ФайлДляЗагрузки.Ресурс);
				Запрос.УстановитьПараметр("Подборка", ЭлементДляЗагрузки);

				Результат = Запрос.Выполнить();

				Если Результат.Пустой() Тогда
					
					ПодборкаОбъект = ЭлементДляЗагрузки.ПолучитьОбъект();
					
					НоваяСтрокаТЧ = ПодборкаОбъект.СкрытыеРесурсы.Добавить();
					НоваяСтрокаТЧ.Ресурс = ФайлДляЗагрузки.Ресурс;
					
					ПодборкаОбъект.Записать();
					
				КонецЕсли;
				
				
			Иначе				
			
				Если НЕ ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ФайлДляЗагрузки.ЭлементПодборки) Тогда 
					
					ЭлементПодборкиОбъект = Справочники.ЭлементыПодборкиСУЗ.СоздатьЭлемент();
					
					Если ЗначениеЗаполнено(ФайлДляЗагрузки.ЭлементПодборки) Тогда 
						
						// Ссылка есть, но в базе объекта нет
						
						ЭлементПодборкиОбъект.УстановитьСсылкуНового(ФайлДляЗагрузки.ЭлементПодборки);
						
					КонецЕсли;
					
					ЭлементПодборкиОбъект.Наименование      = ФайлДляЗагрузки.Имя;
					ЭлементПодборкиОбъект.Владелец          = ЭлементДляЗагрузки;
					ЭлементПодборкиОбъект.Родитель          = Родитель;
					ЭлементПодборкиОбъект.СсылкаНаОбъектСУЗ = ФайлДляЗагрузки.Ресурс;
					
					РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ЭлементПодборкиОбъект);
					
					ЭлементПодборкиОбъект.Записать();
					
					// Запоминаем элемент подборки
					
					ФайлДляЗагрузки.ЭлементПодборки = ЭлементПодборкиОбъект.Ссылка;
					
				КонецЕсли;	
				
				ФайлДляЗагрузки.Подборка = ЭлементДляЗагрузки;
				
			КонецЕсли;
				
		КонецЕсли;
		
		ФайлДляЗагрузки.МожноОбновить = Истина;
		
	КонецЦикла;	
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайлы(СтрокаДерева=Неопределено, PPTApp, DOCApp)
	
	ЕстьПоддержкаДокументов = РазработкаСУЗКлиент.ЕстьПоддержкаДокументов();
	
	// Получаем необходимые переменные
	
	Если СтрокаДерева = Неопределено Тогда
		ЭлементыДляОбхода = ФайлыДляЗагрузки.ПолучитьЭлементы();
	Иначе
		ЭлементыДляОбхода = СтрокаДерева.ПолучитьЭлементы();
	КонецЕсли;
	
	// Получаем файлы для загрузки
	
	Для каждого ФайлДляЗагрузки Из ЭлементыДляОбхода Цикл
		
		Если НЕ ФайлДляЗагрузки.Загружать Тогда
			Продолжить;
		КонецЕсли;
		
		ОтсортированныеФайлы           = Новый Массив(); // Файлы для загрузки в базу в нужном порядке
		ЗависимыеРесурсы               = Новый Массив(); // Ресурсы, на которые есть ссылки
		ЗависимыеРесурсыДополняющиеAPI = Новый Массив(); // Строки с идентификаторами ресурсов, которые будут вставлены в страницу
		ФайлыДляУдаления               = Новый Массив(); // Файлы, которые надо удалить после загрузки
		КонтекстФайла                  = Неопределено; // Метка, позволяющая при записи файла в базу установить доп. свойства
		НастройкиКартинок              = РазработкаСУЗКлиент.НовоеОписаниеКартинокДокумента(ФайлДляЗагрузки.ВариантЗагрузкиКартинок); // Информация о картинках, содержащихся в документе
		
		ТекстовыеДанныеДляИндексирования = "";
		
		ЭтоПрезентация = ?(НЕ ФайлДляЗагрузки.ЭтоКаталог И ЭтоПрезентация(ФайлДляЗагрузки.Расширение), Истина, Ложь);
		ЭтоДокумент    = ?(НЕ ФайлДляЗагрузки.ЭтоКаталог И ЭтоДокумент(ФайлДляЗагрузки.Расширение), Истина, Ложь);		
		
		СписокФайлов = Новый Массив; // Линейный список файлов для последующего помещения во временное хранилище
		СтруктураФайлов = Новый Массив; // Массив файлов с учетом иерархии каталогов		
		СписокРазмещенныхФайлов = Новый Массив; // Список файлов с описанием места их хранения во временном хранилище.				
		
		Если ФайлДляЗагрузки.Преобразовать Тогда
			
			Если ФайлДляЗагрузки.ЭтоКаталог Тогда
				
				ЗагрузитьФайлы(ФайлДляЗагрузки, PPTApp, DOCApp); // Рекурсия
				
				Продолжить;
				
			Иначе
				
				Если НЕ ЕстьПоддержкаДокументов Тогда
					ВызватьИсключение НСтр("ru = 'Преобразование документов не поддерживается'");
				КонецЕсли;
				
				Если НЕ ЭтоПрезентация И НЕ ЭтоДокумент Тогда
					ВызватьИсключение НСтр("ru = 'Неизвестный формат файла для преобразования'");
				КонецЕсли;
				
				// Конвертируем файлы
				
				Если ЭтоПрезентация Тогда
					
					КонтекстФайла = "PowerPoint";
					
					Если НЕ ПриложениеДоступно(PPTApp) Тогда
					
						Попытка
							PPTApp = Новый COMObject("PowerPoint.Application");
						Исключение
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Программа PowerPoint не найдена '") + ОписаниеОшибки());
							Продолжить;
						КонецПопытки;
						
					КонецЕсли;
					
					ПараметрыЗагрузки = Новый Структура();
					
					// Свойства загрузки
					
					ПараметрыЗагрузки.Вставить("ПутьКПрезентации", ФайлДляЗагрузки.Путь);
					ПараметрыЗагрузки.Вставить("Приложение", PPTApp);
					ПараметрыЗагрузки.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);					
					ПараметрыЗагрузки.Вставить("КонтекстФайла", КонтекстФайла);					

					// Свойства для заполнения в процессе загрузки
					
					ПараметрыЗагрузки.Вставить("СтруктураФайлов", СтруктураФайлов);
					ПараметрыЗагрузки.Вставить("ПередаваемыеФайлы", СписокФайлов);					
					ПараметрыЗагрузки.Вставить("ПереданныеФайлы", СписокРазмещенныхФайлов);
					
					РазработкаСУЗКлиент.СформироватьПрезентациюДляСохраненияВБазе(ПараметрыЗагрузки);
					
				КонецЕсли;
				
				Если ЭтоДокумент Тогда
					
					Если ПреобразоватьВФайлыHTML Тогда
						КонтекстФайла = "WordAsHTML";
					Иначе
						КонтекстФайла = "Document";
					КонецЕсли;
					
					// Создаем DOCApp
					//
					
					Если НЕ ПриложениеДоступно(DOCApp) Тогда

						Попытка
							DOCApp = Новый COMObject("Word.Application");
						Исключение
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Программа MS Word не найдена '") + ОписаниеОшибки());
							Возврат;
						КонецПопытки;
						
						DOCApp.Visible = Ложь;
						
					КонецЕсли;
					
					ПараметрыЗагрузки = Новый Структура();
					
					// Свойства загрузки
					
					ПараметрыЗагрузки.Вставить("ПутьКДокументу", ФайлДляЗагрузки.Путь);
					ПараметрыЗагрузки.Вставить("Приложение", DOCApp);
					ПараметрыЗагрузки.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
					ПараметрыЗагрузки.Вставить("ПолучитьHTML", ПреобразоватьВФайлыHTML); // Будут получены файлы HTML, в противном случае документ целиком
					
					ПараметрыЗагрузки.Вставить("ФайлДляЗагрузки", ФайлДляЗагрузки);
					ПараметрыЗагрузки.Вставить("ФайлыДляЗагрузки", ФайлыДляЗагрузки);
					ПараметрыЗагрузки.Вставить("СпособОткрытияСсылок", СпособОткрытияСсылок);					
					ПараметрыЗагрузки.Вставить("КонтекстФайла", КонтекстФайла);					
					
					// Свойства для заполнения в процессе загрузки
					
					ПараметрыЗагрузки.Вставить("НастройкиКартинок", НастройкиКартинок);
					ПараметрыЗагрузки.Вставить("ЗависимыеРесурсы", ЗависимыеРесурсы);										
					ПараметрыЗагрузки.Вставить("ЗависимыеРесурсыДополняющиеAPI", ЗависимыеРесурсыДополняющиеAPI);
					ПараметрыЗагрузки.Вставить("ЗависимыеРесурсы", ЗависимыеРесурсы);
					
					ПараметрыЗагрузки.Вставить("СтруктураФайлов", СтруктураФайлов);
					ПараметрыЗагрузки.Вставить("ПередаваемыеФайлы", СписокФайлов);					
					ПараметрыЗагрузки.Вставить("ПереданныеФайлы", СписокРазмещенныхФайлов);
					ПараметрыЗагрузки.Вставить("ТекстовыеДанныеДляИндексирования", ТекстовыеДанныеДляИндексирования);
					
					РазработкаСУЗКлиент.СформироватьДокументДляСохраненияВБазе(ПараметрыЗагрузки);
					
					ТекстовыеДанныеДляИндексирования = ПараметрыЗагрузки.ТекстовыеДанныеДляИндексирования;
					
				КонецЕсли; // Обработка документа
				
			КонецЕсли; // Обработка файлов
			
		Иначе
				
			Если ФайлДляЗагрузки.СоздаватьСсылки И ЭтоДокумент И ИмяВладельцаФайлов <> "Ресурс" Тогда
				
				// Эта часть кода необходима для продуктов, вроде ПрофКейс,
				// в которых ссылки работают только в тонком клиенте.
				
				КаталогИмпорта = ДобавитьСлешЕслиНужно(ПолучитьИмяВременногоФайла(""));
				
				СоздатьКаталог(КаталогИмпорта);
				
				ПутьККопииФайла = КаталогИмпорта + ФайлДляЗагрузки.Имя + ФайлДляЗагрузки.Расширение;
				
				КопироватьФайл(ФайлДляЗагрузки.Путь, ПутьККопииФайла);
				
				ФайлКопия = Новый Файл(ПутьККопииФайла);
				
				Если ФайлКопия.Существует() Тогда
				
					// Открываем файл doc
					
					Если НЕ ПриложениеДоступно(DOCApp) Тогда

						Попытка
							DOCApp = Новый COMObject("Word.Application");
						Исключение
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Программа MS Word не найдена '") + ОписаниеОшибки());
							Возврат;
						КонецПопытки;
						
						DOCApp.Visible = Ложь;
						
					КонецЕсли;
					
					DOC = DOCApp.Documents.Open(ПутьККопииФайла);
					
					Если DOC.Hyperlinks.count > 0 Тогда
							
						Для каждого Гиперссылка Из DOC.Hyperlinks Цикл
								
							ФайлГиперссылки = Новый Файл(ФайлДляЗагрузки.ПутьККаталогу + Гиперссылка.Address);				

							ВнутренняяГиперссылка = ПолучитьПутьКФайлуВСписке(ФайлГиперссылки.ПолноеИмя, ЗависимыеРесурсы);
							
							Если ЗначениеЗаполнено(ВнутренняяГиперссылка) Тогда
								Гиперссылка.Address = ВнутренняяГиперссылка;	
							КонецЕсли;
									
						КонецЦикла;
						
						DOC.Save();
						
					КонецЕсли;
					
					DOC.Close();
					
					ОтсортированныеФайлы.Добавить(Новый Файл(ПутьККопииФайла));
					
				Иначе
					
					ОтсортированныеФайлы.Добавить(Новый Файл(ФайлДляЗагрузки.Путь));
					
				КонецЕсли;
					
			Иначе
				
				ОтсортированныеФайлы.Добавить(Новый Файл(ФайлДляЗагрузки.Путь));
				
			КонецЕсли;

			
		КонецЕсли; // Преобразовать
		
		// Помещаем файлы во временное хранилище (используется при загрузке чистых файлов, не документов или презентаций)
		
		Если ОтсортированныеФайлы.Количество() > 0 Тогда
			
			ОбщегоНазначенияСУКлиентСервер.СформироватьОписаниеФайлов(ОтсортированныеФайлы, СтруктураФайлов, СписокФайлов, Ложь, КонтекстФайла);
			
			Если СписокФайлов.Количество() = 0 Тогда
				
				Текст = НСтр("ru = 'При загрузке файла ""%1"" произошла ошибка (нет файлов для загрузки)'");
				Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, ФайлДляЗагрузки.Имя);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
			
				Продолжить;	
				
			КонецЕсли;
			
			Состояние(НСтр("ru = 'Пожалуйста, подождите, выполняется передача файлов ...'"));
			
			ПоместитьФайлы(СписокФайлов, СписокРазмещенныхФайлов,, Ложь, УникальныйИдентификатор);
			
		КонецЕсли;
			
		// Формируем миниатюру
		
		АдресХранилищаМиниатюры = Неопределено;
		ДанныеВидео = Неопределено;
		
		Если СоздаватьМиниатюрыВидео И ЗначениеЗаполнено(РабочийКаталогМиниатюр) Тогда
			
			ЭтоВидео = ?(НЕ ФайлДляЗагрузки.ЭтоКаталог И ЭтоВидео(ФайлДляЗагрузки.Расширение), Истина, Ложь);
			
			Если ЭтоВидео Тогда
				
				ДвоичныеДанныеМиниатюры = РазработкаСУЗКлиент.ДвоичныеДанныеМиниатюрыВидео(ФайлДляЗагрузки.Путь, РабочийКаталогМиниатюр); 
				
				Если ДвоичныеДанныеМиниатюры <> Неопределено Тогда
					АдресХранилищаМиниатюры = ПоместитьВоВременноеХранилище(ДвоичныеДанныеМиниатюры, УникальныйИдентификатор);
				КонецЕсли;
				
				РазмерВидео = РазработкаСУЗКлиент.РазмерВидео(ФайлДляЗагрузки.Путь, РабочийКаталогМиниатюр);
				
				ДанныеВидео = Новый Структура("Миниатюра, Размер", АдресХранилищаМиниатюры, РазмерВидео);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Загружаем файлы в базу
		
		СвойстваФайла     = Новый Структура("Имя, Расширение, ЭтоКаталог, Преобразовать, СтруктураФайлов, СписокФайлов, НастройкиКартинок, ДанныеВидео, КонтекстФайла, ТекстовыеДанныеДляИндексирования", ФайлДляЗагрузки.Имя, ФайлДляЗагрузки.Расширение, ФайлДляЗагрузки.ЭтоКаталог, ФайлДляЗагрузки.Преобразовать, СтруктураФайлов, СписокРазмещенныхФайлов, НастройкиКартинок, ДанныеВидео, КонтекстФайла, ТекстовыеДанныеДляИндексирования);
		СвойстваВладельца = Новый Структура("ИмяВладельцаФайлов, ЭлектронныйРесурс, Подборка, Ресурс, ЭлементСодержания, ЭлементПодборки, Родитель, ЗависимыеРесурсы, ЗависимыеРесурсыДополняющиеAPI", ИмяВладельцаФайлов, Параметры.ЭлектронныйРесурс, ФайлДляЗагрузки.Подборка, ФайлДляЗагрузки.Ресурс, ФайлДляЗагрузки.ЭлементСодержания, ФайлДляЗагрузки.ЭлементПодборки, Родитель, Новый ФиксированныйМассив(ЗависимыеРесурсы), Новый ФиксированныйМассив(ЗависимыеРесурсыДополняющиеAPI));
		
		ПоместитьФайлВБазу(СвойстваФайла, СвойстваВладельца);
		
		ФайлДляЗагрузки.ДатаПредыдущейЗагрузки = ТекущаяДата();
		
		// Удаляем временные файлы
			
		Для каждого ФайлДляУдаления Из ФайлыДляУдаления Цикл
			Если ФайлДляУдаления.Существует() Тогда
				УдалитьФайлы(ФайлДляУдаления.ПолноеИмя);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПоместитьФайлВБазу(Знач СвойстваФайла, Знач СвойстваВладельца)
	
	НачатьТранзакцию();
	
	Если ЗначениеЗаполнено(СвойстваВладельца.Ресурс) Тогда
		
		// Находим группу файлов, в которую помещаются все файлы в форме
		
		Если ТипЗнч(СвойстваВладельца.Родитель) = Тип("СправочникСсылка.ФайлыСУЗ") Тогда
			ГруппаФайлов = СвойстваВладельца.Родитель;
		КонецЕсли;
		
		// Находим имя вложенной группы файлов, в которую будут помещены файлы
		
		СвойстваГруппыФайлов = Неопределено;
		
		Если СвойстваФайла.Преобразовать И СвойстваФайла.КонтекстФайла = "WordAsHTML" Тогда
			СвойстваГруппыФайлов = Новый Структура("Имя, Наименование", ПолучитьИмяГруппыДляХраненияФайлов(СвойстваФайла.Имя, СвойстваФайла.Расширение), СвойстваФайла.Имя);
		КонецЕсли;
		
		// Определяем стартовый файл
		
		СтартовыйФайл = Неопределено;	
		
		Если СвойстваВладельца.ИмяВладельцаФайлов <> "Ресурс" Тогда
		
			Если СвойстваФайла.Преобразовать Тогда
				Если СвойстваФайла.КонтекстФайла = "Document" Тогда
					СтартовыйФайл = Новый Структура("Имя, Наименование", СвойстваФайла.Имя + СвойстваФайла.Расширение, СвойстваФайла.Имя);
				Иначе					
					СтартовыйФайл = Новый Структура("Имя, Наименование", "page.htm", СвойстваФайла.Имя);
				КонецЕсли;
			КонецЕсли;
			
			Если СтартовыйФайл = Неопределено И СвойстваФайла.ЭтоКаталог И СвойстваФайла.СтруктураФайлов.Количество() = 1 Тогда
				
				ИмяСтартовогоФайла = "";
				КоличествоФайловHTML = 0;
				
				Для каждого Строка Из СвойстваФайла.СтруктураФайлов[0].ПодчиненныеФайлы Цикл
				
					Если НРег(Строка.Расширение) = ".html" ИЛИ НРег(Строка.Расширение) = ".htm"	Тогда
						КоличествоФайловHTML = КоличествоФайловHTML + 1;
						ИмяСтартовогоФайла = Строка.Имя;
					КонецЕсли;
				
				КонецЦикла;
				
				Если КоличествоФайловHTML = 1 И ЗначениеЗаполнено(ИмяСтартовогоФайла) Тогда
					СтартовыйФайл = Новый Структура("Имя, Наименование", ИмяСтартовогоФайла, СвойстваФайла.Имя);
				КонецЕсли;
				
			КонецЕсли;
			
			Если СтартовыйФайл = Неопределено
				И НЕ СвойстваФайла.ЭтоКаталог 
				И СвойстваФайла.СтруктураФайлов.Количество() = 1
				И НРег(СвойстваФайла.Расширение) = ".pdf" Тогда  
				
				СтартовыйФайл = Новый Структура("Имя, Наименование, ПодключитьAPI", СвойстваФайла.СтруктураФайлов[0].Имя, СвойстваФайла.Имя, Ложь);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Определяем, нужно ли очищать старые файлы ресурса
		
		УдалитьСтарыеФайлыРесурса = Истина;
		Если СвойстваВладельца.ИмяВладельцаФайлов = "Ресурс" Тогда
			УдалитьСтарыеФайлыРесурса = Ложь;
		КонецЕсли;
		
		// Помещаем файлы в ресурс
		
		ПоместитьФайлыВРесурс(СвойстваВладельца.Ресурс, ГруппаФайлов, СвойстваФайла.СтруктураФайлов, СвойстваФайла.СписокФайлов, СтартовыйФайл, СвойстваГруппыФайлов, СвойстваВладельца.ЗависимыеРесурсы, СвойстваВладельца.ЗависимыеРесурсыДополняющиеAPI, СвойстваФайла.НастройкиКартинок, СвойстваФайла.ДанныеВидео, СвойстваФайла.ТекстовыеДанныеДляИндексирования, УдалитьСтарыеФайлыРесурса);
		
	ИначеЕсли ЗначениеЗаполнено(СвойстваВладельца.Подборка)
		И СвойстваФайла.КонтекстФайла = "PowerPoint" Тогда
		
		Справочники.ПодборкиСУЗ.ОбновитьПрезентацию(СвойстваВладельца.Подборка, СвойстваВладельца.ЭлектронныйРесурс, СвойстваФайла.СписокФайлов);
		
	КонецЕсли;

	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьФайлыНастроекДляСохранения(ТекущаяДата)
	
	// Получаем все каталоги, в которых есть файлы для загрузки
	
	МассивКаталогов = Новый Массив();
	
	СформироватьМассивКаталогов(МассивКаталогов);
	
	// Для каждого каталога формируем файл настроек
	
	ФайлыНастроек = Новый Массив();
	
	Для каждого ПутьККаталогу Из МассивКаталогов Цикл
		
		ФайлНастроекXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportFilesSettings", "Файлы");
		ФайлНастроекXDTO     = ФабрикаXDTO.Создать(ФайлНастроекXDTOТип);
		
		// Берем настройки файлов из таблицы ФайлыДляЗагрузки
		
		СформироватьXDTOФайлаНастроек(ФайлНастроекXDTO, ПутьККаталогу, ТекущаяДата);
		
		// Берем настройки файлов из таблицы НастройкиФайлов 
		
		Для каждого Строка Из НастройкиФайлов Цикл
		
			Если Строка.ПутьККаталогу <> ПутьККаталогу Тогда
				Продолжить;	
			КонецЕсли;
			
			// Ищем настройки файла в объекте XDTO
			
			ФайлXDTO = Неопределено;
			
			Для каждого СтрокаXDTO Из ФайлНастроекXDTO.Файл Цикл
				
				Если Строка.ИмяФайла = СтрокаXDTO.ИмяФайла Тогда
					ФайлXDTO = СтрокаXDTO;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если ФайлXDTO = Неопределено Тогда
				
				// Файла нет в таблице ФайлыДляЗагрузки, поэтому переносим
				// Все его настройки из таблицы НастройкиФайлов 
				
				ФайлXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportFilesSettings", "Файл");
				ФайлXDTO     = ФабрикаXDTO.Создать(ФайлXDTOТип);
				
				СвойстваФайлаXDTO = ФайлXDTO.Свойства();
				
				Для каждого СвойствоФайлаXDTO Из СвойстваФайлаXDTO Цикл
					ФайлXDTO[СвойствоФайлаXDTO.Имя] = Строка[СвойствоФайлаXDTO.Имя];	
				КонецЦикла;
				
				ФайлНастроекXDTO.Файл.Добавить(ФайлXDTO);
				
			Иначе
				
				// Файл есть в таблице ФайлыДляЗагрузки, но некоторые
				// Настройки надо взять старые из таблицы НастройкиФайлов
				
				Если Строка.ЭтоКаталог И ИмяВладельцаФайлов <> "ЭлектронныйРесурс" Тогда
					ФайлXDTO.Преобразовать = Строка.Преобразовать;
					// Заменяем на значение из файла, так как в этих случаях,
					// Преобразовывать все равно нельзя.
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ФайлXDTO.Подборка) Тогда
					ФайлXDTO.Подборка = Строка.Подборка;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ФайлXDTO.Ресурс) Тогда
					ФайлXDTO.Ресурс = Строка.Ресурс;
				КонецЕсли;
								
			КонецЕсли;
			
			
		КонецЦикла;
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ФайлНастроекXDTO);
		
		XMLДанныеФайлаНастроек = ЗаписьXML.Закрыть();
	
		СвойстваФайлаНастроек = Новый Структура("Путь, Текст", ПутьККаталогу, XMLДанныеФайлаНастроек);		
		
		ФайлыНастроек.Добавить(СвойстваФайлаНастроек);
		
	КонецЦикла;
	
	// Завершаем
	
	Возврат ФайлыНастроек;
	
КонецФункции

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
				
	Элементы.ФайлыДляЗагрузкиКартинки.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив());
	
	Элементы.СкрытьПодсказку.Видимость = ЗначениеЗаполнено(Параметры.ЭлектронныйРесурс);
	Элементы.ГруппаПодсказка.Видимость = ?(ЗначениеЗаполнено(Параметры.ЭлектронныйРесурс) И НЕ СкрытьПодсказку, Истина, Ложь);
	
КонецПроцедуры

// ВСПОМОГАТЕЛЬНЫЕ

&НаКлиенте
Функция УстановитьПризнакЗагрузкиФайлов(СтрокаДерева=Неопределено)
	
	Если СтрокаДерева = Неопределено Тогда
		ЭлементыДляОбхода = ФайлыДляЗагрузки.ПолучитьЭлементы();
	Иначе
		ЭлементыДляОбхода = СтрокаДерева.ПолучитьЭлементы();
	КонецЕсли;
	
	ЕстьФайлыДляЗагрузки = Ложь;
	
	Для каждого ФайлДляЗагрузки Из ЭлементыДляОбхода Цикл
		
		// Устанавливаем реквизит "Загружать"
		
		Если ФайлДляЗагрузки.ЭтоКаталог Тогда
			
			Если ФайлДляЗагрузки.Преобразовать Тогда
			
				ЕстьФайлыДляЗагрузки = УстановитьПризнакЗагрузкиФайлов(ФайлДляЗагрузки);
				
				ФайлДляЗагрузки.Загружать = ЕстьФайлыДляЗагрузки;
				
			Иначе
				
				Если ФайлДляЗагрузки.Обновить И ЗагружатьНовые И ЗначениеЗаполнено(ФайлДляЗагрузки.ДатаПредыдущейЗагрузки) Тогда
					
					ДатаИзмененияКаталога = ФайлДляЗагрузки.ДатаИзмененияФайла;
					
					ФайлыВКаталоге = НайтиФайлы(ФайлДляЗагрузки.Путь, "*", Истина);
					
					Для каждого Файл Из ФайлыВКаталоге Цикл
						
						ДатаИзмененияФайла = Файл.ПолучитьВремяИзменения();
						
						Если ДатаИзмененияФайла > ДатаИзмененияКаталога Тогда
							ДатаИзмененияКаталога = ДатаИзмененияФайла;
						КонецЕсли;
					
					КонецЦикла;
					
					Если ДатаИзмененияКаталога <= ФайлДляЗагрузки.ДатаПредыдущейЗагрузки Тогда
						ФайлДляЗагрузки.Загружать = Ложь;
					Иначе
						ФайлДляЗагрузки.Загружать = Истина;
						ЕстьФайлыДляЗагрузки = Истина;
					КонецЕсли;
											
				Иначе
					
					ФайлДляЗагрузки.Загружать = Истина;
					ЕстьФайлыДляЗагрузки = Истина;
					
				КонецЕсли;
				
				
			КонецЕсли;
			
		Иначе
		
			Если ФайлДляЗагрузки.Обновить И ЗагружатьНовые И ЗначениеЗаполнено(ФайлДляЗагрузки.ДатаПредыдущейЗагрузки) И ФайлДляЗагрузки.ДатаИзмененияФайла <= ФайлДляЗагрузки.ДатаПредыдущейЗагрузки Тогда
				ФайлДляЗагрузки.Загружать = Ложь;
			Иначе
				ФайлДляЗагрузки.Загружать = Истина;
				ЕстьФайлыДляЗагрузки = Истина;
			КонецЕсли;
						
		КонецЕсли;
			
	КонецЦикла;
	
	Возврат ЕстьФайлыДляЗагрузки;
	
КонецФункции

&НаСервере
Функция СформироватьМассивКаталогов(МассивКаталогов, СтрокаДерева=Неопределено)
	
	Если СтрокаДерева = Неопределено Тогда
		ЭлементыДляОбхода = ФайлыДляЗагрузки.ПолучитьЭлементы();
	Иначе
		ЭлементыДляОбхода = СтрокаДерева.ПолучитьЭлементы();
	КонецЕсли;
	
	Для каждого ФайлДляЗагрузки Из ЭлементыДляОбхода Цикл
		
		Если МассивКаталогов.Найти(ФайлДляЗагрузки.ПутьККаталогу) = Неопределено Тогда
			МассивКаталогов.Добавить(ФайлДляЗагрузки.ПутьККаталогу);	
		КонецЕсли;
		
		Если ФайлДляЗагрузки.ЭтоКаталог Тогда
			СформироватьМассивКаталогов(МассивКаталогов, ФайлДляЗагрузки);	
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

&НаСервере
Процедура СформироватьXDTOФайлаНастроек(ФайлыXDTO, ПутьККаталогу, ТекущаяДата, СтрокаДерева=Неопределено)
	
	Если СтрокаДерева = Неопределено Тогда
		ЭлементыДляОбхода = ФайлыДляЗагрузки.ПолучитьЭлементы();
	Иначе
		ЭлементыДляОбхода = СтрокаДерева.ПолучитьЭлементы();
	КонецЕсли;
	
	Для каждого ФайлДляЗагрузки Из ЭлементыДляОбхода Цикл	
		
		Если ФайлДляЗагрузки.ПутьККаталогу = ПутьККаталогу Тогда
			
			ФайлXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportFilesSettings", "Файл");
			ФайлXDTO     = ФабрикаXDTO.Создать(ФайлXDTOТип);
			
			ФайлXDTO.ИмяФайла          = ФайлДляЗагрузки.Имя + ФайлДляЗагрузки.Расширение;
			ФайлXDTO.ЭтоКаталог        = ФайлДляЗагрузки.ЭтоКаталог;
			ФайлXDTO.ДатаЗагрузки      = ТекущаяДата;
			
			Если ИмяВладельцаФайлов = "ЭлектронныйРесурс" ИЛИ НЕ ФайлДляЗагрузки.ЭтоКаталог Тогда
				ФайлXDTO.Преобразовать  = ФайлДляЗагрузки.Преобразовать;
				// В электронном ресурсе все можно преобразовывать, а в других
				// Владельцах файлов только файлы можно преобразовать.
			КонецЕсли;
			
			ФайлXDTO.Скрыть = ФайлДляЗагрузки.Скрыть;
			
			Если ИмяВладельцаФайлов = "ЭлектронныйРесурс" ИЛИ ИмяВладельцаФайлов = "Подборка" ИЛИ ИмяВладельцаФайлов = "СправочникРесурсы" Тогда
				ФайлXDTO.Ресурс = ФайлДляЗагрузки.Ресурс;
			КонецЕсли;
			
			Если ИмяВладельцаФайлов = "ЭлектронныйРесурс" Тогда
				ФайлXDTO.Подборка = ФайлДляЗагрузки.Подборка;
			КонецЕсли;
			
			Если НЕ ФайлДляЗагрузки.ЭтоКаталог И ФайлДляЗагрузки.Преобразовать Тогда
				ФайлXDTO.СоздаватьСсылки = ФайлДляЗагрузки.СоздаватьСсылки;	
				ФайлXDTO.ВариантЗагрузкиКартинок = ФайлДляЗагрузки.ВариантЗагрузкиКартинок;
			КонецЕсли;
			
			ФайлыXDTO.Файл.Добавить(ФайлXDTO);
			
		КонецЕсли;
		
		Если ФайлДляЗагрузки.ЭтоКаталог Тогда
			СформироватьXDTOФайлаНастроек(ФайлыXDTO, ПутьККаталогу, ТекущаяДата, ФайлДляЗагрузки);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПоместитьФайлыВРесурс(Знач Ресурс, Знач Родитель, СтруктураФайлов, ОписанияФайлов, ФайлЗапуска = Неопределено, СвойстваГруппыФайлов = Неопределено, ЗависимыеРесурсы = Неопределено, ЗависимыеРесурсыДополняющиеAPI = Неопределено, НастройкиКартинок = Неопределено, ДанныеВидео = Неопределено, ТекстовыеДанныеДляИндексирования = "", УдалитьСтарыеФайлыРесурса = Истина)

	// Выбираем все ранее помещенные файлы
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФайлыСУЗ.Ссылка,
		|	ФайлыСУЗ.Родитель,
		|	ФайлыСУЗ.ЭтоГруппа,
		|	ФайлыСУЗ.Наименование,
		|	ФайлыСУЗ.ТипФайла,
		|	ФайлыСУЗ.ИмяФайла,
		|	ФайлыСУЗ.ДатаИзменения
		|ИЗ
		|	Справочник.ФайлыСУЗ КАК ФайлыСУЗ
		|ГДЕ
		|	ФайлыСУЗ.Владелец = &Ресурс";

	Запрос.Параметры.Вставить("Ресурс", Ресурс);
		
	Результат = Запрос.Выполнить();

	ВыборкаФайловВБазе = Результат.Выбрать();
		
	// Ищем родителя 
	
	Если ЗначениеЗаполнено(Родитель) Тогда
		
		// Если родитель задан не группой, то в
		// Качестве родителя считаем родителя этого элемента.
	
		СтруктураПоиска = Новый Структура("Ссылка", Родитель);
		
		ВыборкаФайловВБазе.Сбросить();
		Если ВыборкаФайловВБазе.НайтиСледующий(СтруктураПоиска) Тогда
			
			Если НЕ ВыборкаФайловВБазе.ЭтоГруппа Тогда
				Родитель = ВыборкаФайловВБазе.Родитель;
			КонецЕсли;
			
		Иначе
			
			Родитель = Справочники.ФайлыСУЗ.ПустаяСсылка();
			
		КонецЕсли;
		
	Иначе
		
		Родитель = Справочники.ФайлыСУЗ.ПустаяСсылка();
		
	КонецЕсли;
	
	Если СвойстваГруппыФайлов <> Неопределено Тогда
		
		// Ищем необходимую группу, если она задана явно
		
		СтруктураПоиска = Новый Структура("ИмяФайла, Родитель, ЭтоГруппа", СвойстваГруппыФайлов.Имя, Родитель, Истина);
		
		ВыборкаФайловВБазе.Сбросить();
		
		Если ВыборкаФайловВБазе.НайтиСледующий(СтруктураПоиска) Тогда
			
			Родитель = ВыборкаФайловВБазе.Ссылка;
			
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родитель, "ПометкаУдаления") Тогда
				РодительОбъект = Родитель.ПолучитьОбъект();
				РодительОбъект.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;			
			
		Иначе
			
			НовыйКаталогОбъект = Справочники.ФайлыСУЗ.СоздатьГруппу();
			
			НовыйКаталогОбъект.Владелец     = Ресурс;
			НовыйКаталогОбъект.ИмяФайла     = СвойстваГруппыФайлов.Имя;
			НовыйКаталогОбъект.Наименование = СвойстваГруппыФайлов.Наименование;
			
			НовыйКаталогОбъект.Родитель = Родитель;
			
			РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(НовыйКаталогОбъект);
			
			НовыйКаталогОбъект.Записать();
			
			Родитель = НовыйКаталогОбъект.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	// Записываем файлы в базу данных
	
	МассивЗаписанныхФайлов = Новый Массив;
	
	Если ЗначениеЗаполнено(Родитель) Тогда
		МассивЗаписанныхФайлов.Добавить(Родитель);
	КонецЕсли;
	
	ЗаписатьФайлыРесурса(Ресурс, Родитель, СтруктураФайлов, ОписанияФайлов, ВыборкаФайловВБазе, НастройкиКартинок, ДанныеВидео, МассивЗаписанныхФайлов, ТекстовыеДанныеДляИндексирования);
	
	// Помечаем на удаление файлы, которые не были записаны
	
	Если УдалитьСтарыеФайлыРесурса Тогда
	
		ВыборкаФайловВБазе.Сбросить();
		
		Пока ВыборкаФайловВБазе.Следующий() Цикл
			
			Если МассивЗаписанныхФайлов.Найти(ВыборкаФайловВБазе.Ссылка) = Неопределено Тогда
				
				ФайлОбъект = ВыборкаФайловВБазе.Ссылка.ПолучитьОбъект();
				ФайлОбъект.УстановитьПометкуУдаления(Истина);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
		
	// Указываем стартовый файл

	Если ФайлЗапуска <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(ФайлЗапуска.Имя) Тогда
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ФайлыСУЗ.Ссылка
				|ИЗ
				|	Справочник.ФайлыСУЗ КАК ФайлыСУЗ
				|ГДЕ
				|	ФайлыСУЗ.ПометкаУдаления = ЛОЖЬ
				|	И ФайлыСУЗ.Владелец = &Ресурс
				|	И ФайлыСУЗ.ЭтоГруппа = ЛОЖЬ
				|	И ФайлыСУЗ.ИмяФайла = &ИмяФайлаЗапуска";

			Запрос.УстановитьПараметр("ИмяФайлаЗапуска", ФайлЗапуска.Имя);
			Запрос.УстановитьПараметр("Ресурс", Ресурс);

			Результат = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = Результат.Выбрать();

			Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
				
				ВыборкаДетальныеЗаписи.Следующий();
				
				// Указываем файл запуска
				
				РесурсОбъект = Ресурс.ПолучитьОбъект();
				
				РесурсОбъект.ФайлЗапуска   = ВыборкаДетальныеЗаписи.Ссылка;
				
				Если ФайлЗапуска.Свойство("ПодключитьAPI") Тогда
					РесурсОбъект.ПодключитьAPI = ФайлЗапуска.ПодключитьAPI;
				Иначе					
					РесурсОбъект.ПодключитьAPI = Истина;
				КонецЕсли;
				
				РесурсОбъект.Записать();
				
				// Обновляем наименование файла запуска
				
				ФайлОбъект = ВыборкаДетальныеЗаписи.Ссылка.получитьОбъект(); 
				ФайлОбъект.Наименование = ФайлЗапуска.Наименование;
				ФайлОбъект.Записать();
				
			КонецЕсли;
			
		Иначе
			
			РесурсОбъект = Ресурс.ПолучитьОбъект();
			
			РесурсОбъект.ФайлЗапуска   = Справочники.ФайлыСУЗ.ПустаяСсылка();
			РесурсОбъект.ПодключитьAPI = Ложь;

			РесурсОбъект.Записать();
			
		КонецЕсли;
			
	КонецЕсли;
	
	// Указываем зависимые ресурсы или удаляем лишние
	
	РазработкаСУЗ.ОбновитьЗависимыеРесурсы(Ресурс, ЗависимыеРесурсы, ЗависимыеРесурсыДополняющиеAPI);	
	
	// Записываем ресурс
	
	РесурсОбъект = Ресурс.ПолучитьОбъект();
	РесурсОбъект.Записать(); // Обновляем дату изменения, чтобы обновить кэш файлов
	
	// Обновляем ссылки ресурса фоновым заданием
	
	МассивПараметровФЗ = Новый Массив;
	МассивПараметровФЗ.Добавить(РесурсОбъект.Ссылка);
	
	ФоновыеЗадания.Выполнить("РазработкаСУЗ.ОбновитьГиперссылкиРесурса", МассивПараметровФЗ);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьФайлыРесурса(Ресурс, Знач Родитель, СтруктураФайлов, ОписанияФайлов, ВыборкаФайловВБазе, НастройкиКартинок, ДанныеВидео, МассивЗаписанныхФайлов, ТекстовыеДанныеДляИндексирования)
	
	Для каждого Файл Из СтруктураФайлов Цикл
		
		Если Файл.ЭтоКаталог Тогда
			
			// Ищем каталог в базе
			
			СтруктураПоиска = Новый Структура("ИмяФайла, Родитель, ЭтоГруппа", Файл.Имя, Родитель, Истина);
			
			ВыборкаФайловВБазе.Сбросить();
			Если ВыборкаФайловВБазе.НайтиСледующий(СтруктураПоиска) Тогда				
				НовыйКаталог = ВыборкаФайловВБазе.Ссылка.ПолучитьОбъект();
			Иначе				
				НовыйКаталог = Справочники.ФайлыСУЗ.СоздатьГруппу();				
			КонецЕсли;
			
			// Заполняем реквизиты каталога 
			НовыйКаталог.Владелец     = Ресурс;
			НовыйКаталог.ИмяФайла     = Файл.Имя;
			НовыйКаталог.Наименование = Файл.Имя;
			
			НовыйКаталог.Родитель = Родитель;
			
			РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(НовыйКаталог);
			
			НовыйКаталог.Записать();
			
			Если НовыйКаталог.ПометкаУдаления Тогда
				НовыйКаталог.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;			
			
			МассивЗаписанныхФайлов.Добавить(НовыйКаталог.Ссылка);
			
			ЗаписатьФайлыРесурса(Ресурс, НовыйКаталог.Ссылка, Файл.ПодчиненныеФайлы, ОписанияФайлов, ВыборкаФайловВБазе, НастройкиКартинок, ДанныеВидео, МассивЗаписанныхФайлов, ТекстовыеДанныеДляИндексирования); // Рекурсия
			
		Иначе
			
			// Определяем не является ли это файлом URL
			
			ОписаниеФайлаURL = ПолучитьОписаниеФайлаURL(Файл, ОписанияФайлов);
			
			// Ищем файл в базе
			
			СтруктураПоиска = Новый Структура("ИмяФайла, Родитель, ЭтоГруппа", Файл.Имя, Родитель, Ложь);
			
			ВыборкаФайловВБазе.Сбросить();
			
			Если ВыборкаФайловВБазе.НайтиСледующий(СтруктураПоиска) Тогда
				
				НовыйФайл = ВыборкаФайловВБазе.Ссылка.ПолучитьОбъект();
				
			Иначе
				
				НовыйФайл = Справочники.ФайлыСУЗ.СоздатьЭлемент();
				
				Если Файл.Контекст = "Document" Тогда
					НовыйФайл.ТипФайла = Перечисления.ТипыФайловСУЗ.Document;					
				ИначеЕсли Файл.Контекст = "URL" Тогда
					НовыйФайл.ТипФайла = ОписаниеФайлаURL.ТипФайла;
				Иначе
					НовыйФайл.ТипФайла = РазработкаСУЗКлиентСервер.ПолучитьТипФайлаПоРасширению(Файл.Расширение);
				КонецЕсли;				
				
				Если НовыйФайл.ТипФайла = Перечисления.ТипыФайловСУЗ.Default
					И НЕ РазработкаСУЗ.ЭтоФайлHTML(Файл.Расширение) Тогда
					
					НовыйФайл.ОткрыватьВнешнимПриложением = Истина;
					
				КонецЕсли;
				
			КонецЕсли;
			
			// Заполняем реквизиты файла
			
			НовыйФайл.Родитель      = Родитель;
			НовыйФайл.Владелец      = Ресурс;
			Если Файл.Контекст = "URL" Тогда
				НовыйФайл.ИмяФайла = ОписаниеФайлаURL.Адрес;
				НовыйФайл.ВнешнийФайл = Истина;				
			Иначе
				НовыйФайл.ИмяФайла = Файл.Имя;
				НовыйФайл.ВнешнийФайл = Ложь;
			КонецЕсли;			
			НовыйФайл.Наименование  = Файл.ИмяБезРасширения;
			НовыйФайл.ТипОбъектаСУЗ = Перечисления.ТипыОбъектовСУЗ.file;
			
			Если НовыйФайл.Ссылка.Пустая() Тогда
				НовыйФайл.Версия = 1;
			Иначе
				ПоследняяВерсия = ОбъектыСУЗ.ПолучитьПоследнююВерсию(НовыйФайл.Ссылка, НовыйФайл.Поставщик);
				Если ПоследняяВерсия.Поставщик = НовыйФайл.Поставщик Тогда 
					НовыйФайл.Версия = НовыйФайл.Версия;
				Иначе
					НовыйФайл.Версия = 1;
				КонецЕсли;
			КонецЕсли;
			
			Если НовыйФайл.ТипФайла = Перечисления.ТипыФайловСУЗ.Media Тогда
				НовыйФайл.Ширина      = "100%";
				НовыйФайл.Высота      = "100%";
				НовыйФайл.FlashВерсия = 9;
			КонецЕсли;

			Если НовыйФайл.ТипФайла = Перечисления.ТипыФайловСУЗ.Video Тогда
				
				Если ДанныеВидео <> Неопределено
					И ДанныеВидео.Свойство("Размер")
					И НЕ ЗначениеЗаполнено(НовыйФайл.Ширина)
					И НЕ ЗначениеЗаполнено(НовыйФайл.Высота) Тогда
					
					НовыйФайл.Ширина = ДанныеВидео.Размер.Ширина;
					НовыйФайл.Высота = ДанныеВидео.Размер.Высота;					
						
				КонецЕсли;				
				
			КонецЕсли;
			
			Если НовыйФайл.ТипФайла = Перечисления.ТипыФайловСУЗ.Image
				И Файл.Контекст = "PowerPoint" Тогда
				
				НовыйФайл.Высота      = "100%";
				НовыйФайл.Выравнивать = Перечисления.СпособыВыравниванияСУЗ.center;
				
			КонецЕсли;
			
			Если Файл.Контекст = "WordAsHTML" И Файл.Имя = "page.files" Тогда
				
				НовыйФайл.ТипФайла     = Перечисления.ТипыФайловСУЗ.Folder;
				НовыйФайл.Наименование = НСтр("ru = 'Дополнительные файлы'");
				
			КонецЕсли;			
			
			РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(НовыйФайл);
			
			НовыйФайл.Записать();
			
			Если НовыйФайл.ПометкаУдаления Тогда
				НовыйФайл.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;			
			
			МассивЗаписанныхФайлов.Добавить(НовыйФайл.Ссылка);
			
			// Сохраняем данные файла
			
			ТекстОписания = "";			
			
			Если (Файл.Контекст = "WordAsHTML" И Файл.Имя = "page.htm") ИЛИ Файл.Контекст = "Document" Тогда
				ТекстОписания = РазработкаСУЗ.ОписаниеДокумента(НастройкиКартинок);
			КонецЕсли;
			
			РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(НовыйФайл, ТекстОписания, "Описание");
			
			Если Файл.Контекст = "Document" Тогда
				
				Для каждого ОписаниеФайла Из ОписанияФайлов Цикл
				
					ПереданныйФайл = Новый Файл(ОписаниеФайла.Имя);
					
					ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ОписаниеФайла.Хранение);
					
					Если ПереданныйФайл.Расширение = ".zip" Тогда			
						
						РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(НовыйФайл, ДвоичныеДанныеФайла, "HTML", "ДвоичныеДанные",,,"zip");			
						
					Иначе			
						
						Если ЗначениеЗаполнено(ТекстовыеДанныеДляИндексирования) Тогда					
							
							ДанныеДляСохранения = Новый Структура;
							ДанныеДляСохранения.Вставить("ТекстовыеДанные", ТекстовыеДанныеДляИндексирования);
							ДанныеДляСохранения.Вставить("ДвоичныеДанные", ДвоичныеДанныеФайла);
							
							ИмяРеквизитаДляСохранения = "ВсеРеквизиты";
							
							РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(НовыйФайл, ДанныеДляСохранения, "ДвоичныеДанные", ИмяРеквизитаДляСохранения);
							
						Иначе
							
							РазработкаСУЗ.СохранитьДвоичныеДанныеФайла(НовыйФайл, ДвоичныеДанныеФайла);
							
						КонецЕсли;
						
					КонецЕсли;
				
				КонецЦикла;				
				
			Иначе				
			
				ОписаниеФайла = ПолучитьОписаниеФайлаИзМассива(Файл.ПолноеИмя, ОписанияФайлов);
				
				ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ОписаниеФайла.Хранение);
				
				РазработкаСУЗ.СохранитьДвоичныеДанныеФайла(НовыйФайл, ДвоичныеДанныеФайла);
				
			КонецЕсли;
				
			Если ДанныеВидео <> Неопределено
				И НовыйФайл.ТипФайла = Перечисления.ТипыФайловСУЗ.Video Тогда
				
				Если ДанныеВидео.Свойство("Миниатюра") И ЭтоАдресВременногоХранилища(ДанныеВидео.Миниатюра) Тогда
					
					ДвоичныеДанныеМиниатюры = ПолучитьИзВременногоХранилища(ДанныеВидео.Миниатюра);
			
					РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(НовыйФайл, ДвоичныеДанныеМиниатюры, "Миниатюра", "ДвоичныеДанные",,,"jpg");
					
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОписаниеФайлаURL(Файл, ОписанияФайлов)
	
	Если НРег(Файл.Расширение) <> ".url" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Записываем файл url во временный каталог
	
	ОписаниеФайла = ПолучитьОписаниеФайлаИзМассива(Файл.ПолноеИмя, ОписанияФайлов);	
	ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ОписаниеФайла.Хранение);
	
	ФайлыДляУдаления = Новый Массив;
	
	ПутьКВременномуФайлуURL = ПолучитьИмяВременногоФайла("url");
	ФайлыДляУдаления.Добавить(ПутьКВременномуФайлуURL);
	ДвоичныеДанныеФайла.Записать(ПутьКВременномуФайлуURL);
	
	// Получаем гиперссылку из файла
	
	ЧтениеТекстаФайлаURL = Новый ЧтениеТекста(ПутьКВременномуФайлуURL);
	URLИзФайла = "";
	СтрокаФайлаURL = ЧтениеТекстаФайлаURL.ПрочитатьСтроку();
	Пока СтрокаФайлаURL <> Неопределено Цикл
		Если ВРег(Лев(СтрокаФайлаURL, СтрДлина("URL="))) = "URL=" Тогда
			URLИзФайла = Сред(СтрокаФайлаURL, СтрДлина("URL=") + 1);
			Прервать;
		КонецЕсли;
		СтрокаФайлаURL = ЧтениеТекстаФайлаURL.ПрочитатьСтроку();
	КонецЦикла;
	
	ЧтениеТекстаФайлаURL.Закрыть();
	
	// Удаляем временные файлы
			
	Для каждого ПутьКВременномуФайлу Из ФайлыДляУдаления Цикл
		Попытка
			УдалитьФайлы(ПутьКВременномуФайлу);
		Исключение
			// Не требуется
		КонецПопытки;
	КонецЦикла;
	
	// Получаем контекст
	
	Если НРег(Прав(URLИзФайла, 4)) = ".mp4" Тогда
		Файл.Контекст = "URL";
		Возврат Новый Структура("Адрес, ТипФайла", URLИзФайла, Перечисления.ТипыФайловСУЗ.Video);	
	КонецЕсли;
	
	Если НРег(Прав(URLИзФайла, 4)) = ".mp3" Тогда
		Файл.Контекст = "URL";
		Возврат Новый Структура("Адрес, ТипФайла", URLИзФайла, Перечисления.ТипыФайловСУЗ.Audio);	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ОбъектыСУЗКлиентСервер.ИдентификаторВидеоYouTubeИзURI(URLИзФайла)) Тогда
		Файл.Контекст = "URL";
		Возврат Новый Структура("Адрес, ТипФайла", URLИзФайла, Перечисления.ТипыФайловСУЗ.Video);
	КонецЕсли;
	
	Возврат Неопределено;		
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОписаниеФайлаИзМассива(ПолноеИмя, ОписанияФайлов)
	
	// Ищем описание файла
	
	ОписаниеФайла = Неопределено;
	
	Для каждого ОписаниеФайла Из ОписанияФайлов Цикл
	
		Если ОписаниеФайла.Имя = ПолноеИмя Тогда
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	
	Если ОписаниеФайла = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ОписаниеФайла.Хранение) Тогда
		
		СообщениеОбОшибке = НСтр("ru = 'Описание файла ''%1'' не найдено'");
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеОбОшибке, ПолноеИмя);

	КонецЕсли;
	
	Возврат ОписаниеФайла;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДобавитьСлешЕслиНужно(НовыйПуть)
	
	Если Прав(НовыйПуть, 1) <> "\" И Прав(НовыйПуть,1) <> "/" Тогда
		Возврат НовыйПуть + "\";
	Иначе
		Возврат НовыйПуть;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция НайтиФайлВДеревеПоПолномуИмени(ПолныйПутьКФайлу, СтрокаДерева=Неопределено)
	
	Возврат РазработкаСУЗКлиент.НайтиФайлВДеревеПоПолномуИмени(ПолныйПутьКФайлу, ФайлыДляЗагрузки, СтрокаДерева);
	
КонецФункции

&НаКлиенте
Функция ПолучитьСсылкуНаФайлВСписке(ПолныйПутьКФайлу, ЗависимыеРесурсы)
	
	Возврат РазработкаСУЗКлиент.ПолучитьСсылкуНаФайлВСписке(ПолныйПутьКФайлу, ЗависимыеРесурсы, ФайлыДляЗагрузки, СпособОткрытияСсылок);	
	
КонецФункции

&НаКлиенте
Функция ПолучитьПутьКФайлуВСписке(ПолныйПутьКФайлу, ЗависимыеРесурсы)
	
	НайденныйФайл = НайтиФайлВДеревеПоПолномуИмени(ПолныйПутьКФайлу);
	
	Если НайденныйФайл = Неопределено ИЛИ НайденныйФайл.Преобразовать Тогда
		Возврат "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НайденныйФайл.Ресурс) И ЗависимыеРесурсы.Найти(НайденныйФайл.Ресурс) = Неопределено Тогда
		ЗависимыеРесурсы.Добавить(НайденныйФайл.Ресурс);
	КонецЕсли;
	
	Возврат "../" + Строка(НайденныйФайл.Ресурс.УникальныйИдентификатор()) + "/" + НайденныйФайл.Имя + НайденныйФайл.Расширение;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоПрезентация(Знач РасширениеФайла)
	
	Возврат РазработкаСУЗКлиентСервер.ЭтоФайлПрезентации(РасширениеФайла);
		
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоДокумент(Знач РасширениеФайла)
	
	Если НРег(РасширениеФайла) = ".doc" ИЛИ НРег(РасширениеФайла) = ".docx" Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоВидео(Знач РасширениеФайла)
	
	ТипФайлаСУЗ = РазработкаСУЗКлиентСервер.ПолучитьТипФайлаПоРасширению(РасширениеФайла);
	
	Возврат ?(ТипФайлаСУЗ = ПредопределенноеЗначение("Перечисление.ТипыФайловСУЗ.Video"), Истина, Ложь);
		
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяВладельцаФайла(Знач СвойстваФайла, Знач ЭлементДляЗагрузки)
	
	// Получает имя объекта, куда должен быть загружен файл
	
	Если НЕ СвойстваФайла.ЭтоКаталог
		И ЭтоПрезентация(СвойстваФайла.Расширение)
		И СвойстваФайла.Преобразовать
		И ТипЗнч(ЭлементДляЗагрузки) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
		
		Возврат "Подборка"; // Презентация, которая преобразуется в подборку
		
	ИначеЕсли СвойстваФайла.ЭтоКаталог И СвойстваФайла.Преобразовать И ТипЗнч(ЭлементДляЗагрузки) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
		
		Возврат "Подборка"; // Каталог, который преобразуется в подборку
		
	Иначе
		
		Возврат "Ресурс"; // Остальные файлы загружаются в ресурс
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьВладельцаФайловДляЗагрузки()
	
	ВладелецФайлов = Неопределено;
	
	Если ИмяВладельцаФайлов = "ЭлектронныйРесурс" Тогда
		ВладелецФайлов = Параметры.ЭлектронныйРесурс;
	КонецЕсли;
		
	Если ИмяВладельцаФайлов = "Подборка" Тогда
		ВладелецФайлов = Параметры.Подборка;
	КонецЕсли;
	
	Если ИмяВладельцаФайлов = "Ресурс" Тогда
		ВладелецФайлов = Параметры.Ресурс;
	КонецЕсли;
	
	Если ИмяВладельцаФайлов = "СправочникРесурсы" Тогда
		ВладелецФайлов = Параметры.Ресурс;
	КонецЕсли;
	
	Возврат ВладелецФайлов;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьФайлыКаталогаВСписокЗагрузки(СтрокаКаталогаВДереве)
	
	Если СтрокаКаталогаВДереве.ЭтоКаталог И СтрокаКаталогаВДереве.МожноПреобразовать И СтрокаКаталогаВДереве.Преобразовать Тогда
		
		ФайлыКаталога = НайтиФайлы(СтрокаКаталогаВДереве.Путь, "*", Ложь); 
		
		ДобавитьФайлыВСписокЗагрузки(ФайлыКаталога, СтрокаКаталогаВДереве);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуПреобразовать(ЗначениеПометки, СтрокаДерева=Неопределено)
	
	Если СтрокаДерева = Неопределено Тогда
		ЭлементыДляОбхода = ФайлыДляЗагрузки.ПолучитьЭлементы();
	Иначе
		ЭлементыДляОбхода = СтрокаДерева.ПолучитьЭлементы();
	КонецЕсли;
	
	Для каждого ФайлДляЗагрузки Из ЭлементыДляОбхода Цикл
		
		СтароеЗначениеПометки = ФайлДляЗагрузки.Преобразовать;
		
		ФайлДляЗагрузки.Преобразовать = ?(ФайлДляЗагрузки.МожноПреобразовать, ЗначениеПометки, Ложь);	
		
		Если ФайлДляЗагрузки.ЭтоКаталог Тогда
			 УстановитьПометкуПреобразовать(ЗначениеПометки, ФайлДляЗагрузки);
		КонецЕсли;
		
		Если СтароеЗначениеПометки <> ФайлДляЗагрузки.Преобразовать Тогда
			ОбработатьУстановкуПометкиПреобразовать(ФайлДляЗагрузки);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуЗагружать(ЗначениеПометки, СтрокаДерева=Неопределено)
	
	Если СтрокаДерева = Неопределено Тогда
		ЭлементыДляОбхода = ФайлыДляЗагрузки.ПолучитьЭлементы();
	Иначе
		ЭлементыДляОбхода = СтрокаДерева.ПолучитьЭлементы();
	КонецЕсли;
	
	Для каждого ФайлДляЗагрузки Из ЭлементыДляОбхода Цикл
		
		ФайлДляЗагрузки.Загружать = ЗначениеПометки;	
		
		Если ФайлДляЗагрузки.ЭтоКаталог Тогда
			 УстановитьПометкуЗагружать(ЗначениеПометки, ФайлДляЗагрузки);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкиПреобразованияДляВсехФайлов(ИмяНастройки, ЗначениеНастройки, СтрокаДерева=Неопределено)
	
	Если СтрокаДерева = Неопределено Тогда
		ЭлементыДляОбхода = ФайлыДляЗагрузки.ПолучитьЭлементы();
	Иначе
		ЭлементыДляОбхода = СтрокаДерева.ПолучитьЭлементы();
	КонецЕсли;
	
	Для каждого ФайлДляЗагрузки Из ЭлементыДляОбхода Цикл
		
		Если НЕ ФайлДляЗагрузки.ЭтоКаталог И ФайлДляЗагрузки.Преобразовать Тогда
			ФайлДляЗагрузки[ИмяНастройки] = ЗначениеНастройки;
		КонецЕсли;
		
		Если ФайлДляЗагрузки.ЭтоКаталог Тогда
			 УстановитьНастройкиПреобразованияДляВсехФайлов(ИмяНастройки, ЗначениеНастройки, ФайлДляЗагрузки);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьУстановкуПометкиПреобразовать(ТекущиеДанные)
	
	Если ТекущиеДанные.ЭтоКаталог И ТекущиеДанные.МожноПреобразовать Тогда
		
		Если ТекущиеДанные.Преобразовать Тогда
			ДобавитьФайлыКаталогаВСписокЗагрузки(ТекущиеДанные);	
		Иначе
			ЭлементыСтроки = ТекущиеДанные.ПолучитьЭлементы();
			ЭлементыСтроки.Очистить();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяГруппыДляХраненияФайлов(ИмяФайла, Расширение)
	
	ПолноеИмяФайла = ИмяФайла + Расширение;
	ДлинаСтроки    = СтрДлина(ПолноеИмяФайла);
	ИмяГруппы      = "";
	
	Для Номер = 1 По ДлинаСтроки Цикл
		
		НомерСимвола = КодСимвола(ПолноеИмяФайла, Номер);
		ИндексБуквы  = ОбщегоНазначенияСУ.СлучайноеЧисло(0, 25, НомерСимвола);
		ИмяГруппы    = ИмяГруппы + НРег(Строка(ОбщегоНазначенияСУ.ЗначениеПеречисленияПоИндексу("АлфавитАнглийскийСУЗ", ИндексБуквы)));
		
	КонецЦикла;
	
	ИмяГруппы = "folder_" + ИмяГруппы;
	
	Возврат ИмяГруппы;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИмяФайлаНастроек()
	
	Возврат "v8_FilesImportSettings.xml";
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииЭлементовДляОбновления()
	
	ТекущиеДанные = Элементы.ФайлыДляЗагрузки.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Ресурс)
		ИЛИ ЗначениеЗаполнено(ТекущиеДанные.Подборка)
		ИЛИ ЗначениеЗаполнено(ТекущиеДанные.ЭлементСодержания)
		ИЛИ ЗначениеЗаполнено(ТекущиеДанные.ЭлементПодборки) Тогда
		
		ТекущиеДанные.МожноОбновить = Истина;
		
	Иначе
		
		ТекущиеДанные.МожноОбновить = Ложь;
		
	КонецЕсли;
	
    ТекущиеДанные.Обновить = ТекущиеДанные.МожноОбновить;
	
КонецПроцедуры

&НаКлиенте
Функция ПриложениеДоступно(ПриложениеCOM)
	
	Возврат ОбщегоНазначенияСУКлиент.ПриложениеCOMДоступно(ПриложениеCOM);
	
КонецФункции

#КонецЕсли

#КонецОбласти
 
////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

ОписаниеДопустимыхТиповПеретаскивания = Новый ОписаниеТипов("Файл");