

#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОсновнаяПубликация = ВебКабинетСУ.ПолучитьОсновнуюПубликациюИзКонстанты();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОсновнаяПубликацияПриИзменении(Элемент)
	УстановитьОсновнуюПубликацию();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура МастерПубликации(Команда)
	ОткрытьФорму("Справочник.ПубликацииВебКабинетаСУ.Форма.МастерРучнойНастройки",,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьОсновнуюПубликацию()
	ВебКабинетСУ.УстановитьОсновнуюПубликацию(ОсновнаяПубликация);
КонецПроцедуры


#КонецОбласти

