
// ОСНОВНЫЕ
//

Функция ВерсияANY(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);	
	НастройкиAPI = Новый Структура("Версия, База", ВебКабинетСУ.ВерсияAPI(), СтандартныеПодсистемыСервер.ИдентификаторИнформационнойБазы());	
	Возврат ОтветКлиентуJSON(,НастройкиAPI);

КонецФункции

// Обучение

Функция ПолучитьАктивностиУчастникаОбученияPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	ПраваДляПроверки = Новый Массив;
	ПраваДляПроверки.Добавить("Обучение");
	ПраваДляПроверки.Добавить("Преподавание");
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, ПраваДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	Права = ДанныеСессии.Права.Получить();
	
	// Получаем данные запроса
	//	
	
	ТипОбучения   = Запрос.ПараметрыURL.Получить("ТипОбучения");
	ОтборДанных   = Запрос.ПараметрыURL.Получить("Отбор");
	ДатаНачала    = Запрос.ПараметрыURL.Получить("ДатаНачала");
	ДатаОкончания = Запрос.ПараметрыURL.Получить("ДатаОкончания");
	
	Попытка
		ДатаНачала = ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(Число(ДатаНачала));
		ДатаОкончания = ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(Число(ДатаОкончания));
	Исключение
		ДатаНачала = Дата("00010101");
		ДатаОкончания = Дата("00010101");
	КонецПопытки;	
	
	// Ждем окончания заданий
	
	ОжидатьЗавершенияЗаданияОбновленияЭлектронногоРесурса(ДанныеСессии, НСтр("ru = 'Список обучений'"));		
	
	// Делаем запрос к базе данных
	//
	
	ЗапросДанных = Новый Запрос;
	
	КоличествоСекцийЗапроса = 0;
	
	Если ОтборДанных = "All" Тогда
		
		Если ТипОбучения = "all" ИЛИ ТипОбучения = "periodic" Тогда
			
			ЗапросДанных.Текст = ЗапросДанных.Текст + 
				"ВЫБРАТЬ
				|	ДанныеВебКабинетаСУО_ПП.Данные КАК object
				|ИЗ
				|	РегистрСведений.ДанныеВебКабинетаСУО_ПП КАК ДанныеВебКабинетаСУО_ПП
				|ГДЕ
				|	ДанныеВебКабинетаСУО_ПП.Пользователь = &Пользователь
				|	И ДанныеВебКабинетаСУО_ПП.Тип В (&Тип)
				|   И ДанныеВебКабинетаСУО_ПП.Период МЕЖДУ &ДатаНачала И &ДатаОкончания";
				
			КоличествоСекцийЗапроса = КоличествоСекцийЗапроса + 1;
				
		КонецЕсли;
		
		Если ТипОбучения = "all" ИЛИ ТипОбучения = "distant" Тогда
			
			Если КоличествоСекцийЗапроса > 0 Тогда
				ЗапросДанных.Текст = ЗапросДанных.Текст + " ОБЪЕДИНИТЬ ВСЕ ";
			КонецЕсли;
				
			ЗапросДанных.Текст = ЗапросДанных.Текст + "
				|ВЫБРАТЬ
				|	ДанныеВебКабинетаСУО_ПН.Данные КАК object
				|ИЗ
				|	РегистрСведений.ДанныеВебКабинетаСУО_ПН КАК ДанныеВебКабинетаСУО_ПН
				|ГДЕ
				|	ДанныеВебКабинетаСУО_ПН.Пользователь = &Пользователь
				|	И ДанныеВебКабинетаСУО_ПН.Тип В (&Тип)";
				
			КоличествоСекцийЗапроса = КоличествоСекцийЗапроса + 1;
				
		КонецЕсли;
		
		// Выбираем общие активности, которые образуют виды обучения с группировкой	
		
		Если КоличествоСекцийЗапроса > 0 Тогда
			ЗапросДанных.Текст = ЗапросДанных.Текст + " ОБЪЕДИНИТЬ ВСЕ ";
		КонецЕсли;

		ЗапросДанных.Текст = ЗапросДанных.Текст + "
		|ВЫБРАТЬ
		|	ДанныеВебКабинетаСУО_ОН.Данные КАК object
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУО_ОН КАК ДанныеВебКабинетаСУО_ОН
		|ГДЕ
		|	ДанныеВебКабинетаСУО_ОН.Тип В(&Тип)";	
			
		КоличествоСекцийЗапроса = КоличествоСекцийЗапроса + 1;
		
		
	Иначе
		
		МассивОтборов = Новый Массив;
		
		Если СтрДлина(ОтборДанных) = 36 Тогда
			
			Попытка
				МассивОтборов.Добавить(Новый УникальныйИдентификатор(ОтборДанных));
			Исключение
			КонецПопытки;				
			
		Иначе
			
			Если Найти(ОтборДанных, "_") = 0 Тогда
				МассивСтрокОтборов = Новый Массив;
				МассивСтрокОтборов.Добавить(ОтборДанных);
			Иначе
				МассивСтрокОтборов = ОбщегоНазначенияСУКлиентСервер.РасщепитьСтроку(ОтборДанных, "_");	
			КонецЕсли;
			
			Для каждого ОтборСтрока Из МассивСтрокОтборов Цикл			
				Попытка
					МассивОтборов.Добавить(Перечисления.ОтборыДанныхВебКабинетаСУО.Идентификатор(Перечисления.ОтборыДанныхВебКабинетаСУО[ВебКабинетСУ.Перевод(ОтборСтрока, "ОтборыДанныхВебКабинетаСУО")]));
				Исключение
				КонецПопытки;				
			КонецЦикла;
			
		КонецЕсли;
			
		Если МассивОтборов.Количество() = 0 Тогда
			Возврат ОтветКлиентуJSON("noFilter");
		КонецЕсли;
		
		Если ТипОбучения = "all" ИЛИ ТипОбучения = "periodic" Тогда
			
			ЗапросДанных.Текст = ЗапросДанных.Текст + 
				"ВЫБРАТЬ
				|	ДанныеВебКабинетаСУО_ПП.Данные КАК object
				|ИЗ
				|	РегистрСведений.ДанныеВебКабинетаСУО_ПП КАК ДанныеВебКабинетаСУО_ПП
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыДанныхВебКабинетаСУО_О КАК ОтборыДанныхВебКабинетаСУО_О
				|		ПО ДанныеВебКабинетаСУО_ПП.Объект = ОтборыДанныхВебКабинетаСУО_О.Объект
				|ГДЕ
				|	ДанныеВебКабинетаСУО_ПП.Пользователь = &Пользователь
				|	И ДанныеВебКабинетаСУО_ПП.Тип В (&Тип)
				|	И ОтборыДанныхВебКабинетаСУО_О.Отбор = &Отбор
				|	И ДанныеВебКабинетаСУО_ПП.Период МЕЖДУ &ДатаНачала И &ДатаОкончания";
				
			КоличествоСекцийЗапроса = КоличествоСекцийЗапроса + 1;
				
		КонецЕсли;
		
		Если ТипОбучения = "all" ИЛИ ТипОбучения = "distant" Тогда
			
			Если КоличествоСекцийЗапроса > 0 Тогда
				ЗапросДанных.Текст = ЗапросДанных.Текст + " ОБЪЕДИНИТЬ ВСЕ ";
			КонецЕсли;
		
			ЗапросДанных.Текст = ЗапросДанных.Текст + "
				|ВЫБРАТЬ
				|	ДанныеВебКабинетаСУО_ПН.Данные КАК object
				|ИЗ
				|	РегистрСведений.ДанныеВебКабинетаСУО_ПН КАК ДанныеВебКабинетаСУО_ПН
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыДанныхВебКабинетаСУО_О КАК ОтборыДанныхВебКабинетаСУО_О
				|		ПО ДанныеВебКабинетаСУО_ПН.Объект = ОтборыДанныхВебКабинетаСУО_О.Объект
				|ГДЕ
				|	ДанныеВебКабинетаСУО_ПН.Пользователь = &Пользователь
				|	И ДанныеВебКабинетаСУО_ПН.Тип В (&Тип)
				|	И ОтборыДанныхВебКабинетаСУО_О.Отбор = &Отбор";
			
				
			КоличествоСекцийЗапроса = КоличествоСекцийЗапроса + 1;
				
		КонецЕсли;
		
		// Выбираем общие активности, которые образуют виды обучения с группировкой	
		
		Если КоличествоСекцийЗапроса > 0 Тогда
			ЗапросДанных.Текст = ЗапросДанных.Текст + " ОБЪЕДИНИТЬ ВСЕ ";
		КонецЕсли;

		ЗапросДанных.Текст = ЗапросДанных.Текст + "
		|ВЫБРАТЬ
		|	ДанныеВебКабинетаСУО_ОН.Данные КАК object
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУО_ОН КАК ДанныеВебКабинетаСУО_ОН
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыДанныхВебКабинетаСУО_О КАК ОтборыДанныхВебКабинетаСУО_О
		|		ПО ДанныеВебКабинетаСУО_ОН.Объект = ОтборыДанныхВебКабинетаСУО_О.Объект
		|ГДЕ
		|	ДанныеВебКабинетаСУО_ОН.Тип В(&Тип)
		|	И ОтборыДанныхВебКабинетаСУО_О.Отбор = &Отбор";	
			
		КоличествоСекцийЗапроса = КоличествоСекцийЗапроса + 1;		
		
		
		Если МассивОтборов.Количество() = 1 Тогда
			
			ЗапросДанных.УстановитьПараметр("Отбор", МассивОтборов[0]);
			
		Иначе
			
			УсловиеОтбора = " (";
			НомерОтбора = 1;
			Для каждого Отбор Из МассивОтборов Цикл
			
				УсловиеОтбора = УсловиеОтбора + " ОтборыДанныхВебКабинетаСУО_О.Отбор = &Отбор" + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(НомерОтбора) + " ИЛИ";
				
				ЗапросДанных.УстановитьПараметр("Отбор"+ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(НомерОтбора), Отбор);
				
				НомерОтбора = НомерОтбора + 1;
				
			КонецЦикла;
			
			УсловиеОтбора = Сред(УсловиеОтбора, 1, СтрДлина(УсловиеОтбора) - 3); // Убираем последнее ИЛИ
			
			УсловиеОтбора = УсловиеОтбора + ") ";
			
			ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "ОтборыДанныхВебКабинетаСУО_О.Отбор = &Отбор", УсловиеОтбора);
			
		КонецЕсли;
	
		
	КонецЕсли;
	
	Если КоличествоСекцийЗапроса = 0 Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда
		
		ЗапросДанных.УстановитьПараметр("ДатаНачала", ДатаНачала);
		ЗапросДанных.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
		
	Иначе
		
		ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "И ДанныеВебКабинетаСУО_ПП.Период МЕЖДУ &ДатаНачала И &ДатаОкончания", "");
		
	КонецЕсли;		
	
	
	// Устанавливаем параметры запроса и выполняем его	
	
	МассивТиповАктивностей = Новый Массив;
	
	Если (Права.Свойство("Обучение") И Права.Обучение) Тогда
		МассивТиповАктивностей.Добавить(Перечисления.ТипыДанныхВебКабинетаСУО.УчебнаяАктивность);
	КонецЕсли;
	
	Если Права.Свойство("Преподавание") И Права.Преподавание Тогда
		МассивТиповАктивностей.Добавить(Перечисления.ТипыДанныхВебКабинетаСУО.ПреподавательскаяАктивность);
	КонецЕсли;
	
	ЗапросДанных.УстановитьПараметр("Тип", МассивТиповАктивностей);
	
	ЗапросДанных.УстановитьПараметр("Пользователь", ДанныеСессии.Пользователь);
	
	РезультатЗапроса = ЗапросДанных.Выполнить();
	
	// Возвращаем результат
	
	Возврат ОтветКлиентуJSON(,РезультатЗапроса.Выгрузить());		
	
КонецФункции

Функция ПолучитьОписаниеАктивностиУчастникаОбученияPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем тип активности
	
	Попытка
		ТипАктивности = Запрос.ПараметрыURL.Получить("ТипАктивности");
	Исключение
	КонецПопытки;
	
	Если ТипАктивности <> "education" И ТипАктивности <> "teaching" И ТипАктивности <> "check" Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;	
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	Если ТипАктивности = "education" Тогда
		ПравоДляПроверки = "Обучение";
	КонецЕсли;
	
	Если ТипАктивности = "teaching" Тогда
		ПравоДляПроверки = "Преподавание";
	КонецЕсли;	
	
	Если ТипАктивности = "check" Тогда
		ПравоДляПроверки = "Преподавание";
	КонецЕсли;	
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, ПравоДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные
	//	
	
	Попытка
		Идентификатор = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("ИдентификаторАктивности"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(Идентификатор) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	Если ТипАктивности = "education" Тогда
		ДокументАктивности = Документы.ПрохождениеОбученияСУО.ПолучитьСсылку(Идентификатор);
	КонецЕсли;
	
	Если ТипАктивности = "check" Тогда
		ДокументАктивности = Документы.ПрохождениеОбученияСУО.ПолучитьСсылку(Идентификатор);
	КонецЕсли;	
	
	Если ТипАктивности = "teaching" Тогда
		ДокументАктивности = Документы.ПроведениеПреподавателемОбученияСУО.ПолучитьСсылку(Идентификатор);
	КонецЕсли;		
	
	// Ждем окончания заданий
	
	ОжидатьЗавершенияЗаданияОбновленияЭлектронногоРесурса(ДанныеСессии, ДокументАктивности);		
	
	// Делаем запрос к БД
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст = 
		"ВЫБРАТЬ
		|	ДанныеВебКабинетаСУО.Данные КАК data
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУО_ПН КАК ДанныеВебКабинетаСУО
		|ГДЕ
		|	ДанныеВебКабинетаСУО.Пользователь = &Пользователь
		|	И ДанныеВебКабинетаСУО.Тип = &Тип
		|	И ДанныеВебКабинетаСУО.Объект = &Объект";
	
	ЗапросДанных.УстановитьПараметр("Объект", ДокументАктивности);
	
	Если ТипАктивности = "check" Тогда
		ЗапросДанных.УстановитьПараметр("Пользователь", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументАктивности, "Пользователь"));
	Иначе		
		ЗапросДанных.УстановитьПараметр("Пользователь", ДанныеСессии.Пользователь);
	КонецЕсли;	
	
	Если ТипАктивности = "education" Тогда
		ЗапросДанных.УстановитьПараметр("Тип", Перечисления.ТипыДанныхВебКабинетаСУО.УчебнаяАктивностьОписание);
	КонецЕсли;
	
	Если ТипАктивности = "check" Тогда
		ЗапросДанных.УстановитьПараметр("Тип", Перечисления.ТипыДанныхВебКабинетаСУО.УчебнаяАктивностьОписание);
	КонецЕсли;	
	
	Если ТипАктивности = "teaching" Тогда
		ЗапросДанных.УстановитьПараметр("Тип", Перечисления.ТипыДанныхВебКабинетаСУО.ПреподавательскаяАктивностьОписание);
	КонецЕсли;	
	
	РезультатЗапроса = ЗапросДанных.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат ОтветКлиентуJSON("errorData");
		
	Иначе
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ОтветКлиентуXML(ВыборкаДетальныеЗаписи.data.Получить());
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьВедомостьУчастниковОбученияPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, "Преподавание");
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные
	//	
	
	Попытка
		ИдентификаторПроведенияОбучения = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("ПроведениеОбучения"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПроведенияОбучения) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;	

	Попытка
		ИдентификаторСценария =  Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("Сценарий"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторСценария) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	
	Возврат ПолучитьВедомостьУчастниковОбучения(ИдентификаторПроведенияОбучения, ИдентификаторСценария);

КонецФункции

Функция ПолучитьВедомостьУчастниковОбучения(ИдентификаторПроведенияОбучения, ИдентификаторСценария)
	
	// Выбираем данные из базы
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОписаниеПрохожденияОбучения.Данные КАК data
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУО_ПН КАК ОписаниеПрохожденияОбучения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыДанныхВебКабинетаСУО_О КАК ОтборПоПроведениюОбучения
		|		ПО ОписаниеПрохожденияОбучения.Объект = ОтборПоПроведениюОбучения.Объект
		|			И (ОтборПоПроведениюОбучения.Отбор = &ИдентификаторПроведенияОбучения)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыДанныхВебКабинетаСУО_О КАК ОтборПоСценарию
		|		ПО ОписаниеПрохожденияОбучения.Объект = ОтборПоСценарию.Объект
		|			И (ОтборПоСценарию.Отбор = &ИдентификаторСценария)
		|ГДЕ
		|	ОписаниеПрохожденияОбучения.Тип = &Тип";
	
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыДанныхВебКабинетаСУО.УчебнаяАктивностьОписание);
	Запрос.УстановитьПараметр("ИдентификаторПроведенияОбучения", ИдентификаторПроведенияОбучения);
	Запрос.УстановитьПараметр("ИдентификаторСценария", ИдентификаторСценария);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	РезультатТекстXML = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РезультатТекстXML = РезультатТекстXML + ВыборкаДетальныеЗаписи.data.Получить();
	КонецЦикла;	
	
	Возврат ОтветКлиентуXML(РезультатТекстXML);	
	
КонецФункции

Функция ЗаписатьВедомостьУчастниковОбученияPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, "Преподавание");
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные
	//	
	
	Попытка
		ИдентификаторПроведенияОбучения = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("ПроведениеОбучения"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПроведенияОбучения) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;	
	
	Попытка
		ИдентификаторСценария =  Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("Сценарий"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторСценария) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;	
	
	// Получаем данные для записи
	//
	
	ДанныеДляЗаписиJSON = СокрЛП(Запрос.ПолучитьТелоКакСтроку());
	
	Если НЕ ЗначениеЗаполнено(ДанныеДляЗаписиJSON) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	Попытка
		ДанныеДляЗаписи = ОбщегоНазначенияСУ.JSONВДанные(ДанныеДляЗаписиJSON);
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;
	
	// Получаем текущие данные из БД
	//		
	
	МассивПрохожденийОбучения = Новый Массив;
	
	Для каждого Элемент Из ДанныеДляЗаписи Цикл
		
		Если НЕ ЗначениеЗаполнено(Элемент.id) Тогда
			Продолжить;
		КонецЕсли;
		
		МассивПрохожденийОбучения.Добавить(Документы.ПрохождениеОбученияСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент.id)));
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрохождениеОбученияСУО.Ссылка КАК ПрохождениеОбучения,
		|	ПрохождениеОбученияСУО.Статус,
		|	ПрохождениеОбученияСУО.Баллы,
		|	ПрохождениеОбученияСУО.КомментарийПреподавателя
		|ИЗ
		|	Документ.ПрохождениеОбученияСУО КАК ПрохождениеОбученияСУО
		|ГДЕ
		|	ПрохождениеОбученияСУО.Ссылка В(&МассивПрохожденийОбучения)";
	
	Запрос.УстановитьПараметр("МассивПрохожденийОбучения", МассивПрохожденийОбучения);
	
	ТаблицаТекущихДанных = Запрос.Выполнить().Выгрузить();
	
	ПроведениеОбучения = Документы.ПроведениеОбученияСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторПроведенияОбучения));
	ШкалаОценки = Документы.ПроведениеОбученияСУО.ШкалаОценки(ПроведениеОбучения);
	
	// Записываем данные
	//
	
	Для каждого Элемент Из ДанныеДляЗаписи Цикл
		
		Если НЕ ЗначениеЗаполнено(Элемент.id) Тогда
			Продолжить;
		КонецЕсли;
		
		ПрохождениеОбучения = Документы.ПрохождениеОбученияСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент.id));
		
		ДанныеИзменились = Ложь;
		СтарыеДанные = ТаблицаТекущихДанных.Найти(ПрохождениеОбучения, "ПрохождениеОбучения");
		
		Если Элемент.Свойство("status") Тогда
			СтатусПрохождения = Перечисления.СтатусыПрохожденияОбъектовСУО.ЧислоВЗначение(Число(Элемент.status));
			Если СтатусПрохождения <> СтарыеДанные.Статус Тогда
				ДанныеИзменились = Истина;
			КонецЕсли;				
		КонецЕсли;
		
		Если Элемент.Свойство("mark") И ЗначениеЗаполнено(Элемент.mark) Тогда
			ОценкаПрохождения = Справочники.ЭлементыШкалыОценокСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент.mark));
			Если ОценкаПрохождения <> УправлениеОбучениемСУОПовтИсп.ОценкаИзБаллов(СтарыеДанные.Баллы, ШкалаОценки) Тогда
				ДанныеИзменились = Истина;
			КонецЕсли;			
		КонецЕсли;		
		
		Если Элемент.Свойство("comment") Тогда
			КомментарийПреподавателя = Элемент.comment;
		Иначе
			КомментарийПреподавателя = "";
		КонецЕсли;		
		
		Если СтарыеДанные.КомментарийПреподавателя <> КомментарийПреподавателя Тогда			
			ДанныеИзменились = Истина;			
		КонецЕсли;
			
		Если ДанныеИзменились Тогда				
			ОписаниеПрохождения = ОбучениеСУО.ПриПрохожденииМероприятия(ПрохождениеОбучения, СтатусПрохождения, КомментарийПреподавателя,ОценкаПрохождения,,,Истина);			
			ВебКабинетСУО.ОбновитьДанныеПрохожденияОбученияВебКабинета(ПрохождениеОбучения, ОписаниеПрохождения);
		КонецЕсли;
			
	КонецЦикла;

	
	// Возвращаем результат
	//
	
	Возврат ПолучитьВедомостьУчастниковОбучения(ИдентификаторПроведенияОбучения, ИдентификаторСценария);
	
КонецФункции

Функция ПолучитьРезультатыТестированияPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	ПраваДляПроверки = Новый Массив;
	ПраваДляПроверки.Добавить("Обучение");
	ПраваДляПроверки.Добавить("Преподавание");	
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, ПраваДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные
	//	
	
	Попытка
		ТипАктивности = Запрос.ПараметрыURL.Получить("ТипАктивности");
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;
	
	Если ТипАктивности <> "education" И ТипАктивности <> "check" Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;		
	
	Попытка
		ИдентификаторПрохожденияОбучения = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("ПрохождениеОбучения"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПрохожденияОбучения) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;		
	
	Попытка
		ПрохождениеОбучения = Документы.ПрохождениеОбученияСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторПрохожденияОбучения));
	Исключение
	КонецПопытки;	
	
	// Ждем окончания заданий
	
	Отбор = Новый Структура;
   	Отбор.Вставить("ИмяМетода", "ОбучениеСУО.ПриПрохожденииЭлектронногоРесурса");
   	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	Отбор.Вставить("Ключ", Строка(ДанныеСессии.Пользователь.УникальныйИдентификатор()));
   	ФоновыеЗаданияОбновления = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	Если ФоновыеЗаданияОбновления.Количество() > 0 Тогда
		Попытка
			ФоновыеЗадания.ОжидатьЗавершения(ФоновыеЗаданияОбновления, 10);
		Исключение
			ЗаписьЖурналаРегистрации(
				НСТр("ru = 'Веб-кабинет. Получение данных'"),
				УровеньЖурналаРегистрации.Ошибка,
				,
				ПрохождениеОбучения,
				НСТр("ru = 'Не дождались окончания выполнения фонового задания по обновлению данных при получении результатов тестирования. '") + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;			
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст = 
		"ВЫБРАТЬ
		|	ДанныеВебКабинетаСУО.Данные КАК data
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУО_ПН КАК ДанныеВебКабинетаСУО
		|ГДЕ
		|	ДанныеВебКабинетаСУО.Пользователь = &Пользователь
		|	И ДанныеВебКабинетаСУО.Тип = &Тип
		|	И ДанныеВебКабинетаСУО.Объект = &Объект";
	
	ЗапросДанных.УстановитьПараметр("Объект", ПрохождениеОбучения);
	ЗапросДанных.УстановитьПараметр("Тип", Перечисления.ТипыДанныхВебКабинетаСУО.РезультатыТестирования);
	
	Если ТипАктивности = "check" Тогда
		ЗапросДанных.УстановитьПараметр("Пользователь", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПрохождениеОбучения, "Пользователь"));
	Иначе		
		ЗапросДанных.УстановитьПараметр("Пользователь", ДанныеСессии.Пользователь);
	КонецЕсли;	
	
	РезультатЗапроса = ЗапросДанных.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат ОтветКлиентуJSON(,"");
		
	Иначе
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ОтветКлиентуJSON(,ВыборкаДетальныеЗаписи.data);
		
	КонецЕсли;
	
КонецФункции

Функция УстановитьПроведениеПреподавателемОбученияPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, "Преподавание");
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные
	//	
	
	Попытка
		ИдентификаторПроведенияПреподавателемОбучения = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("ПроведениеПреподавателемОбучения"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПроведенияПреподавателемОбучения) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;	
	
	Попытка
		Проведено = ОбщегоНазначенияСУКлиентСервер.СтрокаВБулево(Запрос.ПараметрыURL.Получить("Проведено"));
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;	
	
	// Записываем данные
	//
	
	ПроведениеПреподавателемОбучения = Документы.ПроведениеПреподавателемОбученияСУО.ПолучитьСсылку(ИдентификаторПроведенияПреподавателемОбучения);
	РезультатОтмены = Документы.ПроведениеПреподавателемОбученияСУО.УстановитьОтметкуПроведено(ПроведениеПреподавателемОбучения, Проведено); // Плюс обновится ВК 	
	
	// Завершаем
	//
	
	Если ТипЗнч(РезультатОтмены) <> Тип("Структура") Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	РезультатОтмены.Вставить("ОперацияЗавершена", РезультатОтмены.Успех);
	РезультатОтмены.Удалить("Успех");
	
	Возврат ОтветКлиентуJSON(, РезультатОтмены);
	
КонецФункции

Функция ПолучитьОписаниеВыполненияЗаданияPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
		
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	ПраваДляПроверки = Новый Массив;
	ПраваДляПроверки.Добавить("Обучение");
	ПраваДляПроверки.Добавить("Преподавание");
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, ПраваДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные
	//	
	
	Попытка
		ИдентификаторПрохожденияОбучения = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("ПрохождениеОбучения"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПрохожденияОбучения) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	ПрохождениеОбучения = Документы.ПрохождениеОбученияСУО.ПолучитьСсылку(ИдентификаторПрохожденияОбучения);
	
	Попытка
		ИдентификаторЗадания = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("Задание"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	Задание = Справочники.ЗаданияСУО.ПолучитьСсылку(ИдентификаторЗадания);
	
	ПерваяЗагрузка = Ложь;
	ЭтоПроверкаПреподавателем = Неопределено;
	
	ДанныеДляЗаписиJSON = СокрЛП(Запрос.ПолучитьТелоКакСтроку());
	
	Если ЗначениеЗаполнено(ДанныеДляЗаписиJSON) Тогда
		
		Попытка
			ДанныеДляЗаписи = ОбщегоНазначенияСУ.JSONВДанные(ДанныеДляЗаписиJSON);
		Исключение
		КонецПопытки;
		
		Если ТипЗнч(ДанныеДляЗаписи) = Тип("Структура")
			И ДанныеДляЗаписи.Свойство("firstLoad")
			И ОбщегоНазначенияСУКлиентСервер.СтрокаВБулево(ДанныеДляЗаписи.firstLoad) Тогда
			
			ПерваяЗагрузка = Истина;
			
		КонецЕсли;
		
		Если ТипЗнч(ДанныеДляЗаписи) = Тип("Структура")
			И ДанныеДляЗаписи.Свойство("typeActivity") Тогда
			
			ЭтоПроверкаПреподавателем = ?(ДанныеДляЗаписи.typeActivity = "check" ИЛИ ДанныеДляЗаписи.typeActivity = "teaching", Истина, Ложь);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПопыткаВыполненияЗадания = ОбучениеСУО.ПоследнееПрохождениеЗадания(ПрохождениеОбучения, Задание);
	
	Если ПерваяЗагрузка И НЕ ЗначениеЗаполнено(ПопыткаВыполненияЗадания) Тогда
		
		// Когда выполняется загрузка карточки следует
		// вызывать событие ПриПрохожденииЗадания, чтобы
		// создать прохождение, если его нет.
		// В других случаях, когда надо получить свежие
		// данные данные карточки это событие не вызываем.
		
		// Событие владельца не вызываем. Это будет сделано при
		// завершении задания.
		
		// Выполняем действия при выполнении задания
		
		ОписаниеПрохождения = ОбучениеСУО.ПриПрохожденииЗадания(ПрохождениеОбучения, Задание,,,Ложь,,,Истина);
		
		// Делаем дополнительные проверки прав
		
		Если ОписаниеПрохождения.Пользователь <> ДанныеСессии.Пользователь Тогда
			
			Права = ДанныеСессии.Права.Получить();
		
			Если НЕ Права.Свойство("Преподавание") ИЛИ НЕ Права.Преподавание Тогда
				Возврат ОтветКлиентуJSON("noPermissions");
			КонецЕсли;		
			
		КонецЕсли;	
		
		// Обновляем данные веб-кабинета после транзакции
		
		ВебКабинетСУ.ОбновитьДанныеОбъекта(Документы.ПопыткаВыполненияЗаданияСУО, ОписаниеПрохождения.ПопыткаВыполненияЗадания);
		
		ПопыткаВыполненияЗадания = ОписаниеПрохождения.ПопыткаВыполненияЗадания;
		ПользовательЗадания = ОписаниеПрохождения.Пользователь;
		ПроверенПреподавателем = Ложь;
		
	Иначе		
		
		ДанныеПопыткиЗадания = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПопыткаВыполненияЗадания, Новый Структура("ПользовательЗадания, ПроверенПреподавателем", "ПрохождениеОбучения.Пользователь", "ПроверенПреподавателем"));
		
		ПользовательЗадания = ДанныеПопыткиЗадания.ПользовательЗадания;
		ПроверенПреподавателем = ДанныеПопыткиЗадания.ПроверенПреподавателем;
		
	КонецЕсли;
	
	Если ЭтоПроверкаПреподавателем = Истина И НЕ ПроверенПреподавателем Тогда
		
		// Записываем преподавателя, который проверяет задание
		
		Попытка
			ОписаниеПрохождения = ОбучениеСУО.ПриПрохожденииЗадания(ПрохождениеОбучения, Задание,,,Ложь,,,Истина,,,,,,ДанныеСессии.Пользователь);
		Исключение
			// Это не очень важная функция, поэтому исключений не выбрасываем
			ЗаписьЖурналаРегистрации(
				НСТр("ru = 'Веб-кабинет. При начале проверки задания'"),
				УровеньЖурналаРегистрации.Ошибка,
				,
				ПрохождениеОбучения,
				НСТр("ru = 'Не удалось указать проверяющего преподавателя. '") + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));			
		КонецПопытки;
		
		Попытка
			ВебКабинетСУ.ОбновитьДанныеОбъекта(Документы.ПопыткаВыполненияЗаданияСУО, ПопыткаВыполненияЗадания);
		Исключение
			// Это не очень важная функция, поэтому исключений не выбрасываем
			ЗаписьЖурналаРегистрации(
				НСТр("ru = 'Веб-кабинет. При начале проверки задания'"),
				УровеньЖурналаРегистрации.Ошибка,
				,
				ПрохождениеОбучения,
				НСТр("ru = 'Не удалось обновить данные при начале проверки задания. '") + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));						
		КонецПопытки;			
		
	КонецЕсли;
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст = 
		"ВЫБРАТЬ
		|	ДанныеВебКабинетаСУО.Данные КАК data
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУО_ПН КАК ДанныеВебКабинетаСУО
		|ГДЕ
		|	ДанныеВебКабинетаСУО.Пользователь = &Пользователь
		|	И ДанныеВебКабинетаСУО.Тип = &Тип
		|	И ДанныеВебКабинетаСУО.Объект = &Объект";
	
	ЗапросДанных.УстановитьПараметр("Объект", ПопыткаВыполненияЗадания);
	ЗапросДанных.УстановитьПараметр("Пользователь", ПользовательЗадания);
	ЗапросДанных.УстановитьПараметр("Тип", Перечисления.ТипыДанныхВебКабинетаСУО.ВыполнениеЗаданияОписание);
	
	РезультатЗапроса = ЗапросДанных.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат ОтветКлиентуJSON("errorData");
		
	Иначе
		
		Возврат ОтветКлиентуJSON(,РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("data")[0]);
		
	КонецЕсли;

КонецФункции

Функция ЗаписатьДанныеВыполненияЗаданияPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
		
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	ПраваДляПроверки = Новый Массив;
	ПраваДляПроверки.Добавить("Обучение");
	ПраваДляПроверки.Добавить("Преподавание");
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, ПраваДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;

	// Получаем данные
	//	
	
	Попытка
		ИдентификаторВыполненияЗадания = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("ВыполнениеЗадания"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторВыполненияЗадания) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	ПопыткаВыполненияЗадания = Документы.ПопыткаВыполненияЗаданияСУО.ПолучитьСсылку(ИдентификаторВыполненияЗадания);
	
	// Получаем данные для записи
	//
	
	ДанныеДляЗаписиJSON = СокрЛП(Запрос.ПолучитьТелоКакСтроку());
	
	Если НЕ ЗначениеЗаполнено(ДанныеДляЗаписиJSON) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	Попытка
		ДанныеДляЗаписи = ОбщегоНазначенияСУ.JSONВДанные(ДанныеДляЗаписиJSON);
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;
	
	Если НЕ ДанныеДляЗаписи.Свойство("answer") Тогда		
		Возврат ОтветКлиентуJSON("errorData");		
	КонецЕсли;
		
	ОписаниеВыполненияЗадания = ОбучениеСУО.ПриПрохожденииЗадания(,,,,Истина,,,Истина,,ДанныеДляЗаписи.answer,,ПопыткаВыполненияЗадания);
	ВебКабинетСУ.ОбновитьДанныеОбъекта(Документы.ПопыткаВыполненияЗаданияСУО, ПопыткаВыполненияЗадания);
	
	// Возвращаем результат
	//
	
	Возврат ОтветКлиентуJSON(, Новый Структура("ОперацияЗавершена, РезультатВыполненияЗадания", Истина, ОписаниеВыполненияЗадания));
	
КонецФункции

Функция ОтменитьВыполнениеЗаданияPOST(Запрос)
		
	УстановитьПривилегированныйРежим(Истина);
		
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	ПраваДляПроверки = Новый Массив;
	ПраваДляПроверки.Добавить("Обучение");
	ПраваДляПроверки.Добавить("Преподавание");
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, ПраваДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;

	// Получаем данные
	//	
	
	Попытка
		ИдентификаторВыполненияЗадания = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("ВыполнениеЗадания"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторВыполненияЗадания) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	ПопыткаВыполненияЗадания = Документы.ПопыткаВыполненияЗаданияСУО.ПолучитьСсылку(ИдентификаторВыполненияЗадания);
	
	// Получаем данные для записи
	//
	
	ОписаниеВыполненияЗадания = ОбучениеСУО.ПриПрохожденииЗадания(,,,,Истина,,,Истина,Ложь,,Истина,ПопыткаВыполненияЗадания);
	ВебКабинетСУ.ОбновитьДанныеОбъекта(Документы.ПопыткаВыполненияЗаданияСУО, ПопыткаВыполненияЗадания);
	ВебКабинетСУ.ОбновитьДанныеОбъекта(Документы.ПрохождениеОбученияСУО, ОписаниеВыполненияЗадания.ПрохождениеОбучения);

	// Возвращаем результат
	//
	
	Возврат ОтветКлиентуJSON(, Новый Структура("ОперацияЗавершена, РезультатВыполненияЗадания", Истина, ОписаниеВыполненияЗадания));
	
КонецФункции

Функция ЗаписатьОценкиЗаданийОбученияPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, "Преподавание");
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные
	//	
	
	Попытка
		ИдентификаторПрохожденияОбучения = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("ПрохождениеОбучения"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПрохожденияОбучения) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;	
	
	ПрохождениеОбучения = Документы.ПрохождениеОбученияСУО.ПолучитьСсылку(ИдентификаторПрохожденияОбучения);
	
	// Получаем данные для записи
	//
	
	ДанныеДляЗаписиJSON = СокрЛП(Запрос.ПолучитьТелоКакСтроку());
	
	Если НЕ ЗначениеЗаполнено(ДанныеДляЗаписиJSON) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	Попытка
		ДанныеДляЗаписи = ОбщегоНазначенияСУ.JSONВДанные(ДанныеДляЗаписиJSON);
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;
	
	// Записываем данные
	//
	
	Для каждого Элемент Из ДанныеДляЗаписи Цикл
		
		Если НЕ ЗначениеЗаполнено(Элемент.task) Тогда
			Продолжить;
		КонецЕсли;
		
		Задание = Справочники.ЗаданияСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент.task));
		
		ПопыткаЗавершена = Неопределено;
		
		Оценка = Неопределено;
		
		Если Элемент.Свойство("mark") Тогда		
			
			Если ЗначениеЗаполнено(Элемент.mark) Тогда
				
				ПопыткаЗавершена = Истина;
				
				Оценка = Справочники.ЭлементыШкалыОценокСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент.mark));
				
			Иначе
				
				ПопыткаЗавершена = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Комментарий = Неопределено;
		
		Если Элемент.Свойство("comment") Тогда				
			Комментарий = ?(ЗначениеЗаполнено(Элемент.comment), Элемент.comment, "");
		КонецЕсли;
		
		ПричинаВозвратаЗадания = Неопределено;
		
		Если Элемент.Свойство("reasonToRevision")
			И ЗначениеЗаполнено(Элемент.reasonToRevision)
			И СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Элемент.reasonToRevision) Тогда
			
			ПричинаВозвратаЗадания = Справочники.ПричиныВозвратаЗаданияНаДоработкуСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент.reasonToRevision));
			
		КонецЕсли;
			
		ОписаниеПрохождения = ОбучениеСУО.ПриПрохожденииЗадания(
			ПрохождениеОбучения,
			Задание,
			Оценка,
			Комментарий,
			Истина,
			,
			,
			Истина,
			ПопыткаЗавершена,
			,
			,
			,
			ПричинаВозвратаЗадания,
			ДанныеСессии.Пользователь); 
		
		ВебКабинетСУ.ОбновитьДанныеОбъекта(Документы.ПопыткаВыполненияЗаданияСУО, ОписаниеПрохождения.ПопыткаВыполненияЗадания);
		
		Элемент.Вставить("taskActionResult", ОписаниеПрохождения)
		
	КонецЦикла;
	
	ОбновитьДанныеПрохожденияОбученияВебКабинета(ПрохождениеОбучения);
		
	// Возвращаем результат
	//
	
	Возврат ОтветКлиентуJSON(, Новый Структура("ОперацияЗавершена, Результат", Истина, ДанныеДляЗаписи));
	
КонецФункции

Функция ОбновитьДанныеПрохожденияОбученияВебКабинета(ПрохождениеОбучения, СтатусПрохождения = Неопределено)
	
	ОписаниеПрохождения = ОбучениеСУО.ПриПрохожденииМероприятия(ПрохождениеОбучения, СтатусПрохождения,,,,,Истина,,,Ложь);
	
	ВебКабинетСУО.ОбновитьДанныеПрохожденияОбученияВебКабинета(ПрохождениеОбучения, ОписаниеПрохождения);
	
	Возврат ОписаниеПрохождения;
	
КонецФункции

Функция ЗавершитьВыполнениеЗаданияPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
		
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	ПраваДляПроверки = Новый Массив;
	ПраваДляПроверки.Добавить("Обучение");
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, ПраваДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;

	// Получаем данные
	//	
	
	Попытка
		ИдентификаторВыполненияЗадания = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("ВыполнениеЗадания"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторВыполненияЗадания) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	ПопыткаВыполненияЗадания = Документы.ПопыткаВыполненияЗаданияСУО.ПолучитьСсылку(ИдентификаторВыполненияЗадания);
	ДанныеОбучения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПопыткаВыполненияЗадания, "ПрохождениеОбучения, Задание");
	
	ОтветПользователя = Неопределено;
	
	ДанныеДляЗаписиJSON = СокрЛП(Запрос.ПолучитьТелоКакСтроку());
	
	Если ЗначениеЗаполнено(ДанныеДляЗаписиJSON) Тогда
		
		Попытка
			ДанныеДляЗаписи = ОбщегоНазначенияСУ.JSONВДанные(ДанныеДляЗаписиJSON);
		Исключение
		КонецПопытки;
		
		Если ТипЗнч(ДанныеДляЗаписи) = Тип("Структура") И ДанныеДляЗаписи.Свойство("answer") Тогда			
			ОтветПользователя = ДанныеДляЗаписи.answer;
		КонецЕсли;		
		
	КонецЕсли;
	
	// Завершаем выполнение задания	
	
	ОписаниеВыполненияЗадания = ОбучениеСУО.ПриПрохожденииЗадания(
		ДанныеОбучения.ПрохождениеОбучения,
		ДанныеОбучения.Задание,
		,
		,
		Ложь,
		,
		,
		Истина,
		Истина,
		ОтветПользователя,
		Истина,
		ПопыткаВыполненияЗадания);
		
	ОбновитьДанныеПрохожденияОбученияВебКабинета(ДанныеОбучения.ПрохождениеОбучения);
	
	ВебКабинетСУ.ОбновитьДанныеОбъекта(Документы.ПопыткаВыполненияЗаданияСУО, ПопыткаВыполненияЗадания);
	
	// Возвращаем результат
	//
	
	Возврат ОтветКлиентуJSON(, Новый Структура("ОперацияЗавершена, РезультатВыполненияЗадания", Истина, ОписаниеВыполненияЗадания));
	
КонецФункции

Функция ПолучитьЗаданияНаПроверкуPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, "Преподавание");
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	НастройкиОтбора = Новый Структура;
	
	НастройкиОтбораJSON = СокрЛП(Запрос.ПолучитьТелоКакСтроку());
	
	Если ЗначениеЗаполнено(НастройкиОтбораJSON) Тогда		
		Попытка
			НастройкиОтбора = ОбщегоНазначенияСУ.JSONВДанные(НастройкиОтбораJSON);
		Исключение
		КонецПопытки;		
	КонецЕсли;
	
	Если ТипЗнч(НастройкиОтбора) <> Тип("Структура") Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	// Получаем данные из базы
	//
	
	ЗапросДанных = Новый Запрос;
	
	Если НастройкиОтбора.Свойство("providingEducation") Тогда
		
		Попытка
			ПроведениеОбученияИдентификатор = Новый УникальныйИдентификатор(НастройкиОтбора.providingEducation);
		Исключение
			Возврат ОтветКлиентуJSON("errorData");
		КонецПопытки;		
		
		ЗапросДанных.Текст = 
			"ВЫБРАТЬ
			|	ОтложенныеЗаданияНаПроверкуСУО.ДатаИзменения КАК postponeDate,
			|	ДанныеВебКабинетаСУО.Объект КАК Объект,
			|	ДанныеВебКабинетаСУО.Пользователь КАК Пользователь,
			|	ДанныеВебКабинетаСУО.Тип КАК Тип
			|ПОМЕСТИТЬ ДанныеКабинета
			|ИЗ
			|	РегистрСведений.ДанныеВебКабинетаСУО_ПН КАК ДанныеВебКабинетаСУО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыДанныхВебКабинетаСУО_О КАК ОтборыДанныхВебКабинетаСУО_О
			|		ПО ДанныеВебКабинетаСУО.Объект = ОтборыДанныхВебКабинетаСУО_О.Объект
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтложенныеЗаданияНаПроверкуСУО КАК ОтложенныеЗаданияНаПроверкуСУО
			|		ПО ДанныеВебКабинетаСУО.Пользователь = ОтложенныеЗаданияНаПроверкуСУО.Преподаватель
			|			И ДанныеВебКабинетаСУО.Объект = ОтложенныеЗаданияНаПроверкуСУО.ПопыткаВыполнения
			|ГДЕ
			|	ДанныеВебКабинетаСУО.Пользователь = &Пользователь
			|	И ДанныеВебКабинетаСУО.Тип = &Тип
			|	И ОтборыДанныхВебКабинетаСУО_О.Отбор = &ПроведениеОбученияИдентификатор
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	ОтложенныеЗаданияНаПроверкуСУО.ДатаИзменения,
			|	ДанныеВебКабинетаСУО.Объект,
			|	ДанныеВебКабинетаСУО.Пользователь,
			|	ДанныеВебКабинетаСУО.Тип
			|ИЗ
			|	РегистрСведений.ДанныеВебКабинетаСУО_ПН КАК ДанныеВебКабинетаСУО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтложенныеЗаданияНаПроверкуСУО КАК ОтложенныеЗаданияНаПроверкуСУО
			|		ПО ДанныеВебКабинетаСУО.Пользователь = ОтложенныеЗаданияНаПроверкуСУО.Преподаватель
			|			И ДанныеВебКабинетаСУО.Объект = ОтложенныеЗаданияНаПроверкуСУО.ПопыткаВыполнения
			|ГДЕ
			|	ДанныеВебКабинетаСУО.Пользователь = &Пользователь
			|	И ДанныеВебКабинетаСУО.Тип = &Тип
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДанныеКабинета.postponeDate КАК postponeDate,
			|	ДанныеВебКабинетаСУО_ПН.Данные КАК data
			|ИЗ
			|	РегистрСведений.ДанныеВебКабинетаСУО_ПН КАК ДанныеВебКабинетаСУО_ПН
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеКабинета КАК ДанныеКабинета
			|		ПО ДанныеВебКабинетаСУО_ПН.Пользователь = ДанныеКабинета.Пользователь
			|			И ДанныеВебКабинетаСУО_ПН.Тип = ДанныеКабинета.Тип
			|			И ДанныеВебКабинетаСУО_ПН.Объект = ДанныеКабинета.Объект";
					
		ЗапросДанных.УстановитьПараметр("ПроведениеОбученияИдентификатор", ПроведениеОбученияИдентификатор);
		
	ИначеЕсли НастройкиОтбора.Свойство("count") Тогда
		
		ЗапросДанных.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 10
			|	ДанныеВебКабинетаСУО.Данные КАК data,
			|	NULL КАК postponeDate
			|ИЗ
			|	РегистрСведений.ДанныеВебКабинетаСУО_ПН КАК ДанныеВебКабинетаСУО
			|ГДЕ
			|	ДанныеВебКабинетаСУО.Пользователь = &Пользователь
			|	И ДанныеВебКабинетаСУО.Тип = &Тип
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДанныеВебКабинетаСУО.ДатаИзменения";	
		
		ЗапросДанных.Текст = СтрЗаменить(ЗапросДанных.Текст, "10", ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(НастройкиОтбора.count)); 
		
	Иначе		
		
		ЗапросДанных.Текст = 
			"ВЫБРАТЬ
			|	ДанныеВебКабинетаСУО.Данные КАК data,
			|	ОтложенныеЗаданияНаПроверкуСУО.ДатаИзменения КАК postponeDate
			|ИЗ
			|	РегистрСведений.ДанныеВебКабинетаСУО_ПН КАК ДанныеВебКабинетаСУО
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтложенныеЗаданияНаПроверкуСУО КАК ОтложенныеЗаданияНаПроверкуСУО
			|		ПО ДанныеВебКабинетаСУО.Пользователь = ОтложенныеЗаданияНаПроверкуСУО.Преподаватель
			|			И ДанныеВебКабинетаСУО.Объект = ОтложенныеЗаданияНаПроверкуСУО.ПопыткаВыполнения
			|ГДЕ
			|	ДанныеВебКабинетаСУО.Пользователь = &Пользователь
			|	И ДанныеВебКабинетаСУО.Тип = &Тип";
		
	КонецЕсли;
		
	ЗапросДанных.УстановитьПараметр("Пользователь", ДанныеСессии.Пользователь);
	ЗапросДанных.УстановитьПараметр("Тип", Перечисления.ТипыДанныхВебКабинетаСУО.ПроверкаЗаданияОписание);
	
	РезультатЗапросаТаблица = ЗапросДанных.Выполнить().Выгрузить();
	
	// Возвращаем результат
	//
	
	Возврат ОтветКлиентуJSON(,РезультатЗапросаТаблица);
	
КонецФункции

Функция НачатьПрохождениеОбученияPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
		
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	ПраваДляПроверки = Новый Массив;
	ПраваДляПроверки.Добавить("Обучение");
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, ПраваДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные
	//	
	
	Попытка
		ИдентификаторПрохожденияОбучения = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("ПрохождениеОбучения"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПрохожденияОбучения) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	ПрохождениеОбучения = Документы.ПрохождениеОбученияСУО.ПолучитьСсылку(ИдентификаторПрохожденияОбучения);
	
	// Начинаем обучение
	//
	
	ОбновитьДанныеПрохожденияОбученияВебКабинета(ПрохождениеОбучения, Перечисления.СтатусыПрохожденияОбъектовСУО.Проходит);
	
	// Возвращаем новое описание обучения
	//

	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст = 
		"ВЫБРАТЬ
		|	ДанныеВебКабинетаСУО.Данные КАК data
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУО_ПН КАК ДанныеВебКабинетаСУО
		|ГДЕ
		|	ДанныеВебКабинетаСУО.Пользователь = &Пользователь
		|	И ДанныеВебКабинетаСУО.Тип = &Тип
		|	И ДанныеВебКабинетаСУО.Объект = &Объект";
	
	ЗапросДанных.УстановитьПараметр("Объект", ПрохождениеОбучения);
	ЗапросДанных.УстановитьПараметр("Тип", Перечисления.ТипыДанныхВебКабинетаСУО.УчебнаяАктивностьОписание);
	ЗапросДанных.УстановитьПараметр("Пользователь", ДанныеСессии.Пользователь);
		
	РезультатЗапроса = ЗапросДанных.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда		
		Возврат ОтветКлиентуJSON("errorData");		
	Иначе	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
		ВыборкаДетальныеЗаписи.Следующий();		
		Возврат ОтветКлиентуXML(ВыборкаДетальныеЗаписи.data.Получить());		
	КонецЕсли;
	
КонецФункции

Функция ЗавершитьПрохождениеОбученияPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
		
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	ПраваДляПроверки = Новый Массив;
	ПраваДляПроверки.Добавить("Обучение");
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, ПраваДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные
	//	
	
	Попытка
		ИдентификаторПрохожденияОбучения = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("ИдентификаторАктивности"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПрохожденияОбучения) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	ПрохождениеОбучения = Документы.ПрохождениеОбученияСУО.ПолучитьСсылку(ИдентификаторПрохожденияОбучения);
	
	ПрохождениеЗадания = Неопределено;
	Задание = Неопределено;
	ПрохождениеЗадания = Неопределено;
	
	Задания = Документы.ПрохождениеОбученияСУО.ЗаданияПрохождения(ПрохождениеОбучения);
	
	Если Задания.Количество() = 1 Тогда
		Задание = Задания[0].Задание;
		ПрохождениеЗадания = Задания[0].ПопыткаВыполнения;
	КонецЕсли;	
		
	// Завершаем обучение
	//
	
	Если ЗначениеЗаполнено(ПрохождениеЗадания) И ЗначениеЗаполнено(Задание) Тогда
		ДанныеПрохожденияЗадания = ОбучениеСУО.ПриПрохожденииЗадания(ПрохождениеОбучения,Задание,,,Ложь,,,Истина,,,,ПрохождениеЗадания);
		ВебКабинетСУ.ОбновитьДанныеОбъекта(Документы.ПопыткаВыполненияЗаданияСУО, ДанныеПрохожденияЗадания.ПопыткаВыполненияЗадания);
	КонецЕсли;			
	
	ОписаниеПрохождения = ОбучениеСУО.ПриПрохожденииМероприятия(ПрохождениеОбучения, "Завершил",,,,,Истина,Истина);
	
	Если ЗначениеЗаполнено(ПрохождениеЗадания) И ЗначениеЗаполнено(Задание) Тогда
		ОписаниеПрохождения.ЗавершеноВПроцентах = ДанныеПрохожденияЗадания.ЗавершеноВПроцентах;
	КонецЕсли;
	
	ВебКабинетСУО.ОбновитьДанныеПрохожденияОбученияВебКабинета(ПрохождениеОбучения, ОписаниеПрохождения);
		
	Возврат ОтветКлиентуJSON(,ОписаниеПрохождения)	
	
КонецФункции

Функция ПолучитьДополнительныеСведенияАктивностиPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	ПраваДляПроверки = Новый Массив;
	ПраваДляПроверки.Добавить("Обучение");
	ПраваДляПроверки.Добавить("Преподавание");	
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, ПраваДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;

	// Получаем данные
	//	
	
	Попытка
		ИдентификаторПрохожденияОбучения = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("ПрохождениеОбучения"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПрохожденияОбучения) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;	
	
	ПрохождениеОбучения = Документы.ПрохождениеОбученияСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторПрохожденияОбучения));	
	
	ДополнительныеСведения = Новый Структура;
	ДополнительныеСведения.Вставить("ДополнительныеСведения", ВебКабинетСУО.ТаблицаДополнительныхРеквизитовОбъекта(ПрохождениеОбучения));
	
	// Возвращаем результат
	//
	
	Возврат ОтветКлиентуJSON(,ДополнительныеСведения);	
	
КонецФункции

Функция СохранитьДополнительныеСведенияАктивностиPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	ПраваДляПроверки = Новый Массив;
	ПраваДляПроверки.Добавить("Обучение");
	ПраваДляПроверки.Добавить("Преподавание");	
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, ПраваДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные
	//		
	
	Попытка
		ИдентификаторПрохожденияОбучения = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("ПрохождениеОбучения"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПрохожденияОбучения) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;	
	
	ПрохождениеОбучения = Документы.ПрохождениеОбученияСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторПрохожденияОбучения));	
	
	// Записываем настройки	
	//
	
	НастройкиДляЗаписиJSON = СокрЛП(Запрос.ПолучитьТелоКакСтроку());
	
	Если НЕ ЗначениеЗаполнено(НастройкиДляЗаписиJSON) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	Попытка
		НастройкиДляЗаписи = ОбщегоНазначенияСУ.JSONВДанные(НастройкиДляЗаписиJSON);
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;
	
	Для каждого Настройка Из НастройкиДляЗаписи Цикл
		Если Настройка.Ключ = "additionalInfo" Тогда			
			УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(ПрохождениеОбучения, СформироватьТаблицуДополнительныхСвойств(Настройка.Значение));			
		КонецЕсли;
	КонецЦикла;	
	
	// Возвращаем результат
	//
	
	Возврат ОтветКлиентуJSON(, Новый Структура("ОперацияЗавершена", Истина));	
	
КонецФункции

Функция ПолучитьУчастниковУчебнойАктивностиPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	ПраваДляПроверки = Новый Массив;
	ПраваДляПроверки.Добавить("Обучение");
	ПраваДляПроверки.Добавить("Преподавание");	
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, ПраваДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные
	//	
	
	Попытка
		ИдентификаторПроведенияОбучения = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("ПроведениеОбучения"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПроведенияОбучения) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;	
	
	Попытка
		ИдентификаторСценария =  Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("Сценарий"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторСценария) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	// Получаем данные об участниках
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст = 
		"ВЫБРАТЬ
		|	ВыборкаУчастников.Данные КАК participant
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУО_ОН КАК ВыборкаУчастников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыДанныхВебКабинетаСУО_О КАК ОтборПроведенияОбучения
		|		ПО ВыборкаУчастников.Объект = ОтборПроведенияОбучения.Объект
		|			И (ОтборПроведенияОбучения.Отбор = &ИдентификаторПроведенияОбучения)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыДанныхВебКабинетаСУО_О КАК ОтборПоСценарию
		|		ПО ВыборкаУчастников.Объект = ОтборПоСценарию.Объект
		|			И (ОтборПоСценарию.Отбор = &ИдентификаторСценария)
		|ГДЕ
		|	ВыборкаУчастников.Тип = &ТипДанных";
		
	// Отбор активных участников не делается, но это возможно при необходимости
		
	ЗапросДанных.УстановитьПараметр("ИдентификаторПроведенияОбучения", ИдентификаторПроведенияОбучения);
	ЗапросДанных.УстановитьПараметр("ИдентификаторСценария", ИдентификаторСценария);
	ЗапросДанных.УстановитьПараметр("ТипДанных", Перечисления.ТипыДанныхВебКабинетаСУО.УчастникОбучения);
	
	Возврат ОтветКлиентуJSON(,ЗапросДанных.Выполнить().Выгрузить().ВыгрузитьКолонку("participant"));
	
КонецФункции

Функция ПолучитьПреподавателейОбученияPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	ПраваДляПроверки = Новый Массив;
	ПраваДляПроверки.Добавить("Обучение");
	ПраваДляПроверки.Добавить("Преподавание");	
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, ПраваДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные
	//	
	
	Попытка
		ИдентификаторПроведенияОбучения = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("ПроведениеОбучения"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПроведенияОбучения) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;	
	
	Попытка
		ИдентификаторСценария =  Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("Сценарий"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторСценария) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	
	// Получаем данные об участниках
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст = 
		"ВЫБРАТЬ
		|	ВыборкаУчастников.Данные КАК teacher
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУО_ОН КАК ВыборкаУчастников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыДанныхВебКабинетаСУО_О КАК ОтборПроведенияОбучения
		|		ПО ВыборкаУчастников.Объект = ОтборПроведенияОбучения.Объект
		|			И (ОтборПроведенияОбучения.Отбор = &ИдентификаторПроведенияОбучения)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыДанныхВебКабинетаСУО_О КАК ОтборПоСценарию
		|		ПО ВыборкаУчастников.Объект = ОтборПоСценарию.Объект
		|			И (ОтборПоСценарию.Отбор = &ИдентификаторСценария)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыДанныхВебКабинетаСУО_О КАК ОтборВидимыхУчащимся
		|		ПО ВыборкаУчастников.Объект = ОтборВидимыхУчащимся.Объект
		|			И (ОтборВидимыхУчащимся.Отбор = &ИдентификаторВидимыхЭлементов)
		|ГДЕ
		|	ВыборкаУчастников.Тип = &ТипДанных";		
			
	ЗапросДанных.УстановитьПараметр("ИдентификаторВидимыхЭлементов", Перечисления.ОтборыДанныхВебКабинетаСУО.Идентификатор(Перечисления.ОтборыДанныхВебКабинетаСУО.Видимые));
	ЗапросДанных.УстановитьПараметр("ИдентификаторПроведенияОбучения", ИдентификаторПроведенияОбучения);
	ЗапросДанных.УстановитьПараметр("ИдентификаторСценария", ИдентификаторСценария);
	ЗапросДанных.УстановитьПараметр("ТипДанных", Перечисления.ТипыДанныхВебКабинетаСУО.ПреподавательОбучения);
	
	Возврат ОтветКлиентуJSON(,ЗапросДанных.Выполнить().Выгрузить().ВыгрузитьКолонку("teacher"));
	
КонецФункции

Функция ПолучитьОписаниеПроведенияОбученияPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	ПраваДляПроверки = Новый Массив;
	ПраваДляПроверки.Добавить("Обучение");
	ПраваДляПроверки.Добавить("Преподавание");
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, ПраваДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные запроса
	//	
	
	ИдентификаторПроведенияОбучения = Запрос.ПараметрыURL.Получить("ПроведениеОбучения");
		
	Попытка
		ПроведениеОбучения = Документы.ПроведениеОбученияСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторПроведенияОбучения));
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;	
	
	// Делаем запрос к базе данных
	//
	
	ЗапросДанных = Новый Запрос;
	
	ЗапросДанных.Текст = "ВЫБРАТЬ
	                     |	ДанныеВебКабинетаСУО_ОН.Данные КАК data
	                     |ИЗ
	                     |	РегистрСведений.ДанныеВебКабинетаСУО_ОН КАК ДанныеВебКабинетаСУО_ОН
	                     |ГДЕ
	                     |	ДанныеВебКабинетаСУО_ОН.Тип = &Тип
	                     |	И ДанныеВебКабинетаСУО_ОН.Объект = &ПроведениеОбучения";	
		
	ЗапросДанных.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);	   	
	ЗапросДанных.УстановитьПараметр("Тип", Перечисления.ТипыДанныхВебКабинетаСУО.ОписаниеОбучения);

	РезультатЗапроса = ЗапросДанных.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;	

	ВыборкаДанных = РезультатЗапроса.Выбрать();
	ВыборкаДанных.Следующий();
	
	// Возвращаем результат
	
	Возврат ОтветКлиентуJSON(,ВыборкаДанных.data);	
	
КонецФункции

Функция ПолучитьОписаниеЗаявкиНаОбучениеPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	ПраваДляПроверки = Новый Массив;
	ПраваДляПроверки.Добавить("Обучение");
	ПраваДляПроверки.Добавить("Преподавание");
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, ПраваДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные запроса
	//	
	
	ИдентификаторПроведенияОбучения = Запрос.ПараметрыURL.Получить("ПроведениеОбучения");
		
	Попытка
		ПроведениеОбучения = Документы.ПроведениеОбученияСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторПроведенияОбучения));
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;	
	
	// Делаем запрос к базе данных
	//
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст = 
		"ВЫБРАТЬ
		|	ВыборкаЗаявок.Данные КАК application
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУО_ПН КАК ВыборкаЗаявок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыДанныхВебКабинетаСУО_П КАК ОтборЗаявокПоПроведениюОбучения
		|		ПО ВыборкаЗаявок.Пользователь = ОтборЗаявокПоПроведениюОбучения.Пользователь
		|			И ВыборкаЗаявок.Объект = ОтборЗаявокПоПроведениюОбучения.Объект
		|			И (ВыборкаЗаявок.Пользователь = &Пользователь)
		|			И (ВыборкаЗаявок.Тип = &Тип)
		|ГДЕ
		|	ОтборЗаявокПоПроведениюОбучения.Отбор = &УникальныйИдентификаторПроведенияОбучения";
	
	ЗапросДанных.УстановитьПараметр("УникальныйИдентификаторПроведенияОбучения", ПроведениеОбучения.УникальныйИдентификатор());
	ЗапросДанных.УстановитьПараметр("Пользователь", ДанныеСессии.Пользователь);
	ЗапросДанных.УстановитьПараметр("Тип", Перечисления.ТипыДанныхВебКабинетаСУО.ОписаниеЗаявки);
	
	ТаблицаЗаявок = ЗапросДанных.Выполнить().Выгрузить();	
		
	// Возвращаем результат
	//
	
	Возврат ОтветКлиентуJSON(,ТаблицаЗаявок);
	
КонецФункции

Функция СоздатьЗаявкуНаОбучениеPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	ПраваДляПроверки = Новый Массив;
	ПраваДляПроверки.Добавить("Обучение");
	ПраваДляПроверки.Добавить("Преподавание");
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, ПраваДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные запроса
	//	
	
	ИдентификаторПроведенияОбучения = Запрос.ПараметрыURL.Получить("ПроведениеОбучения");
		
	Попытка
		ПроведениеОбучения = Документы.ПроведениеОбученияСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторПроведенияОбучения));
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;	

	ДанныеДляЗаписиJSON = СокрЛП(Запрос.ПолучитьТелоКакСтроку());
	
	Если НЕ ЗначениеЗаполнено(ДанныеДляЗаписиJSON) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	Попытка
		ДанныеДляЗаписи = ОбщегоНазначенияСУ.JSONВДанные(ДанныеДляЗаписиJSON);
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;
	
	// Делаем проверку возможности подать заявку
	//
		
	Если Документы.ЗаявкаНаОбучениеСУО.МожноПодатьЗаявку(ПроведениеОбучения, ДанныеСессии.Пользователь) Тогда
		
		НачатьТранзакцию();
		
		Попытка
			
			ТекстЗаявки = ?(ДанныеДляЗаписи.Свойство("text"), ДанныеДляЗаписи.text, "");
		
			ЗаявкаНаОбучение = ОбучениеСУО.ПодатьЗаявкуНаОбучение(ПроведениеОбучения, ДанныеСессии.Пользователь, ТекстЗаявки, Истина);
			
			Если ДанныеДляЗаписи.Свойство("additionalInfo") И ТипЗнч(ДанныеДляЗаписи.additionalInfo) = Тип("Массив") И ДанныеДляЗаписи.additionalInfo.Количество() > 0 Тогда
				УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(ЗаявкаНаОбучение, СформироватьТаблицуДополнительныхСвойств(ДанныеДляЗаписи.additionalInfo));
			КонецЕсли;
			
			ВебКабинетСУ.ОбновитьДанныеОбъекта(ОбщегоНазначения.МенеджерОбъектаПоСсылке(ЗаявкаНаОбучение), ЗаявкаНаОбучение);
			
			ЗафиксироватьТранзакцию();
		
		Исключение
		
		 	ОтменитьТранзакцию();
			ВызватьИсключение;
			
		КонецПопытки;
		
	Иначе
		
		Возврат ОтветКлиентуJSON("applicationNewError");
		
	КонецЕсли;
	
	// Возвращаем результат
	//
	
	Возврат ОтветКлиентуJSON(, Новый Структура("Заявка", ЗаявкаНаОбучение));
	
КонецФункции

Функция ЗаписатьсяНаОбучениеPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	ПраваДляПроверки = Новый Массив;
	ПраваДляПроверки.Добавить("Обучение");
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, ПраваДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;

	// Получаем данные запроса
	//	
	
	ИдентификаторПроведенияОбучения = Запрос.ПараметрыURL.Получить("ПроведениеОбучения");
		
	Попытка
		ПроведениеОбучения = Документы.ПроведениеОбученияСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторПроведенияОбучения));
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;	
	
	// Зачисляем на обучение
	//
	
 	РезультатЗачисления = ОбучениеСУОВызовСервера.ЗаписатьПользователяНаОткрытоеОбучение(ПроведениеОбучения, ДанныеСессии.Пользователь);
	
	Если РезультатЗачисления = Неопределено Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РезультатЗачисления.ПрохождениеОбучения) Тогда		
		ВебКабинетСУ.ОбновитьДанныеОбъекта(ОбщегоНазначения.МенеджерОбъектаПоСсылке(РезультатЗачисления.ПрохождениеОбучения), РезультатЗачисления.ПрохождениеОбучения);		
	КонецЕсли;
	
	МассивПараметровФЗ = Новый Массив;
	МассивПараметровФЗ.Добавить(ОбщегоНазначения.МенеджерОбъектаПоСсылке(ПроведениеОбучения));
	МассивПараметровФЗ.Добавить(ПроведениеОбучения);
	
	ФоновыеЗадания.Выполнить("ВебКабинетСУ.ОбновитьДанныеОбъекта", МассивПараметровФЗ);
	
	Возврат ОтветКлиентуJSON(,РезультатЗачисления);
	
КонецФункции

Функция ПолучитьСписокСертификатовPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	ПраваДляПроверки = Новый Массив;
	ПраваДляПроверки.Добавить("Обучение");
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, ПраваДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;	
	
	// Получаем данные
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст = 
		"ВЫБРАТЬ
		|	ДанныеВебКабинетаСУО.Данные КАК certificate
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУО_ПН КАК ДанныеВебКабинетаСУО
		|ГДЕ
		|	ДанныеВебКабинетаСУО.Пользователь = &Пользователь
		|	И ДанныеВебКабинетаСУО.Тип = &Тип";
	
	ЗапросДанных.УстановитьПараметр("Тип", Перечисления.ТипыДанныхВебКабинетаСУО.Сертификат);
	ЗапросДанных.УстановитьПараметр("Пользователь", ДанныеСессии.Пользователь);		
	
	РезультатЗапроса = ЗапросДанных.Выполнить();
	
	Возврат ОтветКлиентуJSON(,РезультатЗапроса.Выгрузить());	
	
		
КонецФункции

Функция ПолучитьПредставлениеСертификатаPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ИдентификаторСертификата = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("Сертификат"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторСертификата) Тогда
		Возврат ОтветКлиентуJSON("Sertificate not found");
	КонецЕсли;	
	
	Попытка
		Сертификат = Документы.СертификатСУО.ПолучитьСсылку(ИдентификаторСертификата);
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(Сертификат) Тогда
		Возврат ОтветКлиентуJSON("Sertificate not found");
	КонецЕсли;	
	
	Если НЕ Документы.СертификатСУО.СертификатАктивен(Сертификат) Тогда
		Возврат ОтветКлиентуJSON("Sertificate not found");
	КонецЕсли;
	
	Представление = Документы.СертификатСУО.ПредставлениеHTML(Сертификат);
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Data-type", "text/html"); // Обязательно
	Ответ.УстановитьТелоИзСтроки(Представление);
	ДобавитьЗаголовкиМежсайтовогоЗапроса(Ответ);
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьПредставлениеСертификатаGET(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ИдентификаторСертификата = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("Сертификат"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторСертификата) Тогда
		Возврат ОтветКлиентуJSON("Sertificate not found");
	КонецЕсли;	
	
	Попытка
		Сертификат = Документы.СертификатСУО.ПолучитьСсылку(ИдентификаторСертификата);
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(Сертификат) Тогда
		Возврат ОтветКлиентуJSON("Sertificate not found");
	КонецЕсли;	
	
	Если НЕ Документы.СертификатСУО.СертификатАктивен(Сертификат) Тогда
		Возврат ОтветКлиентуJSON("Sertificate not found");
	КонецЕсли;
	
	ДвоичныеДанныеСертификата = Документы.СертификатСУО.ПредставлениеPDF(Сертификат);
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Data-type", "application/pdf"); // Обязательно
	Ответ.Заголовки.Вставить("Content-Type", "application/pdf");
	Ответ.УстановитьТелоИзДвоичныхДанных(ДвоичныеДанныеСертификата);
	ДобавитьЗаголовкиМежсайтовогоЗапроса(Ответ);
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьФайлыУчастниковОбученияPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, "Преподавание");
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные
	//	
	
	Попытка
		ИдентификаторПроведенияОбучения = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("ПроведениеОбучения"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПроведенияОбучения) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;		
	
	ДополнительныеОтборыJSON = СокрЛП(Запрос.ПолучитьТелоКакСтроку());
	
	ИдентификаторМероприятия = Неопределено;
	ИдентификаторУчастника = Неопределено;
	
	Если ЗначениеЗаполнено(ДополнительныеОтборыJSON) Тогда
	
		Попытка
			ДополнительныеОтборы = ОбщегоНазначенияСУ.JSONВДанные(ДополнительныеОтборыJSON);
		Исключение
			Возврат ОтветКлиентуJSON("errorData");
		КонецПопытки;
		
		Если ДополнительныеОтборы.Свойство("eduTemplate")
			И ЗначениеЗаполнено(ДополнительныеОтборы.eduTemplate) Тогда
			
			ИдентификаторМероприятия = Новый УникальныйИдентификатор(ДополнительныеОтборы.eduTemplate);
			
		КонецЕсли;	
		
				
		Если ДополнительныеОтборы.Свойство("user")
			И ЗначениеЗаполнено(ДополнительныеОтборы.user) Тогда
			
			ИдентификаторУчастника = Новый УникальныйИдентификатор(ДополнительныеОтборы.user);
			
		КонецЕсли;

	КонецЕсли;
	
	// Выбираем данные из базы
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыборкаФайлов.Данные КАК object,
		|	ВыборкаДанныхОПроверкеФайла.Данные КАК userDescription
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУО_ОН КАК ВыборкаФайлов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыДанныхВебКабинетаСУО_О КАК ОтборПроведенияОбучения
		|		ПО ВыборкаФайлов.Объект = ОтборПроведенияОбучения.Объект
		|			И (ОтборПроведенияОбучения.Отбор = &ИдентификаторПроведенияОбучения)
		|       %ОтборПоМероприятию%
		|       %ОтборПоУчастнику%
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыДанныхВебКабинетаСУО_О КАК ОтборПоПреподавателю
		|		ПО ВыборкаФайлов.Объект = ОтборПоПреподавателю.Объект
		|			И (ОтборПоПреподавателю.Отбор = &ИдентификаторПреподавателя)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеВебКабинетаСУО_ПП.СрезПоследних(, Пользователь = &Пользователь) КАК ВыборкаДанныхОПроверкеФайла
		|		ПО ВыборкаФайлов.Объект = ВыборкаДанныхОПроверкеФайла.Объект
		|			И ВыборкаФайлов.Тип = ВыборкаДанныхОПроверкеФайла.Тип
		|ГДЕ
		|	ВыборкаФайлов.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.ФайлУчащегося)";
	
		
	Если ЗначениеЗаполнено(ИдентификаторМероприятия) Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ОтборПоМероприятию%", "
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыДанныхВебКабинетаСУО_О КАК ОтборПоМероприятию
			|	ПО ВыборкаФайлов.Объект = ОтборПоМероприятию.Объект
			|		И (ОтборПоМероприятию.Отбор = &ИдентификаторМероприятия)");			
			
		Запрос.УстановитьПараметр("ИдентификаторМероприятия", ИдентификаторМероприятия);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ОтборПоМероприятию%", "");
		
	КонецЕсли;				
		
	Если ЗначениеЗаполнено(ИдентификаторУчастника) Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ОтборПоУчастнику%", "
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыДанныхВебКабинетаСУО_О КАК ОтборПоУчастнику
			|	ПО ВыборкаФайлов.Объект = ОтборПоУчастнику.Объект
			|		И (ОтборПоУчастнику.Отбор = &ИдентификаторУчастника)");			
			
		Запрос.УстановитьПараметр("ИдентификаторУчастника", ИдентификаторУчастника);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ОтборПоУчастнику%", "");
		
	КонецЕсли;		
	
	
	Запрос.УстановитьПараметр("ИдентификаторПроведенияОбучения", ИдентификаторПроведенияОбучения);
	Запрос.УстановитьПараметр("ИдентификаторПреподавателя", ДанныеСессии.Пользователь.УникальныйИдентификатор());
	Запрос.УстановитьПараметр("Пользователь", ДанныеСессии.Пользователь);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ОтветКлиентуJSON(,РезультатЗапроса.Выгрузить());
	
КонецФункции

Функция ЗаписатьНастройкиФайлаУчастникаОбученияPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, "Преподавание");
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные
	//	
	
	Попытка
		ИдентификаторФайла = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("ФайлУчастникаОбучения"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторФайла) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;	

	Файл = Справочники.ПрохождениеОбученияСУОПрисоединенныеФайлы.ПолучитьСсылку(ИдентификаторФайла);
	
	НастройкиДляЗаписиJSON = СокрЛП(Запрос.ПолучитьТелоКакСтроку());
	
	Если НЕ ЗначениеЗаполнено(НастройкиДляЗаписиJSON) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	Попытка
		НастройкиДляЗаписи = ОбщегоНазначенияСУ.JSONВДанные(НастройкиДляЗаписиJSON);
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;
	
	ИмяНастройки      = Неопределено;
	ЗначениеНастройки = Неопределено;
	
	Если НастройкиДляЗаписи.Свойство("name") И НастройкиДляЗаписи.Свойство("value") Тогда
		Попытка
			ИмяНастройки      = НастройкиДляЗаписи.name;
			ЗначениеНастройки = НастройкиДляЗаписи.value; 
		Исключение
			Возврат ОтветКлиентуJSON("errorData");
		КонецПопытки;			
	КонецЕсли;
	
	ТекущаяДата = ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(ЗначениеНастройки);
	
	Файлы = Новый Массив;
	Файлы.Добавить(Файл);	
	
	Если ИмяНастройки = "setChecked" Тогда
		РегистрыСведений.ФайлыПроверенныеПреподавателямиСУО.ЗапомнитьПроверенныеФайлы(Файлы, ДанныеСессии.Пользователь, ТекущаяДата, Истина);
	КонецЕсли;
	
	Если ИмяНастройки = "clearChecked" Тогда
		РегистрыСведений.ФайлыПроверенныеПреподавателямиСУО.ОчиститьПроверенныеФайлы(Файлы, ДанныеСессии.Пользователь, Истина);
	КонецЕсли;
	
	РегистрыСведений.ФайлыПроверенныеПреподавателямиСУО.ОбновитьДанныеВебКабинета(Файл);
	
	Возврат ОтветКлиентуJSON(, Новый Структура("ОперацияЗавершена, Дата", Истина, ТекущаяДата));	
	
КонецФункции

Функция ОтложитьЗаданияНаПроверкуPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, "Преподавание");
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные для записи
	//
	
	ПараметрыJSON = СокрЛП(Запрос.ПолучитьТелоКакСтроку());
	
	Если НЕ ЗначениеЗаполнено(ПараметрыJSON) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	Попытка
		ПараметрыСтруктура = ОбщегоНазначенияСУ.JSONВДанные(ПараметрыJSON);
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;	
	
	НачатьТранзакцию();
	
	Попытка
		
		Для каждого СвойствоЗадания Из ПараметрыСтруктура.taskAttempts Цикл	

			Попытка
				ИдентификаторПрохожденияОбучения = Новый УникальныйИдентификатор(СвойствоЗадания.userActivity);
			Исключение
			КонецПопытки;
			
			ПрохождениеОбучения = Документы.ПрохождениеОбученияСУО.ПолучитьСсылку(ИдентификаторПрохожденияОбучения);
			
			НаОсновеЭлектронногоРесурса = СвойствоЗадания.onElectronicResource;
			
			Попытка
				ИдентификаторПопыткиВыполнения = Новый УникальныйИдентификатор(СвойствоЗадания.taskAttempt);
			Исключение
			КонецПопытки;
			
			Если НаОсновеЭлектронногоРесурса Тогда
				ПопыткаВыполнения = Документы.СессияЭлектронногоРесурсаСУЗ.ПолучитьСсылку(ИдентификаторПопыткиВыполнения);
			Иначе
				ПопыткаВыполнения = Документы.ПопыткаВыполненияЗаданияСУО.ПолучитьСсылку(ИдентификаторПопыткиВыполнения);
			КонецЕсли;
			
			РегистрыСведений.ОтложенныеЗаданияНаПроверкуСУО.ОтложитьЗадание(ПопыткаВыполнения, ДанныеСессии.Пользователь, ПрохождениеОбучения);
		
		КонецЦикла;		
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	// Возвращаем результат
	//
	
	Возврат ОтветКлиентуJSON(, Новый Структура("ОперацияЗавершена", Истина));
	
КонецФункции

// Файлы (пользовательские)

Функция ЗагрузитьФайлPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки   = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем переменные
	//
	
	ЗаголовкиЗапроса       = Запрос.Заголовки;
	ИдентификаторВладельца = Запрос.ПараметрыURL.Получить("ИдентификаторВладельца");
	ТипВладельца           = Запрос.ПараметрыURL.Получить("ТипВладельца");
	ПараметрыФайла         = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(Запрос.ПолучитьТелоКакСтроку(), "", ";", ":", Истина);
	
	ФайлыДляЗаписи = ФайлыДляЗаписи(ПараметрыФайла);
	
	Если ФайлыДляЗаписи = Неопределено Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;	
	
	// Загружаем файлы в базу
	//	
	
	Если ТипВладельца = "userPhoto" Тогда
		
		Если ФайлыДляЗаписи.Количество() <> 1 Тогда
			Возврат ОтветКлиентуJSON("errorData");
		КонецЕсли;
		
		СвойстваФайла = ФайлыДляЗаписи[0];
		
		РегистрыСведений.ФотографииПользователейСУО.СохранитьФотографиюПользователя(ДанныеСессии.Пользователь, СвойстваФайла.АдресХраненияФайла,, Истина);
		
		РегистрыСведений.ФотографииПользователейСУО.ОбновитьДанныеВебКабинета(ДанныеСессии.Пользователь);
		
		ВебКабинетСУО.ОбновитьДанныеПользователяВебКабинета(ДанныеСессии.Пользователь);
		
		Возврат ОтветКлиентуJSON(, Новый Структура("ОперацияЗавершена", Истина));	
		
	Иначе
		
		ВладелецФайла = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ВебКабинетСУ.Перевод(ТипВладельца, "Метаданные")).ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторВладельца));
		
		ЗагруженныеФайлы = Новый Массив;
		
		Для каждого ФайлДляЗаписи Из ФайлыДляЗаписи Цикл
		
			СсылкаНаФайл = ПрисоединенныеФайлы.ДобавитьФайл(ВладелецФайла, ФайлДляЗаписи.ИмяФайлаБезРасширения, ФайлДляЗаписи.РасширениеФайлаБезТочки, ТекущаяДатаСеанса(), ФайлДляЗаписи.ВремяИзмененияФайла, ФайлДляЗаписи.АдресХраненияФайла,, ФайлДляЗаписи.ОписаниеФайла);
			
			Если НЕ ЗначениеЗаполнено(СсылкаНаФайл) Тогда
				Возврат ОтветКлиентуJSON("saveFileError");
			КонецЕсли;
			
			// Меняем автора на текущего пользователя
			
			ФайлОбъект = СсылкаНаФайл.ПолучитьОбъект();
			ФайлОбъект.Автор = ДанныеСессии.Пользователь;
			ФайлОбъект.Записать();
			
			ЗагруженныеФайлы.Добавить(Новый Структура("name, ref, extension",
				ФайлДляЗаписи.ИмяФайлаБезРасширения, Строка(СсылкаНаФайл.УникальныйИдентификатор()), ФайлДляЗаписи.РасширениеФайла));
			
		КонецЦикла;
			
		// Перепроводим документ владельца
		//
		
		ДокументыДляПерепроведения = Новый Массив;
		ДокументыДляПерепроведения.Добавить(ВладелецФайла);
		
		ОбщегоНазначенияСУ.ПровестиДокументы(ДокументыДляПерепроведения,,Новый Структура("НеОбновлятьДанныеВебКабинета", Истина));		
	
		ВебКабинетСУ.ОбновитьДанныеОбъекта(ОбщегоНазначения.МенеджерОбъектаПоСсылке(ВладелецФайла), ВладелецФайла);
		
		Возврат ОтветКлиентуJSON(,ЗагруженныеФайлы);

	КонецЕсли;	
	
		
КонецФункции

Функция УдалитьФайлPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем ссылку на файл
	//
	
	ТипВладельца           = Запрос.ПараметрыURL.Получить("ТипВладельца");
	ИдентификаторВладельца = Запрос.ПараметрыURL.Получить("ИдентификаторВладельца");
	ИдентификаторФайла     = Запрос.ПараметрыURL.Получить("ИдентификаторФайла");	
	Пользователь           = ДанныеСессии.Пользователь;
	НастройкиКлиента       = ОбщегоНазначенияСУ.JSONВДанные(Запрос.ПолучитьТелоКакСтроку());
	АдресФайла             = Неопределено;
	Права                  = ДанныеСессии.Права.Получить();
	
	// Примечание: в ПолучитьАдресФайлаPOST аналогичный алгоритм поиска файла 
	
	Если ТипВладельца = "common" Тогда
		
		Возврат ОтветКлиентуJSON("noPermissions");
		
	Иначе
		
		ВладелецФайла = Неопределено;
		ПользовательВладельца = Неопределено;
		
		Если ТипВладельца = "userActivity" Тогда			
			ВладелецФайла = Документы.ПрохождениеОбученияСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторВладельца));
			ПользовательВладельца = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВладелецФайла, "Пользователь");
		КонецЕсли;
		
		Если ТипВладельца = "userTask" Тогда			
			ВладелецФайла = Документы.ПопыткаВыполненияЗаданияСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторВладельца));
			ПользовательВладельца = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВладелецФайла, "ПрохождениеОбучения.Пользователь");			
		КонецЕсли;			
		
		Если ТипВладельца = "message" Тогда
			ВладелецФайла = Документы.СообщениеСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторВладельца));
			ПользовательВладельца = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВладелецФайла, "Пользователь");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВладелецФайла) Тогда
			Возврат ОтветКлиентуJSON("errorData");
		КонецЕсли;
		
		
		ИмяСправочникаХраненияФайлов = РаботаСФайламиСлужебный.ИмяСправочникаХраненияФайлов(ВладелецФайла);
		
		Файл = Справочники[ИмяСправочникаХраненияФайлов].ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторФайла));
		
		ЕстьПравоУдаления = Ложь;
		
		Если ТипЗнч(ВладелецФайла) = Тип("ДокументСсылка.ПопыткаВыполненияЗаданияСУО") Тогда
			
			// Проверям, что автор файла совпадает с текущим пользователем, так как
			// в заданиях реализована возможность прикреплять файлы преподавателем.
				
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Файл, "Автор") = Пользователь Тогда
				ЕстьПравоУдаления = Истина;
			КонецЕсли;
			
		Иначе
			
			// Проверяем, что пользователь владельца, к которому прикреплен файл
			// совпадает с текущим пользователем, т.е. он удаляет файл своего объекта.
			// Автор файла может быть любой.
			
			Если ПользовательВладельца = Пользователь Тогда
				ЕстьПравоУдаления = Истина;
			КонецЕсли;
						
		КонецЕсли;
			

		Если НЕ ЕстьПравоУдаления Тогда
			Возврат ОтветКлиентуJSON("noPermissions");
		КонецЕсли;
		
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Файл) Тогда
		
		ФайлОбъект = Файл.ПолучитьОбъект();
		
		ФайлОбъект.ДополнительныеСвойства.Вставить("ОбновитьДанныеВебКабинетаВТранзакции", Истина);
		
		// Примечание: важно учитывать, что обновление данных веб-кабинета зависимых от файла объектов
		// работает только при пометке на удаление, но не при ее снятии, так как при снятии
		// сам файл не отмечается, как зависмый элемент, будучи помеченным на удаление.
		// В этом случае срабатывает подписка ПрисоединенныйФайлПриЗаписиСУО и документ перепроводится
		// регламетным заданием ПерепроведениеДокументовСУО. 
		
		ФайлОбъект.УстановитьПометкуУдаления(Истина, Истина);
		
	Иначе
		
		Возврат ОтветКлиентуJSON("errorData");
		
	КонецЕсли;	
	
	Возврат ОтветКлиентуJSON(, Новый Структура("ОперацияЗавершена", Истина));
	
КонецФункции

Функция ПолучитьИмяФайлаGET(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем ссылку на файл
	//
	
	ТипВладельца           = Запрос.ПараметрыURL.Получить("ТипВладельца");
	ИдентификаторВладельца = Запрос.ПараметрыURL.Получить("ИдентификаторВладельца");
	ИдентификаторФайла     = Запрос.ПараметрыURL.Получить("ИдентификаторФайла");	
	ИмяФайла               = "";

	// Примечание: в УдалитьФайлPOST аналогичный алгоритм поиска файла
	
	Если ТипВладельца = "common" Тогда
		
		Файл = Справочники.Файлы.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторФайла));
		
		ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайла(Файл);
		ИмяФайла =    ДанныеФайла.ПолноеНаименованиеВерсии + "." + ДанныеФайла.Расширение;				
		
	Иначе
		
		ВладелецФайла = Неопределено;
		
		Если ТипВладельца = "userActivity" Тогда
			ВладелецФайла = Документы.ПрохождениеОбученияСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторВладельца));
		КонецЕсли;
		
		Если ТипВладельца = "userTask" Тогда
			ВладелецФайла = Документы.ПопыткаВыполненияЗаданияСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторВладельца));
		КонецЕсли;		
		
		Если ТипВладельца = "message" Тогда
			ВладелецФайла = Документы.СообщениеСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторВладельца));
			ШаблонСообщения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВладелецФайла, "Шаблон");
			Если ЗначениеЗаполнено(ШаблонСообщения) И ТипЗнч(ШаблонСообщения) = Тип("СправочникСсылка.ШаблоныСообщенийСУО") Тогда
				ВладелецФайла = ШаблонСообщения; // Ищем файлы в шаблоне
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВладелецФайла) Тогда
			Возврат ОтветКлиентуJSON("errorData");
		КонецЕсли;
		
		ИмяСправочникаХраненияФайлов = РаботаСФайламиСлужебный.ИмяСправочникаХраненияФайлов(ВладелецФайла);		
		Файл = Справочники[ИмяСправочникаХраненияФайлов].ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторФайла));
		ДанныеФайла = ПрисоединенныеФайлы.ПолучитьДанныеФайла(Файл,,Ложь,Ложь);
		ИмяФайла = ДанныеФайла.ИмяФайла;				
			
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИмяФайла) Тогда
		Возврат ОтветКлиентуJSON("fileNotFound");
	Иначе
		Возврат ОтветКлиентуJSON(,ИмяФайла);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьАдресФайлаPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем ссылку на файл
	//
	
	ТипВладельца           = Запрос.ПараметрыURL.Получить("ТипВладельца");
	ИдентификаторВладельца = Запрос.ПараметрыURL.Получить("ИдентификаторВладельца");
	ИдентификаторФайла     = Запрос.ПараметрыURL.Получить("ИдентификаторФайла");	
	Пользователь           = ДанныеСессии.Пользователь;
	НастройкиКлиента       = ОбщегоНазначенияСУ.JSONВДанные(Запрос.ПолучитьТелоКакСтроку());
	АдресФайла             = Неопределено;
	
	// Примечание: в УдалитьФайлPOST аналогичный алгоритм поиска файла
	
	Если ТипВладельца = "common" Тогда
		
		Файл = Справочники.Файлы.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторФайла));
		
		ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайла(Файл);
		
		Если РаботаСФайламиСлужебный.ХранениеФайловВТомахНаДиске() Тогда
			
			Запрос = Новый Запрос;
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ВерсииФайлов.ПутьКФайлу КАК ПутьКФайлу,
			|	ВерсииФайлов.Том КАК Том
			|ИЗ
			|	Справочник.ВерсииФайлов КАК ВерсииФайлов
			|ГДЕ
			|	ВерсииФайлов.Ссылка = &Версия";
			
			Запрос.Параметры.Вставить("Версия", ДанныеФайла.Версия);
			
			ДанныеФайлаПутьКФайлу = "";
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				ДанныеФайлаПутьКФайлу = Выборка.ПутьКФайлу;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДанныеФайлаПутьКФайлу) Тогда 
			
				АдресФайла = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(НастройкиКлиента.baseFiles);
				АдресФайла = АдресФайла + ДанныеФайлаПутьКФайлу;
				
				АдресФайла = ОбщегоНазначенияСУКлиентСервер.ПривестиСлэши(АдресФайла); 
				
			КонецЕсли;
				
		Иначе
			
			АдресФайла = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(НастройкиКлиента.baseDesktop);			
			АдресФайла = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(АдресФайла + ИдентификаторФайла);
			АдресФайла = ВебКабинетСУО.ПолноеИмяОбщегоФайлаВебКабинета(Файл, АдресФайла, ДанныеФайла);
					
		КонецЕсли;		
		
	Иначе
		
		ВладелецФайла = Неопределено;
		
		Если ТипВладельца = "userActivity" Тогда
			ВладелецФайла = Документы.ПрохождениеОбученияСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторВладельца));
		КонецЕсли;
		
		Если ТипВладельца = "userTask" Тогда
			ВладелецФайла = Документы.ПопыткаВыполненияЗаданияСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторВладельца));
		КонецЕсли;		
		
		Если ТипВладельца = "message" Тогда
			ВладелецФайла = Документы.СообщениеСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторВладельца));
			ШаблонСообщения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВладелецФайла, "Шаблон");
			Если ЗначениеЗаполнено(ШаблонСообщения) И ТипЗнч(ШаблонСообщения) = Тип("СправочникСсылка.ШаблоныСообщенийСУО") Тогда
				ВладелецФайла = ШаблонСообщения; // Ищем файлы в шаблоне
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВладелецФайла) Тогда
			Возврат ОтветКлиентуJSON("errorData");
		КонецЕсли;
		
		ИмяСправочникаХраненияФайлов = РаботаСФайламиСлужебный.ИмяСправочникаХраненияФайлов(ВладелецФайла);
		
		Файл = Справочники[ИмяСправочникаХраненияФайлов].ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторФайла));

		Если РаботаСФайламиСлужебный.ХранениеФайловВТомахНаДиске() Тогда

			ПутьКФайлуВТоме = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Файл, "ПутьКФайлу");
			
			Если ЗначениеЗаполнено(ПутьКФайлуВТоме) Тогда 
			
				АдресФайла = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(НастройкиКлиента.baseFiles);
				АдресФайла = АдресФайла + ПутьКФайлуВТоме;
				
				АдресФайла = ОбщегоНазначенияСУКлиентСервер.ПривестиСлэши(АдресФайла); 
				
			КонецЕсли;			
			
		Иначе
		
			ДанныеФайла = ПрисоединенныеФайлы.ПолучитьДанныеФайла(Файл,,Ложь,Ложь);
			
			АдресФайла = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(НастройкиКлиента.baseDesktop);			
			АдресФайла = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(АдресФайла + ИдентификаторВладельца);
			АдресФайла = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(АдресФайла + ИдентификаторФайла);
			АдресФайла = АдресФайла + ДанныеФайла.ИмяФайла;
			
		КонецЕсли;
			
			
	КонецЕсли;
	
	Если АдресФайла = Неопределено Тогда
		Возврат ОтветКлиентуJSON("fileNotFound");
	Иначе
		Возврат ОтветКлиентуJSON(,АдресФайла);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьФайлGET(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуДвоичныеДанные(401);
	КонецЕсли;
	
	// Получаем ссылку на файл
	//
	
	ТипВладельца           = Запрос.ПараметрыURL.Получить("ТипВладельца");
	ИдентификаторВладельца = Запрос.ПараметрыURL.Получить("ИдентификаторВладельца");
	ИдентификаторФайла     = Запрос.ПараметрыURL.Получить("ИдентификаторФайла");	
	
	Пользователь           = ДанныеСессии.Пользователь;
	ДвоичныеДанные         = Неопределено;
	ИмяФайла               = Неопределено;
	РасширениеФайла        = Неопределено;   
	
	// Примечание: в УдалитьФайлPOST аналогичный алгоритм поиска файла
	
	Если ТипВладельца = "common" Тогда
		
		Файл = Справочники.Файлы.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторФайла));
		
		ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайла(Файл);
		РасширениеФайла = "." + ДанныеФайла.Расширение;
		ИмяФайла = ДанныеФайла.ПолноеНаименованиеВерсии + "." + ДанныеФайла.Расширение;
		
		Если РаботаСФайламиСлужебный.ХранениеФайловВТомахНаДиске() Тогда
			
			Запрос = Новый Запрос;
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ВерсииФайлов.ПутьКФайлу КАК ПутьКФайлу,
			|	ВерсииФайлов.Том КАК Том
			|ИЗ
			|	Справочник.ВерсииФайлов КАК ВерсииФайлов
			|ГДЕ
			|	ВерсииФайлов.Ссылка = &Версия";
			
			Запрос.Параметры.Вставить("Версия", ДанныеФайла.Версия);
			
			ДанныеФайлаПутьКФайлу = "";
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				ДанныеФайлаПутьКФайлу = Выборка.ПутьКФайлу;
				ДанныеФайлаТом = Выборка.Том;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДанныеФайлаПутьКФайлу) Тогда 			
				ПолныйПуть = РаботаСФайламиСлужебный.ПолныйПутьТома(ДанныеФайлаТом) + ДанныеФайлаПутьКФайлу; 
				ДвоичныеДанные = Новый ДвоичныеДанные(ПолныйПуть);
			КонецЕсли;
				
		Иначе
			
			ДвоичныеДанные = РаботаСФайлами.ХранилищеФайлаИзИнформационнойБазы(ДанныеФайла.ТекущаяВерсия).Получить();
					
		КонецЕсли;		
		
	Иначе
		
		ВладелецФайла = Неопределено;
		
		Если ТипВладельца = "userActivity" Тогда
			ВладелецФайла = Документы.ПрохождениеОбученияСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторВладельца));
		КонецЕсли;
		
		Если ТипВладельца = "userTask" Тогда
			ВладелецФайла = Документы.ПопыткаВыполненияЗаданияСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторВладельца));
		КонецЕсли;		
		
		Если ТипВладельца = "message" Тогда
			ВладелецФайла = Документы.СообщениеСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторВладельца));
			ШаблонСообщения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВладелецФайла, "Шаблон");
			Если ЗначениеЗаполнено(ШаблонСообщения) И ТипЗнч(ШаблонСообщения) = Тип("СправочникСсылка.ШаблоныСообщенийСУО") Тогда
				ВладелецФайла = ШаблонСообщения; // Ищем файлы в шаблоне
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВладелецФайла) Тогда
			ИмяСправочникаХраненияФайлов = РаботаСФайламиСлужебный.ИмяСправочникаХраненияФайлов(ВладелецФайла);		
			Файл = Справочники[ИмяСправочникаХраненияФайлов].ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторФайла));
			ДвоичныеДанные = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(Файл);
			ДанныеФайла = ПрисоединенныеФайлы.ПолучитьДанныеФайла(Файл,,Ложь,Ложь);
			ИмяФайла = ДанныеФайла.ИмяФайла;
			РасширениеФайла = "." + ДанныеФайла.Расширение;
		КонецЕсли;
			
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИмяФайла) Тогда
		Возврат ОтветКлиентуДвоичныеДанные(404);
	КонецЕсли;
	
	MIMEТипфайла = ОбщегоНазначенияСУКлиентСервер.MIMEТипПоРасширению(РасширениеФайла);
	
	Возврат ОтветКлиентуДвоичныеДанные(0, ДвоичныеДанные, MIMEТипфайла);
	
КонецФункции

// Подготовливает файлы, полученные из кабинета для записи в базу
//
Функция ФайлыДляЗаписи(ПараметрыФайла)
	
	ФайлыДляЗаписи = Новый Массив;
	
	МассивСвойствФайла = Новый Массив;
	МассивСвойствФайла.Добавить("fileName");
	МассивСвойствФайла.Добавить("fileSize");
	МассивСвойствФайла.Добавить("fileDateModified");
	МассивСвойствФайла.Добавить("fileBase64Data");
	
	Для каждого ИмяСвойства Из МассивСвойствФайла Цикл
	
		Если НЕ ПараметрыФайла.Свойство(ИмяСвойства) Тогда
			Возврат Неопределено; // Ничего не делаем
		КонецЕсли;
		
		Если ТипЗнч(ПараметрыФайла[ИмяСвойства]) <> Тип("Массив") Тогда
			НовыйМассив = Новый Массив;
			НовыйМассив.Добавить(ПараметрыФайла[ИмяСвойства]);
			ПараметрыФайла[ИмяСвойства] = НовыйМассив;
		КонецЕсли;
		
	КонецЦикла;
	
	КоличествоФайлов = ПараметрыФайла.fileName.Количество();
	НомерФайла       = 0;
	ВерсияКабинета = ВебКабинетСУ.ВерсияAPI();
	
	Для каждого ИмяФайла Из ПараметрыФайла.fileName Цикл
		
		// Имя Файлы
		
		ИмяФайла = ПараметрыФайла.fileName[НомерФайла];
		
		ИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайла, "_");
		ВосстановитьСимволыСтрокиПараметров(ИмяФайла);
		
		РасширениеФайла         = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ИмяФайла);
		РасширениеФайлаБезТочки = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(РасширениеФайла);
		ИмяФайлаБезРасширения   = Сред(ИмяФайла, 1, СтрДлина(ИмяФайла) - СтрДлина(РасширениеФайла) - 1);
		
		// Двоичные данные файла
		
		Если НЕ ЗначениеЗаполнено(ПараметрыФайла.fileBase64Data[НомерФайла]) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Попытка
			ДвоичныеДанныеФайла = Base64Значение(ПараметрыФайла.fileBase64Data[НомерФайла]);
		Исключение
			Возврат Неопределено;
		КонецПопытки;	
		
		АдресХраненияФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла);
		
		// Дата файла
		
		ДатаФайлаУниверсальная  = Число(ПараметрыФайла.fileDateModified[НомерФайла]);
		ВремяИзмененияФайла     = ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(ДатаФайлаУниверсальная);
		
		// Описание файла
		
		ОписаниеФайла = НСтр("ru = 'Файл загружен через веб-кабинет'");
		
		ФайлыДляЗаписи.Добавить(Новый Структура("
		|ИмяФайла,
		|РасширениеФайла,
		|РасширениеФайлаБезТочки,
		|ИмяФайлаБезРасширения,
		|АдресХраненияФайла,
		|ВремяИзмененияФайла,
		|ОписаниеФайла",
		ИмяФайла,
		РасширениеФайла,
		РасширениеФайлаБезТочки,
		ИмяФайлаБезРасширения,
		АдресХраненияФайла,
		ВремяИзмененияФайла,
		ОписаниеФайла));
		
		// Следующая итерация
		
		НомерФайла = НомерФайла + 1;
		
	КонецЦикла;
	
	Возврат ФайлыДляЗаписи;
	
КонецФункции

// Форум

Функция ПолучитьРазделыФорумаPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, "Форум");
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем разделы форума
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст = 
		"ВЫБРАТЬ
		|	ДанныеВебКабинетаСУО_ОН.Данные КАК object,
		|	ДанныеВебКабинетаСУО_ОН_Описание.Данные КАК description,
		|	ДанныеВебКабинетаСУО_ПН_Описание.Данные КАК userDescription
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУО_ОН КАК ДанныеВебКабинетаСУО_ОН
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеВебКабинетаСУО_ОН КАК ДанныеВебКабинетаСУО_ОН_Описание
		|		ПО ДанныеВебКабинетаСУО_ОН.Объект = ДанныеВебКабинетаСУО_ОН_Описание.Объект
		|			И (ДанныеВебКабинетаСУО_ОН_Описание.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.РазделФорумаОписание))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеВебКабинетаСУО_ПН КАК ДанныеВебКабинетаСУО_ПН_Описание
		|		ПО ДанныеВебКабинетаСУО_ОН.Объект = ДанныеВебКабинетаСУО_ПН_Описание.Объект
		|			И (ДанныеВебКабинетаСУО_ПН_Описание.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.РазделФорумаОписание))
		|			И (ДанныеВебКабинетаСУО_ПН_Описание.Пользователь = &Пользователь)
		|ГДЕ
		|	ДанныеВебКабинетаСУО_ОН.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.РазделФорума)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеВебКабинетаСУО_ПН.Данные,
		|	ДанныеВебКабинетаСУО_ОН_Описание.Данные,
		|	ДанныеВебКабинетаСУО_ПН_Описание.Данные
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУО_ПН КАК ДанныеВебКабинетаСУО_ПН
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеВебКабинетаСУО_ОН КАК ДанныеВебКабинетаСУО_ОН_Описание
		|		ПО ДанныеВебКабинетаСУО_ПН.Объект = ДанныеВебКабинетаСУО_ОН_Описание.Объект
		|			И (ДанныеВебКабинетаСУО_ОН_Описание.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.РазделФорумаОписание))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеВебКабинетаСУО_ПН КАК ДанныеВебКабинетаСУО_ПН_Описание
		|		ПО ДанныеВебКабинетаСУО_ПН.Объект = ДанныеВебКабинетаСУО_ПН_Описание.Объект
		|			И (ДанныеВебКабинетаСУО_ПН_Описание.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.РазделФорумаОписание))
		|			И (ДанныеВебКабинетаСУО_ПН_Описание.Пользователь = &Пользователь)
		|ГДЕ
		|	ДанныеВебКабинетаСУО_ПН.Пользователь = &Пользователь
		|	И ДанныеВебКабинетаСУО_ПН.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.РазделФорума)";
	
	ЗапросДанных.УстановитьПараметр("Пользователь", ДанныеСессии.Пользователь);
	
	РезультатЗапроса = ЗапросДанных.Выполнить();
	
	// ЗаполнитьЗначенияСвойств
	
	Возврат ОтветКлиентуJSON(,РезультатЗапроса.Выгрузить());
	
КонецФункции

Функция ПолучитьТемыРазделаФорумаPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, "Форум");
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем переменные
	//
		
	МассивИдентификаторов = Новый Массив;
	
	ИдентификаторРазделаЗначениеПараметра = Запрос.ПараметрыURL.Получить("РазделФорума");
	
	Если СтрДлина(ИдентификаторРазделаЗначениеПараметра) > 1 Тогда
	
		ИдентификаторРазделаМассивСтрок = ОбщегоНазначенияСУКлиентСервер.РасщепитьСтроку(ИдентификаторРазделаЗначениеПараметра, ";");
			
		Для каждого ИдентификаторРазделаСтрока Из ИдентификаторРазделаМассивСтрок Цикл
		
			Попытка
				ИдентификаторРаздела = Новый УникальныйИдентификатор(ИдентификаторРазделаСтрока);
			Исключение
			КонецПопытки;
			
			Если НЕ ЗначениеЗаполнено(ИдентификаторРаздела) Тогда
				Возврат ОтветКлиентуJSON("errorData");
			КонецЕсли;	
			
			МассивИдентификаторов.Добавить(ИдентификаторРаздела);
		
		КонецЦикла;
		
	КонецЕсли;
		
	ДанныеДляЗаписиJSON = СокрЛП(Запрос.ПолучитьТелоКакСтроку());
	
	Если ЗначениеЗаполнено(ДанныеДляЗаписиJSON) Тогда
		
		Попытка
			ДанныеДляЗаписиСтруктура = ОбщегоНазначенияСУ.JSONВДанные(ДанныеДляЗаписиJSON);
		Исключение
			Возврат ОтветКлиентуJSON("errorData");
		КонецПопытки;
		
		Если ДанныеДляЗаписиСтруктура.Свойство("categories") 
			И ТипЗнч(ДанныеДляЗаписиСтруктура.categories) = Тип("Массив") Тогда
			Для каждого ИдентификаторРазделаСтрока Из ДанныеДляЗаписиСтруктура.categories Цикл
				Попытка
					ИдентификаторРаздела = Новый УникальныйИдентификатор(ИдентификаторРазделаСтрока);
				Исключение
				КонецПопытки;
				Если НЕ ЗначениеЗаполнено(ИдентификаторРаздела) Тогда
					Возврат ОтветКлиентуJSON("errorData");
				КонецЕсли;
				МассивИдентификаторов.Добавить(ИдентификаторРаздела);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
		
	// Темы раздела
	//
	
	Запрос = Новый Запрос;
		
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписокТем.Данные КАК object,
		|	ОписаниеТем.Данные КАК description,
		|	ОписаниеТемПользовательское.Данные КАК userDescription
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУО_ОН КАК СписокТем
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыДанныхВебКабинетаСУО_О КАК ОтборДанных
		|		ПО СписокТем.Объект = ОтборДанных.Объект
		|			И (СписокТем.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.ТемаОбщения))
		|			И (ОтборДанных.Отбор В (&МассивИдентификаторов))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыДанныхВебКабинетаСУО_О КАК ОтборДанныхПоПользователям
		|		ПО СписокТем.Объект = ОтборДанныхПоПользователям.Объект
		|			И (СписокТем.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.ТемаОбщения))
		|			И (ОтборДанныхПоПользователям.Отбор = &ИдентификаторПользователя)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеВебКабинетаСУО_ОН КАК ОписаниеТем
		|		ПО СписокТем.Объект = ОписаниеТем.Объект
		|			И (СписокТем.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.ТемаОбщения))
		|			И (ОписаниеТем.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.ТемаОбщенияОписание))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеВебКабинетаСУО_ПН КАК ОписаниеТемПользовательское
		|		ПО СписокТем.Объект = ОписаниеТемПользовательское.Объект
		|			И (СписокТем.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.ТемаОбщения))
		|			И (ОписаниеТемПользовательское.Пользователь = &Пользователь)
		|			И (ОписаниеТемПользовательское.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.ТемаОбщенияОписание))";
		
	Запрос.УстановитьПараметр("МассивИдентификаторов", МассивИдентификаторов);
	Запрос.УстановитьПараметр("ИдентификаторПользователя", ДанныеСессии.Пользователь.УникальныйИдентификатор());
	Запрос.УстановитьПараметр("Пользователь", ДанныеСессии.Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ОтветКлиентуJSON(,РезультатЗапроса.Выгрузить());
	
КонецФункции

Функция ПолучитьСообщенияТемыФорумаPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, "Форум");
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем раздел форума
	//
	
	Попытка
		ИдентификаторТемы = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("ТемаФорума"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторТемы) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;	
	
	// Получаем темы раздела форума
	//
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписокСообщений.Данные КАК object
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУО_ОП КАК СписокСообщений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыДанныхВебКабинетаСУО_О КАК ОтборСообщений
		|		ПО СписокСообщений.Объект = ОтборСообщений.Объект
		|			И (ОтборСообщений.Отбор = &ИдентификаторТемы)
		|			И (СписокСообщений.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.Сообщение))";
		
	Запрос.УстановитьПараметр("ИдентификаторТемы", ИдентификаторТемы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ОтветКлиентуJSON(,РезультатЗапроса.Выгрузить());
	
	
КонецФункции

Функция ПолучитьТекстыСообщенийТемыФорумаPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, "Форум");
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем раздел форума
	//
	
	Попытка
		ИдентификаторТемы = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("ТемаФорума"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторТемы) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;	
	
	// Получаем темы раздела форума
	//
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписокСообщений.Данные КАК ТекстСообщения
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУО_ОН КАК СписокСообщений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыДанныхВебКабинетаСУО_О КАК ОтборСообщений
		|		ПО СписокСообщений.Объект = ОтборСообщений.Объект
		|			И (ОтборСообщений.Отбор = &ИдентификаторТемы)
		|			И (СписокСообщений.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.СообщениеОписание))";
		
	Запрос.УстановитьПараметр("ИдентификаторТемы", ИдентификаторТемы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	РезультатТекстXML = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РезультатТекстXML = РезультатТекстXML + ВыборкаДетальныеЗаписи.ТекстСообщения.Получить();
	КонецЦикла;
	
	Возврат ОтветКлиентуXML(РезультатТекстXML);
	
КонецФункции

Функция ПолучитьКоличествоТемСНовымиСообщениямиРазделовФорумаPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, "Форум");
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Обрабатываем данные
	
	МассивИдентификаторомРазделовФорума = ОбщегоНазначенияСУ.JSONВДанные(Запрос.ПолучитьТелоКакСтроку());

	МассивРазделовФорума = Новый Массив;
	
	Для каждого Идентификатор Из МассивИдентификаторомРазделовФорума Цикл
		МассивРазделовФорума.Добавить(Справочники.РазделыФорумаСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор)));
	КонецЦикла;
	
	ТаблицаРазделов = Документы.СообщениеСУО.КоличествоНовыхГрупповыхСообщений(ДанныеСессии.Пользователь, МассивРазделовФорума, Истина);
	
	Возврат ОтветКлиентуJSON(,ТаблицаРазделов);
	
КонецФункции

Функция УдалитьСообщениеФорумаМодераторомPOST(Запрос)
		
	УстановитьПривилегированныйРежим(Истина);

	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	ПраваДляПроверки = Новый Массив;
	ПраваДляПроверки.Добавить("Форум");
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, ПраваДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные запроса
	
	Попытка
		ИдентификаторСообщения = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("Сообщение"));
		Сообщение = Документы.СообщениеСУО.ПолучитьСсылку(ИдентификаторСообщения);
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(Сообщение) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	// Удаляем сообщение
	
	СообщениеОбъект = Сообщение.ПолучитьОбъект();
	
	РазделФорума = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СообщениеОбъект.Тема, "Контекст");
	
	Если ТипЗнч(РазделФорума) <> Тип("СправочникСсылка.РазделыФорумаСУО") Тогда
		Возврат ОтветКлиентуJSON("errorData");	
	КонецЕсли;
	
	МодераторыРаздела = Справочники.РазделыФорумаСУО.МодераторыРаздела(РазделФорума);
	
	Если МодераторыРаздела.Найти(ДанныеСессии.Пользователь, "Пользователь") = Неопределено
		И СообщениеОбъект.Пользователь <> ДанныеСессии.Пользователь Тогда
		Возврат ОтветКлиентуJSON("noPermissions");
	КонецЕсли;
	
	СообщениеОбъект.УдаленоМодератором = Истина;
	СообщениеОбъект.ДатаУдаленияМодератором = ТекущаяДатаСеанса();
	СообщениеОбъект.УдалившийМодератор = ДанныеСессии.Пользователь;
	
	СообщениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	СообщениеОбъект.ДополнительныеСвойства.Вставить("НеОбновлятьДанныеВебКабинета", Истина);
	СообщениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	// Обновляем данные веб-кабинета
		
	ВебКабинетСУ.ОбновитьДанныеОбъекта(ОбщегоНазначения.МенеджерОбъектаПоСсылке(СообщениеОбъект.Ссылка), СообщениеОбъект.Ссылка, СообщениеОбъект.ДополнительныеСвойства);
	РегистрыСведений.НастройкиТемФорумаСУО.ОбновитьДанныеВебКабинетаЗаписи(ДанныеСессии.Пользователь, СообщениеОбъект.Тема);
	
	// Возвращаем результат
	
	Возврат ОтветКлиентуJSON(, Новый Структура("ОперацияЗавершена", Истина));	
	
КонецФункции

// Личные сообщения

Функция ПолучитьЛичныеСообщенияPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, "Сообщения");
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные запроса
	//
	
	ДатаНачала = Дата("00010101");
	ДатаОкончания = Дата("00010101");
	
	Попытка
		Тип = Перечисления.ОтборыДанныхВебКабинетаСУО[ВебКабинетСУ.Перевод(Запрос.ПараметрыURL.Получить("Тип"), "ОтборыДанныхВебКабинетаСУО")];
		ИдентификаторТипа = Перечисления.ОтборыДанныхВебКабинетаСУО.Идентификатор(Тип);
		ДатаНачала = ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(Число(Запрос.ПараметрыURL.Получить("ДатаНачала")));
		ДатаОкончания = ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(Число(Запрос.ПараметрыURL.Получить("ДатаОкончания")));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторТипа) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;	
	
	// Получаем сообщения
	//
	
	Запрос = Новый Запрос;	
		
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписокСообщений.Данные КАК object,
		|	ПользовательскиеСвойстваСообщения.Данные КАК userDescription,
		|	СписокСообщений.Период КАК date,
		|	ОписаниеТем.Данные КАК topic
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУО_ОП КАК СписокСообщений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыДанныхВебКабинетаСУО_П КАК ОтборСообщений
		|		ПО СписокСообщений.Объект = ОтборСообщений.Объект
		|			И (ОтборСообщений.Отбор = &ИдентификаторТипа)
		|			И (ОтборСообщений.Пользователь = &Пользователь)
		|			И (СписокСообщений.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.Сообщение))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеВебКабинетаСУО_ПН КАК ПользовательскиеСвойстваСообщения
		|		ПО СписокСообщений.Объект = ПользовательскиеСвойстваСообщения.Объект
		|			И (ПользовательскиеСвойстваСообщения.Пользователь = &Пользователь)
		|			И (ПользовательскиеСвойстваСообщения.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.СообщениеОписание))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыДанныхВебКабинетаСУО_О КАК ОтборТем
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеВебКабинетаСУО_ОН КАК ОписаниеТем
		|			ПО ОтборТем.ОтборСсылка = ОписаниеТем.Объект
		|				И (ОписаниеТем.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.ТемаОбщенияОписание))
		|		ПО СписокСообщений.Объект = ОтборТем.Объект
		|ГДЕ
		|	СписокСообщений.Период МЕЖДУ &ДатаНачала И &ДатаОкончания";
		
	Запрос.УстановитьПараметр("Пользователь", ДанныеСессии.Пользователь);
	Запрос.УстановитьПараметр("ИдентификаторТипа", ИдентификаторТипа);
	
	Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда
	
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СписокСообщений.Период МЕЖДУ &ДатаНачала И &ДатаОкончания", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ", "");
		
	КонецЕсли;
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ОтветКлиентуJSON(,РезультатЗапроса.Выгрузить());
	
КонецФункции

Функция ПолучитьЛичныеСообщенияТемыPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, "Сообщения");
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;	
	
	// Получаем данные запроса
	//
	
	ИдентификаторТемы = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("Тема"));
	
	Тема = Справочники.ТемыСообщенийСУО.ПолучитьСсылку(ИдентификаторТемы);
	
	// Получаем сообщения
	//
	
	Запрос = Новый Запрос;	
		
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписокСообщений.Данные КАК object,
		|	ПользовательскиеСвойстваСообщения.Данные КАК userDescription,
		|	СписокСообщений.Период КАК date
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУО_ОП КАК СписокСообщений
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеВебКабинетаСУО_ПН КАК ПользовательскиеСвойстваСообщения
		|		ПО СписокСообщений.Объект = ПользовательскиеСвойстваСообщения.Объект
		|			И (ПользовательскиеСвойстваСообщения.Пользователь = &Пользователь)
		|			И (ПользовательскиеСвойстваСообщения.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.СообщениеОписание))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыДанныхВебКабинетаСУО_О КАК ОтборСообщенийПоТемам
		|		ПО СписокСообщений.Объект = ОтборСообщенийПоТемам.Объект
		|			И (ОтборСообщенийПоТемам.Отбор = &ИдентификаторТемы)";
		
	Запрос.УстановитьПараметр("Тема", Тема);
	Запрос.УстановитьПараметр("Пользователь", ДанныеСессии.Пользователь);
	Запрос.УстановитьПараметр("ИдентификаторТемы", ИдентификаторТемы);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ОтветКлиентуJSON(,РезультатЗапроса.Выгрузить());
	
КонецФункции

Функция ПолучитьТекстЛичногоСообщенияPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, "Сообщения");
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем раздел форума
	//
	
	Попытка
		ИдентификаторСообщения = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("Сообщение"));
		Сообщение = Документы.СообщениеСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторСообщения));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(Сообщение) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;	
	
	// Получаем темы раздела форума
	//
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеВебКабинетаСУО_ОН.Данные КАК ТекстСообщения
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУО_ОН КАК ДанныеВебКабинетаСУО_ОН
		|ГДЕ
		|	ДанныеВебКабинетаСУО_ОН.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.СообщениеОписание)
		|	И ДанныеВебКабинетаСУО_ОН.Объект = &Сообщение";
		
	Запрос.УстановитьПараметр("Сообщение", Сообщение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	РезультатТекстXML = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РезультатТекстXML = РезультатТекстXML + ВыборкаДетальныеЗаписи.ТекстСообщения.Получить();
	КонецЦикла;
	
	Возврат ОтветКлиентуXML(РезультатТекстXML);
	
КонецФункции

// Коммуникации (общее)

Функция СоздатьРассылкуPOST(ЗапросHTTP)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	ПраваДляПроверки = Новый Массив;
	ПраваДляПроверки.Добавить("Сообщения");
	ПраваДляПроверки.Добавить("Форум");	
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(ЗапросHTTP, ДанныеСессии, КодОшибки, Истина, ПраваДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;

	// Получаем параметры запроса
	//
	
	ДанныеЗапросаJSON = СокрЛП(ЗапросHTTP.ПолучитьТелоКакСтроку());
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗапросаJSON) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	Попытка
		ДанныеЗапросаСтруктура = ОбщегоНазначенияСУ.JSONВДанные(ДанныеЗапросаJSON);
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;
	
	Попытка
		ПроведениеОбучения = Документы.ПроведениеОбученияСУО.ПолучитьСсылку(
			Новый УникальныйИдентификатор(ДанныеЗапросаСтруктура.providingEducation));
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;
	
	ВсеАдресаты = Новый Массив;	
	
	ВсеУчастники = Документы.ПроведениеОбученияСУО.УчастникиОбучения(ПроведениеОбучения).ВыгрузитьКолонку("Пользователь");
	ВсеПреподаватели = Документы.ПроведениеОбученияСУО.Преподаватели(ПроведениеОбучения).ВыгрузитьКолонку("Пользователь");
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеАдресаты, ВсеУчастники, Истина); 
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеАдресаты, ВсеПреподаватели, Истина); 
	
	// Формируем рассылку
	//
	
	НоваяРассылка = Документы.РассылкаСообщенийСУО.СоздатьДокумент();
				
	НоваяРассылка.Дата = ТекущаяДатаСеанса();				
	НоваяРассылка.Автор = ДанныеСессии.Пользователь;
	НоваяРассылка.Заголовок = ДанныеЗапросаСтруктура.textNewTopic;
	ТекстРассылки = Новый ФорматированныйДокумент();
	Вложения = Новый Структура;	
	ТекстРассылки.УстановитьHTML(ДанныеЗапросаСтруктура.textNewMessage, Вложения);
	НоваяРассылка.ФорматированныйДокумент = Новый ХранилищеЗначения(ТекстРассылки);	
	НоваяРассылка.Описание = НСтр("ru = 'Ручная рассылка преподавателя из веб-кабинета'");
	НоваяРассылка.Основание = ПроведениеОбучения;
	НоваяРассылка.ТолькоЭлектроннаяПочта = Ложь;
	НоваяРассылка.БезШаблона = Истина;
	НоваяРассылка.АвтоматическаяРассылка = Ложь;
			
	Для каждого ТекущийПользователь Из ВсеАдресаты Цикл
		НовыйАдресат = НоваяРассылка.Адресаты.Добавить();
		НовыйАдресат.Пользователь = ТекущийПользователь;
	КонецЦикла;
	
	НоваяРассылка.ЗаполнитьПеременные();
	
	НоваяРассылка.Записать(РежимЗаписиДокумента.Проведение); // Не проводим
	
	// Завершаем
	
	Возврат ОтветКлиентуJSON(, Новый Структура("Рассылка", НоваяРассылка.Ссылка));
	
КонецФункции

Функция СоздатьСообщениеPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	ПраваДляПроверки = Новый Массив;
	ПраваДляПроверки.Добавить("Сообщения");
	ПраваДляПроверки.Добавить("Форум");	
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, ПраваДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем параметры запроса
	
	ПараметрыСообщения = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(Запрос.ПолучитьТелоКакСтроку(), "", ";", ":");
	
	Для каждого Элемент Из ПараметрыСообщения Цикл
		ВосстановитьСимволыСтрокиПараметров(ПараметрыСообщения[Элемент.Ключ]);
	КонецЦикла;
	
	НачатьТранзакцию();
	
	Попытка
		
		// Получаем тему сообщения
		
		Если НЕ ПараметрыСообщения.Свойство("topic")
			ИЛИ НЕ ЗначениеЗаполнено(ПараметрыСообщения.topic) Тогда
			
			Если НЕ ПараметрыСообщения.Свойство("textNewTopic")
				ИЛИ НЕ ПараметрыСообщения.Свойство("addressee")
				ИЛИ НЕ ПараметрыСообщения.Свойство("context")
				ИЛИ НЕ ПараметрыСообщения.Свойство("contextType") Тогда
				
				Возврат ОтветКлиентуJSON("errorData");
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ПараметрыСообщения.textNewTopic)
				ИЛИ НЕ ЗначениеЗаполнено(ПараметрыСообщения.addressee)
				ИЛИ НЕ ЗначениеЗаполнено(ПараметрыСообщения.context)
				ИЛИ НЕ ЗначениеЗаполнено(ПараметрыСообщения.contextType) Тогда
				
				Возврат ОтветКлиентуJSON("errorData");
				
			КонецЕсли;		
			
			НоваяТемаОбъект = Справочники.ТемыСообщенийСУО.СоздатьЭлемент();
			НоваяТемаОбъект.Наименование = ПараметрыСообщения.textNewTopic;
			НоваяТемаОбъект.Кому         = Перечисления.АдресатыСообщенийСУО.ЗначениеИзСтроки(ПараметрыСообщения.addressee);
			
			Если ПараметрыСообщения.contextType = "user" Тогда
				НоваяТемаОбъект.Контекст     = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрыСообщения.context));
			КонецЕсли;
			
			Если ПараметрыСообщения.contextType = "forumCategory" Тогда
				
				НоваяТемаОбъект.Контекст = Справочники.РазделыФорумаСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрыСообщения.context));
				
				Если НЕ Справочники.РазделыФорумаСУО.ЕстьПравоСоздаватьТемыФорума(
					ДанныеСессии.Пользователь, НоваяТемаОбъект.Контекст) Тогда
					
					Возврат ОтветКлиентуJSON("noPermissions");
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НоваяТемаОбъект.Контекст) Тогда
				Возврат ОтветКлиентуJSON("errorData");
			КонецЕсли;		
			
			НоваяТемаОбъект.Автор = ДанныеСессии.Пользователь;
			
			НоваяТемаОбъект.ДополнительныеСвойства.Вставить("НеОбновлятьДанныеВебКабинета", Истина);		
			НоваяТемаОбъект.Записать();
			
			Тема = НоваяТемаОбъект.Ссылка;
			
			ВебКабинетСУ.ОбновитьДанныеОбъекта(ОбщегоНазначения.МенеджерОбъектаПоСсылке(Тема), Тема, НоваяТемаОбъект.ДополнительныеСвойства);
			
			ПервоеСообщениеВТеме = Истина;
			
		Иначе
			
			Попытка
				ИдентификаторТемы = Новый УникальныйИдентификатор(ПараметрыСообщения.topic);
				Тема = Справочники.ТемыСообщенийСУО.ПолучитьСсылку(ИдентификаторТемы);
			Исключение
			КонецПопытки;
			
			ПервоеСообщениеВТеме = Ложь;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Тема) Тогда
			Возврат ОтветКлиентуJSON("errorData");
		КонецЕсли;	
		
		// Получаем текст сообщения
		
		Если НЕ ПараметрыСообщения.Свойство("textNewMessage") Тогда
			Возврат ОтветКлиентуJSON("errorData");
		КонецЕсли;	
		
		ТекстСообщения = СокрЛП(ПараметрыСообщения.textNewMessage);
		
		Если НЕ ЗначениеЗаполнено(ТекстСообщения) Тогда
			Возврат ОтветКлиентуJSON("errorData");
		КонецЕсли;
		
		ФорматированныйДокумент = Новый ФорматированныйДокумент;
		ФорматированныйДокумент.УстановитьHTML(ТекстСообщения, Новый Структура);
		
		// Создаем новое сообщение	
			
		НовоеСообщениеОбъект = Документы.СообщениеСУО.СоздатьДокумент();
		НовоеСообщениеОбъект.Дата = ТекущаяДатаСеанса();
		НовоеСообщениеОбъект.Пользователь = ДанныеСессии.Пользователь;
		НовоеСообщениеОбъект.Тема = Тема;
		НовоеСообщениеОбъект.ФорматированныйДокумент = Новый ХранилищеЗначения(ФорматированныйДокумент);
		НовоеСообщениеОбъект.ИспользуетсяТекстовыйДокумент = Истина;
		НовоеСообщениеОбъект.ТекстовыйДокумент = ТекстСообщения;
		
		Если ПараметрыСообщения.Свойство("replyTo")
			И ЗначениеЗаполнено(ПараметрыСообщения.replyTo) Тогда
			
			НовоеСообщениеОбъект.РодительскоеСообщение = Документы.СообщениеСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрыСообщения.replyTo));
			
		КонецЕсли;	
		
		НовоеСообщениеОбъект.Записать(РежимЗаписиДокумента.Запись);
		
		// Прикрепляем файлы
		
		ЗагруженныеФайлы = Новый Массив;
		
		ФайлыДляЗаписи = ФайлыДляЗаписи(ПараметрыСообщения);
		
		Если ФайлыДляЗаписи <> Неопределено Тогда
			
			Для каждого ФайлДляЗаписи Из ФайлыДляЗаписи Цикл
			
				СсылкаНаФайл = ПрисоединенныеФайлы.ДобавитьФайл(НовоеСообщениеОбъект.Ссылка, ФайлДляЗаписи.ИмяФайлаБезРасширения, ФайлДляЗаписи.РасширениеФайлаБезТочки, ТекущаяДатаСеанса(), ФайлДляЗаписи.ВремяИзмененияФайла, ФайлДляЗаписи.АдресХраненияФайла,, ФайлДляЗаписи.ОписаниеФайла);
				
				Если НЕ ЗначениеЗаполнено(СсылкаНаФайл) Тогда
					Возврат ОтветКлиентуJSON("saveFileError");
				КонецЕсли;
				
				ЗагруженныеФайлы.Добавить(Новый Структура("name, ref, extension",
					ФайлДляЗаписи.ИмяФайла, Строка(СсылкаНаФайл.УникальныйИдентификатор()), ФайлДляЗаписи.РасширениеФайлаБезТочки));
				
			КонецЦикла;
			
		КонецЕсли;
		
		// Проводим документ
		
		НовоеСообщениеОбъект.ПервоеСообщениеВТеме = ПервоеСообщениеВТеме;
		
		НовоеСообщениеОбъект.ДополнительныеСвойства.Вставить("НеОбновлятьДанныеВебКабинета", Истина);
		НовоеСообщениеОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
		
		 
		
		// Обновляем данные веб-кабинета
		
		ВебКабинетСУ.ОбновитьДанныеОбъекта(ОбщегоНазначения.МенеджерОбъектаПоСсылке(НовоеСообщениеОбъект.Ссылка), НовоеСообщениеОбъект.Ссылка, НовоеСообщениеОбъект.ДополнительныеСвойства);
		
		// Записываем дату просмотра темы форума
		
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Тема, "Кому") = Перечисления.АдресатыСообщенийСУО.НаФоруме Тогда
			ДатаПросмотра = НовоеСообщениеОбъект.Дата + 1;	
			Справочники.ТемыСообщенийСУО.ЗаписатьПользовательскиеНастройкиТемы(Тема,,, ДанныеСессии.Пользователь, ДатаПросмотра, Истина);	
			РегистрыСведений.НастройкиТемФорумаСУО.ОбновитьДанныеВебКабинетаЗаписи(ДанныеСессии.Пользователь, Тема);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
		
	// Возвращаем результат
	
	Возврат ОтветКлиентуJSON(,Новый Структура("Сообщение, ЗагруженныеФайлы", НовоеСообщениеОбъект.Ссылка, ЗагруженныеФайлы));
	
КонецФункции

Функция ЗаписатьНастройкиТемыРазделаФорумаPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);

	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	ПраваДляПроверки = Новый Массив;
	ПраваДляПроверки.Добавить("Сообщения");
	ПраваДляПроверки.Добавить("Форум");	
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, ПраваДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные запроса
	
	Попытка
		ИдентификаторТемы = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("Тема"));
		Тема = Справочники.ТемыСообщенийСУО.ПолучитьСсылку(ИдентификаторТемы);
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(Тема) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	// Записываем настройки
	
	ДатаПросмотра = ТекущаяДатаСеанса();	
	Справочники.ТемыСообщенийСУО.ЗаписатьПользовательскиеНастройкиТемы(Тема,,, ДанныеСессии.Пользователь, ДатаПросмотра, Истина);	
	РегистрыСведений.НастройкиТемФорумаСУО.ОбновитьДанныеВебКабинетаЗаписи(ДанныеСессии.Пользователь, Тема);
	
	// Возвращаем результат
	
	Возврат ОтветКлиентуJSON(, Новый Структура("ОперацияЗавершена", Истина));
	
КонецФункции

Функция ЗаписатьНастройкиСообщенияPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);

	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	ПраваДляПроверки = Новый Массив;
	ПраваДляПроверки.Добавить("Сообщения");
	ПраваДляПроверки.Добавить("Форум");
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, ПраваДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные запроса
	
	Попытка
		ИдентификаторСообщения = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("Сообщение"));
		Сообщение = Документы.СообщениеСУО.ПолучитьСсылку(ИдентификаторСообщения);
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(Сообщение) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	НастройкиДляЗаписиJSON = СокрЛП(Запрос.ПолучитьТелоКакСтроку());
	
	Если НЕ ЗначениеЗаполнено(НастройкиДляЗаписиJSON) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	Попытка
		НастройкиДляЗаписи = ОбщегоНазначенияСУ.JSONВДанные(НастройкиДляЗаписиJSON);
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;
	
	ИмяНастройки      = Неопределено;
	ЗначениеНастройки = Неопределено;
	
	Если НастройкиДляЗаписи.Свойство("name") И НастройкиДляЗаписи.Свойство("value") Тогда
		Попытка
			ИмяНастройки      = ВебКабинетСУ.Перевод(НастройкиДляЗаписи.name, "ТипыДанныхВебКабинетаСУО");
			ЗначениеНастройки = НастройкиДляЗаписи.value; 
		Исключение
			Возврат ОтветКлиентуJSON("errorData");
		КонецПопытки;			
	КонецЕсли;
		
	ТекущаяДата = ТекущаяДатаСеанса();
	
	// Записываем настройки
		
	НачатьТранзакцию();
	
	Попытка
		
		РегистрыСведений.НастройкиЛичныхСообщенийСУО.ЗаписатьНастройки(Сообщение, ИмяНастройки, ЗначениеНастройки, ДанныеСессии.Пользователь, ТекущаяДата, Истина);
		РегистрыСведений.НастройкиТемОбщенияСУО.ЗаписатьНастройки(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сообщение, "Тема"),,,ДанныеСессии.Пользователь, ТекущаяДата);		
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	// Возвращаем результат
	
	Возврат ОтветКлиентуJSON(, Новый Структура("ОперацияЗавершена", Истина));	
	
КонецФункции

// Библиотека

Функция ПолучитьБиблиотекуПользователяPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, "Библиотека");
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Библиотеки
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БиблиотекиПользователя.Данные КАК Данные
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУО_ПН КАК БиблиотекиПользователя
		|ГДЕ
		|	БиблиотекиПользователя.Пользователь = &Пользователь
		|	И БиблиотекиПользователя.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.БиблиотекаПользователя)
		|	И БиблиотекиПользователя.Объект = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ДанныеСессии.Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат ОтветКлиентуJSON(,);
		
	Иначе
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ОтветКлиентуJSON(,ВыборкаДетальныеЗаписи.Данные);
		
	КонецЕсли;
	
КонецФункции

// Новости

Функция ПолучитьНовостиPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, "Новости");
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем переменные
	
	ДатаНачала    = Дата("00010101");
	ДатаОкончания = Дата("00010101");
	Количество    = 0;
	
	Попытка
		ДатаНачала = ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(Число(Запрос.ПараметрыURL.Получить("ДатаНачала")));
		ДатаОкончания = ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(Число(Запрос.ПараметрыURL.Получить("ДатаОкончания")));
		Количество = Число(Запрос.ПараметрыURL.Получить("Количество"));
	Исключение
	КонецПопытки;
	
	// Получаем данные
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СписокОбщихНовостей.Данные КАК object,
		|	СписокОбщихНовостей.Период КАК date
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУО_ОП КАК СписокОбщихНовостей
		|ГДЕ
		|	СписокОбщихНовостей.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.Новость)
		|	И СписокОбщихНовостей.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СписокНовостейПользователя.Данные,
		|	СписокНовостейПользователя.Период
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУО_ПП КАК СписокНовостейПользователя
		|ГДЕ
		|	СписокНовостейПользователя.Пользователь = &Пользователь
		|	И СписокНовостейПользователя.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.Новость)
		|	И СписокНовостейПользователя.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|УПОРЯДОЧИТЬ ПО
		|	date";
		
	Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда
		
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);		
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СписокОбщихНовостей.Период МЕЖДУ &ДатаНачала И &ДатаОкончания", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СписокНовостейПользователя.Период МЕЖДУ &ДатаНачала И &ДатаОкончания", "");
		
	КонецЕсли;		
	
	Если ЗначениеЗаполнено(Количество) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1", "ПЕРВЫЕ " + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(Количество));
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Пользователь", ДанныеСессии.Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ОтветКлиентуJSON(,РезультатЗапроса.Выгрузить());
	
КонецФункции

Функция ПолучитьТекстНовостиPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, "Новости");
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем переменные
	//
	
	Попытка
		ИдентификаторНовости = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("Новость"));
		Новость = Документы.НовостьСУО.ПолучитьСсылку(ИдентификаторНовости);
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(Новость) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;	
	
	// Получаем темы раздела форума
	//
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеВебКабинетаСУО_ОН.Данные КАК ТекстСообщения
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУО_ОН КАК ДанныеВебКабинетаСУО_ОН
		|ГДЕ
		|	ДанныеВебКабинетаСУО_ОН.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.НовостьОписание)
		|	И ДанныеВебКабинетаСУО_ОН.Объект = &Новость";
		
	Запрос.УстановитьПараметр("Новость", Новость);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	РезультатТекстXML = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РезультатТекстXML = РезультатТекстXML + ВыборкаДетальныеЗаписи.ТекстСообщения.Получить();
	КонецЦикла;
	
	Возврат ОтветКлиентуXML(РезультатТекстXML);
	
КонецФункции

Функция СоздатьНовостьPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;	
	
	ПраваДляПроверки = Новый Массив;
	ПраваДляПроверки.Добавить("Новости");
	ПраваДляПроверки.Добавить("ДобавлениеНовостей");
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, ПраваДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;

	Права = ДанныеСессии.Права.Получить();
	
	// Получаем параметры запроса
	
	ПараметрыСообщения = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(Запрос.ПолучитьТелоКакСтроку(), "", ";", ":");
	
	Для каждого Элемент Из ПараметрыСообщения Цикл
		ВосстановитьСимволыСтрокиПараметров(ПараметрыСообщения[Элемент.Ключ]);
	КонецЦикла;
	
	// Получаем заголовок новости
	
	Если НЕ ПараметрыСообщения.Свойство("textTopic") Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;	
	
	ЗаголовокНовости = СокрЛП(ПараметрыСообщения.textTopic);
	
	// Получаем тело новости
	
	Если НЕ ПараметрыСообщения.Свойство("textMessage") Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;	
	
	ТекстНовости = СокрЛП(ПараметрыСообщения.textMessage);
	
	Если НЕ ЗначениеЗаполнено(ТекстНовости) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	ФорматированныйДокумент = Новый ФорматированныйДокумент;
	ФорматированныйДокумент.УстановитьHTML(ТекстНовости, Новый Структура);
	
	// Получаем учебную группу для которой создается новость
	
	Если НЕ ПараметрыСообщения.Свойство("idEduGroup")
		ИЛИ НЕ ПараметрыСообщения.Свойство("typeEduGroup") Тогда
		
		Возврат ОтветКлиентуJSON("errorData");
		
	КонецЕсли;	
	
	УчебнаяГруппа = Неопределено;
	
	Если ЗначениеЗаполнено(ПараметрыСообщения.idEduGroup)
		И ЗначениеЗаполнено(ПараметрыСообщения.typeEduGroup) Тогда
		
		МенеджерСправочникаГрупп = Справочники.УчебныеГруппыСУО.МенеджерСправочникаПоТипу(ПараметрыСообщения.typeEduGroup);
		
		УчебнаяГруппа = МенеджерСправочникаГрупп.ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрыСообщения.idEduGroup));
		
	КонецЕсли;	
	
	// Создаем новость
	
	НовостьОбъект = Документы.НовостьСУО.СоздатьДокумент();
	НовостьОбъект.Дата = ТекущаяДатаСеанса();
	НовостьОбъект.Заголовок = ЗаголовокНовости;
	НовостьОбъект.ФорматированныйДокумент = Новый ХранилищеЗначения(ФорматированныйДокумент);
	НовостьОбъект.ДатаПубликации = ТекущаяДатаСеанса();
	НовостьОбъект.Автор = ДанныеСессии.Пользователь; 
	
	Если ЗначениеЗаполнено(УчебнаяГруппа) Тогда
		
		Участники = МенеджерСправочникаГрупп.Участники(УчебнаяГруппа);
		
		Для каждого Строка Из Участники Цикл
			
			Если НЕ ЗначениеЗаполнено(Строка.Пользователь) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрокаТЧ = НовостьОбъект.Получатели.Добавить();
			НоваяСтрокаТЧ.Пользователь = Строка.Пользователь;
		
		КонецЦикла;
		
	Иначе		
		
		Если НЕ Права.Свойство("КаталогПользователей") ИЛИ НЕ Права.КаталогПользователей Тогда
			
			ПолучателиНовости = КаталогПользователей(ДанныеСессии, Истина);
			
			Для каждого ПолучательНовости Из ПолучателиНовости Цикл
				
				Если НЕ ЗначениеЗаполнено(ПолучательНовости) Тогда
					Продолжить;
				КонецЕсли;				
				
				НоваяСтрокаТЧ = НовостьОбъект.Получатели.Добавить();
				НоваяСтрокаТЧ.Пользователь = ПолучательНовости;
			
			КонецЦикла;
			
		Иначе
			
			// Для всех пользователей базы (ТЧ не заполняем)
			
		КонецЕсли;

	КонецЕсли;
		
	НовостьОбъект.ДополнительныеСвойства.Вставить("НеОбновлятьДанныеВебКабинета", Истина);
	
	НовостьОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	ВебКабинетСУ.ОбновитьДанныеОбъекта(Документы.НовостьСУО, НовостьОбъект.Ссылка);
	
	// Завершаем
	
	Возврат ОтветКлиентуJSON(,Новый Структура("ДатаНовости", НовостьОбъект.Дата));
	
КонецФункции

Функция ЗаписатьНастройкиЛентыНовостейPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);

	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, "Новости");
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Записываем данные
	//
	
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	
	РегистрыСведений.ПросмотрыЛентыНовостейПользователямиСУО.ЗафиксироватьПросмотр(ДанныеСессии.Пользователь, ТекущаяДатаСеанса);	
	
	// Возвращаем результат
	
	Возврат ОтветКлиентуJSON(, Новый Структура("ОперацияЗавершена", Истина));	
	
КонецФункции

// Литература (книги)

Функция ПолучитьОписаниеКнигиPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, "Библиотека");
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем переменные
	//
	
	Попытка
		Книга = Справочники.ЛитератураСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("Идентификатор")));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(Книга) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;	
	
	// Получаем описание книги
	//
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеВебКабинетаСУО_ОН.Данные КАК ОписаниеКниги
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУО_ОН КАК ДанныеВебКабинетаСУО_ОН
		|ГДЕ
		|	ДанныеВебКабинетаСУО_ОН.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.КнигаОписание)
		|	И ДанныеВебКабинетаСУО_ОН.Объект = &Книга";
		
	Запрос.УстановитьПараметр("Книга", Книга);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ОтветКлиентуXML(ВыборкаДетальныеЗаписи.ОписаниеКниги.Получить());
	Иначе
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;	
	
КонецФункции

// Уведомления

Функция ПолучитьУведомленияPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем уведомления
	//
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Права = ДанныеСессии.Права.Получить();
	
	Уведомления = Новый Структура("КоличествоНовыхЛичныхСообщений, КоличествоНовыхСообщенийФорума, КоличествоНовыхНовостей, КоличествоПользователейОнлайн, Пользователь", 0, 0, 0, 0, Неопределено);
	
	Если Права.Свойство("Сообщения") И Права.Сообщения Тогда
		Уведомления.КоличествоНовыхЛичныхСообщений = Документы.СообщениеСУО.КоличествоНовыхЛичныхСообщений(ДанныеСессии.Пользователь);
	КонецЕсли;
		
	Если Права.Свойство("Форум") И Права.Форум Тогда
		Уведомления.КоличествоНовыхСообщенийФорума = Документы.СообщениеСУО.КоличествоНовыхГрупповыхСообщений(ДанныеСессии.Пользователь);	
	КонецЕсли;
	
	Если Права.Свойство("Новости") И Права.Новости Тогда
		
		ДатаПросмотраЛентыНовостей = РегистрыСведений.ПросмотрыЛентыНовостейПользователямиСУО.ДатаПоследнегоПросмотра(ДанныеСессии.Пользователь);	
		
		Если ДатаПросмотраЛентыНовостей = Неопределено Тогда
			ДатаПросмотраЛентыНовостей = ДобавитьМесяц(ТекущаяДата, -1)
		КонецЕсли;
		
		Уведомления.КоличествоНовыхНовостей = РегистрыСведений.НовостиСУО.КоличествоНовостейЗаПериод(ДанныеСессии.Пользователь, ДатаПросмотраЛентыНовостей, ТекущаяДата);  
		
	КонецЕсли;
	
	Если Права.Свойство("Пользователи") И Права.Пользователи Тогда		
		
		// Получаем данные запроса
		
		Попытка
			СтруктураДанных = ОбщегоНазначенияСУ.JSONВДанные(Запрос.ПолучитьТелоКакСтроку());
		Исключение
		КонецПопытки;
		
		Если ТипЗнч(СтруктураДанных) = Тип("Структура") И СтруктураДанных.Свойство("getCountUsersOnline") И СтруктураДанных.getCountUsersOnline Тогда
			
			Если НЕ Права.Свойство("КаталогПользователей") ИЛИ НЕ Права.КаталогПользователей Тогда
				ПользователиКаталога = КаталогПользователей(ДанныеСессии, Истина);				
			Иначе				
				ПользователиКаталога = Неопределено; // Доступны все пользователи и явно их не получаем
			КонецЕсли;			
			
			МассивАктивныхПользователей = РегистрыСведений.СессииВебКабинетаСУ.АктивныеПользователи(ПользователиКаталога);		
			
			Уведомления.КоличествоПользователейОнлайн = МассивАктивныхПользователей.Количество();
			
		КонецЕсли;
			
	КонецЕсли;
	
	Уведомления.Пользователь = ВебКабинетСУО.ПользовательСтруктура(ДанныеСессии.Пользователь);
	
	// Возвращаем результат
	
	Возврат ОтветКлиентуJSON(,Уведомления);
	
КонецФункции

// Настройки пользователя

Функция ПолучитьНастройкиPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем настройки из регистра настроек
	//
	
	НастройкиПользователя = Новый Структура;
	
	РегистрыСведений.НастройкиПользователейСУО.ЗаполнитьСтруктуруНастроек(ДанныеСессии.Пользователь, НастройкиПользователя);
	
	// Получаем контактную информацию
	//
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст = 
		"ВЫБРАТЬ
		|	ПользователиКонтактнаяИнформация.Представление,
		|	ПользователиКонтактнаяИнформация.НомерСтроки,
		|	ВидыКонтактнойИнформации.Ссылка КАК Вид,
		|	ВидыКонтактнойИнформации.Наименование КАК НаименованиеВида,
		|	ВидыКонтактнойИнформации.ЗапретитьРедактированиеПользователем КАК ЗапретитьРедактированиеПользователем,
		|	ВидыКонтактнойИнформации.Тип КАК Тип,
		|	ВидыКонтактнойИнформации.ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
		|		ПО (ПользователиКонтактнаяИнформация.Вид = ВидыКонтактнойИнформации.Ссылка)
		|			И (ПользователиКонтактнаяИнформация.Ссылка = &Пользователь)
		|ГДЕ
		|	ВидыКонтактнойИнформации.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.СправочникПользователи)
		|	И ВидыКонтактнойИнформации.ЭтоГруппа = ЛОЖЬ
		|	И ВидыКонтактнойИнформации.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидыКонтактнойИнформации.РеквизитДопУпорядочивания";
	
	ЗапросДанных.УстановитьПараметр("Пользователь", ДанныеСессии.Пользователь);
	
	НастройкиПользователя.Вставить("КонтактнаяИнформация", ЗапросДанных.Выполнить().Выгрузить());
	
	// Получаем дополнительные сведения
	//
	
	НастройкиПользователя.Вставить("ДополнительныеСведения", ВебКабинетСУО.ТаблицаДополнительныхРеквизитовОбъекта(ДанныеСессии.Пользователь));
	
	// Получаем фотографию и аватар
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФотографииПользователейСУО.Фотография,
		|	ФотографииПользователейСУО.Аватар
		|ИЗ
		|	РегистрСведений.ФотографииПользователейСУО КАК ФотографииПользователейСУО
		|ГДЕ
		|	ФотографииПользователейСУО.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ДанныеСессии.Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();

		ДвоичныеДанныеФотографии = ВыборкаДетальныеЗаписи.Фотография.Получить(); 
		
		Если ДвоичныеДанныеФотографии <> Неопределено Тогда
			
			ИмяФайлаФотографии = РегистрыСведений.ФотографииПользователейСУО.ИмяФайлаФотографии(ДвоичныеДанныеФотографии);
		
			НастройкиПользователя.Вставить("Фотография", Строка(ДанныеСессии.Пользователь.УникальныйИдентификатор()) + "/" + ИмяФайлаФотографии);
			
		КонецЕсли;
		
		ДвоичныеДанныеАватара = ВыборкаДетальныеЗаписи.Аватар.Получить(); 
		
		Если ДвоичныеДанныеАватара <> Неопределено Тогда
			
			ИмяФайлаАватара = РегистрыСведений.ФотографииПользователейСУО.ИмяФайлаАватара();
		
			НастройкиПользователя.Вставить("Аватар", Строка(ДанныеСессии.Пользователь.УникальныйИдентификатор()) + "/" + ИмяФайлаАватара);
			
		КонецЕсли;		
		
	КонецЕсли;
	
	// Получаем пин-коды
	//
	
	ПинКоды = Новый Структура("Используется, Список", ПолучитьФункциональнуюОпцию("ИспользоватьПинКодыВПерсональныхНастройкахСУО"), Неопределено);
	
	Если ПинКоды.Используется Тогда		
		ПинКоды.Список = РегистрыСведений.ВыданныеПинКодыСУО.КодыПользователя(ДанныеСессии.Пользователь);
	КонецЕсли;	
	
	НастройкиПользователя.Вставить("ПинКоды", ПинКоды);
	
	// Получаем время доступа
	//
	
	НастройкиПользователя.Вставить("ВремяДоступа", РегистрыСведений.ВремяДоступаПользователейСУО.ДатыДоступа(ДанныеСессии.Пользователь));
	
	// Возвращаем результат
	//
	
	Возврат ОтветКлиентуJSON(,НастройкиПользователя);
	
КонецФункции

Функция ЗаписатьНастройкиPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Записываем настройки	
	//
	
	НастройкиДляЗаписиJSON = СокрЛП(Запрос.ПолучитьТелоКакСтроку());
	
	Если НЕ ЗначениеЗаполнено(НастройкиДляЗаписиJSON) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	Попытка
		НастройкиДляЗаписи = ОбщегоНазначенияСУ.JSONВДанные(НастройкиДляЗаписиJSON);
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;
	
	ПрохождениеОбученияДляОбновления = Неопределено;
	
	Для каждого Настройка Из НастройкиДляЗаписи Цикл
	
		Если Настройка.Ключ = "denyMailing" Тогда
			РегистрыСведений.НастройкиПользователейСУО.ЗаписатьНастройку(ДанныеСессии.Пользователь, "ЗапретитьРассылкуНаАдресЭлектроннойПочты", Настройка.Значение);	
		КонецЕсли;
		
		Если Настройка.Ключ = "denyNewMessagesMailing" Тогда
			РегистрыСведений.НастройкиПользователейСУО.ЗаписатьНастройку(ДанныеСессии.Пользователь, "ЗапретитьУведомленияОНовыхЛичныхСообщениях", Настройка.Значение);	
		КонецЕсли;
		
		Если Настройка.Ключ = "denyNewForumTopicsMailing" Тогда
			РегистрыСведений.НастройкиПользователейСУО.ЗаписатьНастройку(ДанныеСессии.Пользователь, "ЗапретитьУведомленияОНовыхСообщенияхФорума", Настройка.Значение);	
		КонецЕсли;		
		
		Если Настройка.Ключ = "hideContactInformation" Тогда
			РегистрыСведений.НастройкиПользователейСУО.ЗаписатьНастройку(ДанныеСессии.Пользователь, "СкрытьКонтактнуюИнформацию", Настройка.Значение);
		КонецЕсли;
		
		Если Настройка.Ключ = "hideAdditionalInformation" Тогда
			РегистрыСведений.НастройкиПользователейСУО.ЗаписатьНастройку(ДанныеСессии.Пользователь, "СкрытьДополнительныеСведения", Настройка.Значение);
		КонецЕсли;		
		
		Если Настройка.Ключ = "updateActivity" И ЗначениеЗаполнено(Настройка.Значение) Тогда
			ПрохождениеОбученияДляОбновления = Документы.ПрохождениеОбученияСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(Настройка.Значение));			
		КонецЕсли;
		
		Если Настройка.Ключ = "contacts" Тогда
			
			ДанныеЗаполнения = УправлениеКонтактнойИнформацией.НоваяКонтактнаяИнформация(Ложь);	
			
			Для каждого Элемент Из Настройка.Значение Цикл
				
				Если НЕ Элемент.Свойство("num") ИЛИ НЕ Элемент.Свойство("value") ИЛИ НЕ Элемент.Свойство("kind") ИЛИ НЕ Элемент.Свойство("type") Тогда
				    Возврат ОтветКлиентуJSON("errorData");
				КонецЕсли;				
				
				ТипКИ = Перечисления.ТипыКонтактнойИнформации[Элемент.type];
				
				СтрокаЗаполнения = ДанныеЗаполнения.Добавить();
				СтрокаЗаполнения.Вид = Справочники.ВидыКонтактнойИнформации.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент.kind));
				СтрокаЗаполнения.Представление = Элемент.value;
				СтрокаЗаполнения.Тип = ТипКИ;
				Если ТипЗнч(Элемент.num) = Тип("Число") Тогда
					СтрокаЗаполнения.ИдентификаторСтрокиТабличнойЧасти = Элемент.num;
				КонецЕсли;
						
			КонецЦикла;			
						
			УправлениеКонтактнойИнформацией.УстановитьКонтактнуюИнформациюОбъекта(ДанныеСессии.Пользователь, ДанныеЗаполнения, Истина);
			
		КонецЕсли;
		
		Если Настройка.Ключ = "additionalInfo" Тогда
			
			УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(ДанныеСессии.Пользователь, СформироватьТаблицуДополнительныхСвойств(Настройка.Значение));
			
		КонецЕсли;
		
		Если Настройка.Ключ = "avatar" Тогда

			Если ЗначениеЗаполнено(Настройка.Значение) Тогда
			
				Попытка
					ДвоичныеДанныеАватара = Base64Значение(Настройка.Значение);
				Исключение
					Возврат ОтветКлиентуJSON("errorData");
				КонецПопытки;	
				
				АдресХраненияАватара = ПоместитьВоВременноеХранилище(ДвоичныеДанныеАватара);
				
				РегистрыСведений.ФотографииПользователейСУО.СохранитьФотографиюПользователя(ДанныеСессии.Пользователь,,АдресХраненияАватара, Истина);
				
			Иначе
				
				РегистрыСведений.ФотографииПользователейСУО.УдалитьФотографиюПользователя(ДанныеСессии.Пользователь,,Истина, Истина);
				
			КонецЕсли;
			
			РегистрыСведений.ФотографииПользователейСУО.ОбновитьДанныеВебКабинета(ДанныеСессии.Пользователь);
			
			ВебКабинетСУ.ВыполнитьОбновлениеЗависимостей(ДанныеСессии.Пользователь);
			
		КонецЕсли;	
		
		Если Настройка.Ключ = "photo" Тогда
			
			Если ЗначениеЗаполнено(Настройка.Значение) Тогда
				
				// Ничего не делаем, так как фотография записывается через загрузку файлов
				
			Иначе
				
				РегистрыСведений.ФотографииПользователейСУО.УдалитьФотографиюПользователя(ДанныеСессии.Пользователь, Истина, Ложь, Истина);
				
			КонецЕсли;
			
			РегистрыСведений.ФотографииПользователейСУО.ОбновитьДанныеВебКабинета(ДанныеСессии.Пользователь);
			
		КонецЕсли;		
		
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(ПрохождениеОбученияДляОбновления) Тогда
		ВебКабинетСУ.ОбновитьДанныеОбъекта(Документы.ПрохождениеОбученияСУО, ПрохождениеОбученияДляОбновления);
	КонецЕсли;
	
	ВебКабинетСУО.ОбновитьДанныеПользователяВебКабинета(ДанныеСессии.Пользователь);
	
	// Возвращаем результат
	//
	
	Возврат ОтветКлиентуJSON(, Новый Структура("ОперацияЗавершена", Истина));		
	
КонецФункции

Функция АктивироватьПинКодPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;	
	
	// Записываем настройки	
	//
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПинКодыВПерсональныхНастройкахСУО") Тогда
		Возврат ОтветКлиентуJSON("noFunctionality");
	КонецЕсли;
	
	НастройкиДляЗаписиJSON = СокрЛП(Запрос.ПолучитьТелоКакСтроку());
	
	Если НЕ ЗначениеЗаполнено(НастройкиДляЗаписиJSON) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	Попытка
		НастройкиДляЗаписи = ОбщегоНазначенияСУ.JSONВДанные(НастройкиДляЗаписиJSON);
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;
	
	Если НЕ НастройкиДляЗаписи.Свойство("pinCode") Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	ДанныеПинКода = РегистрыСведений.ВыданныеПинКодыСУО.КодДоступенДляАктивации(
		НастройкиДляЗаписи.pinCode,
		?(НастройкиДляЗаписи.Свойство("pinCodeOption"), НастройкиДляЗаписи.pinCodeOption, Неопределено)
	);
	
	Если ДанныеПинКода.ТребуетсяОпция Тогда
		
		ДанныеПинКода.Вставить("ДоступныеОпции", Справочники.СерииПинКодовСУО.СтруктураОпцийДляВебКабинета(ДанныеПинКода.Серия));
		
		Возврат ОтветКлиентуJSON(, ДанныеПинКода);
			
	КонецЕсли;
	
	Если НЕ ДанныеПинКода.ДоступенДляАктивации Тогда
		
		Возврат ОтветКлиентуJSON(, ДанныеПинКода);
		
	КонецЕсли;
	
	РегистрыСведений.ВыданныеПинКодыСУО.АктивироватьКод(ДанныеПинКода.Серия, ДанныеПинКода.Код, ДанныеСессии.Пользователь,,ДанныеПинКода.Опция,Истина);
	
	ТекстУведомления = РегистрыСведений.ВыданныеПинКодыСУО.ПолучитьТекстУведомленияИЗапомнить(ДанныеСессии.Пользователь);
	
	ДанныеПинКода.Вставить("Уведомление", ТекстУведомления);
	
	Возврат ОтветКлиентуJSON(, ДанныеПинКода);
	
КонецФункции

// Каталог пользователей

Функция ПолучитьКаталогПользователейPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	Каталог = КаталогПользователей(ДанныеСессии);
	
	Возврат ОтветКлиентуJSON(,Каталог);
	
КонецФункции

Функция ПолучитьОписаниеПользователяPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем переменные
	//
	
	ИдентификаторПользователяСтрока = Запрос.ПараметрыURL.Получить("Пользователь");
	
	Если ИдентификаторПользователяСтрока = "current" Тогда
		Пользователь = ДанныеСессии.Пользователь;
	Иначе
	
		Попытка
			Пользователь = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторПользователяСтрока));
		Исключение		
		КонецПопытки;
		
		Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
			Возврат ОтветКлиентуJSON("errorData");
		КонецЕсли;	
		
	КонецЕсли;
		
	// Получаем описание пользователя
	//
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеПользователя.Данные КАК ОписаниеПользователя
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУО_ОН КАК ДанныеПользователя
		|ГДЕ
		|	ДанныеПользователя.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.ПользовательОписание)
		|	И ДанныеПользователя.Объект = &Пользователь";
		
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ОтветКлиентуJSON(,ВыборкаДетальныеЗаписи.ОписаниеПользователя);
	Иначе
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьСвоиУчебныеГруппыPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыборкаУчебныхГрупп.Данные
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУО_ОН КАК ВыборкаУчебныхГрупп
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыДанныхВебКабинетаСУО_О КАК ОтборУчебныхГруппПользователя
		|		ПО ВыборкаУчебныхГрупп.Объект = ОтборУчебныхГруппПользователя.Объект
		|ГДЕ
		|	ОтборУчебныхГруппПользователя.Отбор = &ИдентификаторПользователя
		|	И ВыборкаУчебныхГрупп.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.УчебнаяГруппа)";

	Запрос.УстановитьПараметр("ИдентификаторПользователя", ДанныеСессии.Пользователь.УникальныйИдентификатор());

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаУчебныхГрупп = РезультатЗапроса.Выбрать();
	
	УчебныеГруппы = Новый Массив;
			
	Пока ВыборкаУчебныхГрупп.Следующий() Цикл		
		УчебныеГруппы.Добавить(ВыборкаУчебныхГрупп.Данные);		
	КонецЦикла;	
	
	Возврат ОтветКлиентуJSON(,УчебныеГруппы);

КонецФункции

// Оценка качества обучения

Функция ЗаписатьОценкуКачестваОбученияPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
		
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	ПраваДляПроверки = Новый Массив;
	ПраваДляПроверки.Добавить("Обучение");
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, ПраваДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;

	// Получаем данные
	//	
	
	Попытка
		ИдентификаторПрохожденияОбучения = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("ПрохождениеОбучения"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПрохожденияОбучения) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	ПрохождениеОбучения = Документы.ПрохождениеОбученияСУО.ПолучитьСсылку(ИдентификаторПрохожденияОбучения);
	
	// Получаем данные для записи
	//
	
	ДанныеДляЗаписиJSON = СокрЛП(Запрос.ПолучитьТелоКакСтроку());
	
	Если НЕ ЗначениеЗаполнено(ДанныеДляЗаписиJSON) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	Попытка
		ДанныеДляЗаписи = ОбщегоНазначенияСУ.JSONВДанные(ДанныеДляЗаписиJSON);
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;
	
	СтруктураДанных = Новый Структура;
	
	Если ДанныеДляЗаписи.Свойство("mark") Тогда		
		СтруктураДанных.Вставить("ОценкаКачестваОбучения", Число(ДанныеДляЗаписи.mark));		
	КонецЕсли;
	
	Если ДанныеДляЗаписи.Свойство("comment") Тогда		
		СтруктураДанных.Вставить("КомментарийКачестваОбучения", ДанныеДляЗаписи.comment);
	КонецЕсли;
	
	ОбучениеСУО.ЗаписатьДанныеОценкиКачестваОбучения(ПрохождениеОбучения, СтруктураДанных, Истина);			
	ВебКабинетСУ.ОбновитьДанныеОбъекта(Документы.ПрохождениеОбученияСУО, ПрохождениеОбучения);
	
	ПроведениеОбучения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПрохождениеОбучения, "ПроведениеОбучения");
	РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(ПроведениеОбучения);
	
	// Возвращаем результат
	//
	
	Возврат ОтветКлиентуJSON(, Новый Структура("ОперацияЗавершена", Истина));
	
КонецФункции

Функция ПолучитьОценкиКачестваОбученияPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
		
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	ПраваДляПроверки = Новый Массив;
	ПраваДляПроверки.Добавить("Обучение");
	ПраваДляПроверки.Добавить("Преподавание");
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, ПраваДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;

	// Получаем данные
	//	
	
	Попытка
		ИдентификаторПроведенияОбучения = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("ПроведениеОбучения"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПроведенияОбучения) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	ПроведениеОбучения = Документы.ПроведениеОбученияСУО.ПолучитьСсылку(ИдентификаторПроведенияОбучения);
	
	// Делаем проверки
	//
	
	ПоказыватьОценкиИКомментарииВсемУчастникам = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроведениеОбучения, "ПоказыватьОценкиИКомментарииВсемУчастникам");
	
	Если НЕ ПоказыватьОценкиИКомментарииВсемУчастникам Тогда
		Возврат ОтветКлиентуJSON("noPermissions");
	КонецЕсли;
	
	// Делаем запрос к базе данных
	//
	
	ЗапросДанных = Новый Запрос;
	
	ЗапросДанных.Текст = "ВЫБРАТЬ
	                     |	ДанныеВебКабинетаСУО_ОН.Данные КАК data
	                     |ИЗ
	                     |	РегистрСведений.ДанныеВебКабинетаСУО_ОН КАК ДанныеВебКабинетаСУО_ОН
	                     |ГДЕ
	                     |	ДанныеВебКабинетаСУО_ОН.Тип = &Тип
	                     |	И ДанныеВебКабинетаСУО_ОН.Объект = &ПроведениеОбучения";	
		
	ЗапросДанных.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);	   	
	ЗапросДанных.УстановитьПараметр("Тип", Перечисления.ТипыДанныхВебКабинетаСУО.ОценкиКачестваОбучения);

	РезультатЗапроса = ЗапросДанных.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;	

	ВыборкаДанных = РезультатЗапроса.Выбрать();
	ВыборкаДанных.Следующий();
	
	// Возвращаем результат
	
	Возврат ОтветКлиентуJSON(,ВыборкаДанных.data);
	
КонецФункции

// Отчеты

Функция ПолучитьОтчетПреподавателяGET(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
		
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	ПраваДляПроверки = Новый Массив;
	ПраваДляПроверки.Добавить("Преподавание");
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, ПраваДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;

	// Получаем данные
	//	
	
	Попытка
		ИмяФорматаОтчета = Запрос.ПараметрыURL.Получить("Формат");
		ИдентификаторВариантаОтчета = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("Отчет"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИмяФорматаОтчета)
		ИЛИ НЕ ЗначениеЗаполнено(ИдентификаторВариантаОтчета) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	ВариантОтчета = Справочники.ВариантыОтчетов.ПолучитьСсылку(ИдентификаторВариантаОтчета);	
	ФорматОтчета = ТипФайлаТабличногоДокумента[ИмяФорматаОтчета];
	
	// Формируем отчет
	//
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("СсылкаВарианта", ВариантОтчета);
	
	ПараметрыОтчета = ВариантыОтчетов.ПодключитьОтчетИЗагрузитьНастройки(ПараметрыОтчета);
	
	Если НЕ ПараметрыОтчета.Успех Тогда
		Возврат ОтветКлиентуJSON("errorData", Новый Структура("description", ПараметрыОтчета.ТекстОшибки));
	КонецЕсли;
	
	ОбщегоНазначенияклиентСервер.ДобавитьЭлементКомпоновки(
		ПараметрыОтчета.НастройкиКД.Отбор,
		"Преподаватель",
		ВидСравненияКомпоновкиДанных.Равно,
		ДанныеСессии.Пользователь,
		Неопределено,
		Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	
		
	РезультатФормирования = ВариантыОтчетов.СформироватьОтчет(ПараметрыОтчета, Ложь, Ложь);		
	
	Если НЕ РезультатФормирования.Успех Тогда
		Возврат ОтветКлиентуJSON("errorData", Новый Структура("description", РезультатФормирования.ТекстОшибки));
	КонецЕсли;
	
	ИмяФайлаБезРасширения = Строка(ДанныеСессии.Пользователь) + "_" + Формат(ТекущаяДатаСеанса(), "ДФ=yyyy-MM-dd");
	
	Возврат ВозвратитьОтчет(РезультатФормирования.ТабличныйДокумент, ФорматОтчета, ИмяФайлаБезРасширения);
	
КонецФункции

Функция ПолучитьОтчетПроведенияОбученияGET(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
		
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	ПраваДляПроверки = Новый Массив;
	ПраваДляПроверки.Добавить("Преподавание");
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, ПраваДляПроверки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;

	// Получаем данные
	//	
	
	Попытка
		ИдентификаторПроведенияОбучения = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("ПроведениеОбучения"));
		ИмяФорматаОтчета = Запрос.ПараметрыURL.Получить("Формат");
		ИдентификаторВариантаОтчета = Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("Отчет"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПроведенияОбучения)
		ИЛИ НЕ ЗначениеЗаполнено(ИмяФорматаОтчета)
		ИЛИ НЕ ЗначениеЗаполнено(ИдентификаторВариантаОтчета) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	ПроведениеОбучения = Документы.ПроведениеОбученияСУО.ПолучитьСсылку(ИдентификаторПроведенияОбучения);
	ВариантОтчета = Справочники.ВариантыОтчетов.ПолучитьСсылку(ИдентификаторВариантаОтчета);
	ФорматОтчета = ТипФайлаТабличногоДокумента[ИмяФорматаОтчета];
	
	// Формируем отчет
	//
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("СсылкаВарианта", ВариантОтчета);
	
	ПараметрыОтчета = ВариантыОтчетов.ПодключитьОтчетИЗагрузитьНастройки(ПараметрыОтчета);
	
	Если НЕ ПараметрыОтчета.Успех Тогда
		Возврат ОтветКлиентуJSON("errorData", Новый Структура("description", ПараметрыОтчета.ТекстОшибки));
	КонецЕсли;
	
	ОбщегоНазначенияклиентСервер.ДобавитьЭлементКомпоновки(
		ПараметрыОтчета.НастройкиКД.Отбор,
		"ПроведениеОбучения",
		ВидСравненияКомпоновкиДанных.Равно,
		ПроведениеОбучения,
		Неопределено,
		Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	
		
	РезультатФормирования = ВариантыОтчетов.СформироватьОтчет(ПараметрыОтчета, Ложь, Ложь);		
	
	Если НЕ РезультатФормирования.Успех Тогда
		Возврат ОтветКлиентуJSON("errorData", Новый Структура("description", РезультатФормирования.ТекстОшибки));
	КонецЕсли;
	
	ИмяФайлаБезРасширения = Строка(ПроведениеОбучения) + "_" + Формат(ТекущаяДатаСеанса(), "ДФ=yyyy-MM-dd");	
	
	Возврат ВозвратитьОтчет(РезультатФормирования.ТабличныйДокумент, ФорматОтчета, ИмяФайлаБезРасширения);
	
КонецФункции

Функция ВозвратитьОтчет(ТекстовыйДокументОтчета, ТипФайла, ИмяФайлаБезРасширения)
	
	ПутьКВременномуФайлу = ПолучитьИмяВременногоФайла("tmp");
	ТекстовыйДокументОтчета.Записать(ПутьКВременномуФайлу, ТипФайла);
	
	ДвоичныеДанныеОтчета = Новый ДвоичныеДанные(ПутьКВременномуФайлу);
	
	Попытка
		УдалитьФайлы(ПутьКВременномуФайлу);
	Исключение
		// Не требуется
	КонецПопытки;
	
	Если ТипФайла = ТипФайлаТабличногоДокумента.HTML5
		ИЛИ ТипФайла = ТипФайлаТабличногоДокумента.HTML
		ИЛИ ТипФайла = ТипФайлаТабличногоДокумента.HTML3
		ИЛИ ТипФайла = ТипФайлаТабличногоДокумента.HTML4 Тогда
	
		Возврат ОтветКлиентуHTMLИзДвоичныхДанных(ДвоичныеДанныеОтчета);
		
	КонецЕсли;
	
	Если ТипФайла = ТипФайлаТабличногоДокумента.XLS
		ИЛИ ТипФайла = ТипФайлаТабличногоДокумента.XLS95
		ИЛИ ТипФайла = ТипФайлаТабличногоДокумента.XLS97 Тогда
		
		Возврат ОтветКлиентуДвоичныеДанные(0, ДвоичныеДанныеОтчета, "application/vnd.ms-excel", ИмяФайлаБезРасширения + ".xls");
		
	КонецЕсли;
	
	Если ТипФайла = ТипФайлаТабличногоДокумента.XLSX Тогда		
		
		Возврат ОтветКлиентуДвоичныеДанные(0, ДвоичныеДанныеОтчета, "application/vnd.openxmlformats-officedocument.spreadsheetml.sheet", ИмяФайлаБезРасширения + ".xlsx");
		
	КонецЕсли;
	
	Если ТипФайла = ТипФайлаТабличногоДокумента.PDF
		ИЛИ ТипФайла = ТипФайлаТабличногоДокумента.PDF_A_1
		ИЛИ ТипФайла = ТипФайлаТабличногоДокумента.PDF_A_2
		ИЛИ ТипФайла = ТипФайлаТабличногоДокумента.PDF_A_3 Тогда
	
		Возврат ОтветКлиентуДвоичныеДанные(0, ДвоичныеДанныеОтчета, "application/pdf", ИмяФайлаБезРасширения + ".pdf", Истина); 
		
	КонецЕсли;
	
КонецФункции

// ОБЩИЕ (аналогичные процедуры есть в других HTTP-сервисах)
//

Функция ОтветКлиентуJSON(КодОшибки = "", Данные = NULL)
	
	ТекстСообщенияСтруктура = Новый Структура("error, data", КодОшибки, Данные);
	
	ТекстСообщения = ОбщегоНазначенияСУ.ДанныеВJSON(ТекстСообщенияСтруктура);

	Если ЗначениеЗаполнено(КодОшибки) Тогда
		Ответ = Новый HTTPСервисОтвет(400);
	Иначе
		Ответ = Новый HTTPСервисОтвет(200);
	КонецЕсли;
		
	Ответ.УстановитьТелоИзСтроки(ТекстСообщения);
	
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	ДобавитьЗаголовкиМежсайтовогоЗапроса(Ответ);
	
	Возврат Ответ;
	
КонецФункции

Функция ОтветКлиентуДвоичныеДанные(КодОшибки = 0, ДвоичныеДанные = Неопределено, MIMEТип = Неопределено, ИмяФайла = Неопределено, ПросмотретьВБраузере = Ложь)
	
	Если ЗначениеЗаполнено(КодОшибки) Тогда
				
		Ответ = Новый HTTPСервисОтвет(КодОшибки);
		
	Иначе
		
		Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
			
			Ответ = Новый HTTPСервисОтвет(200);
			Ответ.УстановитьТелоИзДвоичныхДанных(ДвоичныеДанные);
			
			Ответ.Заголовки.Вставить("Accept-Ranges", "bytes");
			
			Если ЗначениеЗаполнено(ИмяФайла) Тогда
				ВариантОткрытия = ?(ПросмотретьВБраузере, "inline", "attachment");
				Ответ.Заголовки.Вставить("Content-Disposition", ""+ВариантОткрытия+"; filename="""+ СтроковыеФункцииКлиентСервер.СтрокаЛатиницей(ИмяФайла) +"""");
			КонецЕсли;			
			
			Если ЗначениеЗаполнено(MIMEТип) Тогда
				Ответ.Заголовки.Вставить("Content-Type", MIMEТип);
			КонецЕсли;
			
		Иначе
			
			Ответ = Новый HTTPСервисОтвет(404);
			
		КонецЕсли;			
		
	КонецЕсли;	
	
	ДобавитьЗаголовкиМежсайтовогоЗапроса(Ответ);
	
	Возврат Ответ;
	
КонецФункции

Функция ОтветКлиентуXML(ТекстXML)
	
	РезультатЗапроса = "<?xml version=""1.0"" encoding=""utf-8""?><response>";
	РезультатЗапроса = РезультатЗапроса + ТекстXML;
	РезультатЗапроса = РезультатЗапроса + "</response>";
	
	Ответ = Новый HTTPСервисОтвет(200);
		
	Ответ.УстановитьТелоИзСтроки(РезультатЗапроса);

	Ответ.Заголовки.Вставить("Content-Type", "application/xml");
	ДобавитьЗаголовкиМежсайтовогоЗапроса(Ответ);
	
	Возврат Ответ;
	
КонецФункции

Функция ОтветКлиентуHTMLИзДвоичныхДанных(ДвоичныеДанные)
		
	Ответ = Новый HTTPСервисОтвет(200);
		
	Ответ.УстановитьТелоИзДвоичныхДанных(ДвоичныеДанные);

	Ответ.Заголовки.Вставить("Data-type", "text/html");
	Ответ.Заголовки.Вставить("Content-Type", "text/html");
	
	ДобавитьЗаголовкиМежсайтовогоЗапроса(Ответ);
	
	Возврат Ответ;
	
КонецФункции

Процедура ВосстановитьСимволыСтрокиПараметров(Значение)
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
	
		Значение = СтрЗаменить(Значение, "%3A", ":");
		Значение = СтрЗаменить(Значение, "%3B", ";");		
		
	КонецЕсли;
		
КонецПроцедуры

Функция СформироватьТаблицуДополнительныхСвойств(МассивСвойств)

	ТаблицаСвойств = Новый ТаблицаЗначений;
	ТаблицаСвойств.Колонки.Добавить("Свойство");
	ТаблицаСвойств.Колонки.Добавить("Значение");

	Для каждого Элемент Из МассивСвойств Цикл
		
		Если НЕ Элемент.Свойство("propertyId") ИЛИ НЕ Элемент.Свойство("value") ИЛИ НЕ ЗначениеЗаполнено(Элемент.propertyId) ИЛИ НЕ Элемент.Свойство("typeValue") Тогда
			ОтменитьТранзакцию();
		    Возврат ОтветКлиентуJSON("errorData");
		КонецЕсли;				
		
		НоваяСтрока = ТаблицаСвойств.Добавить();
		НоваяСтрока.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент.propertyId));
		
		Если Элемент.typeValue = "date" Тогда
			НоваяСтрока.Значение = ОбщегоНазначенияСУКлиентСервер.СтрокаISO8601ВДату(Элемент.value);
		ИначеЕсли Элемент.typeValue = "properties" ИЛИ Элемент.typeValue = "values" Тогда
			НоваяСтрока.Значение = Справочники.ЗначенияСвойствОбъектов.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент.value));
		Иначе
			НоваяСтрока.Значение = Элемент.value;
		КонецЕсли;

	КонецЦикла;
	
	Возврат ТаблицаСвойств;
	
КонецФункции

Функция КаталогПользователей(ДанныеСессии, ТолькоПользователи=Ложь)
	
	Если ТолькоПользователи Тогда
		МассивПользователей = Новый Массив;
	Иначе
		КаталогПользователей = Новый Структура("УчебныеГруппы, КаталогПользователей, Преподаватели, Организаторы", Новый Массив, Неопределено, Неопределено, Неопределено);
	КонецЕсли;
		
	Права = ДанныеСессии.Права.Получить();
	
	Если Права.Свойство("Пользователи") И Права.Пользователи Тогда
		
		Если Права.Свойство("СвоиУчебныеГруппы") И Права.СвоиУчебныеГруппы Тогда

			// Получаем учебные группы пользователя
			//			
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ВыборкаУчебныхГрупп.Данные
				|ИЗ
				|	РегистрСведений.ДанныеВебКабинетаСУО_ОН КАК ВыборкаУчебныхГрупп
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыДанныхВебКабинетаСУО_О КАК ОтборУчебныхГруппПользователя
				|		ПО ВыборкаУчебныхГрупп.Объект = ОтборУчебныхГруппПользователя.Объект
				|ГДЕ
				|	ОтборУчебныхГруппПользователя.Отбор = &ИдентификаторПользователя
				|	И ВыборкаУчебныхГрупп.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.УчебнаяГруппаОписание)";

			Запрос.УстановитьПараметр("ИдентификаторПользователя", ДанныеСессии.Пользователь.УникальныйИдентификатор());

			РезультатЗапроса = Запрос.Выполнить();

			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если ТолькоПользователи Тогда
					
					ДанныеГруппы = ОбщегоНазначенияСУ.JSONВДанные(ВыборкаДетальныеЗаписи.Данные.Получить());
					
					Для каждого Участник Из ДанныеГруппы.Участники Цикл
						
						Пользователь = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(Участник.Идентификатор));
						
						Если МассивПользователей.Найти(Пользователь) = Неопределено Тогда
							МассивПользователей.Добавить(Пользователь);
						КонецЕсли;
					
					КонецЦикла;
					
				Иначе
					
					КаталогПользователей.УчебныеГруппы.Добавить(ВыборкаДетальныеЗаписи.Данные);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если Права.Свойство("КаталогПользователей") И Права.КаталогПользователей Тогда
		
			// Получаем общий каталог, если есть соответствующее право
			//

			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ДанныеВебКабинетаСУО_ОН.Данные
				|ИЗ
				|	РегистрСведений.ДанныеВебКабинетаСУО_ОН КАК ДанныеВебКабинетаСУО_ОН
				|ГДЕ
				|	ДанныеВебКабинетаСУО_ОН.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.КаталогПользователей)
				|	И ДанныеВебКабинетаСУО_ОН.Объект = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.КаталогПользователей)";
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если НЕ РезультатЗапроса.Пустой() Тогда
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				ВыборкаДетальныеЗаписи.Следующий();
				
				Если ТолькоПользователи Тогда

					ДанныеОбщегоКаталога = ОбщегоНазначенияСУ.JSONВДанные(ВыборкаДетальныеЗаписи.Данные.Получить());
					
					Для каждого ПользовательОбщегоКаталога Из ДанныеОбщегоКаталога.Пользователи Цикл
						
						Пользователь = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(ПользовательОбщегоКаталога.Идентификатор));
						
						Если МассивПользователей.Найти(Пользователь) = Неопределено Тогда
							МассивПользователей.Добавить(Пользователь);
						КонецЕсли;
					
					КонецЦикла;
					
				Иначе
					
					КаталогПользователей.КаталогПользователей = ВыборкаДетальныеЗаписи.Данные;
					
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЕсли;
		
		Если Права.Свойство("Обучение") И Права.Обучение Тогда
			
			// Получаем преподавателей учащегося
			//
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ДанныеВебКабинетаСУО_ПН.Данные
				|ИЗ
				|	РегистрСведений.ДанныеВебКабинетаСУО_ПН КАК ДанныеВебКабинетаСУО_ПН
				|ГДЕ
				|	ДанныеВебКабинетаСУО_ПН.Пользователь = &Пользователь
				|	И ДанныеВебКабинетаСУО_ПН.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.ПреподавателиПользователя)
				|	И ДанныеВебКабинетаСУО_ПН.Объект = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.ПреподавателиПользователя)";
				
			Запрос.Параметры.Вставить("Пользователь", ДанныеСессии.Пользователь);
				
			РезультатЗапроса = Запрос.Выполнить();
			
			Если НЕ РезультатЗапроса.Пустой() Тогда
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				ВыборкаДетальныеЗаписи.Следующий();
				
				Если ТолькоПользователи Тогда
					
					ДанныеПреподавателей = ОбщегоНазначенияСУ.JSONВДанные(ВыборкаДетальныеЗаписи.Данные.Получить());
					
					Для каждого Преподаватель Из ДанныеПреподавателей Цикл
						
						Пользователь = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(Преподаватель.Идентификатор));
						
						Если МассивПользователей.Найти(Пользователь) = Неопределено Тогда
							МассивПользователей.Добавить(Пользователь);
						КонецЕсли;
					
					КонецЦикла;
					
				Иначе
									
					КаталогПользователей.Преподаватели = ВыборкаДетальныеЗаписи.Данные;
					
				КонецЕсли;	
					
			КонецЕсли;
			
		КонецЕсли;
		
		// Организаторы
		//

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СписокОбщихАдресатов.Данные КАК object
			|ИЗ
			|	РегистрСведений.ДанныеВебКабинетаСУО_ОН КАК СписокОбщихАдресатов
			|ГДЕ
			|	СписокОбщихАдресатов.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.Организатор)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СписокПользовательскихАдресатов.Данные
			|ИЗ
			|	РегистрСведений.ДанныеВебКабинетаСУО_ПН КАК СписокПользовательскихАдресатов
			|ГДЕ
			|	СписокПользовательскихАдресатов.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУО.Организатор)
			|	И СписокПользовательскихАдресатов.Пользователь = &Пользователь";
		
		Запрос.УстановитьПараметр("Пользователь", ДанныеСессии.Пользователь);
	
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда			
			
			Если ТолькоПользователи Тогда

				ТаблицаОрганизаторов = РезультатЗапроса.Выгрузить();

				Для каждого ДанныеОрганизатора Из ТаблицаОрганизаторов Цикл
				
					СвойстваОрганизатора = ОбщегоНазначенияСУ.JSONВДанные(ДанныеОрганизатора.object.Получить());
					
					Пользователь = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(СвойстваОрганизатора.Пользователь));
					
					Если МассивПользователей.Найти(Пользователь) = Неопределено Тогда
						МассивПользователей.Добавить(Пользователь);
					КонецЕсли;
					
				КонецЦикла;				
				
			Иначе
			
				КаталогПользователей.Организаторы = РезультатЗапроса.Выгрузить();
				
			КонецЕсли;		
				
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТолькоПользователи Тогда
		
		Возврат МассивПользователей;
		
	Иначе
		
		Возврат КаталогПользователей;	
		
	КонецЕсли;	
	
КонецФункции

Функция ОжидатьЗавершенияЗаданияОбновленияЭлектронногоРесурса(ДанныеСессии, ДокументАктивности)
	
	Отбор = Новый Структура;
   	Отбор.Вставить("ИмяМетода", "ОбучениеСУО.ПриПрохожденииЭлектронногоРесурса");
   	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	Отбор.Вставить("Ключ", Строка(ДанныеСессии.Пользователь.УникальныйИдентификатор()));
   	ФоновыеЗаданияОбновления = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	Если ФоновыеЗаданияОбновления.Количество() > 0 Тогда
		Попытка
			ФоновыеЗадания.ОжидатьЗавершения(ФоновыеЗаданияОбновления, 10);
		Исключение
			ЗаписьЖурналаРегистрации(
				НСТр("ru = 'Веб-кабинет. Получение данных'"),
				УровеньЖурналаРегистрации.Ошибка,
				,
				ДокументАктивности,
				НСТр("ru = 'Не дождались окончания выполнения фонового задания по обновлению данных. '") + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;	
	
КонецФункции

Функция РазрешитьМежсайтовыеЗапросыOPTIONS(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	ДобавитьЗаголовкиМежсайтовогоЗапроса(Ответ, Истина);
	Возврат Ответ;
	
КонецФункции

Процедура ДобавитьЗаголовкиМежсайтовогоЗапроса(Ответ, ПроверитьРазрешение = Ложь)
	Если НЕ ПроверитьРазрешение ИЛИ Константы.РазрешитьЗапросыКСервисамСДругихДоменовСУ.Получить() = Истина Тогда
		Ответ.Заголовки.Вставить("Access-Control-Allow-Origin", "*");
	    Ответ.Заголовки.Вставить("Access-Control-Allow-Methods", "GET, PUT, POST, DELETE, HEAD, OPTIONS");
	    Ответ.Заголовки.Вставить("Access-Control-Allow-Credentials", "true");
	    Ответ.Заголовки.Вставить("Access-Control-Allow-Headers", "X-Requested-With, origin, content-type, accept");
	КонецЕсли;
КонецПроцедуры












