
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		
		Библиотека = Параметры.Отбор.Владелец;
		
		Элементы.Библиотека.Видимость = Ложь;
		
	Иначе
		
		СписокБиблиотек = Элементы.Библиотека.СписокВыбора;
			
		Если Параметры.Свойство("ВладелецМетки") Тогда
			
			Если ЗначениеЗаполнено(Параметры.ВладелецМетки) Тогда
				Библиотека = Параметры.ВладелецМетки;
			Иначе
				Библиотека = Справочники.СхемыМероприятийСУО.Общая;
			КонецЕсли;
			
			СписокБиблиотек.Добавить(Справочники.СхемыМероприятийСУО.Общая, "Общая");
			
		Иначе
			
			Библиотека = Пользователи.ТекущийПользователь();
			
		КонецЕсли;
		
		Если (ТипЗнч(Библиотека) = Тип("СправочникСсылка.Пользователи")
			ИЛИ ТипЗнч(Библиотека) = Тип("СправочникСсылка.КаталогМероприятийСУО"))
			И ЗначениеЗаполнено(Библиотека) Тогда
			
			НаименованиеБиблиотеки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Библиотека, "Наименование");
			
			СписокБиблиотек.Добавить(Библиотека, НаименованиеБиблиотеки);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.ТекущаяСтрока) Тогда
			Библиотека = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ТекущаяСтрока, "Владелец");
		КонецЕсли;
		
		Если СписокБиблиотек.Количество() < 2 Тогда
			Элементы.Библиотека.ТолькоПросмотр = Истина;		
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Список, Библиотека);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.Источники = Новый Массив;
	ПараметрыРазмещения.Источники.Добавить(Метаданные.Справочники.СтруктураБиблиотекиПользователейСУО);
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ФормаПодключаемыеКоманды;
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура БиблиотекаПриИзменении(Элемент)
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Список, Библиотека);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Список

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти



#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти



