#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ПовторныеПрохождения(Пользователь, ПрохождениеОбучения, Задание) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПовторноеПрохождениеЭлектронныхРесурсовСУЗСрезПоследних.ЭлементСодержания,
		|	ПовторноеПрохождениеЭлектронныхРесурсовСУЗСрезПоследних.Период КАК Дата
		|ИЗ
		|	РегистрСведений.ПовторноеПрохождениеЭлектронныхРесурсовСУЗ.СрезПоследних(
		|			,
		|			Пользователь = &Пользователь
		|				И ПрохождениеОбучения = &ПрохождениеОбучения
		|				И Задание = &Задание) КАК ПовторноеПрохождениеЭлектронныхРесурсовСУЗСрезПоследних";
	
	Запрос.УстановитьПараметр("Задание", Задание);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбучения);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ЭлементыСодержанияРегистратора(ДокументРегистратор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПовторноеПрохождениеЭлектронныхРесурсовСУЗ.ЭлементСодержания
		|ИЗ
		|	РегистрСведений.ПовторноеПрохождениеЭлектронныхРесурсовСУЗ КАК ПовторноеПрохождениеЭлектронныхРесурсовСУЗ
		|ГДЕ
		|	ПовторноеПрохождениеЭлектронныхРесурсовСУЗ.Регистратор = &ДокументРегистратор";
	
	Запрос.УстановитьПараметр("ДокументРегистратор", ДокументРегистратор);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЭлементСодержания");
	
КонецФункции

#КонецОбласти

#КонецЕсли
