
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверки
	//
	
	ПопыткаВыполненияЗадания = Параметры.ПрохождениеЗадания;
	
	Если НЕ ЗначениеЗаполнено(ПопыткаВыполненияЗадания) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Обучающийся еще не начал выполнять задание'"),,,,Отказ);
		Возврат;
	КонецЕсли;
	
	// Реквизиты формы
	//
	
	ПопыткаВыполненияЗаданияДанные = Документы.ПопыткаВыполненияЗаданияСУО.ОписаниеПопыткиВыполненияЗаданияДанные(ПопыткаВыполненияЗадания);
	
	Задание = ПопыткаВыполненияЗаданияДанные.Задание;
	ПрохождениеОбучения = ПопыткаВыполненияЗаданияДанные.ПрохождениеОбучения;
	Вариант = ПопыткаВыполненияЗаданияДанные.Вариант;
	Ответ = ПопыткаВыполненияЗаданияДанные.ТекстОтвета;	
	
	ШкалаОценки = Документы.ПроведениеОбученияСУО.ШкалаОценки(ПопыткаВыполненияЗаданияДанные.ПроведениеОбучения);
	
	Если Параметры.ДанныеВедомости = Неопределено Тогда
		
		ЭтоПроверкаПреподавателем = Ложь;
		
		Оценка = УправлениеОбучениемСУОПовтИсп.ОценкаИзБаллов(ПопыткаВыполненияЗаданияДанные.Баллы, ШкалаОценки);
		ВозвращеноНаДоработку = ПопыткаВыполненияЗаданияДанные.ВозвращеноНаДоработку;
		ПричинаВозвратаНаДоработку = ПопыткаВыполненияЗаданияДанные.ПричинаВозвратаНаДоработку;
		КомментарийПреподавателя = ПопыткаВыполненияЗаданияДанные.КомментарийПреподавателя;
		ПроверенПреподавателем = ПопыткаВыполненияЗаданияДанные.ПроверенПреподавателем;
		
	Иначе
		
		ЭтоПроверкаПреподавателем = Истина;
		
		Оценка = Параметры.ДанныеВедомости.Оценка;
		ВозвращеноНаДоработку = Параметры.ДанныеВедомости.ВозвращеноНаДоработку;
		ПричинаВозвратаНаДоработку = Параметры.ДанныеВедомости.ПричинаВозвратаНаДоработку;
		КомментарийПреподавателя = Параметры.ДанныеВедомости.КомментарийПреподавателя;
		ПроверенПреподавателем = (ЗначениеЗаполнено(Оценка) И НЕ ВозвращеноНаДоработку);
		ПроходнаяОценка = Справочники.ШкалыОценокСУО.ПроходнаяОценкаСтрока(ПопыткаВыполненияЗаданияДанные.ПроходнойБалл, ШкалаОценки);
		
		МассивПараметровВыбора = Новый Массив();
		МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец", ШкалаОценки));
		Элементы.Оценка.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);		
		
	КонецЕсли;
	
	ЗаполнитьСтатусЗадания();
	
	Если ПопыткаВыполненияЗаданияДанные.ИспользуетсяФорматированныйДокумент Тогда
		Элементы.ЗаданиеОписание.Видимость = Ложь;
		ОписаниеФорматированныйДокумент = ПопыткаВыполненияЗаданияДанные.ОписаниеФорматированныйДокумент.Получить();
	Иначе
		Элементы.ОписаниеФорматированныйДокумент.Видимость = Ложь;
	КонецЕсли;
	
	// Динамические списки
	//
	
	Если ЗначениеЗаполнено(Вариант) Тогда
		ФайлыЗадания.Параметры.УстановитьЗначениеПараметра("Владелец", Вариант);
	Иначе
		ФайлыЗадания.Параметры.УстановитьЗначениеПараметра("Владелец", Задание);
	КонецЕсли;	
	
	ФайлыПользователя.Параметры.УстановитьЗначениеПараметра("ПопыткаВыполненияЗадания", ПопыткаВыполненияЗадания);
	
	// Видимость элементов
	//
	
	УстановитьДоступностьЭлементовОтвета();	
	УстановитьДоступностьЭлементовПроверки();
	УстановитьДоступностьЭлементовЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗакрытьБезПредупреждения
		И Модифицированность Тогда
		
		// Только для ученика
		
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("ПредложитьСохранитьИзмененияПродолжение", ЭтотОбъект);				
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Данные были изменены. Сохранить изменения?'"), РежимДиалогаВопрос.ДаНетОтмена, 0);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьСохранитьИзмененияПродолжение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		СохранитьОтвет();
		ЗакрытьБезПредупреждения = Истина;
		Закрыть();		
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		ЗакрытьБезПредупреждения = Истина;
		Закрыть();
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОткрытьФайлПользователя(Команда)
	
	ТекущиеДанные = Элементы.ФайлыПользователя.ТекущиеДанные;
	
	Если НЕ ОбщегоНазначенияСУКлиент.ТекущиеДанныеТаблицыДоступны(ТекущиеДанные) Тогда
		Возврат;	
	КонецЕсли;
	
	Если ТекущиеДанные.Зашифрован Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФайл(ТекущиеДанные.Ссылка);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайлПользователя(Команда)
	ПрисоединенныеФайлыКлиент.ДобавитьФайлы(ПопыткаВыполненияЗадания, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОтветПользователя(Команда)
	СохранитьОтвет();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыполнениеЗадания(Команда)	
	
	ОписаниеВыполненияЗадания = ЗавершитьЗадание();
	
	Если ОписаниеВыполненияЗадания.Свойство("Сообщение")
		И ТипЗнч(ОписаниеВыполненияЗадания.Сообщение) = Тип("Структура") Тогда		
		ПоказатьПредупреждение(,ОписаниеВыполненияЗадания.Сообщение.Текст); 		
	КонецЕсли;
	
	Оповестить("ОбновитьМоеОбучение");	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьНаДоработку(Команда)
	Если Элементы.ПричинаВозвратаНаДоработку.Видимость И НЕ ЗначениеЗаполнено(ПричинаВозвратаНаДоработку) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите причину возврата задания на доработку'"),,"ПричинаВозвратаНаДоработку");
		Возврат;
	КонецЕсли;	
	ВозвращеноНаДоработку = Истина;
	ЗавершитьПроверку();
КонецПроцедуры

&НаКлиенте
Процедура ВыставитьОценку(Команда)
	Если НЕ ЗначениеЗаполнено(Оценка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите оценку за проверенное задание'"),,"Оценка");
		Возврат;
	КонецЕсли;
	ВозвращеноНаДоработку = Ложь;
	ПричинаВозвратаНаДоработку = Неопределено;
	ЗавершитьПроверку();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФайлыЗадания

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ФайлыЗадания

&НаКлиенте
Процедура ФайлыЗаданияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ФайлыЗадания.ТекущиеДанные;
	
	Если НЕ ОбщегоНазначенияСУКлиент.ТекущиеДанныеТаблицыДоступны(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(ТекущиеДанные.Ссылка,, УникальныйИдентификатор);
	РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыЗаданияПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФайлыПользователя

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ФайлыПользователя

&НаКлиенте
Процедура ФайлыПользователяВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если НЕ ОбщегоНазначенияСУКлиент.ТекущиеДанныеТаблицыДоступны(ТекущиеДанные) Тогда
		Возврат;	
	КонецЕсли;
	
	Если ТекущиеДанные.Зашифрован Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФайл(ТекущиеДанные.Ссылка);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ОткрытьФайл(Файл)
	
	ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ПолучитьДанныеФайла(Файл, УникальныйИдентификатор);
	
	ПрисоединенныеФайлыКлиент.ОткрытьФайл(ДанныеФайла, Ложь);		
	
КонецПроцедуры

&НаСервере
Процедура СохранитьОтвет()
	
	ОбучениеСУО.ПриПрохожденииЗадания(ПрохождениеОбучения,Задание,,,Ложь,,,,,Ответ,,ПопыткаВыполненияЗадания);	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ЗавершитьЗадание()
	
	ОписаниеВыполненияЗадания = ОбучениеСУО.ПриПрохожденииЗадания(
		ПрохождениеОбучения,Задание,,,Истина,,,Истина,Истина,Ответ,Истина,ПопыткаВыполненияЗадания);
		
	ВозвращеноНаДоработку = ОписаниеВыполненияЗадания.ПопыткаВыполненияЗадания.ВозвращеноНаДоработку;
	ПроверенПреподавателем = ОписаниеВыполненияЗадания.ПопыткаВыполненияЗадания.ПроверенПреподавателем;
	
	УстановитьДоступностьЭлементовОтвета();
	ЗаполнитьСтатусЗадания();
	Модифицированность = Ложь;
	
	Возврат ОписаниеВыполненияЗадания;
	
КонецФункции

&НаСервере
Процедура УстановитьДоступностьЭлементовОтвета()
		
	ЗаданияДоступны = Документы.ПрохождениеОбученияСУО.ЗаданияДоступны(ПрохождениеОбучения);
	ОбучениеАктуально = Документы.ПрохождениеОбученияСУО.Актуально(ПрохождениеОбучения);
	ДанныеПопытки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПопыткаВыполненияЗадания, "ПопыткаЗавершена");
	
	ТолькоПросмотрФормы = Ложь;
	
	Если НЕ ЗаданияДоступны Тогда
		ТолькоПросмотрФормы = Истина;
	КонецЕсли;

	Если ДанныеПопытки.ПопыткаЗавершена Тогда
		ТолькоПросмотрФормы = Истина;	
	КонецЕсли;
	
	Если НЕ ОбучениеАктуально Тогда
		ТолькоПросмотрФормы = Истина;
	КонецЕсли;
		
	Элементы.Ответ.ТолькоПросмотр = ТолькоПросмотрФормы;	
	Элементы.ФайлыПользователя.ТолькоПросмотр = ТолькоПросмотрФормы; 
	
	Элементы.ФайлыПользователяПрикрепитьФайлПользователя.Доступность = НЕ ТолькоПросмотрФормы;
	Элементы.КоманднаяПанельОтвета.Доступность = НЕ ТолькоПросмотрФормы;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовПроверки()
	
	ДанныеПопытки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПопыткаВыполненияЗадания, "ПопыткаЗавершена");
	
	СтраницаПроверкиАктивна = ?(ЭтоПроверкаПреподавателем, Истина, Ложь); 
	
	Если СтраницаПроверкиАктивна Тогда
		Элементы.ПричинаВозвратаНаДоработку.Видимость = Справочники.ПричиныВозвратаЗаданияНаДоработкуСУО.ЕстьПричиныВозврата();
		Элементы.ГруппаОценка.Доступность = ДанныеПопытки.ПопыткаЗавершена;
	Иначе		
		Элементы.КомментарийПреподавателя.Видимость = ЗначениеЗаполнено(КомментарийПреподавателя);
		Элементы.ВыставитьОценку.Видимость = Ложь;
		Элементы.ВернутьНаДоработку.Видимость = Ложь;
		Элементы.Оценка.Видимость = Ложь;
		Элементы.ПричинаВозвратаНаДоработку.Видимость = Ложь;
		Элементы.СтраницаПроверка.Заголовок = НСтр("ru = 'Комментарий преподавателя'");
	КонецЕсли;				
	
	Элементы.ПроходнаяОценка.Видимость = ЗначениеЗаполнено(ПроходнаяОценка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовЗадания()
	
	Элементы.ГруппаВариант.Видимость = ЗначениеЗаполнено(Вариант);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.Ссылка
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.ВладелецФайла = &ВладелецФайла";

	Если ЗначениеЗаполнено(Вариант) Тогда
		Запрос.УстановитьПараметр("ВладелецФайла", Вариант);
	Иначе
		Запрос.УстановитьПараметр("ВладелецФайла", Задание);
	КонецЕсли;

	Результат = Запрос.Выполнить();

	Элементы.ФайлыЗадания.Видимость = НЕ Результат.Пустой();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПроверку()
	
	ДанныеВедомостиЗадания = Новый Структура("Оценка, ВозвращеноНаДоработку, ПричинаВозвратаНаДоработку,
	|КомментарийПреподавателя, ПроверенПреподавателем, ПопыткаЗавершена, ВыставляетсяОценка");

	ДанныеВедомостиЗадания.Оценка = Оценка;
	ДанныеВедомостиЗадания.ВозвращеноНаДоработку = ВозвращеноНаДоработку;
	ДанныеВедомостиЗадания.ПричинаВозвратаНаДоработку = ПричинаВозвратаНаДоработку;
	ДанныеВедомостиЗадания.КомментарийПреподавателя = КомментарийПреподавателя;
	ДанныеВедомостиЗадания.ПроверенПреподавателем = Истина;
	ДанныеВедомостиЗадания.ПопыткаЗавершена = НЕ ВозвращеноНаДоработку;
	ДанныеВедомостиЗадания.ВыставляетсяОценка = Истина;
	
	Закрыть(ДанныеВедомостиЗадания);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатусЗадания()
	
	Если ВозвращеноНаДоработку Тогда
		Если ЗначениеЗаполнено(ПричинаВозвратаНаДоработку) Тогда
			НаименованиеПричиныВозврата = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПричинаВозвратаНаДоработку, "Наименование");
			СтатусЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Возвращено на доработку (%1)'"), НаименованиеПричиныВозврата);
		Иначе
			СтатусЗадания = НСтр("ru = 'Возвращено на доработку'");
		КонецЕсли;
	Иначе
		
		ДанныеПопытки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПопыткаВыполненияЗадания, "ПопыткаЗавершена");

		Если ДанныеПопытки.ПопыткаЗавершена Тогда
			Если ПроверенПреподавателем Тогда
				НаименованиеОценки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Оценка, "Наименование");
				СтатусЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Проверено (%1)'"), НаименованиеОценки);
			Иначе
				СтатусЗадания = НСтр("ru = 'Проверяется'");
			КонецЕсли;
		Иначе
			СтатусЗадания = НСтр("ru = 'Выполняется'");
		КонецЕсли;
		
	КонецЕсли;		
	
КонецПроцедуры



#КонецОбласти

