Процедура ДобавитьОтбор(Объект, Отбор) Экспорт
	
	ИдентификаторОтбора = Перечисления.ОтборыДанныхВебКабинетаСУО.Идентификатор(Отбор);
	
	НаборЗаписей = РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Отбор.Установить(ИдентификаторОтбора);
	НаборЗаписей.Отбор.Объект.Установить(Объект);

	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Отбор = ИдентификаторОтбора;
	НоваяЗапись.Объект = Объект;
	НоваяЗапись.ОтборСсылка = Отбор;
	НоваяЗапись.ДатаИзменения = ТекущаяДатаСеанса();

	НаборЗаписей.Записать();	
	
КонецПроцедуры

Процедура УдалитьОтбор(Объект, Отбор = Неопределено) Экспорт
	
	НаборЗаписей = РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Объект.Установить(Объект);
	
	Если Отбор <> Неопределено Тогда
		ИдентификаторОтбора = Перечисления.ОтборыДанныхВебКабинетаСУО.Идентификатор(Отбор);
		НаборЗаписей.Отбор.Отбор.Установить(ИдентификаторОтбора);
	КонецЕсли;	
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
