
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Страница = "https://sdo.1c.ru/conf/platforms/ku.txt";
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ИспользуемаяВерсияПлатформы = СистемнаяИнформация.ВерсияПриложения;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПродолжитьРаботу(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРаботу(Команда)
	Закрыть(Истина);
КонецПроцедуры

#КонецОбласти
