#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция Переменные(Знач ШаблонСообщений) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныСообщенийСУОПеременные.Переменная КАК Переменная,
		|	NULL КАК ИмяПеременной
		|ИЗ
		|	Справочник.ШаблоныСообщенийСУО.Переменные КАК ШаблоныСообщенийСУОПеременные
		|ГДЕ
		|	ШаблоныСообщенийСУОПеременные.Ссылка = &ШаблонСообщений
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ШаблоныСообщенийСУОДополнительныеПеременные.Переменная,
		|	ШаблоныСообщенийСУОДополнительныеПеременные.ИмяПеременной
		|ИЗ
		|	Справочник.ШаблоныСообщенийСУО.ДополнительныеПеременные КАК ШаблоныСообщенийСУОДополнительныеПеременные
		|ГДЕ
		|	ШаблоныСообщенийСУОДополнительныеПеременные.Ссылка = &ШаблонСообщений";
	
	Запрос.УстановитьПараметр("ШаблонСообщений", ШаблонСообщений);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
