#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		ДатаИзменения = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ТипШаблона = Перечисления.ТипыШаблоновСообщенийСУО.АвтоматическаяРассылка Тогда
		ПроверяемыеРеквизиты.Добавить("ТипАвтоматическойРассылки");
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ФорматированныйДокумент = ОбъектКопирования.ФорматированныйДокумент;
	Действующий = Ложь;
КонецПроцедуры


#КонецОбласти

#КонецЕсли
