

#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтараяГруппаПроведенийОбучения = Параметры.ГруппаПроведенийОбучения;
	ПроведениеПрограммыОбучения = Параметры.ПроведениеПрограммыОбучения;
	
	Если (ЗначениеЗаполнено(СтараяГруппаПроведенийОбучения)
		И ЗначениеЗаполнено(ПроведениеПрограммыОбучения))
		ИЛИ (НЕ ЗначениеЗаполнено(СтараяГруппаПроведенийОбучения)
		И НЕ ЗначениеЗаполнено(ПроведениеПрограммыОбучения))Тогда
		
		ВызватьИсключение НСтр("ru = 'Ошибочное сочетание параметров формы'");
		
	КонецЕсли;
			
	ЗаполнитьРеквизиты();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ЗаменитьПроведениеПрограммыОбученияПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьДатыПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьПреподавателейПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКНаименованиюТекстПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура НовоеПроведениеПрограммыОбученияПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Скопировать(Команда)
	НачатьЗакрытиеФормы();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыПреподаватели

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Преподаватели

&НаКлиенте
Процедура ПреподавателиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент.ТекущиеДанные.ЕстьРольПреподавателя = ЕстьРольПреподавателя(Элемент.ТекущиеДанные.НовыйПреподаватель);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Элементы.ДекорацияНетОбучений.Видимость = НЕ ЕстьПроведенияОбученияДляКопирования;
	
	// Программа обучения
	
	Элементы.ГруппаПрограммаОбучения.Видимость = НЕ ЗначениеЗаполнено(ПроведениеПрограммыОбучения) И ПолучитьФункциональнуюОпцию("ПолныйИнтерфейсСУО"); 
	Элементы.ЗаменитьПроведениеПрограммыОбучения.Доступность = ЕстьПроведенияОбученияДляКопирования;
	Элементы.НовоеПроведениеПрограммыОбучения.Доступность = ЗаменитьПроведениеПрограммыОбучения;
	
	// Даты
			
	Элементы.СдвинутьДаты.Доступность = ЗначениеЗаполнено(СтараяДатаНачала);
	Элементы.ДекорацияНетДаты.Видимость = ЕстьПроведенияОбученияДляКопирования И НЕ ЗначениеЗаполнено(СтараяДатаНачала);
	Элементы.НоваяДатаНачалаБезВремени.Видимость = ЗначениеЗаполнено(СтараяДатаНачала) И СкрытьВремя;
	Элементы.НоваяДатаНачалаБезВремени.Доступность = СдвинутьДаты;
	
	Элементы.НоваяДатаНачала.Видимость = ЗначениеЗаполнено(СтараяДатаНачала) И НЕ СкрытьВремя;
	Элементы.НоваяДатаНачала.Доступность = СдвинутьДаты;		
	
	// Преподаватели
	
	Элементы.СкопироватьПреподавателей.Доступность = Преподаватели.Количество() > 0;
	Элементы.Преподаватели.Доступность = СкопироватьПреподавателей;
	
	// Постфикс
	
	Элементы.ДобавитьКНаименованиюТекст.Доступность = ЕстьПроведенияОбученияДляКопирования;
	Элементы.ТекстДляДобавленияКНаименованию.Доступность = ДобавитьКНаименованиюТекст;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьРеквизиты()
	
	// Настройки
	
	ЗаменитьПроведениеПрограммыОбучения = 
		ЗначениеЗаполнено(СтараяГруппаПроведенийОбучения) И ПолучитьФункциональнуюОпцию("ПолныйИнтерфейсСУО");			
	
	// Есть проведение обучения для копирования
	
	ЕстьПроведенияОбученияДляКопирования = Истина;
	
	Если ЗначениеЗаполнено(СтараяГруппаПроведенийОбучения) Тогда
		ЕстьПроведенияОбученияДляКопирования = НЕ РегистрыСведений.СоставыГруппПроведенийОбученияСУО.Пустая(СтараяГруппаПроведенийОбучения, Истина);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПроведениеПрограммыОбучения) Тогда
		ЕстьПроведенияОбученияДляКопирования = НЕ Документы.ПроведениеПрограммыОбученияСУО.Пустая(ПроведениеПрограммыОбучения, Истина);	
	КонецЕсли;
	
	// Даты
	
	ПервоеПроведениеОбученияСтруктура = Неопределено;
	
	Если ЗначениеЗаполнено(СтараяГруппаПроведенийОбучения) Тогда
		ПервоеПроведениеОбученияСтруктура = РегистрыСведений.СоставыГруппПроведенийОбученияСУО.ПервоеПроведениеОбученияГруппы(СтараяГруппаПроведенийОбучения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПроведениеПрограммыОбучения) Тогда
		ПервоеПроведениеОбученияСтруктура = Документы.ПроведениеПрограммыОбученияСУО.ПервоеПроведенияОбучения(ПроведениеПрограммыОбучения);
	КонецЕсли;
		
	Если ТипЗнч(ПервоеПроведениеОбученияСтруктура) = Тип("Структура") Тогда
		СтараяДатаНачала = ПервоеПроведениеОбученияСтруктура.ДатаНачала;
		СкрытьВремя = ПервоеПроведениеОбученияСтруктура.СкрытьВремя;
	КонецЕсли;
	
	// Есть обучения с программой обучения
	
	ЕстьОбученияСПрограммойОбучения = Ложь;
	
	Если ЗначениеЗаполнено(СтараяГруппаПроведенийОбучения) Тогда
		ЕстьОбученияСПрограммойОбучения = РегистрыСведений.СоставыГруппПроведенийОбученияСУО.ЕстьОбученияСПрограммойОбучения(СтараяГруппаПроведенийОбучения);
	КонецЕсли;
	
	// Преподаватели
	
	МассивПреподавателей = Новый Массив;
	
	Если ЗначениеЗаполнено(СтараяГруппаПроведенийОбучения) Тогда
		МассивПреподавателей = РегистрыСведений.СоставыГруппПроведенийОбученияСУО.ПреподавателиГруппы(СтараяГруппаПроведенийОбучения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПроведениеПрограммыОбучения) Тогда
		МассивПреподавателей = Документы.ПроведениеПрограммыОбученияСУО.Преподаватели(ПроведениеПрограммыОбучения);
	КонецЕсли;
	
	Преподаватели.Очистить();
	
	Для каждого Преподаватель Из МассивПреподавателей Цикл		
		НоваяСтрока = Преподаватели.Добавить();
		НоваяСтрока.СтарыйПреподаватель = Преподаватель;	
	    НоваяСтрока.НовыйПреподаватель = Преподаватель;
		НоваяСтрока.ЕстьРольПреподавателя = УправлениеОбучениемСУО.ЕстьРольПреподавателя(Преподаватель);
	КонецЦикла;
		
	// Элементы формы
	
	УстановитьДоступностьЭлементовФормы();
	
КонецФункции

&НаКлиенте
Процедура НачатьЗакрытиеФормы()
	
	Отказ = Ложь;
	ТекстСообщения = "";
	
	ПроверитьДанные(Отказ, ТекстСообщения);
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		
		Если Отказ Тогда
			ПоказатьПредупреждение(, ТекстСообщения);
		Иначе
			ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьЗакрытиеФормы", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 0);
		КонецЕсли;
		
	Иначе
		
		ПродолжитьЗакрытиеФормы();	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗакрытиеФормы(Результат = Неопределено, Параметры = Неопределено) Экспорт
	
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	Закрыть(СтруктураДанных());
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураДанных()
	
	НоваяСтруктураДанных = Новый Структура;
	
	Если ЗаменитьПроведениеПрограммыОбучения
		И НЕ ЗначениеЗаполнено(ПроведениеПрограммыОбучения) Тогда
		НоваяСтруктураДанных.Вставить("ПроведениеПрограммыОбучения", НовоеПроведениеПрограммыОбучения);
	КонецЕсли;
	
	Если СдвинутьДаты Тогда
		НоваяСтруктураДанных.Вставить("ДатыПроведения", Новый Структура);	
		НоваяСтруктураДанных.ДатыПроведения.Вставить("СтараяДатаНачала", СтараяДатаНачала);
		НоваяСтруктураДанных.ДатыПроведения.Вставить("НоваяДатаНачала", НоваяДатаНачала());
	КонецЕсли;
	
	Если СкопироватьПреподавателей Тогда
		СоответствиеПреподавателей = Новый Соответствие;
		Для каждого Строка Из Преподаватели Цикл
			СоответствиеПреподавателей.Вставить(Строка.СтарыйПреподаватель, Строка.НовыйПреподаватель);	
		КонецЦикла;
		НоваяСтруктураДанных.Вставить("Преподаватели", СоответствиеПреподавателей);
	КонецЕсли;
	
	Если ДобавитьКНаименованиюТекст Тогда
		НоваяСтруктураДанных.Вставить("ТекстДляДобавления", ТекстДляДобавленияКНаименованию);		
	КонецЕсли;
	
	Возврат НоваяСтруктураДанных;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьДанные(Отказ, ТекстСообщения)
	
	Отказ = Ложь;
	ТекстСообщения = "";
	
	// Проведение программы
	
	Если НЕ ЗаменитьПроведениеПрограммыОбучения
		И НЕ ЗначениеЗаполнено(ПроведениеПрограммыОбучения)
		И ЕстьОбученияСПрограммойОбучения Тогда
		ТекстСообщения = НСтр("ru = 'В некоторых обучениях указано действующее проведение программы обучения.
		|При проведении этих обучений на них автоматически будут зачислены участники проведения программы обучения.
		|Выполнить копирование?'");
		Возврат;	
	КонецЕсли;
	
	// Преподаватели без прав
	
	ЕстьПреподавателиБезПрав = Ложь;
	
	Для каждого Строка Из Преподаватели Цикл
	
		Если НЕ Строка.ЕстьРольПреподавателя Тогда
			ЕстьПреподавателиБезПрав = Истина;
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	
	Если СкопироватьПреподавателей И ЕстьПреподавателиБезПрав Тогда		
		ТекстСообщения = НСтр("ru = 'Есть преподаватели без прав доступа. Выполнить копирование?'");
		Возврат;	
	КонецЕсли;
	
	// Даты
	
	Если СдвинутьДаты
		И ЗначениеЗаполнено(СтараяДатаНачала)
		И ЗначениеЗаполнено(НоваяДатаНачала())
		И НоваяДатаНачала() < СтараяДатаНачала Тогда
		
		Отказ = Истина;
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Дата начала обучения должна быть позднее %1'"), Формат(СтараяДатаНачала));
			
		Возврат;		
		
	КонецЕсли;
	
	// Текст
	
	Если ДобавитьКНаименованиюТекст
		И НЕ ЗначениеЗаполнено(ТекстДляДобавленияКНаименованию) Тогда
		
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Заполните поле ""Текст для добавления к наименованию""'");			
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НоваяДатаНачала()
	
	Если НЕ ЗначениеЗаполнено(СтараяДатаНачала) Тогда
		Возврат Дата("00010101");
	КонецЕсли;
		
	Если СкрытьВремя Тогда
		Если ЗначениеЗаполнено(НоваяДатаНачалаБезВремени) Тогда
			Возврат НачалоДня(НоваяДатаНачалаБезВремени); 
		Иначе
			Возврат Дата("00010101");
		КонецЕсли;
	Иначе
		Возврат НоваяДатаНачалаСВременем;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьРольПреподавателя(Знач Преподаватель)
	Возврат УправлениеОбучениемСУО.ЕстьРольПреподавателя(Преподаватель);
КонецФункции
	
#КонецОбласти

