

#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЛицензированиеВебКабинетаСУ.ПроверитьРегистрационныеНомера();
	ОбновитьДанныеНаСервере();
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОнлайнВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Пользователь);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	ОбновитьДанныеНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ОбновитьДанныеНаСервере()
	
	КоличествоЗаданийТаблица = РегистрыСведений.ЗаданияНаОбновлениеДанныхВебКабинетаСУ.КоличествоЗаданий();
	ЗначениеВДанныеФормы(КоличествоЗаданийТаблица, КоличествоЗаданий);
	
	ОнлайнТаблица = РегистрыСведений.СессииВебКабинетаСУ.АктивныеПользователи(,Истина);
	ЗначениеВДанныеФормы(ОнлайнТаблица, Онлайн);
	
	КоличествоОнлайн = ОнлайнТаблица.Количество();
	
	Элементы.ДекорацияЗаданиеОбновлениеДанныхВК.Видимость = 
		НЕ РегламентныеЗаданияСервер.РегламентноеЗаданиеИспользуется(Метаданные.РегламентныеЗадания.ОбновлениеДанныхВебКабинетаСУ);
		
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	Элементы.ДекорацияЗаданиеПерепроведениеДокументов.Видимость = 
		НЕ РегламентныеЗаданияСервер.РегламентноеЗаданиеИспользуется(Метаданные.РегламентныеЗадания.ПерепроведениеДокументовСУО);
	//----------------------------------//
	
	//--# КОНСТРУКТОР КУРСОВ ДОБАВИТЬ #--//
	// Элементы.ДекорацияЗаданиеПерепроведениеДокументов.Видимость = Ложь;
	//----------------------------------//
	
	АдресВебКабинета = Справочники.ПубликацииВебКабинетаСУ.АдресВебКабинета();
	Если НЕ ЗначениеЗаполнено(АдресВебКабинета) Тогда
		Элементы.ФормаОткрытьВебКабинет.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВебКабинет(Команда)
	ПерейтиПоНавигационнойСсылке(АдресВебКабинета);
КонецПроцедуры
	

#КонецОбласти

