

#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Параметры.ПроведениеОбучения) Тогда
		ВызватьИсключение НСТр("ru = 'Проведение обучения не задано'")	
	КонецЕсли;
	
	ЗаполнитьТаблицуЗадания();
	 
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ВыбратьЗадания(Команда)
	
	ВыбранныеСтроки = Задания.НайтиСтроки(Новый Структура("Выбрано", Истина));
	ВыбранныеЗадания = Новый Массив;
	
	Для каждого НайденнаяСтрока Из ВыбранныеСтроки Цикл
		ВыбранныеЗадания.Добавить(НайденнаяСтрока.Задание);
	КонецЦикла;
	ВыбранныеЗадания = Новый ФиксированныйМассив(ВыбранныеЗадания);
	Закрыть(ВыбранныеЗадания);
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаполнитьТаблицуЗадания()
	
	Задания.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроведениеОбученияСУОЭлектронныеЗадания.Задание КАК Задание,
		|	ПроведениеОбученияСУОЭлектронныеЗадания.Наименование КАК Наименование
		|ИЗ
		|	Документ.ПроведениеОбученияСУО.ЭлектронныеЗадания КАК ПроведениеОбученияСУОЭлектронныеЗадания
		|ГДЕ
		|	ПроведениеОбученияСУОЭлектронныеЗадания.Ссылка = &ПроведениеОбучения
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПроведениеОбученияСУОЭлектронныеЗадания.НомерСтроки";
	
	Запрос.УстановитьПараметр("ПроведениеОбучения", Параметры.ПроведениеОбучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		
		НоваяСтрока = Задания.Добавить();
		НоваяСтрока.Задание = ВыборкаДетальныеЗаписи.Задание;
		НоваяСтрока.Наименование = ВыборкаДетальныеЗаписи.Наименование;		
	КонецЦикла;
	
КонецПроцедуры



#КонецОбласти

