

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьФорматРедактированияВремени();
	УстановитьПредупреждениеДляПолноправногоПользователя();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РегистрыСведений.ВремяДоступаПользователейСУО.ЗаполнитьЗаписьДоступа(ТекущийОбъект, Запись, Отказ, СкрытьВремя);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РегистрыСведений.ВремяДоступаПользователейСУО.ДобавитьОткрытоеОбучениеДляПерепроведения();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура СкрытьВремяПриИзменении(Элемент)
	УстановитьФорматРедактированияВремени();
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	УстановитьПредупреждениеДляПолноправногоПользователя();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияДоступаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Запись.ДатаОкончанияДоступа = КонецДня(ВыбранноеЗначение);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура УстановитьФорматРедактированияВремени()
	
	Если СкрытьВремя Тогда
		Элементы.ДатаНачалаДоступа.ФорматРедактирования = "ДЛФ=D";
		Элементы.ДатаОкончанияДоступа.ФорматРедактирования = "ДЛФ=D";
	Иначе
		Элементы.ДатаНачалаДоступа.ФорматРедактирования = "";
		Элементы.ДатаОкончанияДоступа.ФорматРедактирования = "";
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоПолноправныйПользователь(Пользователь)
	УстановитьПривилегированныйРежим(Истина);
	Возврат Пользователи.ЭтоПолноправныйПользователь(Пользователь,,Ложь);
КонецФункции

&НаКлиенте
Процедура УстановитьПредупреждениеДляПолноправногоПользователя()
	Элементы.ГруппаПредупреждение.Видимость = ?(ЗначениеЗаполнено(Запись.Пользователь) И ЭтоПолноправныйПользователь(Запись.Пользователь), Истина, Ложь);
КонецПроцедуры	

#КонецОбласти
