
&НаСервере
Функция ПолучитьОбъектЗапроса(ЗапросНаОбучение)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗапросНаОбучение, "ОбъектЗапроса");
	
КонецФункции


&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОбъектЗапроса = ПолучитьОбъектЗапроса(ПараметрКоманды);
	
	Если ТипЗнч(ОбъектЗапроса) = Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда
		ИмяФормы = "Документ.ПроведениеОбученияСУО.ФормаОбъекта";	
	КонецЕсли;
	
	Если ТипЗнч(ОбъектЗапроса) = Тип("СправочникСсылка.КаталогПрограммОбученияСУО") Тогда
		ИмяФормы = "Документ.ПроведениеПрограммыОбученияСУО.ФормаОбъекта";	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяФормы) Тогда
		
		ПараметрыФормы = Новый Структура("ЗапросНаОбучение", ПараметрКоманды);
		
		ОткрытьФорму(ИмяФормы, ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
		
	Иначе
		
		ПоказатьПредупреждение(,НСтр("ru = 'Создание проведения для данного типа запроса не поддерживается'"));
		
	КонецЕсли;
		
КонецПроцедуры
