
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Определение = ТекущийОбъект.Определение.Получить();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.КраткоеОпределение = Определение.ПолучитьТекст();
	ТекущийОбъект.Определение = Новый ХранилищеЗначения(Определение);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ТерминГлоссарияОбновлен", Объект.Ссылка, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.БукваДляПоиска) Тогда
		Объект.БукваДляПоиска = БукваДляПоискаОпределения(Объект.Наименование);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСинонимы

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Синонимы

&НаКлиенте
Процедура СинонимыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Для каждого СтрокаТС Из Объект.Синонимы Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТС.БукваДляПоиска) Тогда
			СтрокаТС.БукваДляПоиска = БукваДляПоискаОпределения(СтрокаТС.Представление);
		КонецЕсли; 
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиентеНаСервереБезКонтекста
Функция БукваДляПоискаОпределения(Знач ПредставлениеТермина)
	Возврат РазработкаЭлектронныхКурсовСлужебныйКлиентСервер.БукваДляПоискаТермина(ПредставлениеТермина);	
КонецФункции


#КонецОбласти

