
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ПараметрыФормы = Новый Структура("ЭлектронныеРесурсы, ТипПубликации", Неопределено, Неопределено);
	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		ПараметрыФормы.ЭлектронныеРесурсы = ПараметрКоманды;
	Иначе
		ПараметрыФормы.ЭлектронныеРесурсы = Новый Массив;
		ПараметрыФормы.ЭлектронныеРесурсы.Добавить(ПараметрКоманды);
	КонецЕсли;
	
	ОткрытьФорму("Обработка.ПубликацияЭлектронныхРесурсовСУЗ.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
