Процедура ДобавитьДанные(Пользователь, Тип, Объект, Данные, Формат) Экспорт	
	
	НаборЗаписей = РегистрыСведений.ДанныеВебКабинетаСУЗ_ПН.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Отбор.Тип.Установить(Тип);
	НаборЗаписей.Отбор.Объект.Установить(Объект);

	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Пользователь = Пользователь;
	НоваяЗапись.Тип = Тип;
	НоваяЗапись.Объект = Объект;
	
	НоваяЗапись.Данные = Новый ХранилищеЗначения(Данные);
	НоваяЗапись.Формат = Формат;
	НоваяЗапись.ДатаИзменения = ТекущаяДатаСеанса();

	НаборЗаписей.Записать();	
	
КонецПроцедуры

Процедура УдалитьДанные(Объект=Неопределено, Тип=Неопределено, Пользователь=Неопределено) Экспорт
	
	НаборЗаписей = РегистрыСведений.ДанныеВебКабинетаСУЗ_ПН.СоздатьНаборЗаписей();

	Если Объект <> Неопределено Тогда
		НаборЗаписей.Отбор.Объект.Установить(Объект);
	КонецЕсли;
	
	Если Пользователь <> Неопределено Тогда
		НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);	
	КонецЕсли;
	
	Если Тип <> Неопределено Тогда
		НаборЗаписей.Отбор.Тип.Установить(Тип);	
	КонецЕсли;	
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
