
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		Рубрикатор = Параметры.Отбор.Владелец;
		Элементы.Рубрикатор.ТолькоПросмотр = Истина;
	ИначеЕсли ЗначениеЗаполнено(Параметры.ТекущаяСтрока) Тогда
		Рубрикатор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ТекущаяСтрока, "Владелец");
	КонецЕсли;
	
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Список, Рубрикатор);	
	
КонецПроцедуры

&НаКлиенте
Процедура РубрикаторПриИзменении(Элемент)
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Список, Рубрикатор);
КонецПроцедуры

