#Область ПрограммныйИнтерфейс

// Открывает форму создания нового электронного курса.
// 
// Параметры:
//   Тип - ПеречислениеСсылка.ТипыЭлектронныхКурсов - Тип курса, который надо создать.
//   ВладелецФормы - УправляемаяФорма - необязательный, форма-источник команды. 
//                   Для данного элемента будет вызвано событие ОбработкаЗаписиНового.
//   КонтекстРедактирования - Структура - произвольные данные, связанные с созданием курса.
//                            Будут возвращены в процедуру
//                            ИзучениеЭлектронныхКурсовПереопределяемый.ПриЗаписиЭлектронногоКурса.
//
Процедура СоздатьЭлектронныйКурс(Тип, ВладелецФормыКурса = Неопределено, КонтекстРедактирования = Неопределено) Экспорт	
	ИзучениеЭлектронныхКурсовСлужебныйКлиент.СоздатьЭлектронныйКурс(Тип, ВладелецФормыКурса, КонтекстРедактирования);
КонецПроцедуры

// Копирует электронный курс.
// 
// Параметры:
//   ЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - Копируемый курс.
//   ВладелецФормы - УправляемаяФорма - необязательный, форма-источник команды. 
//                   Для данного элемента будет вызвано событие ОбработкаЗаписиНового.
//   КонтекстРедактирования - Структура - произвольные данные, связанные с созданием курса.
//                            Будут возвращены в процедуру
//                            ИзучениеЭлектронныхКурсовПереопределяемый.ПриЗаписиЭлектронногоКурса.
//
Процедура СкопироватьЭлектронныйКурс(ЭлектронныйКурс, ВладелецФормыКурса = Неопределено, КонтекстРедактирования = Неопределено) Экспорт	
	ИзучениеЭлектронныхКурсовСлужебныйКлиент.СкопироватьЭлектронныйКурс(ЭлектронныйКурс, ВладелецФормыКурса, КонтекстРедактирования);
КонецПроцедуры


#КонецОбласти