#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Функция ТипОбъектаСУЗ() Экспорт
	
	Возврат Перечисления.ТипыОбъектовСУЗ.page;
	
КонецФункции

// Позволяет получить XML данные объекта.
//
// Параметры
//  ОбъектСУЗ          - экземпляр обработки ОбъектСУЗ.
//  ПараметрыСсылки    – Структура, содержит параметры ссылки по которой вызывается вопрос.
//  КонтекстВыполнения - Структура, содержит параметры контекста выполнения объекта.
//
// Возвращаемое значение:
//   Строка – содержит XML представление объекта СУЗ.
//
Функция ПолучитьXMLПредставление(Страница, ПараметрыСсылки, КонтекстВыполнения) Экспорт

	ИмяОбъектаСУЗ         = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ТипОбъектаСУЗ());
	ПоставщикСводаЗнаний  = Справочники.СводыЗнанийСУЗ.Поставщик(КонтекстВыполнения.ЭлектронныйРесурс);
	ИдентификаторСтраницы = Страница.УникальныйИдентификатор();
	
	Если Страница.ИспользуетсяФорматированныйДокумент Тогда
		
		ФорматированныйДокумент = ОбъектыСУЗ.ПолучитьДанные(Страница, "ТекстСтраницы", Истина, "ФорматированныйДокумент", ПоставщикСводаЗнаний);
		
		ПредставлениеСтраницы = ОбщегоНазначенияСУ.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ФорматированныйДокумент, ИдентификаторСтраницы);
		
		Если ПредставлениеСтраницы.ЕстьВложения Тогда
			ОбъектыСУЗ.ДобавитьРесурсВМассивРесурсов(Страница, КонтекстВыполнения.СписокРесурсов);
		КонецЕсли;
		
		ТекстСтраницы = ПредставлениеСтраницы.ПредставлениеHTML;		
		
		Если КонтекстВыполнения.ПараметрыЭкспорта <> Неопределено Тогда
			ОбщегоНазначенияСУКлиентСервер.ИсправитьBase64Строку(ТекстСтраницы);
		КонецЕсли;
		
	Иначе
		
		ТекстСтраницы = ОбъектыСУЗ.ПолучитьДанные(Страница, "ТекстСтраницы", Истина, "ТекстовыеДанные", ПоставщикСводаЗнаний);
		ТекстСтраницы = ОбщегоНазначенияСУ.ВыделитьТелоHTMLДокумента(ТекстСтраницы);
		
	КонецЕсли;

	ОбъектыСУЗ.ДобавитьРесурсыОбъектаВМассивРесурсов(Страница, КонтекстВыполнения.СписокРесурсов, КонтекстВыполнения.СписокПодсказок);
	
	// Формируем XDTO
	
	СтраницаXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Page","Страница");
	СтраницаXDTO     = ФабрикаXDTO.Создать(СтраницаXDTOТип);
	
	СтраницаXDTO.id           = Страница.УникальныйИдентификатор();
	СтраницаXDTO.object       = ИмяОбъектаСУЗ;
	СтраницаXDTO.Наименование = Страница.Наименование;
	СтраницаXDTO.Текст        = ТекстСтраницы;
	
	// Применяем шаблон к текстам
	
	Если ЗначениеЗаполнено(Страница.ШаблонТекста) Тогда
		
		// Получаем путь к основному ресурсу

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РесурсыОбъектовСУЗ.Ресурс
			|ИЗ
			|	Справочник.РесурсыОбъектовСУЗ КАК РесурсыОбъектовСУЗ
			|ГДЕ
			|	РесурсыОбъектовСУЗ.Владелец = &Страница
			|	И РесурсыОбъектовСУЗ.Основной = ИСТИНА";

		Запрос.УстановитьПараметр("Страница", Страница);

		Результат = Запрос.Выполнить();

		Если НЕ Результат.Пустой() Тогда
		
			ВыборкаДетальныеЗаписи = Результат.Выбрать();

			ВыборкаДетальныеЗаписи.Следующий();
			
			ИмяКаталогаОсновногоРесурса = Справочники.РесурсыСУЗ.ИмяКаталогаРесурса(ВыборкаДетальныеЗаписи.Ресурс);
			
		Иначе
			
			ИмяКаталогаОсновногоРесурса = "";
			
		КонецЕсли;

		// Обрабатываем тексты на основе шаблона
		
		СтраницаXDTO.Текст = ОбъектыСУЗ.ПрименитьШаблонКТексту(СтраницаXDTO.Текст, Страница.ШаблонТекста, ИмяКаталогаОсновногоРесурса); 	
				
	КонецЕсли;		
	
	// Формируем XML
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, СтраницаXDTO);
	XMLДанные = ЗаписьXML.Закрыть();
	
	ШаблонОбъекта = ОбъектыСУЗ.ПолучитьСсылкуНаXSLШаблонОбъекта(Страница);
	ОбъектыСУЗ.ДобавитьШаблонВСписокОбъекта(ШаблонОбъекта, КонтекстВыполнения.СписокШаблонов);
	
	// Добавляем ссылки на объекты
	
	ОбъектыСУЗ.ДобавитьСсылкиОбъектаВМассив(Страница, КонтекстВыполнения);
	
	Возврат XMLДанные;
	
КонецФункции

Функция УстановитьАвтоНаименование(СтартоваяСтраницаОбъект, РодительскийОбъект) Экспорт
	
	СтартоваяСтраницаОбъект.Наименование  = НСтр("ru = 'Стартовая страница теста ""%1""'");
	СтартоваяСтраницаОбъект.Наименование  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтартоваяСтраницаОбъект.Наименование, РодительскийОбъект.Наименование);
	
КонецФункции

#КонецЕсли