#Область ОписаниеПеременных

&НаКлиенте
Перем ФормаВладелец; // Форма, из которой открыта эта форма

#КонецОбласти


#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//////////////////////////////////////////////////////////////////
	
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Объект);
	
	ТаблицаДоступностиДанныхПоставщика = РазработкаСУЗ.ПолучитьТаблицуДоступностиДанныхПоставщика();
	
	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.Текст;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	РазработкаСУЗ.УстановитьДоступностьДанныхОтПоставщика(ЭтотОбъект, ТаблицаДоступностиДанныхПоставщика);
	
	//////////////////////////////////////////////////////////////////
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Заполняем реквизиты, хранящиеся в регистре ДанныеВопросыСУЗ
	
	ФормаВладелец = ОбщегоНазначенияСУКлиент.НайтиВладельцаУправляемойФормы(ВладелецФормы);
	
	Если ФормаВладелец <> Неопределено Тогда
			
		Если ФормаВладелец.ИмяФормы = "Справочник.ВариантыОтветовНаВопросСУЗ.Форма.ФормаЭлемента" Тогда
			ФормаВладелец = ОбщегоНазначенияСУКлиент.НайтиВладельцаУправляемойФормы(ФормаВладелец.ВладелецФормы);	
		КонецЕсли;
		
		Если ФормаВладелец.ИмяФормы = "Справочник.ВопросыСУЗ.Форма.ФормаЭлемента" Тогда
		
			Для каждого Строка Из ФормаВладелец.ДанныеВариантовОтветов Цикл
			
				Если Строка.ВариантОтвета = Объект.Ссылка Тогда
					Текст = Строка.Текст;
				КонецЕсли;
			
			КонецЦикла;
			
			УстановитьДоступностьЭлементовФормыНаКлиенте();
			
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если НЕ Объект.Ссылка.Пустая()
		И ФормаВладелец.ИмяФормы = "Справочник.ВопросыСУЗ.Форма.ФормаЭлемента" Тогда
		
		СтрокаВарианта = Неопределено;
		
		Для каждого Строка Из ФормаВладелец.ДанныеВариантовОтветов Цикл
			Если Строка.ВариантОтвета = Объект.Ссылка Тогда
				СтрокаВарианта = Строка;
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокаВарианта = Неопределено Тогда
			СтрокаВарианта = ФормаВладелец.ДанныеВариантовОтветов.Добавить();
		КонецЕсли;
			
		СтрокаВарианта.Текст                = Текст;
		СтрокаВарианта.ВариантОтвета        = Объект.Ссылка;

		ФормаВладелец.ВывестиТекстыВариантов();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Сохраняем в базе
		
	СтруктураДанныхВариантов = Новый Структура;
	СтруктураДанныхВариантов.Вставить("ТекстовыеДанные", Текст);
	
	РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ТекущийОбъект.Владелец, СтруктураДанныхВариантов, ТекущийОбъект.Ссылка, "ВсеРеквизиты");	

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормыНаКлиенте()
	
	Если ФормаВладелец.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.ПоШаблону") Тогда
		Элементы.ПредлагатьВыборВариантов.Видимость     = Истина;
		Элементы.КоличествоДоступныхВариантов.Видимость = Ложь;
	Иначе
		Элементы.ПредлагатьВыборВариантов.Видимость     = Ложь;
		Элементы.КоличествоДоступныхВариантов.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

#КонецОбласти


