
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДоступныеТипы") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТипыПакетовДанныхСУЗ.Ссылка
			|ИЗ
			|	Перечисление.ТипыПакетовДанныхСУЗ КАК ТипыПакетовДанныхСУЗ
			|
			|УПОРЯДОЧИТЬ ПО
			|	ТипыПакетовДанныхСУЗ.Порядок";

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если Параметры.ДоступныеТипы.Найти(ВыборкаДетальныеЗаписи.Ссылка) <> Неопределено Тогда
			
				Элемент = ДанныеВыбора.Добавить();
				Элемент.Значение = ВыборкаДетальныеЗаписи.Ссылка;
				Элемент.Представление = ВыборкаДетальныеЗаписи.Ссылка;
				
			КонецЕсли;

		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры
