
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Делаем проверки
	//
	
	ПутьКОбщемуКаталогу = ОбъектыСУЗПовтИсп.ПутьКОбщемуКаталогу();
	
	Если НЕ ЗначениеЗаполнено(ПутьКОбщемуКаталогу) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОбщегоНазначенияСУПовтИсп.ТекстОНеобходимостиНастроитьОбщийКаталог(),,,,Отказ);
		Возврат;
	КонецЕсли;		
	
	// Пути к файлам
	//
	
	ПутьКФайламКабинета = ВебКабинетСУ.ПутьККаталогуУстановки(ПутьКОбщемуКаталогу);	
	
	ПутьККаталогуЭР = ЭлектронныеРесурсыСУЗКлиентСервер.ПутьККаталогуЭлектронныхРесурсов(ПутьКОбщемуКаталогу);
	
	
	// Начальные значения реквизитов
	//
	
	ИспользоватьПоУмолчанию = Истина;
	
	Справочники.ПубликацииВебКабинетаСУ.ЗаполнитьОбъектНачальнымиДанными(Объект);
	
	Объект.Наименование = "localhost";
	Объект.АдресВебСервера = "http://localhost";	
	Объект.АдресПубликации = "/edu";
	
	Объект.АдресПубликацииИБ = Объект.АдресПубликации + "/admin";
	
	Объект.АдресКаталогаКабинета = Объект.АдресПубликации + "/cabinet";
	Объект.АдресПубликацийРесурсов =  Объект.АдресПубликации + "/res";	
	Объект.АдресКаталогаФайлов =  Объект.АдресПубликации + "/files";	
	
	Объект.АдресСервисаОбучения = Объект.АдресПубликацииИБ + "/hs/cabinet";
	Объект.АдресСервисаПользователи = Объект.АдресПубликацииИБ + "/hs/users";
	Объект.АдресСервисаЭР = Объект.АдресПубликацииИБ + "/hs/res";
	Объект.АдресСервисаЭлектронныхКурсов = Объект.АдресПубликацииИБ + "/hs/courses";
	Объект.АдресВебСервисаЭР = Объект.АдресПубликацииИБ + "/ws/res.1cws";

	
	// Устанавливаем доступность элементов формы
	//
	
	// Примечание: установка видимости элементов для конструктора курсов
	Справочники.ПубликацииВебКабинетаСУ.УстановитьНачальнуюДоступностьЭлементовФормыПубликации(ЭтотОбъект, Элементы);
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ИспользоватьПоУмолчанию", ИспользоватьПоУмолчанию);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура АдресПубликацииИБПриИзменении(Элемент)
	
	Объект.АдресСервисаОбучения = Объект.АдресПубликацииИБ + "/hs/cabinet";
	Объект.АдресСервисаПользователи = Объект.АдресПубликацииИБ + "/hs/users";
	Объект.АдресСервисаЭР = Объект.АдресПубликацииИБ + "/hs/res";
	Объект.АдресСервисаЭлектронныхКурсов = Объект.АдресПубликацииИБ + "/hs/courses";
	Объект.АдресВебСервисаЭР = Объект.АдресПубликацииИБ + "/ws/res.1cws";

КонецПроцедуры

&НаКлиенте
Процедура АдресПубликацииПриИзменении(Элемент)
	
	Объект.АдресКаталогаКабинета = Объект.АдресПубликации + "/cabinet";
	Объект.АдресПубликацийРесурсов =  Объект.АдресПубликации + "/res";
	Объект.АдресКаталогаФайлов = Объект.АдресПубликации + "/files";

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Переходы

&НаКлиенте
Процедура ОткрытьСтраницуСозданияКаталогаПубликации(Команда)
	
	Если ЗначениеЗаполнено(Объект.РегистрационныйНомер) Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСозданияКаталогаПубликации;
	Иначе
		ПоказатьПредупреждение(,НСтр("ru = 'Укажите регистрационный номер продукта'"));
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтраницуСозданияКаталогаКабинета(Команда)
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСозданияФункциональныхКаталогов;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтартовуюСтраницу(Команда)
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСтартовая;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтраницуПубликацииИБ(Команда)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСозданияФункциональныхКаталогов Тогда		
		АдресТестовогоФайла = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(Объект.АдресВебСервера + Объект.АдресКаталогаКабинета) + "index.html";		
		ПроверитьДоступностьВебАдреса(АдресТестовогоФайла);		
	КонецЕсли;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПубликацияИБ;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтраницуНастройкиСлужебногоПользователя(Команда)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПубликацияИБ Тогда		
		АдресТестовогоФайла = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(Объект.АдресВебСервера + Объект.АдресПубликацииИБ);
		ПроверитьДоступностьВебАдреса(АдресТестовогоФайла);		
	КонецЕсли;	
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройкаСлужебногоПользователя;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФинальнуюСтраницу(Команда)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройкаСлужебногоПользователя Тогда
		АдресТестовогоФайла = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(Объект.АдресВебСервера + Объект.АдресСервисаОбучения) + "version";
		ПроверитьДоступностьВебАдреса(АдресТестовогоФайла);				
	КонецЕсли;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаФинальная;
	
КонецПроцедуры

// Функциональные

&НаКлиенте
Процедура СоздатьСлужебногоПользователя(Команда)
	ПользовательСоздан = Ложь;
	СоздатьСлужебногоПользователяНаСервере(ПользовательСоздан);
	Если ПользовательСоздан Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Пользователь успешно создан'"));
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура СоздатьСлужебногоПользователяНаСервере(ПользовательСоздан = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Объект.ЛогинСлужебногоПользователя) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите логин пользователя'"),,"ЛогинСлужебногоПользователя", "ЛогинСлужебногоПользователя");
		Возврат;
	КонецЕсли;
	
	Пользователь = Пользователи.НайтиПоИмени(Объект.ЛогинСлужебногоПользователя);
	
	Если Пользователь = Неопределено Тогда
		ПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();	
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Пользователь с таким именем уже существует'"));
		Возврат;
	КонецЕсли;
	
	ПользовательОбъект.Наименование = Объект.ЛогинСлужебногоПользователя;	
	
	ОписаниеПользователяИБ = Пользователи.НовоеОписаниеПользователяИБ();
	ОписаниеПользователяИБ.Вставить("Действие", "Записать");
	ОписаниеПользователяИБ.Вставить("ВходВПрограммуРазрешен", Истина);
	
	ОписаниеПользователяИБ.Пароль = Объект.ПарольСлужебногоПользователя;
	ОписаниеПользователяИБ.Имя = Объект.ЛогинСлужебногоПользователя;
	ОписаниеПользователяИБ.ПолноеИмя = Объект.ЛогинСлужебногоПользователя;
	ОписаниеПользователяИБ.АутентификацияСтандартная = Истина;
	ОписаниеПользователяИБ.ПоказыватьВСпискеВыбора = Ложь;
	
	
	//--# КОНСТРУКТОР КУРСОВ ДОБАВИТЬ #--//
	
	// МассивРолей = Новый Массив;
	// МассивРолей.Добавить("ВебКабинетСлужебныйПользовательСУ"); 
	//
	// ОписаниеПользователяИБ.Роли = МассивРолей;	
	
		
	//----------------------------------//
	
	ПользовательОбъект.ДополнительныеСвойства.Вставить(
		"ОписаниеПользователяИБ", ОписаниеПользователяИБ);
	
	ПользовательОбъект.ДополнительныеСвойства.Вставить("ЗапретитьУстановкуГруппыДоступаДляНовыхПользователей", Истина);
	
	ПользовательОбъект.Записать();	
	
	УправлениеДоступомСлужебный.ВключитьПользователяВГруппуДоступа(ПользовательОбъект.Ссылка, "3968e7c4-03ab-11e5-be5c-f0def149b112");	
	
	// Завершаем
	
	ПользовательСоздан = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы() Экспорт
	
	Элементы.КомандаПолучитьФайлНастроек.Доступность = НЕ Объект.Ссылка.Пустая();
	Элементы.КомандаОткрытьПубликацию.Доступность = НЕ Объект.Ссылка.Пустая();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДоступностьВебАдреса(АдресТестовогоФайла) 
	
	#Если НЕ ВебКлиент Тогда
	
	ПутьДляСохранения = ПолучитьИмяВременногоФайла(".html");

	ПустойТекстовыйДокумент = Новый ТекстовыйДокумент;
	ПустойТекстовыйДокумент.Записать(ПутьДляСохранения);
	
	ПараметрыПолучения = Новый Структура();
	ПараметрыПолучения.Вставить("ПутьДляСохранения", ПутьДляСохранения);
	
	Результат = ПолучениеФайловИзИнтернетаКлиент.СкачатьФайлНаКлиенте(АдресТестовогоФайла, ПараметрыПолучения, Ложь);
	
	Если НЕ Результат.Статус Тогда
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'При проверке предыдущего этапа настройки произошла ошибка.
			|Вернитесь назад к предыдущему этапу и проверьте правильность настройки.
			|Проверяемый адрес: %1 
			|Текст ошибки:
			|%2'"), АдресТестовогоФайла, Результат.СообщениеОбОшибке);
			
		ПоказатьПредупреждение(,ТекстОшибки);
		
	КонецЕсли;
	
	УдалитьФайлы(ПутьДляСохранения);		
	
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

