#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ИсключитьЗначения = Новый Массив;
	ИсключитьЗначения.Добавить(Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.WS);
	
	ЭлектронныеРесурсыПереопределяемый.ПриОпределенииДоступныхТиповПубликации(ИсключитьЗначения);
	
	Параметры.Вставить("ИсключитьЗначения", ИсключитьЗначения);
	
	ОбщегоНазначенияСУ.ИсключитьЗначенияПеречисленияИзСпискаВыбора(Параметры, ДанныеВыбора, "ТипыПубликацийЭлектронныхРесурсовСУЗ", СтандартнаяОбработка);	
	
КонецПроцедуры

#КонецЕсли