////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

&НаКлиенте
Перем ПропуститьАктивациюЭлементаСодержания; // Признак того, что не будет срабатывать обработчик "НавигационноеДеревоПриАктивизацииСтроки".

&НаКлиенте
Перем ПропуститьФормированиеКорневогоДокумента; // Признак того, что не будет формироваться корневая страница.

&НаКлиенте
Перем КолонкиТаблицыДополнительныеМатериалы; // Колонки таблицы ДополнительныеМатериалы, которые используются на клиенте.

&НаКлиенте
Перем АктивированныйЭлементСодержания; // Переменная содержит активированный элемент содержания. Значение очищается после загрузки объекта

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
// Функция вызывается при виртуальной симуляции прохождения электронных ресурсов
//
Функция ВыполнитьДействиеСимуляции(сАдресОбъекта, сЭлементСодержания) Экспорт
	
	ЭтоДействие = Ложь;
	
	Если ТипЗнч(сАдресОбъекта) = Тип("Строка") Тогда
		
		СтруктураСсылки = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(сАдресОбъекта);
		
		Действие = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "action");
		
		Если ЗначениеЗаполнено(Действие) Тогда // Выполняем действие
			ЭтоДействие = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоДействие Тогда
		
		СтруктураСсылки = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(сАдресОбъекта);
		
		Результат  = ПолучитьРезультатДействия(СтруктураСсылки,
		                                       сЭлементСодержания,
											   Параметры.ПрохождениеОбучения,
											   Параметры.Задание,
											   Параметры.Вариант,
											   ПутьККаталогуРесурсов,
											   ПредпочитаемыйПоставщик,
											   Параметры.СводЗнаний,
		                                       Истина,
											   ТекущийПользователь,
											   ДатаОткрытияФормы,
											   "");
		
											   
											   
											   
	Иначе
		
		Результат = ПолучитьПредставлениеОбъекта(сАдресОбъекта,
		                                         сЭлементСодержания,
												 Параметры.СводЗнаний,
												 ПопыткаВыполненияСтатичногоОбъекта,
												 Параметры.ПрохождениеОбучения,
												 Параметры.Задание,
												 Параметры.Вариант,
												 ПутьККаталогуРесурсов,
												 ПредпочитаемыйПоставщик,
												 Параметры.СводЗнаний,
												 Неопределено,
												 ДатаОткрытияФормы,
												 ЗначенияНастроекЭР,
		                                         Истина,
												 Параметры.РежимПросмотра,
												 ТекущийПользователь,
												 ОбщегоНазначенияСУКлиент.ЭтоВстроенныйWeKit(Браузер)
												 );
			
			
		// Запоминаем попытку выполнения объекта (если загружен не статичный объект, то
		// Значение ПопыткаВыполненияСтатичногоОбъекта будет равно Неопределено).
		
		ПопыткаВыполненияСтатичногоОбъекта = Результат.ПопыткаВыполненияСтатичногоОбъекта;
		
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Основные действия на клиенте

&НаКлиенте
Процедура ОтобразитьТекущийОбъект()
	
	// Делаем необходимые проверки.
	
	Если НЕ ОбластьПросмотраЗагружена Тогда
		Возврат;
	КонецЕсли;
	
	АдресОбъекта = ПолучитьСтрокуПоискаДокумента();
	
	Если НЕ ЗначениеЗаполнено(АдресОбъекта) Тогда
		Возврат;
	КонецЕсли;
	
	// Получаем данные с сервера.
	
	ТекущийЭлементСодержания              = ПолучитьТекущийЭлементСодержания(); // Сохраняется в реквизите формы
	ОбластьПоискаНовогоЭлементаСодержания = Параметры.СводЗнаний;
	
	ДополнительныеМатериалы.Очистить();
	
	СтруктураДанныхОбъекта = ПолучитьПредставлениеОбъекта(АдресОбъекта,
	                                                      ТекущийЭлементСодержания,
														  ОбластьПоискаНовогоЭлементаСодержания,
														  ПопыткаВыполненияСтатичногоОбъекта,
														  Параметры.ПрохождениеОбучения,
														  Параметры.Задание,
														  Параметры.Вариант,
														  ПутьККаталогуРесурсов,
														  ПредпочитаемыйПоставщик,
														  Параметры.СводЗнаний,
														  ?(Элементы.ГруппаДополнительныеМатериалы.Видимость, ДополнительныеМатериалы, Неопределено),
														  ДатаОткрытияФормы,
														  ЗначенияНастроекЭР,
	                                                      Ложь,
														  Параметры.РежимПросмотра,
														  ТекущийПользователь,
														  ОбщегоНазначенияСУКлиент.ЭтоВстроенныйWeKit(Браузер)
														  );
	
	// Обновляем необходимые ресурсы в локальном кэше на клиенте.
	
	Если ИспользуетсяКэшНаКлиенте Тогда 
		ОбщегоНазначенияСУКлиентСервер.ВыгрузитьРесурсыВКэш(
			СтруктураДанныхОбъекта.Ресурсы,
			ПутьККаталогуРесурсов,
			ПредпочитаемыйПоставщик,
			Параметры.СводЗнаний,
			,
			,
			СтруктураДанныхОбъекта.КонтекстВыполнения);
	КонецЕсли;
	
	Документ = Элементы.ОбластьПросмотра.Документ;
	
	// Вставляем стили
	
	ОбщегоНазначенияСУКлиент.ВставитьСтили(Документ, Браузер, СтруктураДанныхОбъекта.Стили);
	
	// Размещаем контент страницы
	ОбщегоНазначенияСУКлиент.ВставитьДанныеВТелоДокумента(Документ, Браузер, СтруктураДанныхОбъекта.Представление);
	ОбщегоНазначенияСУКлиент.ОбработатьСсылкиДокумента(Документ, Браузер);
	
	// Вставляем скрипты
	
	ОбщегоНазначенияСУКлиент.ВставитьСкрипты(Документ, Браузер, СтруктураДанныхОбъекта.Скрипт);
	
	// Находим текущий объект в дереве и выделяем его
	
	Если СтруктураДанныхОбъекта.ТекущийЭлементСодержания <> ТекущийЭлементСодержания Тогда
		
		Если ЗначениеЗаполнено(СтруктураДанныхОбъекта.ТекущийЭлементСодержания) Тогда
			
			ПропуститьАктивациюЭлементаСодержания = Истина;
			
			// Примечание: при изменении активного элемента содержания будет вызван обработчик
			// События При активации строки. Для того, чтобы обработчик не сработал, так как этот пункт
			// Выбран не интерактивно, устанавливаем переменную ПропуститьАктивациюЭлементаСодержания = Истина.
			
		КонецЕсли;
		
		ТекущийЭлементСодержания = СтруктураДанныхОбъекта.ТекущийЭлементСодержания;
		МассивРодителей          = ПолучитьМассивРодителейЭлементаСодержания(ТекущийЭлементСодержания);
		
		Для каждого Строка Из МассивРодителей Цикл
			Элементы.НавигационноеДерево.Развернуть(ПолучитьИндексЭлементаСодержания(Строка)); //V8 bug
		КонецЦикла;
		
		Если Элементы.НавигационноеДерево.Видимость Тогда
			Элементы.НавигационноеДерево.ТекущаяСтрока = ПолучитьИндексЭлементаСодержания(ТекущийЭлементСодержания);
		КонецЕсли;
		
	КонецЕсли;
	
	// Запоминаем попытку выполнения объекта (если загружен не статичный объект, то
	// Значение ПопыткаВыполненияСтатичногоОбъекта будет равно Неопределено).
	
	ПопыткаВыполненияСтатичногоОбъекта = СтруктураДанныхОбъекта.ПопыткаВыполненияСтатичногоОбъекта;
	
	// Обновляем реквизит ЗавершеноВПроцентах и обновляем заголовок. 
	
	ЗавершеноВПроцентах = СтруктураДанныхОбъекта.ПроцентЗавершенныхЭлементовОбучения;
	
	// Запоминаем, пройден ли объект и запоминаем предыдущий и следующий элемент
	
	ТекущийЭлементСодержанияПройден             = СтруктураДанныхОбъекта.Пройден;
	СледующийЭлементСодержания                  = СтруктураДанныхОбъекта.СледующийЭлементСодержания;
	ПредыдущийЭлементСодержания                 = СтруктураДанныхОбъекта.ПредыдущийЭлементСодержания;
	ВозможноДобавитьВИзбранноеЭлементСодержания = СтруктураДанныхОбъекта.ВозможноДобавитьВИзбранное;
	
	// Устанавливаем картинку элемента содержания
	
	ТекущиеДанныеНД = Элементы.НавигационноеДерево.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущийЭлементСодержания) И ТипЗнч(ТекущийЭлементСодержания) = Тип("СправочникСсылка.СодержаниеСУЗ") И ТекущиеДанныеНД <> Неопределено Тогда
		
		ТекущиеДанныеНД.Пройдено = ТекущийЭлементСодержанияПройден;
		
		Если ТекущиеДанныеНД.ЭтоГруппа Тогда
			ОпределитьСтатусГруппЭлементовСодержания(ТекущиеДанныеНД);
		Иначе
			ОпределитьСтатусГруппЭлементовСодержания(ТекущиеДанныеНД.ПолучитьРодителя());
		КонецЕсли;
		
		ТекущиеДанныеНД.Картинка = ПолучитьКартинкуЭлементаСодержания(ТекущиеДанныеНД, Параметры.ПрохождениеОбучения);
		
	КонецЕсли;
	
	// Дополнительные материалы
	
	Если Элементы.ГруппаДополнительныеМатериалы.Видимость
		И СтруктураДанныхОбъекта.ТаблицаДополнительныхМатериалов <> Неопределено Тогда
		
		Для каждого Строка Из СтруктураДанныхОбъекта.ТаблицаДополнительныхМатериалов Цикл
			
			НоваяСтрока = ДополнительныеМатериалы.Добавить();
			
			Для каждого Колонка Из КолонкиТаблицыДополнительныеМатериалы Цикл
				НоваяСтрока[Колонка] = Строка[Колонка];
			КонецЦикла;
		
		КонецЦикла;
		
	КонецЕсли;
		
	// Дополнительно
	
	Если СтруктураДанныхОбъекта.ВыполняетсяТестирование <> Неопределено Тогда
		ВыполняетсяТестирование = СтруктураДанныхОбъекта.ВыполняетсяТестирование; // Реквизит формы
	КонецЕсли;
	
	Если СтруктураДанныхОбъекта.СессияТестирования <> Неопределено Тогда
		СессияТестирования = СтруктураДанныхОбъекта.СессияТестирования; // Реквизит формы
	КонецЕсли;
	
	Если ВыполняетсяТестирование Тогда
		НавигацияДоступна  = Ложь;
	Иначе
		НавигацияДоступна  = Истина;
	КонецЕсли;
	
	УстановитьЗаголовокФормы();
	
	АдресЗагруженногоОбъекта = АдресОбъекта;
	
	УстановитьДоступностьКнопокНавигации();
	
	ПропуститьФормированиеКорневогоДокумента = Ложь;
	
	Если ВыполняетсяТестирование
		И ЗначениеЗаполнено(СессияТестирования)
		И (СтруктураДанныхОбъекта.Свойство("ВсеВопросыТестированияОтвечены") И СтруктураДанныхОбъекта.ВсеВопросыТестированияОтвечены = ИСТИНА)
		И НЕ ЗаданВопросОЗавершенииТестирования Тогда
		
		СтруктураАдресаФинальнойСтраницы = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(АдресОбъекта);
		
		Если НЕ СтруктураАдресаФинальнойСтраницы.Свойство("numGroup") Тогда
			Возврат;			
		КонецЕсли;
		
		ЗаданВопросОЗавершенииТестирования = Истина;
		
		СпроситьОЗакрытииСессииТестирования("УстановитьТекущийОбъект", СтруктураАдресаФинальнойСтраницы);
				
	КонецЕсли;
	
	Если НЕ ВыполняетсяТестирование Тогда
		ЗаданВопросОЗавершенииТестирования = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействие()
	
	Если ДанныеКоманды = Неопределено Тогда  // Реквизит
		Возврат;
	КонецЕсли;
	
	Команда          = ДанныеКоманды.Команда;
	ПараметрыКоманды = ДанныеКоманды.Параметры;
	ИмяФрейма        = ДанныеКоманды.ИмяФрейма;
	Браузер	         = ДанныеКоманды.Браузер;
	
	Если Команда = "goToLink" И ЗначениеЗаполнено(ПараметрыКоманды) Тогда
		
		СтруктураСсылки = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(ПараметрыКоманды);
		
		Если Найти(ПараметрыКоманды, "e1cib/") > 0 Тогда
			
			ПерейтиПоНавигационнойСсылке(ПараметрыКоманды);
			
		Иначе
			
			Если СтруктураСсылки.Свойство("object") И ТипЗнч(СтруктураСсылки.object) = Тип("Массив") Тогда
				
				ПараметрыКоманды = ВыбратьОбъектКоманды(СтруктураСсылки);
				
				Если ПараметрыКоманды = Неопределено Тогда
					ВызватьИсключение НСтр("ru = 'Неверный формат ссылки'");
				КонецЕсли;
				
				СтруктураСсылки  = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(ПараметрыКоманды);
				
			КонецЕсли;
			
			Если ВыполняетсяТестирование И ЗначениеЗаполнено(СессияТестирования) Тогда
				
				НомерДокумента = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "numDocument");
				НомерГруппы = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "numGroup");
				
				Если НЕ ЗначениеЗаполнено(НомерДокумента)
					ИЛИ Число(НомерДокумента) <> СессияТестирования
					ИЛИ НЕ ЗначениеЗаполнено(НомерГруппы)
					ИЛИ НомерГруппы = "-1" Тогда
					
					СпроситьОЗакрытииСессииТестирования("ПерейтиПоСсылке", ПараметрыКоманды);
					
				Иначе
					
					ПерейтиПоСсылке(ПараметрыКоманды);	
					
				КонецЕсли;
				
			Иначе
				
				ПерейтиПоСсылке(ПараметрыКоманды);
				
			КонецЕсли;
			
			
		КонецЕсли;
			
	КонецЕсли;
	
	ДанныеКоманды = Неопределено; // Очищаем данные команды
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиПоСсылке(ПараметрыКоманды)
	
	СтруктураСсылки = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(ПараметрыКоманды);
	
	ЦелевоеОкно = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "window");

	Если ПоследовательнаяНавигация И НЕ Параметры.ДочернееОкно И ОткрываетсяДругойОбъект(СтруктураСсылки) Тогда
		 ЦелевоеОкно = "new";	
	КонецЕсли;

	Если ЦелевоеОкно = "new" Тогда // Открываем ссылку в новом окне
		
		ЭлементСодержания = ПолучитьТекущийЭлементСодержания();
		ОбъектыСУЗКлиент.ОткрытьОбозреватель(Параметры.СводЗнаний,
											 ПараметрыКоманды,
											 Истина,
											 ЭлементСодержания,
											 Параметры.ПрохождениеОбучения,
											 Параметры.Задание,
											 Параметры.Вариант,
											 Истина,
											 ,
											 Параметры.ТекущийПользователь,
											 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе // Открываем ссылку в этом окне.
		
		Действие = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "action");
		
		Если ЗначениеЗаполнено(Действие) Тогда // Выполняем действие
			
			Если Действие = "plugin" Тогда
				
				// ИмяПлагина = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "name");
				//
				// ПараметрыПлагина = Новый Структура;
				// ПараметрыПлагина.Вставить("object", ПолучитьСтрокуПоискаДокумента());
				// ПараметрыПлагина.Вставить("url", ПараметрыКоманды);
				//
				// ФормаПлагина = ПолучитьФорму("Обработка."+ИмяПлагина+".Форма.Форма", ПараметрыПлагина, ЭтаФорма);
				//
				// РезультатДействия = ФормаПлагина.ОткрытьМодально(); // Реквизит				
				
			Иначе
				
				// ТекущийЭлементСодержания берем из реквизита формы, а не получаем реальный, так как
				// Реальный элемент содержания может быть уже новым, а действие выполняется для предыдущего
				// Элемента содержания.
				
				РезультатДействия        = ПолучитьРезультатДействия(СтруктураСсылки,
				                                                     ТекущийЭлементСодержания,
																	 Параметры.ПрохождениеОбучения,
																	 Параметры.Задание,
																	 Параметры.Вариант,
																	 ПутьККаталогуРесурсов,
																	 ПредпочитаемыйПоставщик,
																	 Параметры.СводЗнаний,
				                                                     Ложь,
																	 ТекущийПользователь,
																	 ДатаОткрытияФормы,
																	 ПолучитьСтрокуПоискаДокумента()); // Реквизит
																	 
			КонецЕсли;
			
			Если РезультатДействия <> Неопределено Тогда
			
				Если ЗначениеЗаполнено(РезультатДействия.МодельДанныхПопыткиОбъектаSCORM)
					ИЛИ РезультатДействия.Форма <> Неопределено
					ИЛИ ОбщегоНазначенияСУКлиент.ЭтоВстроенныйWeKit(Браузер) Тогда
					ОбработатьРезультатДействия();
				Иначе
					ПодключитьОбработчикОжидания("ОбработатьРезультатДействия", 0.01, Истина); //Web-client 404 bug
				КонецЕсли;
				
			КонецЕсли;
				
		Иначе // Сразу переходим по ссылке
			
			УстановитьТекущийОбъект(ПараметрыКоманды);
			
		КонецЕсли;
		
	КонецЕсли;
			
			
КонецПроцедуры
		
&НаКлиенте
Процедура ОбработатьОткрытиеВнешнейФормы(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Булево") И РезультатЗакрытия Тогда
		ДанныеКоманды = ДополнительныеПараметры;
		ВыполнитьДействие(); // Еще раз пытаемся выполнить действие	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПризнакПройденоУЭлементовСодержания(СтрокиДерева, ПовторноеПрохождение)
	
	Для каждого Строка Из СтрокиДерева Цикл
	
		Если ПовторноеПрохождение.Найти(Строка.Ссылка) <> Неопределено Тогда
			Строка.Пройдено = Ложь;
			Строка.Картинка = ПолучитьКартинкуЭлементаСодержания(Строка, Параметры.ПрохождениеОбучения);
			ОпределитьСтатусГруппЭлементовСодержания(Строка.ПолучитьРодителя());
		КонецЕсли;
		
		СнятьПризнакПройденоУЭлементовСодержания(Строка.ПолучитьЭлементы(), ПовторноеПрохождение); // Рекурсия
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатДействия()
	
	ДействиеВыполнено = Ложь;
	
	Якорь = "";
	
	Если ТипЗнч(РезультатДействия) = Тип("Структура") Тогда
		
		Если РезультатДействия.ВнешняяОбработка <> Неопределено Тогда
			
			ПараметрыВнешнейОбработки = Новый Структура("ТекущийЭлементСодержания, ТекущийПользователь, ТекущийПользовательСеанса, СессияТестирования, ПопыткаВыполненияСтатичногоОбъекта, НаименованиеОбъекта, ВыполняетсяТестирование", ТекущийЭлементСодержания, ТекущийПользователь, ТекущийПользовательСеанса, СессияТестирования, ПопыткаВыполненияСтатичногоОбъекта, НаименованиеОбъекта, ВыполняетсяТестирование);
			ИмяВнешнейОбработки       = "ВнешняяОбработка."+ РезультатДействия.ВнешняяОбработка.Имя +".Форма";
			ОткрытьФорму(ИмяВнешнейОбработки, ПараметрыВнешнейОбработки);				
			ДействиеВыполнено = Истина;
			
		КонецЕсли;
		
		Якорь = РезультатДействия.Якорь;
		
		Если ИспользуетсяКэшНаКлиенте Тогда 
			ОбщегоНазначенияСУКлиентСервер.ВыгрузитьРесурсыВКэш(РезультатДействия.Ресурсы, ПутьККаталогуРесурсов, ПредпочитаемыйПоставщик, Параметры.СводЗнаний);
		КонецЕсли;
		
		Если РезультатДействия.ВыполняетсяТестирование <> Неопределено Тогда
			ВыполняетсяТестирование = РезультатДействия.ВыполняетсяТестирование; // Реквизит формы
		КонецЕсли;
		
		Если РезультатДействия.СессияТестирования <> Неопределено Тогда
			СессияТестирования = РезультатДействия.СессияТестирования; // Реквизит формы
		КонецЕсли;
		
		Если ВыполняетсяТестирование Тогда
			НавигацияДоступна  = Ложь;
		Иначе
			НавигацияДоступна  = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РезультатДействия.ВнешняяСсылка) Тогда
			ПерейтиПоНавигационнойСсылке(РезультатДействия.ВнешняяСсылка);
			ДействиеВыполнено = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РезультатДействия.АдресФайла) Тогда
			Если ИспользуетсяКэшНаКлиенте Тогда
				ЗапуститьПриложение(РезультатДействия.АдресФайла);
			Иначе
				Если Браузер = "msie" Тогда
					Элементы.ОбластьПросмотра.Документ.parentWindow.open(РезультатДействия.АдресФайла);
				Иначе
					ПерейтиПоНавигационнойСсылке(РезультатДействия.АдресФайла);
				КонецЕсли;
			КонецЕсли;
			ДействиеВыполнено = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РезультатДействия.АдресОбъекта) Тогда
			
			СтруктураСсылки = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(РезультатДействия.АдресОбъекта);
			
			ЦелевоеОкно = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "window");
			
			Если ПоследовательнаяНавигация И НЕ Параметры.ДочернееОкно И ОткрываетсяДругойОбъект(СтруктураСсылки) Тогда
				 ЦелевоеОкно = "new";	
			КонецЕсли;
			
			Если ЦелевоеОкно = "new" Тогда 
				
				// Открываем ссылку в новом окне
				
				ЭлементСодержания = ПолучитьТекущийЭлементСодержания();
				ОбъектыСУЗКлиент.ОткрытьОбозреватель(Параметры.СводЗнаний,
				                                     РезультатДействия.АдресОбъекта,
													 Истина,
													 ЭлементСодержания,
													 Параметры.ПрохождениеОбучения,
													 Параметры.Задание,
													 Параметры.Вариант,
													 Истина,
													 ,
													 Параметры.ТекущийПользователь,
													 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			Иначе 
													 
				// Открываем ссылку в этом окне.
				
				УстановитьТекущийОбъект(РезультатДействия.АдресОбъекта);
				
			КонецЕсли;
			
			ДействиеВыполнено = Истина;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РезультатДействия.ТекстСообщения) Тогда
			
			ПоказатьПредупреждение(,РезультатДействия.ТекстСообщения);
		
			ДействиеВыполнено = Истина;
			
		КонецЕсли;
		
		Если РезультатДействия.Форма <> Неопределено Тогда
					
			ПараметрыФормы = Новый Структура("Ключ, ОткрытаИзЭлектронногоРесурса, ЗначенияЗаполнения", РезультатДействия.Форма.Ключ, Истина, РезультатДействия.Форма.ЗначенияЗаполнения);
			
			ОткрытьФорму(РезультатДействия.Форма.Имя, ПараметрыФормы, ЭтотОбъект,,,, Новый ОписаниеОповещения("ОбработатьОткрытиеВнешнейФормы", ЭтотОбъект, ДанныеКоманды), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);					
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РезультатДействия.Значение) Тогда // Значит это команда SCORM
			
			Документ = Элементы.ОбластьПросмотра.Документ;
			ДокументКонтейнер = Документ; 
			
			ДокументКонтейнер.sessionDataForm.returnValue.value  = РезультатДействия.Значение;
			ДокументКонтейнер.sessionDataForm.errorCode.value    = РезультатДействия.КодОшибки;
			ДокументКонтейнер.sessionDataForm.xmlModelData.value = РезультатДействия.МодельДанныхПопыткиОбъектаSCORM;
			ДокументКонтейнер.sessionDataForm.numSession.value   = РезультатДействия.НомерСессии;
			
			Если РезультатДействия.ЗакрытьСтраницу И НЕ ВозможноОтобразитьСодержание Тогда
				ПодключитьОбработчикОжидания("ЗакрытьОкно", 0.5, Истина);
			КонецЕсли;
			
			ДействиеВыполнено = Истина;
			
		КонецЕсли;
		
		Если РезультатДействия.ЗакрытьОкно Тогда
			ПодключитьОбработчикОжидания("ЗакрытьОкно", 0.5, Истина);
		КонецЕсли;
		
		Если ТипЗнч(РезультатДействия.ПовторноеПрохождение) = Тип("Массив")
			И РезультатДействия.ПовторноеПрохождение.Количество() > 0 Тогда
			
			СнятьПризнакПройденоУЭлементовСодержания(НавигационноеДерево.ПолучитьЭлементы(), РезультатДействия.ПовторноеПрохождение);
			
		КонецЕсли;			
		
		Если ДействиеВыполнено Тогда
			РезультатДействия = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
		
	// Если нет однозначеного указания, какое действие следует выполнить,
	// То обновляем страницу.
	Если НЕ ДействиеВыполнено Тогда
		
		Если НЕ ЗначениеЗаполнено(Якорь) Тогда
			Якорь = ?(Элементы.ОбластьПросмотра.Документ = Неопределено, "", Элементы.ОбластьПросмотра.Документ.location.hash);
		КонецЕсли;
		
		УстановитьТекущийОбъект(ПолучитьСтрокуПоискаДокумента(), Якорь);
		
	КонецЕсли;
	
	УстановитьДоступностьКнопокНавигации();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущийОбъект(АдресЗагружаемогоОбъекта=Неопределено, Якорь="")
	
	СтруктураСсылки = Неопределено;
	
	Если ТипЗнч(АдресЗагружаемогоОбъекта) = Тип("Структура") Тогда 
		СтруктураСсылки = АдресЗагружаемогоОбъекта;
	КонецЕсли;
	
	Если ТипЗнч(АдресЗагружаемогоОбъекта) = Тип("Строка") И ЗначениеЗаполнено(АдресЗагружаемогоОбъекта) Тогда
		СтруктураСсылки = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(АдресЗагружаемогоОбъекта);		
	КонецЕсли;
	
	Если СтруктураСсылки = Неопределено Тогда
		
		Если НЕ ЗначениеЗаполнено(АдресЗагружаемогоОбъекта) Тогда
			АдресЗагружаемогоОбъекта = Параметры.СводЗнаний;
		КонецЕсли;
		
		Адрес = Неопределено;
		
		Для каждого Строка Из АдресаЭлементовСодержания Цикл
		
			Попытка //8.3 bug
				Если Строка.ЭлементСодержания = АдресЗагружаемогоОбъекта Тогда
					Адрес = Строка.Адрес;
					Прервать;
				КонецЕсли;
			Исключение
			КонецПопытки;
		
		КонецЦикла;
		
		Если Адрес = Неопределено Тогда
			Адрес = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(АдресЗагружаемогоОбъекта); // Вызов сервера
		КонецЕсли;
		
		
	Иначе
		
		Если СтруктураСсылки.Свойство("date") Тогда
			СтруктураСсылки.Удалить("date");
		КонецЕсли;
		
		Если СтруктураСсылки.Свойство("anchor") Тогда
			СтруктураСсылки.Удалить("anchor");
		КонецЕсли;
		
		Адрес = ОбъектыСУЗКлиентСервер.ПолучитьАдресСсылкиИзСтруктуры(СтруктураСсылки);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Адрес) Тогда
		Адрес = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(Параметры.СводЗнаний); // Вызов сервера
	КонецЕсли;
	
	Адрес = Адрес + "&date=" + Формат(ТекущаяДата(), "ДФ=ddMMyyyyhhmmss"); // Чтобы страница перезагрузилась
	
	Если ЗначениеЗаполнено(Якорь) Тогда
		Адрес = Адрес + "&anchor=" + Якорь;	
	КонецЕсли;
	
	// Отображаем объект
	
	Адрес  = ?(Лев(Адрес, 1) = "?", "", "?") + Адрес;
	
	АдресДокумента = АдресКаталогаРесурсов + "objects.htm" + Адрес;
	
	// После загрузки документа objects.htm будет вызвана функция ОтобразитьТекущийОбъект(). 
	
	Если ИспользуетсяКэшНаКлиенте Тогда
		АдресДокумента = ?(Лев(АдресДокумента, 7) = "file://", "", "file://") + АдресДокумента; //IE 6 bug
	КонецЕсли;
	
	ОбластьПросмотра         = АдресДокумента; 
	АдресЗагружаемогоОбъекта = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура СпроситьОЗакрытииСессииТестирования(ИмяПроцедурыДляПродолжения, ДополнительныеПараметры=Неопределено)

	ОписаниеОповещения = Новый ОписаниеОповещения("ЗакрытьСессиюТестированияПродолжение", ЭтотОбъект, Новый Структура("Имя, Параметр", ИмяПроцедурыДляПродолжения, ДополнительныеПараметры));		
	
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Завершить тестирование?'"), РежимДиалогаВопрос.ДаНет, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСессиюТестированияПродолжение(Ответ, ОписаниеПроцедуры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ЗакрытьТекущуюСессиюТестирования(СессияТестирования, Параметры.ПрохождениеОбучения, Параметры.Задание);
		ВыполняетсяТестирование = Ложь;
		СессияТестирования      = 0;
		
		Если ОписаниеПроцедуры.Имя = "Закрыть" Тогда
			Закрыть();
		КонецЕсли;
		
		Если ОписаниеПроцедуры.Имя = "АктивироватьЭлементСодержанияПродолжение" Тогда
			АктивироватьЭлементСодержанияПродолжение();
		КонецЕсли;
		
		Если ОписаниеПроцедуры.Имя = "ПерейтиПоСсылке" Тогда
			ПерейтиПоСсылке(ОписаниеПроцедуры.Параметр);
		КонецЕсли;
		
		Если ОписаниеПроцедуры.Имя = "УстановитьТекущийОбъект" Тогда
			ОписаниеПроцедуры.Параметр.numGroup = "-1";
			УстановитьТекущийОбъект(ОписаниеПроцедуры.Параметр);
		КонецЕсли;		
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьОкно()
	Закрыть();
КонецПроцедуры

// Основные действия на сервере

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеОбъекта(Знач АдресОбъекта,
	                                 Знач ТекущийЭлементСодержания,
									 Знач ОбластьПоискаНовогоЭлементаСодержания,
									 Знач ПопыткаВыполненияСтатичногоОбъектаДляЗавершения,
									 Знач ПрохождениеОбучения,
									 Знач Задание,
									 Знач Вариант,
									 Знач ПутьККаталогуРесурсов,
									 Знач ПредпочитаемыйПоставщик,
									 Знач СводЗнаний,
									 Знач ДополнительныеМатериалы,
									 Знач ДатаОткрытияФормы,
									 Знач ЗначенияНастроекЭР,
	                                 Знач Симуляция,
									 Знач РежимПросмотра,
									 Знач ТекущийПользователь,
									 Знач ЭтоВстроенныйWeKit)
									 
	УстановитьПривилегированныйРежим(Истина);
									 
	//////////////////////////////////////////////////////////////////////////////////								 
	// Завершаем попытку выполнения текущего статичного объекта.
	
	Если ЗначениеЗаполнено(ПопыткаВыполненияСтатичногоОбъектаДляЗавершения) Тогда
		ОбъектыСУЗ.ЗавершитьПопыткуВыполненияСтатичногоОбъекта(ПопыткаВыполненияСтатичногоОбъектаДляЗавершения);
	КонецЕсли;
	   
	//////////////////////////////////////////////////////////////////////////////////
	// Получаем параметры ссылки
	
	// Получаем параметры ссылки на объект.
	
	Если ТипЗнч(АдресОбъекта) <> Тип("Строка") Тогда
		АдресОбъекта = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(АдресОбъекта);
	КонецЕсли;
	
	ПараметрыСсылки = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(АдресОбъекта);
	
	//////////////////////////////////////////////////////////////////////////////////
	// Получаем ссылку на объект
	
	ИмяОбъекта = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "object");
	id         = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "id");
	Ссылка     = ОбъектыСУЗ.ПолучитьСсылкуПоИдентификатору(ИмяОбъекта, id);
	
	Если Ссылка = Неопределено Тогда
		СтруктураДанных = ОбъектыСУЗ.ПолучитьПредставлениеПустогоОбъекта();
		СтруктураДанных.Вставить("Представление", "<H2 align=""center"">Объект не найден!</H2>");
		Возврат СтруктураДанных;
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////////////////////
	// Находим элемент содержания, соответствующий объекту.
	
	// Примечание: переменная ТекущийЭлементСодержания содержит тот элемент содержания, который
	// Выбран в данный момент. При этом сам объект может относиться уже к другому элементу, если
	// Например пользователь щелкнул на ссылку на странице или кнопку Назад, тогда требуется найти
	// Новый элемент содержания исходя из значения параметра ОбластьПоискаНовогоЭлементаСодержания
	// И передать обратно на клиент и в функцию ПолучитьСтруктуруДанныхОбъекта.

	Если ОбластьПоискаНовогоЭлементаСодержания <> Неопределено Тогда
		
		Если ТипЗнч(ОбластьПоискаНовогоЭлементаСодержания) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
			
			Если Ссылка = ОбластьПоискаНовогоЭлементаСодержания Тогда
				
				ТекущийЭлементСодержания = Неопределено;
				
			Иначе
				
				Если ИмяОбъекта = "map" И ПараметрыСсылки.targetMap = "Folder" Тогда
					
					ТекущийЭлементСодержания = Справочники.СодержаниеСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрыСсылки.idTargetMap));
					
				Иначе
					
					ТекстЗапроса = "ВЫБРАТЬ
					               |	СодержаниеСУЗ.Ссылка
					               |ИЗ
					               |	Справочник.СодержаниеСУЗ КАК СодержаниеСУЗ
					               |ГДЕ
					               |	СодержаниеСУЗ.Владелец = &Владелец
					               |	И СодержаниеСУЗ.СсылкаНаЭлемент = &СсылкаНаЭлемент
					               |	И СодержаниеСУЗ.ЭтоГруппа = ЛОЖЬ
					               |	И СодержаниеСУЗ.ПометкаУдаления = ЛОЖЬ";
					
					Запрос = Новый Запрос(ТекстЗапроса);
					Запрос.УстановитьПараметр("СсылкаНаЭлемент", Ссылка); 
					Запрос.УстановитьПараметр("Владелец", ОбластьПоискаНовогоЭлементаСодержания); 
					
					Результат = Запрос.Выполнить().Выбрать();
					
					// Ищем, нет ли в найденных элементах текущего элемента содержания.
					// Если есть, то он текущим и останется. Ничего не трогаем.
					
					Если Результат.Количество() > 0
						И НЕ Результат.НайтиСледующий(ТекущийЭлементСодержания, "Ссылка") Тогда
						
						Результат.Сбросить();
						Результат.Следующий();
						
						ТекущийЭлементСодержания = Результат.Ссылка;
						
					КонецЕсли;
					
				КонецЕсли;
					
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийЭлементСодержания) Тогда
		ДанныеЭлементаСодержания = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущийЭлементСодержания, "ЭтоГруппа");
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////////////////////
	// Получаем структуру данных объекта.
	
	ЗначенияНастроекЭР = ДанныеФормыВЗначение(ЗначенияНастроекЭР, Тип("ТаблицаЗначений"));
	
	ЗначениеНастроекЭРСтруктура = Новый Структура;
	
	Для каждого Строка Из ЗначенияНастроекЭР Цикл
		ЗначениеНастроекЭРСтруктура.Вставить(Строка.Код, Строка.Значение);
	КонецЦикла;
	
	КонтекстВыполнения = ОбъектыСУЗ.ЗаполнитьКонтекстВыполненияОбъекта(СводЗнаний, ТекущийЭлементСодержания, ТекущийПользователь, ПрохождениеОбучения, Задание, Вариант, ЗначениеНастроекЭРСтруктура, Симуляция,, ДатаОткрытияФормы,,,ЭтоВстроенныйWeKit);
	
	СтруктураДанных = ОбъектыСУЗ.ПолучитьПредставление(Ссылка, ПараметрыСсылки, КонтекстВыполнения);	
	СтруктураДанных.Вставить("ТекущийЭлементСодержания", ТекущийЭлементСодержания);
	
	Если НЕ ПараметрыСеанса.ИспользуетсяЛокальныйКэшНаКлиентеСУЗ Тогда 
		ОбщегоНазначенияСУКлиентСервер.ВыгрузитьРесурсыВКэш(СтруктураДанных.Ресурсы, ПутьККаталогуРесурсов, ПредпочитаемыйПоставщик, СводЗнаний);
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////////////////////
	// Определяем следующий и предыдущий элемент содержания
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СодержаниеСУЗ.Ссылка КАК Ссылка,
		|	СодержаниеСУЗ.ЭтоГруппа
		|ИЗ
		|	Справочник.СодержаниеСУЗ КАК СодержаниеСУЗ
		|ГДЕ
		|	СодержаниеСУЗ.Владелец = &Владелец
		|	И СодержаниеСУЗ.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	СодержаниеСУЗ.Код ИЕРАРХИЯ";

	Запрос.УстановитьПараметр("Владелец", СводЗнаний);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	// Находим следующий и предыдущий элемент содержания
	
	СледующийЭлементСодержания = Справочники.СодержаниеСУЗ.ПустаяСсылка();
	
	Если НЕ ЗначениеЗаполнено(ТекущийЭлементСодержания)
		ИЛИ ТипЗнч(ТекущийЭлементСодержания) <> Тип("СправочникСсылка.СодержаниеСУЗ") Тогда

		// Ищем первый элемент, который не является группой.
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если НЕ ВыборкаДетальныеЗаписи.ЭтоГруппа Тогда
				СледующийЭлементСодержания = ВыборкаДетальныеЗаписи.Ссылка;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.Ссылка = ТекущийЭлементСодержания Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если НЕ ВыборкаДетальныеЗаписи.ЭтоГруппа Тогда
				СледующийЭлементСодержания = ВыборкаДетальныеЗаписи.Ссылка;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
		
	ПредыдущийЭлементСодержания = СводЗнаний;
	
	Если ЗначениеЗаполнено(ТекущийЭлементСодержания)
		И ТипЗнч(ТекущийЭлементСодержания) = Тип("СправочникСсылка.СодержаниеСУЗ") Тогда
		
		ВыборкаДетальныеЗаписи.Сбросить();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.Ссылка = ТекущийЭлементСодержания Тогда
				Прервать;
			КонецЕсли;
			Если НЕ ВыборкаДетальныеЗаписи.ЭтоГруппа Тогда
				ПредыдущийЭлементСодержания = ВыборкаДетальныеЗаписи.Ссылка;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	СтруктураДанных.СледующийЭлементСодержания  = СледующийЭлементСодержания;
	СтруктураДанных.ПредыдущийЭлементСодержания = ПредыдущийЭлементСодержания;
	
	////////////////////////////////////////////////////////////////////////////////////////
	// Определеяем, можно ли добавить в избранное
	
	Если ЗначениеЗаполнено(ТекущийЭлементСодержания)
		И ТипЗнч(ТекущийЭлементСодержания) = Тип("СправочникСсылка.СодержаниеСУЗ")
		И НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийЭлементСодержания, "ЭтоГруппа") Тогда
		
		СтруктураДанных.ВозможноДобавитьВИзбранное = Истина;
		
	Иначе
		
		СтруктураДанных.ВозможноДобавитьВИзбранное = Ложь;
		
	КонецЕсли;	
	
	//////////////////////////////////////////////////////////////////////////////////
	// Начинаем попытку статичного объекта. 
	
	// Автоматически начинаем попытку выполнения статичного объекта.
	// Для других объектов попытки начинаются и завершаются при выполнении
	// Соответствующих действий этих объектов.
	
	ЭтоСтатичныйОбъект = Истина;
	
	// Это активный объект SCORM (SCO)
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.РесурсыСУЗ")
		И Ссылка.SCO Тогда
		
		ЭтоСтатичныйОбъект = Ложь;
		
	КонецЕсли;
	
	// Это подборка вопросов в режиме тестирования.
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ПодборкиСУЗ")
		И Ссылка.ЭтоТест Тогда
		
		ЭтоСтатичныйОбъект = Ложь;
		
	КонецЕсли;
	
	Если ЭтоСтатичныйОбъект И НЕ РежимПросмотра Тогда
		
		ТекущаяДата = ТекущаяДата();
		
		ПопыткаВыполнения = Документы.ПопыткаВыполненияСтатичногоОбъектаСУЗ.СоздатьДокумент();
		
		ПопыткаВыполнения.Дата                         = ТекущаяДата;
		ПопыткаВыполнения.Пользователь                 = ОбъектыСУЗ.ТекущийПользователь(КонтекстВыполнения);
		ПопыткаВыполнения.ПрохождениеОбучения       = ПрохождениеОбучения;
		ПопыткаВыполнения.Задание                      = Задание;
		
		Если ТипЗнч(ТекущийЭлементСодержания) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
			ПопыткаВыполнения.СводЗнаний                   = ТекущийЭлементСодержания;
		Иначе
			ПопыткаВыполнения.СводЗнаний                   = СводЗнаний;
			ПопыткаВыполнения.ЭлементСодержанияСводаЗнаний = ТекущийЭлементСодержания;
		КонецЕсли;
		
		ПопыткаВыполнения.СсылкаНаОбъектСУЗ            = Ссылка;
		ПопыткаВыполнения.ДатаНачалаВыполнения         = ТекущаяДата;
		
		ПопыткаВыполнения.Записать(РежимЗаписиДокумента.Проведение);
		
		СтруктураДанных.Вставить("ПопыткаВыполненияСтатичногоОбъекта", ПопыткаВыполнения.Ссылка);
		
	КонецЕсли;
	
	// Примечание: попытка выполнения статичного объекта будет завершена автоматически
	// При получении данных другого объекта в форме "ОбозревательОбъектовСУЗ"
	// Или при закрытии этой формы.
	
	//////////////////////////////////////////////////////////////////////////////////
	// Определяем пройден ли объект

	Если ЗначениеЗаполнено(ТекущийЭлементСодержания) И ДанныеЭлементаСодержания.ЭтоГруппа Тогда
		
		СтруктураДанных.Пройден = Ложь; // Группа считается всегда не пройденной
		
	Иначе
		
		Если ЭтоСтатичныйОбъект И НЕ РежимПросмотра Тогда
			
			СтруктураДанных.Пройден = Истина; // Статичный объект считается пройденным сразу, как только был показан.	
			
		Иначе
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗСрезПоследних.Регистратор
				|ИЗ
				|	РегистрСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.СрезПоследних(
				|			,
				|			Пользователь = &Пользователь
				|				И ЭлементСодержания = &ЭлементСодержания
				|				И Задание = &Задание
				|				И ПрохождениеОбучения = &ПрохождениеОбучения
				|				И ПопыткаЗавершена = ИСТИНА) КАК ПопыткиПрохожденияЭлектронныхРесурсовСУЗСрезПоследних";

			Запрос.УстановитьПараметр("Задание", Задание);
			Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбучения);
			
			Запрос.УстановитьПараметр("Пользователь", ТекущийПользовательПрохождения(РежимПросмотра, ПрохождениеОбучения, ТекущийПользователь));
			Запрос.УстановитьПараметр("ЭлементСодержания", ТекущийЭлементСодержания);

			Результат = Запрос.Выполнить();

			Если Результат.Пустой() Тогда
				СтруктураДанных.Пройден = Ложь;
			Иначе
				СтруктураДанных.Пройден = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
		
	//////////////////////////////////////////////////////////////////////////////////
	// Получаем таблицу дополнительных  материалов
	
	Если ДополнительныеМатериалы <> Неопределено Тогда
		
		ТаблицаДополнительныхМатериалов = ПолучитьТаблицуДополнительныхМатериалов(?(ЗначениеЗаполнено(СтруктураДанных.ТекущийЭлементСодержания), СтруктураДанных.ТекущийЭлементСодержания, СводЗнаний), ТекущийПользователь);
		
		Для каждого Строка Из ТаблицаДополнительныхМатериалов Цикл
		
			Если НЕ ЗначениеЗаполнено(Строка.Наименование) Тогда
				Строка.Наименование = Строка.Текст;
			КонецЕсли;
		
		КонецЦикла;
		
		ЗначениеВДанныеФормы(ТаблицаДополнительныхМатериалов, ДополнительныеМатериалы);
		
	КонецЕсли;
	
	СтруктураДанных.Вставить("ТаблицаДополнительныхМатериалов", ДополнительныеМатериалы);	
	СтруктураДанных.Вставить("КонтекстВыполнения", КонтекстВыполнения);	
	
	//////////////////////////////////////////////////////////////////////////////////
	// Возвращаем данные
	
	Возврат СтруктураДанных;	
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРезультатДействия(Знач СтруктураДействия,
	                              Знач ТекущийЭлементСодержания,
								  Знач ПрохождениеОбучения,
								  Знач Задание,
								  Знач Вариант,
								  Знач ПутьККаталогуРесурсов,
								  Знач ПредпочитаемыйПоставщик,
								  Знач СводЗнаний,
								  Знач Симуляция,
								  Знач ТекущийПользователь,
								  Знач ДатаОткрытияФормы,
								  Знач АдресЗагруженногоОбъекта)
								  
	КонтекстВыполнения = ОбъектыСУЗ.ЗаполнитьКонтекстВыполненияОбъекта(СводЗнаний, ТекущийЭлементСодержания, ТекущийПользователь, ПрохождениеОбучения, Задание, Вариант,, Симуляция,, ДатаОткрытияФормы, АдресЗагруженногоОбъекта);
								  
	РезультатДействия = ОбъектыСУЗ.ВыполнитьДействие(СтруктураДействия, КонтекстВыполнения);
	
	Если НЕ ПараметрыСеанса.ИспользуетсяЛокальныйКэшНаКлиентеСУЗ Тогда 
		ОбщегоНазначенияСУКлиентСервер.ВыгрузитьРесурсыВКэш(РезультатДействия.Ресурсы, ПутьККаталогуРесурсов, ПредпочитаемыйПоставщик, СводЗнаний);
	КонецЕсли;
	
	Возврат РезультатДействия;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗакрытьТекущуюСессиюТестирования(НомерДокумента, ПрохождениеОбучения, Задание)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Попытка
		
		ДокументСессииСсылка = Документы.ПопыткаВыполненияПодборкиВопросовСУЗ.НайтиПоНомеру(НомерДокумента);
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.ПопыткаВыполненияПодборкиВопросовСУЗ");
		ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", ДокументСессииСсылка);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		ДокументСессии = ДокументСессииСсылка.ПолучитьОбъект();

		Если НЕ ДокументСессии.ТестЗавершен Тогда
			
			ДокументСессии.ЗакрытьСессию(Истина);
			
			ДокументСессии.Записать(РежимЗаписиДокумента.Проведение);
			
			ЭлектронныеРесурсыПереопределяемый.ПослеПрохожденияТестирования(НомерДокумента, ПрохождениеОбучения, Задание); 
			
		КонецЕсли;		
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	

	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьДействияПриЗакрытии(Знач ПопыткаВыполненияСтатичногоОбъекта,
	                                   Знач ПараметрыФормы,
									   Знач Комментарий,
									   Знач ТекущийЭлементСодержания,
									   Знач ПоказыватьСодержание,
									   Знач ЗначенияНастроекЭР,
									   Знач РежимПросмотра,
									   Знач ТекущийПользователь,
									   Знач ПрохождениеОбучения)
	
	
	Если ЗначениеЗаполнено(ПопыткаВыполненияСтатичногоОбъекта) Тогда
		ОбъектыСУЗ.ЗавершитьПопыткуВыполненияСтатичногоОбъекта(ПопыткаВыполненияСтатичногоОбъекта);
	КонецЕсли;
	
	// Сохраням настройки
	
	Если ЗначениеЗаполнено(ПараметрыФормы.СводЗнаний) Тогда
	
		Пользователь = ТекущийПользователь;
		
		НаборЗаписей = РегистрыСведений.НастройкиПрохожденияЭлектронныхРесурсовСУЗ.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
		НаборЗаписей.Отбор.ЭлектронныйРесурс.Установить(ПараметрыФормы.СводЗнаний);
		НаборЗаписей.Отбор.ПрохождениеОбучения.Установить(ПараметрыФормы.ПрохождениеОбучения);
		НаборЗаписей.Отбор.Задание.Установить(ПараметрыФормы.Задание);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.Пользователь                 = Пользователь;
		НоваяЗапись.ЭлектронныйРесурс            = ПараметрыФормы.СводЗнаний;
		НоваяЗапись.ПрохождениеОбучения       = ПараметрыФормы.ПрохождениеОбучения;
		НоваяЗапись.Задание                      = ПараметрыФормы.Задание;
		
		НоваяЗапись.ПоследнийЭлементСодержания   = ТекущийЭлементСодержания;
		НоваяЗапись.Комментарий                  = Комментарий;
		НоваяЗапись.ПоказыватьСодержание         = ПоказыватьСодержание;
		НоваяЗапись.НастройкиЭлектронногоРесурса = Новый ХранилищеЗначения(ДанныеФормыВЗначение(ЗначенияНастроекЭР, Тип("ТаблицаЗначений")));
		
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
	ПользовательПрохождения = ТекущийПользовательПрохождения(РежимПросмотра, ПрохождениеОбучения, ТекущийПользователь);
	
	Если НЕ РежимПросмотра ИЛИ ТекущийПользователь <> ПользовательПрохождения Тогда
		ЭлектронныеРесурсыПереопределяемый.ПриЗакрытииЭлектронногоРесурса(ПараметрыФормы.СводЗнаний, ПараметрыФормы.ПрохождениеОбучения, ПараметрыФормы.Задание);
	КонецЕсли;
	
КонецПроцедуры

// Вспомогательные

&НаСервере
Процедура УстановитьДоступностьЭлементовФормыНаСервере(НастройкиПредыдущегоПрохождения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Параметры.СкрытьНавигационноеДерево Тогда
		
		Если Параметры.ДочернееОкно Тогда
			Элементы.ГруппаОбычнаяНавигация.Видимость = Ложь; // Показываем только обычные кнопки навигации.
		Иначе
			Элементы.ГруппаОбычнаяНавигация.Видимость = Истина; // Показываем только обычные кнопки навигации.
		КонецЕсли;		
			
	Иначе // Управляем видимостью кнопок навигации
		
		Если ЗначениеЗаполнено(Параметры.СводЗнаний) И НЕ Параметры.СводЗнаний.СкрытьСодержание Тогда
			
			ЕдинственныйЭлементСодержания = Справочники.СводыЗнанийСУЗ.ЕдинственныйЭлементСодержания(Параметры.СводЗнаний);
			
			Если ЗначениеЗаполнено(ЕдинственныйЭлементСодержания) Тогда
				
				Параметры.ЭлементСодержания         = ЕдинственныйЭлементСодержания;
				Параметры.АдресОбъекта              = ЕдинственныйЭлементСодержания;
				Параметры.СкрытьНавигационноеДерево = Истина;
				
				ВозможноОтобразитьСодержание = Ложь;
				
				Элементы.НавигационноеДерево.Видимость  = Ложь;
				Элементы.ПоказатьСкрытьНавигационноеДерево.Пометка = Ложь;
				
				ТекущийЭлементСодержания = ЕдинственныйЭлементСодержания;
				
			Иначе
						
				ВозможноОтобразитьСодержание = Истина;
				
				Если ПоследовательнаяНавигация Тогда
					Элементы.НавигационноеДерево.Видимость   = НастройкиПредыдущегоПрохождения.ПоказыватьСодержание;
					Элементы.ПоказатьСкрытьНавигационноеДерево.Пометка  = НастройкиПредыдущегоПрохождения.ПоказыватьСодержание;
					Элементы.ПоказатьСкрытьНавигационноеДерево.ЦветФона = ?(Элементы.ПоказатьСкрытьНавигационноеДерево.Пометка, Новый Цвет(235, 231, 205), Новый Цвет(245, 242, 221));
				Иначе
					Элементы.НавигационноеДерево.Видимость  = Истина;
					Элементы.ПоказатьСкрытьНавигационноеДерево.Пометка = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Показываем нужную панель навигации
		
		Если ЗначениеЗаполнено(Параметры.СводЗнаний)
			И ПоследовательнаяНавигация Тогда
			
			Элементы.ГруппаОбычнаяНавигация.Видимость          = Ложь;
			Элементы.ГруппаПоследовательнаяНавигация.Видимость = Истина;
			
			Если Параметры.СводЗнаний.СкрытьСодержание Тогда
				Элементы.ПоказатьСкрытьНавигационноеДерево.Видимость = Ложь;
			Иначе
				Элементы.ПоказатьСкрытьНавигационноеДерево.Видимость = Истина;
			КонецЕсли;
			
		Иначе
			
			Элементы.ГруппаОбычнаяНавигация.Видимость          = Истина;
			Элементы.ГруппаПоследовательнаяНавигация.Видимость = Ложь;
			
		КонецЕсли;
		
		// Кнопка показа и скрытия содержания
		
		Если ВозможноОтобразитьСодержание Тогда
			Элементы.ПоказатьСкрытьНавигационноеДерево.Видимость = Истина;	
		Иначе
			Элементы.ПоказатьСкрытьНавигационноеДерево.Видимость = Ложь;
		КонецЕсли;
		
		// Кнопка "Добавить в избранное"
		
		Если Элементы.НавигационноеДерево.Видимость Тогда
			Элементы.ДобавитьВИзбранное.Видимость = Истина;
		Иначе
			Элементы.ДобавитьВИзбранное.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	// Для всех режимов
	
	// Комментарий
	
	Если ЗначениеЗаполнено(Параметры.СводЗнаний)
		И НЕ Параметры.СкрытьНавигационноеДерево Тогда
		
		Элементы.КомандаКомментарий.Видимость = Истина;
		
		Если ЗначениеЗаполнено(Комментарий) Тогда
			
			Элементы.Комментарий.Видимость = Истина;
			
			Элементы.КомандаКомментарий.Пометка = Истина;
			Элементы.КомандаКомментарий.ЦветФона = Новый Цвет(235, 231, 205);
			
		Иначе
			
			Элементы.Комментарий.Видимость = Ложь;
			
		КонецЕсли;
		
	Иначе
		
		Элементы.КомандаКомментарий.Видимость = Ложь;
		
	КонецЕсли;
	
	// Полнотекстовый поиск
	
	Если ЗначениеЗаполнено(Параметры.СводЗнаний) И НЕ ПоследовательнаяНавигация И Параметры.СводЗнаний.Тип <> Перечисления.ТипыЭлектронныхРесурсовСУЗ.Тест И НЕ Параметры.ДочернееОкно Тогда
		Элементы.КомандаПолнотекстовыйПоиск.Видимость = Истина;
	Иначе
		Элементы.КомандаПолнотекстовыйПоиск.Видимость = Ложь;
	КонецЕсли;
	
	// Дополнительные материалы
	
	// Определяем, можно ли вообще использовать доп. материалы
	
	Если Параметры.ДочернееОкно Тогда		
		МожноИспользоватьДополнительныеМатериалы = Ложь;		
	Иначе		
		МожноИспользоватьДополнительныеМатериалы = РегистрыСведений.ИспользованиеДополнительныхМатериаловСУЗ.МожноИспользоватьДополнительныеМатериалы(Параметры.СводЗнаний, Параметры.Задание); 
	КонецЕсли;
		
	Если МожноИспользоватьДополнительныеМатериалы Тогда
		Элементы.КомандаДополнительныеМатериалы.Видимость = Истина;
		Элементы.НавигационноеДеревоДополнительныеМатериалы.Видимость = Истина;
	Иначе
		Элементы.КомандаДополнительныеМатериалы.Видимость = Ложь;
		Элементы.НавигационноеДеревоДополнительныеМатериалы.Видимость = Ложь;
	КонецЕсли;
	
	// Показываем область доп. материалов при необходимости
	
	Если МожноИспользоватьДополнительныеМатериалы И ДополнительныеМатериалыВидны Тогда
		
		Элементы.ГруппаДополнительныеМатериалы.Видимость = Истина;
		
		Элементы.КомандаДополнительныеМатериалы.Пометка  = Истина;
		Элементы.КомандаДополнительныеМатериалы.ЦветФона = Новый Цвет(235, 231, 205);
		
	Иначе
		
		Элементы.ГруппаДополнительныеМатериалы.Видимость  = Ложь;
		
	КонецЕсли;
	
	// Справочная информация
	
	Если ЗначениеЗаполнено(СправочнаяИнформация)
		И НЕ Параметры.СкрытьНавигационноеДерево Тогда
		
		Элементы.СправочнаяИнформация.Видимость = Истина;
		
	Иначе
		
		Элементы.СправочнаяИнформация.Видимость = Ложь;
		
	КонецЕсли;
	
	// Команда настройки
	
	Если ЗначениеЗаполнено(Параметры.СводЗнаний) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СводыЗнанийСУЗПользовательскиеНастройки.ВидНастройки
			|ИЗ
			|	Справочник.СводыЗнанийСУЗ.ПользовательскиеНастройки КАК СводыЗнанийСУЗПользовательскиеНастройки
			|ГДЕ
			|	СводыЗнанийСУЗПользовательскиеНастройки.Ссылка = &ЭлектронныйРесурс";

		Запрос.УстановитьПараметр("ЭлектронныйРесурс", Параметры.СводЗнаний);

		Результат = Запрос.Выполнить();

		Если Результат.Пустой() Тогда
			Элементы.КомандаНастройки.Видимость = Ложь;
		Иначе
			Элементы.КомандаНастройки.Видимость = Истина;
		КонецЕсли;
		
	Иначе
		
		Элементы.КомандаНастройки.Видимость = Ложь;
		
	КонецЕсли;
	
	Элементы.ЗначенияНастроекЭР.Видимость = Ложь;
	
	// Глоссарий
	
	Если ЗначениеЗаполнено(Глоссарий)
		И НЕ Параметры.СкрытьНавигационноеДерево Тогда
		
		Элементы.Глоссарий.Видимость = Истина;
		
	Иначе
		
		Элементы.Глоссарий.Видимость = Ложь;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтрокуПоискаДокумента()
	
	Документ = Элементы.ОбластьПросмотра.Документ;
	
	Если Документ = Неопределено Тогда
		СтрокаПоиска = "";
	Иначе
		СтрокаПоиска = Документ.location.search;
	КонецЕсли;
	
	СтрокаПоиска = СтрЗаменить(СтрокаПоиска, "%26", "&"); //IE 6 bug
	
	Если НЕ ЗначениеЗаполнено(СтрокаПоиска) Тогда
		СтрокаПоиска = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(Параметры.СводЗнаний);
	КонецЕсли;
	
	Возврат СтрокаПоиска;
	
КонецФункции

&НаКлиенте
Функция ПолучитьТекущийЭлементСодержания()
	
	Если Элементы.НавигационноеДерево.Видимость Тогда
		
		Если Элементы.НавигационноеДерево.ТекущиеДанные = Неопределено Тогда
			Возврат ПредопределенноеЗначение("Справочник.СодержаниеСУЗ.ПустаяСсылка");
		Иначе
			Возврат Элементы.НавигационноеДерево.ТекущиеДанные.Ссылка;
		КонецЕсли;
		
	Иначе
		
		Возврат ТекущийЭлементСодержания;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура УстановитьЗаголовокФормы()
	
	ТекстЗаголовка = ЗаголовокПоУмолчанию;
	
	Если Параметры.РежимПросмотра Тогда
		ТекстЗаголовка = ТекстЗаголовка + НСтр("ru = ' / Режим просмотра '");
	КонецЕсли;
	
	Если ТекущийПользователь <> ТекущийПользовательСеанса Тогда
		ТекстЗаголовка = ТекстЗаголовка + " / " + ТекущийПользователь;		
	КонецЕсли;
	
	Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКнопокНавигации()
	
	// Следующая страница
	
	Если (
		 	(ТекущийЭлементСодержанияПройден И ЗначениеЗаполнено(ПрохождениеОбучения))
		 	ИЛИ ТипЗнч(ТекущийЭлементСодержания) <> Тип("СправочникСсылка.СодержаниеСУЗ")
		 	ИЛИ НЕ ЗначениеЗаполнено(ПрохождениеОбучения)
		 )
		 И ЗначениеЗаполнено(СледующийЭлементСодержания)
		 И НавигацияДоступна Тогда
		
		Элементы.НавигацияВперед.Доступность = Истина;
		
	Иначе
		
		Элементы.НавигацияВперед.Доступность = Ложь;
		
	КонецЕсли;
	
	// Предыдущая страница
	
	Если ТипЗнч(ТекущийЭлементСодержания) = Тип("СправочникСсылка.СодержаниеСУЗ")
		И НавигацияДоступна Тогда
		
		Элементы.НавигацияНазад.Доступность = Истина;
		
	Иначе
		
		Элементы.НавигацияНазад.Доступность = Ложь;
		
	КонецЕсли;
	
	// Вперед, назад
	
	Если ВыполняетсяТестирование Тогда
		Элементы.Вперед.Доступность = Ложь;
		Элементы.Назад.Доступность  = Ложь;
	Иначе
		Элементы.Вперед.Доступность = Истина;
		Элементы.Назад.Доступность  = Истина;
	КонецЕсли;
	
	
	// Избранное
	
	Если ВозможноДобавитьВИзбранноеЭлементСодержания Тогда
		Элементы.ДобавитьВИзбранное.Доступность = Истина;
	Иначе
		Элементы.ДобавитьВИзбранное.Доступность = Ложь;
	КонецЕсли;
	
	// Дерево
	
	// Элементы.НавигационноеДерево.Доступность = НавигацияДоступна;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьИлиУдалитьЭлементСодержанияВИзбранном(ЭлементСодержания, ТекущийПользователь)
	
	РегистрыСведений.ИзбранноеПользователейСУЗ.ДобавитьУдалитьЭлементВИзбранном(ЭлементСодержания, ТекущийПользователь);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиПредыдущегоПрохождения(ТекущийПользователь)
	
	НастройкиПрохождения = Новый Структура("ПоследнийЭлементСодержания, Комментарий, ПоказыватьСодержание, ЗначенияНастроекЭР", Справочники.СодержаниеСУЗ.ПустаяСсылка(), "", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПрохожденияЭлектронныхРесурсовСУЗ.ПоследнийЭлементСодержания,
		|	НастройкиПрохожденияЭлектронныхРесурсовСУЗ.Комментарий,
		|	НастройкиПрохожденияЭлектронныхРесурсовСУЗ.ПоказыватьСодержание,
		|	НастройкиПрохожденияЭлектронныхРесурсовСУЗ.НастройкиЭлектронногоРесурса
		|ИЗ
		|	РегистрСведений.НастройкиПрохожденияЭлектронныхРесурсовСУЗ КАК НастройкиПрохожденияЭлектронныхРесурсовСУЗ
		|ГДЕ
		|	НастройкиПрохожденияЭлектронныхРесурсовСУЗ.Пользователь = &Пользователь
		|	И НастройкиПрохожденияЭлектронныхРесурсовСУЗ.ЭлектронныйРесурс = &ЭлектронныйРесурс
		|	И НастройкиПрохожденияЭлектронныхРесурсовСУЗ.ПрохождениеОбучения = &ПрохождениеОбучения
		|	И НастройкиПрохожденияЭлектронныхРесурсовСУЗ.Задание = &Задание";

	Запрос.УстановитьПараметр("Задание", Параметры.Задание);
	Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);
	Запрос.УстановитьПараметр("ПрохождениеОбучения", Параметры.ПрохождениеОбучения);
	Запрос.УстановитьПараметр("ЭлектронныйРесурс", Параметры.СводЗнаний);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		НастройкиПрохождения.ПоследнийЭлементСодержания = ВыборкаДетальныеЗаписи.ПоследнийЭлементСодержания;
		НастройкиПрохождения.Комментарий                = ВыборкаДетальныеЗаписи.Комментарий;
		НастройкиПрохождения.ПоказыватьСодержание       = ВыборкаДетальныеЗаписи.ПоказыватьСодержание;
		НастройкиПрохождения.ЗначенияНастроекЭР         = ВыборкаДетальныеЗаписи.НастройкиЭлектронногоРесурса.Получить();
		
	КонецЕсли;
	
    Возврат НастройкиПрохождения;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуНастроекЭР(СохраненныеНастройки, ТекущийПользователь)
	
	Если НЕ ЗначениеЗаполнено(Параметры.СводЗнаний) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(СохраненныеНастройки) <> Тип("ТаблицаЗначений") Тогда
		СохраненныеНастройки = ДанныеФормыВЗначение(ЗначенияНастроекЭР, Тип("ТаблицаЗначений"));
		СохраненныеНастройки.Очистить(); // Пустая таблица
	КонецЕсли;
	
	Пользователь = ТекущийПользователь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СводыЗнанийСУЗПользовательскиеНастройки.ВидНастройки КАК Вид,
		|	СводыЗнанийСУЗПользовательскиеНастройки.ВидНастройки.Код КАК Код
		|ИЗ
		|	Справочник.СводыЗнанийСУЗ.ПользовательскиеНастройки КАК СводыЗнанийСУЗПользовательскиеНастройки
		|ГДЕ
		|	СводыЗнанийСУЗПользовательскиеНастройки.Ссылка = &СводЗнаний";

	Запрос.УстановитьПараметр("СводЗнаний", Параметры.СводЗнаний);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = ЗначенияНастроекЭР.Добавить();
		НоваяСтрока.Вид = ВыборкаДетальныеЗаписи.Вид;
		НоваяСтрока.Код = ВыборкаДетальныеЗаписи.Код;
	
		СохраненноеЗначение = СохраненныеНастройки.Найти(ВыборкаДетальныеЗаписи.Вид, "Вид");
		
		Если СохраненноеЗначение <> Неопределено Тогда
			НоваяСтрока.Значение = СохраненноеЗначение.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыСодержанияВДерево(СтрокиДерева, СтрокиВыгрузки, ТаблицаИзбранное, ТаблицаДопМатериалы, ТаблицаПрохождений, ВсеЭлементыПройдены = Истина, ИндексСтрокиДС, ПовторныеПрохождения);

	Для каждого Строка Из СтрокиВыгрузки Цикл
		
		ИндексСтрокиДС = ИндексСтрокиДС + 1;
		
		НоваяСтрока = СтрокиДерева.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		НоваяСтрока.Отмечено  = Ложь;
		НоваяСтрока.Пройдено  = Ложь;
		НоваяСтрока.ЭтоКорень = Ложь;
		
		НоваяСтрокаАЭС = АдресаЭлементовСодержания.Добавить();
		НоваяСтрокаАЭС.Адрес             = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(НоваяСтрока.Ссылка);
	    НоваяСтрокаАЭС.ЭлементСодержания = НоваяСтрока.Ссылка;
		НоваяСтрокаАЭС.Индекс            = ИндексСтрокиДС;
		НоваяСтрокаАЭС.Группа            = Строка.Группа;
		
		Если Строка.ЭтоГруппа Тогда
			
			НоваяСтрока.КартинкаДополнительногоМатериала = 1;
			
			ВсеЭлементыГруппыПройдены = Истина;
			
			ДобавитьЭлементыСодержанияВДерево(НоваяСтрока.Строки, Строка.Строки, ТаблицаИзбранное, ТаблицаДопМатериалы, ТаблицаПрохождений, ВсеЭлементыГруппыПройдены, ИндексСтрокиДС, ПовторныеПрохождения); // Рекурсия
			
			Если ВсеЭлементыГруппыПройдены Тогда
				НоваяСтрока.Пройдено = Истина;
			Иначе
				ВсеЭлементыПройдены = Ложь;
			КонецЕсли;
			
		Иначе
			
			Если ТаблицаИзбранное.Найти(НоваяСтрока.Ссылка, "ЭлементСодержания") <> Неопределено Тогда
				НоваяСтрока.Отмечено = Истина;
			КонецЕсли;			
			
			СтрокаТаблицыПрохождений = Неопределено;
			Если ТаблицаПрохождений <> Неопределено Тогда
				СтрокаТаблицыПрохождений = ЭлектронныеРесурсыСУЗ.ПопыткаПрохожденияЭлементаСодержанияЭлектронногоРесурса(
					ТаблицаПрохождений, НоваяСтрока.Ссылка, НоваяСтрока.СсылкаНаЭлемент, Неопределено, ПовторныеПрохождения);					
			КонецЕсли;
			
			Если СтрокаТаблицыПрохождений = Неопределено Тогда
				ВсеЭлементыПройдены = Ложь;
			Иначе
				НоваяСтрока.Пройдено = Истина;
			КонецЕсли;
						
			Если ТаблицаДопМатериалы.Найти(НоваяСтрока.Ссылка, "ЭлементСодержания") = Неопределено Тогда
				НоваяСтрока.КартинкаДополнительногоМатериала = 1;
			Иначе
				НоваяСтрока.КартинкаДополнительногоМатериала = 0;
			КонецЕсли;
			
		КонецЕсли;
		
		НоваяСтрока.Картинка = ПолучитьКартинкуЭлементаСодержания(НоваяСтрока, Параметры.ПрохождениеОбучения);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьКартинкуЭлементаСодержания(ТекущаяСтрока, ПрохождениеОбучения)
	
	Если ТекущаяСтрока.ЭтоКорень Тогда
		
		Если ТекущаяСтрока.Пройдено И ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
			Возврат 8; // Книга с галочкой
		Иначе
			Возврат 7; // Книга
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтрока.ЭтоГруппа Тогда
		
		Если ТекущаяСтрока.Пройдено И ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
			Возврат 3; // Папка с галочкой
		Иначе
			Возврат 2; // Папка
		КонецЕсли;
		
	Иначе
		
		Если ТекущаяСтрока.Отмечено Тогда
			
			Возврат 0; // Звезда
			
		Иначе
			
			Если ТекущаяСтрока.Пройдено И ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
				Возврат 6; // Галочка (5 - зеленый реквизит)
			Иначе
				Возврат 1; // Синяя палочка
			КонецЕСли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОпределитьСтатусГруппЭлементовСодержания(ТекущаяСтрока)
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВсеЭлементыПройдены = Истина;
	ДочерниеЭлементы = ТекущаяСтрока.ПолучитьЭлементы(); 
	
	Для каждого Строка Из ДочерниеЭлементы Цикл

		 Если НЕ Строка.Пройдено Тогда
			 ВсеЭлементыПройдены = Ложь;
			 Прервать;
		 КонецЕсли;

	КонецЦикла;
	
	ТекущаяСтрока.Пройдено = ВсеЭлементыПройдены; 
	
	ТекущаяСтрока.Картинка = ПолучитьКартинкуЭлементаСодержания(ТекущаяСтрока, Параметры.ПрохождениеОбучения);
	
	ОпределитьСтатусГруппЭлементовСодержания(ТекущаяСтрока.ПолучитьРодителя()); // Рекурсия
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИндексЭлементаСодержания(ЭлементСодержания)
	
	Если ЗначениеЗаполнено(ЭлементСодержания) Тогда
		
		НайденныеСтроки = АдресаЭлементовСодержания.НайтиСтроки(Новый Структура("ЭлементСодержания", ЭлементСодержания));
		
		Если НайденныеСтроки.Количество() = 1 Тогда
			Возврат НайденныеСтроки[0].Индекс;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

&НаКлиенте
Функция ПолучитьМассивРодителейЭлементаСодержания(ЭлементСодержания, МассивРодителей=Неопределено)
	
	Если МассивРодителей = Неопределено Тогда
		МассивРодителей = Новый Массив();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлементСодержания) Тогда
		
		НайденныеСтроки  = АдресаЭлементовСодержания.НайтиСтроки(Новый Структура("ЭлементСодержания", ЭлементСодержания));
		РодительЭлемента = Неопределено;
		
		Если НайденныеСтроки.Количество() = 1 Тогда
			РодительЭлемента = НайденныеСтроки[0].Группа;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РодительЭлемента) Тогда
			МассивРодителей.Добавить(РодительЭлемента);
			ПолучитьМассивРодителейЭлементаСодержания(РодительЭлемента, МассивРодителей); // Рекурсия
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат МассивРодителей;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекущийПользовательПрохождения(РежимПросмотра, ПрохождениеОбучения, ТекущийПользователь)
	
	ПользовательПрохожденияОбучения = ТекущийПользователь;
	
	ЭлектронныеРесурсыПереопределяемый.ПользовательОбучения(ПользовательПрохожденияОбучения, ПрохождениеОбучения); 
	
	Возврат ?(РежимПросмотра, ПользовательПрохожденияОбучения, ТекущийПользователь);
	
КонецФункции

&НаКлиенте
Функция ОткрываетсяДругойОбъект(ПараметрыСсылки)
	
	Действие = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "action");
	
	Если ЗначениеЗаполнено(Действие) Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	СтруктураСсылкиЗагруженногоОбъекта = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(АдресЗагруженногоОбъекта);
	ИдентификаторЗагруженногоОбъекта   = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылкиЗагруженногоОбъекта, "id");
	ИдентификаторЗагружаемогоОбъекта   = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "id");
	
	Если ИдентификаторЗагруженногоОбъекта = ИдентификаторЗагружаемогоОбъекта Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВыбратьОбъектКоманды(Знач СтруктураСсылки)
	
	Для каждого ИмяОбъекта Из СтруктураСсылки.object Цикл
	
		СсылкаНаОбъект = ОбъектыСУЗ.ПолучитьСсылкуПоИдентификатору(ИмяОбъекта, СтруктураСсылки.id);
		
		Если ЗначениеЗаполнено(СсылкаНаОбъект) И ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(СсылкаНаОбъект) Тогда
			СтруктураСсылки.object = ИмяОбъекта;
			Возврат ОбъектыСУЗКлиентСервер.ПолучитьАдресСсылкиИзСтруктуры(СтруктураСсылки);
			Прервать;
		КонецЕсли;	
	
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОписаниеРесурсовДляВыгрузки(МассивРесурсов)
	
	МассивРесурсовДляВыгрузки = Новый Массив();
	
	Для каждого ДанныеРесурс Из МассивРесурсов Цикл
		
		СтруктураРесурса = ОбъектыСУЗ.ПолучитьСтруктуруРесурса(ДанныеРесурс.Ресурс);
		СтруктураРесурса.Размер = ДанныеРесурс.Размер;
		
		МассивРесурсовДляВыгрузки.Добавить(СтруктураРесурса);
		
	КонецЦикла;

	Возврат МассивРесурсовДляВыгрузки;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ВыполнитьПроверкуОбщегоКаталога() Экспорт
	
	Если НЕ ИспользуетсяКэшНаКлиенте Тогда
		Возврат;
	КонецЕсли;
	
	#Если НЕ ВебКлиент Тогда
		
	Если ОбщегоНазначенияСУКлиентСервер.ЛокальныйКэшПоврежден(ПутьКОбщемуКаталогу) Тогда
		
		ОбластьПросмотра = "about:blank";
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОчиститьКаталогВременныхФайловПродолжение", ЭтотОбъект);		
		
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Обнаружено повреждение файлов во временном каталоге.
		|Вероятно, часть файлов была удалена сторонней программой. 
		|Программа будет перезапущена и каталог будет сформирован повторно. 
		|Продолжить?'"), РежимДиалогаВопрос.ДаНет, 0);
		
	КонецЕсли;
	
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКаталогВременныхФайловПродолжение(Ответ, ДополнительныеПараметры) Экспорт
	
	#Если НЕ ВебКлиент Тогда
		
	Если Ответ = КодВозвратаДиалога.Нет Тогда
	    Возврат;
	КонецЕсли;

	СообщениеОбОшибке = Неопределено;
	
	Попытка
	    УдалитьФайлы(ПутьКОбщемуКаталогу);  
	Исключение
	    СообщениеОбОшибке = ОписаниеОшибки();
	КонецПопытки;
	
	Если СообщениеОбОшибке <> Неопределено Тогда		
		ПоказатьПредупреждение(,НСтр("ru = 'В процессе удаления файлов произошла ошибка.
		|Рекомендуется перезапустить программу и выполнить очистку повторно в персональных настройках.
		|Описание ошибки: '") + СообщениеОбОшибке);
	Иначе		
		ЗавершитьРаботуСистемы(Ложь, Истина);
	КонецЕсли;

	#КонецЕсли

КонецПроцедуры


// Управление дополнительными материалами

&НаСервереБезКонтекста
Функция ПолучитьТаблицуДополнительныхМатериалов(ЭлементСодержания, ТекущийПользователь)
	
	Возврат РегистрыСведений.ДополнительныеМатериалыПользователейСУЗ.ТаблицаМатериалов(ТекущийПользователь, ЭлементСодержания);
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаписатьДополнительныйМатериал(Знач Период=Неопределено, Знач Автор=Неопределено, Знач ЭлементСодержания, Знач СсылкаНаОбъектСУЗ, Знач ТекущийПользователь, Знач Текст="")
	
	Возврат РегистрыСведений.ДополнительныеМатериалыПользователейСУЗ.ЗаписатьМатериал(Период, ЭлементСодержания, Автор, СсылкаНаОбъектСУЗ, ТекущийПользователь, Текст);
	
КонецФункции

&НаСервереБезКонтекста
Функция УдалитьДополнительныйМатериал(Знач Период, Знач ЭлементСодержания)
	
	РегистрыСведений.ДополнительныеМатериалыПользователейСУЗ.УдалитьМатериал(Период, ЭлементСодержания);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьНастройкиДополнительногоМатериала(Знач Период, Знач ЭлементСодержания, Знач Общий=Неопределено)
	
	НаборЗаписей = РегистрыСведений.ДополнительныеМатериалыПользователейСУЗ.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.ЭлементСодержания.Установить(ЭлементСодержания);

	НаборЗаписей.Прочитать();
	
	Запись = НаборЗаписей[0]; // Всегда есть одна запись
	
	Если Общий <> Неопределено Тогда
		Запись.Общий = Общий;
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Определяем недостающие параметры или переопределяем их при необходимости
	//
	
	Если НЕ ЗначениеЗаполнено(Параметры.СводЗнаний)
		И ТипЗнч(Параметры.АдресОбъекта) = Тип("СправочникСсылка.СодержаниеСУЗ") Тогда
		
		Параметры.СводЗнаний = Параметры.АдресОбъекта.Владелец;
		
	КонецЕсли;
	
	Если Параметры.ПрохождениеОбучения = Неопределено Тогда
		Параметры.ПрохождениеОбучения = Метаданные.ОпределяемыеТипы.ПрохождениеЭлектронногоОбучения.Тип.ПривестиЗначение(Параметры.ПрохождениеОбучения);
	КонецЕсли;		
	
	Если Параметры.Задание = Неопределено Тогда
		Параметры.Задание = Метаданные.ОпределяемыеТипы.ЗаданиеЭлектронногоОбучения.Тип.ПривестиЗначение(Параметры.Задание);
	КонецЕсли;
	
	Если Параметры.Вариант = Неопределено Тогда
		Параметры.Вариант = Метаданные.ОпределяемыеТипы.ВариантЗаданияЭлектронногоОбучения.Тип.ПривестиЗначение(Параметры.Вариант);
	КонецЕсли;	        	
	
	// Проверяем корректность параметров формы.
	//
	
	Если НЕ ЗначениеЗаполнено(Параметры.Задание)
		И ЗначениеЗаполнено(Параметры.ПрохождениеОбучения) Тогда
		
		ВызватьИсключение НСтр("ru = 'Задание прохождения обучения не задано'");
		
	КонецЕсли;			
	
	Если (ЗначениеЗаполнено(Параметры.СводЗнаний)
		И Параметры.СводЗнаний.ЭтоГруппа)
		ИЛИ (
		ЗначениеЗаполнено(Параметры.АдресОбъекта)
		И ТипЗнч(Параметры.АдресОбъекта) <> Тип("Строка")
		И Параметры.АдресОбъекта.ЭтоГруппа
		) Тогда
		
		Отказ = Истина;
		Текст = НСтр("ru = 'Выберите элемент справочника для просмотра'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
		
	КонецЕсли;
	
	Если Параметры.РежимПросмотра И НЕ ЗначениеЗаполнено(Параметры.ПрохождениеОбучения) Тогда
		
		Отказ = Истина;
		Текст = НСтр("ru = 'Электронный курс/тест не может быть открыт в режиме просмотра без привязки к проведению обучения'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
		
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Параметры.СводЗнаний) И НЕ ЗначениеЗаполнено(Параметры.АдресОбъекта) Тогда
		
		Отказ = Истина;
		Текст = НСтр("ru = 'Не задан объект для открытия'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
		
	КонецЕсли;
		
	// Проверяем тип электронного ресурса.
	//
	
	Если ЗначениеЗаполнено(Параметры.СводЗнаний) Тогда
		
		Если НЕ СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации()
			И Параметры.СводЗнаний.Базовый Тогда
			
			Отказ = Истина;
			Текст = НСтр("ru = 'Электронный курс/тест не может быть просмотрен в этой конфигурации'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Получаем необходимые реквизиты формы и устанавливаем нужные параметры.
	//
	
	ТекущийПользовательСеанса = Пользователи.ТекущийПользователь(); 
	
	Если ЗначениеЗаполнено(Параметры.ТекущийПользователь) Тогда
		ТекущийПользователь = Параметры.ТекущийПользователь;
	Иначе
		ТекущийПользователь = ТекущийПользовательСеанса;
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(Параметры.ПрохождениеОбучения) Тогда
		
		ПользовательПрохожденияОбучения = ТекущийПользователь;
		ЭлектронныеРесурсыПереопределяемый.ПользовательОбучения(ПользовательПрохожденияОбучения, Параметры.ПрохождениеОбучения);
		
		Если ТекущийПользователь <> ПользовательПрохожденияОбучения Тогда		
			Параметры.РежимПросмотра = Истина;			
		КонецЕсли;
		
		// Проверяем противоречия между личным кабинетом и веб-кабинетом
		
		ЕстьПопыткиПрохожденияИзЛичногоКабинета = РегистрыСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЕстьПопыткиПрохожденияИзЛичногоКабинета(ПользовательПрохожденияОбучения, Параметры.ПрохождениеОбучения, Параметры.Задание);
		ЕстьПопыткиПрохожденияИзВебКабинета = ЗначениеЗаполнено(Документы.СессияЭлектронногоРесурсаСУЗ.КорневаяСессияПрохожденияЭлектронногоКурса(ПользовательПрохожденияОбучения, Параметры.ПрохождениеОбучения, Параметры.СводЗнаний, Параметры.Задание));

		Если ЕстьПопыткиПрохожденияИзЛичногоКабинета
			И ЕстьПопыткиПрохожденияИзВебКабинета Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Данный электронный курс/тест ранее изучался через веб-кабинет. Результаты этого изучения показать здесь нельзя, их просмотр доступен только через веб-кабинет'"));
			
		КонецЕсли;
		
		Если НЕ ЕстьПопыткиПрохожденияИзЛичногоКабинета
			И ЕстьПопыткиПрохожденияИзВебКабинета Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Используйте веб-кабинет для открытия электронного курса или теста'"),,,,Отказ);
			
		КонецЕсли;				
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.СводЗнаний) Тогда
		СправочнаяИнформация = Параметры.СводЗнаний.СправочнаяИнформация;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.СводЗнаний) Тогда
		Глоссарий = Параметры.СводЗнаний.Глоссарий;
	КонецЕсли;
	
	ЕстьПравоИзмененияОбщихДополнительныхМатериалов = ПравоДоступа("Редактирование", Метаданные.РегистрыСведений.ДополнительныеМатериалыПользователейСУЗ);
	НастройкиПредыдущегоПрохождения                 = ПолучитьНастройкиПредыдущегоПрохождения(ТекущийПользователь);
	
	ЗаполнитьТаблицуНастроекЭР(НастройкиПредыдущегоПрохождения.ЗначенияНастроекЭР, ТекущийПользователь);
	
	ЗавершеноВПроцентах = -1;
	
	ОбластьПросмотраЗагружена = Ложь;
	
	ИдентификаторВладельца = Справочники.СводыЗнанийСУЗ.ИдентификаторКаталога(Параметры.СводЗнаний);
	
	Если ЗначениеЗаполнено(Параметры.СводЗнаний) Тогда
		
		Если Параметры.СводЗнаний.ПоказыватьПоследнююВерсию Тогда
			ПредпочитаемыйПоставщик = Параметры.СводЗнаний.ПредпочитатьПоставщика;
		Иначе
			ПредпочитаемыйПоставщик = Неопределено;
		КонецЕсли;
		
	Иначе
		
		ПредпочитаемыйПоставщик = Неопределено; // Именно Неопределено, а не пустая ссылка.
		
	КонецЕсли;
	
	ИмяКаталогаРесурсов      = "res_" + ИдентификаторВладельца;
	ИспользуетсяКэшНаКлиенте = ПараметрыСеанса.ИспользуетсяЛокальныйКэшНаКлиентеСУЗ;
	
	АдресОбщегоКаталога      = ОбъектыСУзПовтИсп.АдресКаталогаОбъектов();
	ПутьКОбщемуКаталогу      = ОбъектыСУЗПовтИсп.ПутьКаталогуОбъектов();
	
	Если НЕ ЗначениеЗаполнено(АдресОбщегоКаталога)
		ИЛИ НЕ ЗначениеЗаполнено(ПутьКОбщемуКаталогу) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОбщегоНазначенияСУПовтИсп.ТекстОНеобходимостиНастроитьОбщийКаталог(),,,,Отказ);
		Возврат;		
		
	КонецЕсли;	
	
	АдресКаталогаРесурсов    = ОбщегоНазначенияСУКлиентСервер.ПривестиСлэши(АдресОбщегоКаталога + ИмяКаталогаРесурсов);
	АдресКаталогаРесурсов    = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(АдресКаталогаРесурсов);	
	
	ПутьККаталогуРесурсов    = ОбъектыСУЗПовтИсп.ПутьКаталогуОбъектов() + ИмяКаталогаРесурсов;
	ПутьККаталогуРесурсов    = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуРесурсов);
	
	Если ЗначениеЗаполнено(Параметры.СводЗнаний) Тогда
		ПоследовательнаяНавигация = Параметры.СводЗнаний.ПоследовательнаяНавигация;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ЭлементСодержания) Тогда
		ТекущийЭлементСодержания = Параметры.ЭлементСодержания;
	Иначе
		ТекущийЭлементСодержания = НастройкиПредыдущегоПрохождения.ПоследнийЭлементСодержания;
	КонецЕсли;
	
	Комментарий                  = НастройкиПредыдущегоПрохождения.Комментарий;
	ГруппаОбщиеРесурсы           = Справочники.РесурсыСУЗ.Общие;
	ГруппаОбщиеСтраницы          = Справочники.СтраницыСУЗ.Общие;
	ПрохождениеОбучения          = Параметры.ПрохождениеОбучения;
		
	// Формируем таблицу зависимых ресурсов
	
    Если ЗначениеЗаполнено(Параметры.СводЗнаний) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СкрытыеРесурсы.Ресурс,
			|	СкрытыеРесурсы.Размер
			|ИЗ
			|	Справочник.СводыЗнанийСУЗ.СкрытыеРесурсы КАК СкрытыеРесурсы
			|ГДЕ
			|	СкрытыеРесурсы.Ссылка = &ЭлектронныйРесурс
			|	И СкрытыеРесурсы.ВыгружатьПриОткрытии = ИСТИНА";

		Запрос.УстановитьПараметр("ЭлектронныйРесурс", Параметры.СводЗнаний);

		Результат = Запрос.Выполнить();

		ЗначениеВРеквизитФормы(Результат.Выгрузить(), "ЗависимыеРесурсы");

	КонецЕсли;
	
	// Заполняем навигационное дерево
	//
	
	// Получаем выгрузку элементов содержания
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СодержаниеСУЗ.Ссылка КАК Ссылка,
		|	СодержаниеСУЗ.СсылкаНаЭлемент КАК СсылкаНаЭлемент,
		|	СодержаниеСУЗ.Наименование КАК Наименование,
		|	СодержаниеСУЗ.ЭтоГруппа,
		|	СодержаниеСУЗ.Родитель КАК Группа
		|ИЗ
		|	Справочник.СодержаниеСУЗ КАК СодержаниеСУЗ
		|ГДЕ
		|	СодержаниеСУЗ.Владелец = &ЭлектронныйРесурс
		|	И СодержаниеСУЗ.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	СодержаниеСУЗ.Код ИЕРАРХИЯ,
		|	Наименование ИЕРАРХИЯ";

	Запрос.УстановитьПараметр("ЭлектронныйРесурс", Параметры.СводЗнаний);

	Результат = Запрос.Выполнить();

	ДеревоСодержанияВыгрузка = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	// Получаем избранное пользователя

	ТаблицаИзбранное = РегистрыСведений.ИзбранноеПользователейСУЗ.ТаблицаИзбранного(ТекущийПользователь);
	
	// Получаем дополнительные материалы пользователя

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДополнительныеМатериалыПользователейСУЗСрезПоследних.ЭлементСодержания
		|ИЗ
		|	РегистрСведений.ДополнительныеМатериалыПользователейСУЗ.СрезПоследних(
		|			,
		|			Общий = ИСТИНА
		|					И НЕ &ПоказыватьПослеПроверки
		|				ИЛИ Общий = ИСТИНА
		|					И Проверено = ИСТИНА
		|					И &ПоказыватьПослеПроверки
		|				ИЛИ Автор = &ТекущийПользователь) КАК ДополнительныеМатериалыПользователейСУЗСрезПоследних";

	Запрос.УстановитьПараметр("ПоказыватьПослеПроверки", Константы.ПоказыватьОбщиеДополнительныеМатериалыПослеПроверкиСУЗ.Получить());
	Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);

	Результат = Запрос.Выполнить();

	ТаблицаДопМатериалы = Результат.Выгрузить();

	// Получаем данные о прохождении
	
	ПользовательПрохождения = ТекущийПользовательПрохождения(Параметры.РежимПросмотра, Параметры.ПрохождениеОбучения, ТекущийПользователь);
	
	ТаблицаПрохождений = РегистрыСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПопыткиПрохождения(
		ПользовательПрохождения, Параметры.ПрохождениеОбучения, Параметры.Задание, Параметры.СводЗнаний);  
	
	// Формируем итоговое дерево содержания и выводим его в форму	
	
	ДеревоСодержания = Новый ДеревоЗначений();
	
	ДеревоСодержания.Колонки.Добавить("Ссылка");
	ДеревоСодержания.Колонки.Добавить("СсылкаНаЭлемент");
	ДеревоСодержания.Колонки.Добавить("Наименование");
	ДеревоСодержания.Колонки.Добавить("ЭтоГруппа");
	ДеревоСодержания.Колонки.Добавить("КартинкаДополнительногоМатериала");
	ДеревоСодержания.Колонки.Добавить("Картинка");
	ДеревоСодержания.Колонки.Добавить("Пройдено");
    ДеревоСодержания.Колонки.Добавить("Отмечено");
	ДеревоСодержания.Колонки.Добавить("ЭтоКорень");
	
	КореньДереваСодержания = ДеревоСодержания.Строки.Добавить();
	КореньДереваСодержания.Ссылка = Параметры.СводЗнаний;
	КореньДереваСодержания.СсылкаНаЭлемент = Параметры.СводЗнаний;
	КореньДереваСодержания.Наименование = НСтр("ru = 'Начало'");
	КореньДереваСодержания.КартинкаДополнительногоМатериала = 1;
	КореньДереваСодержания.ЭтоКорень = Истина;
	КореньДереваСодержания.Отмечено = Ложь;
	КореньДереваСодержания.Пройдено = Истина;
	
	ИндексСтрокиДС = 0;
	
	НоваяСтрокаАЭС = АдресаЭлементовСодержания.Добавить();
	НоваяСтрокаАЭС.Адрес = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(Параметры.СводЗнаний);
    НоваяСтрокаАЭС.ЭлементСодержания = Справочники.СодержаниеСУЗ.ПустаяСсылка();
	НоваяСтрокаАЭС.Индекс = ИндексСтрокиДС;
	
	ПовторныеПрохождения = РегистрыСведений.ПовторноеПрохождениеЭлектронныхРесурсовСУЗ.ПовторныеПрохождения(ПользовательПрохождения, Параметры.ПрохождениеОбучения, Параметры.Задание); 
	
	ДобавитьЭлементыСодержанияВДерево(КореньДереваСодержания.Строки, ДеревоСодержанияВыгрузка.Строки, ТаблицаИзбранное, ТаблицаДопМатериалы, ТаблицаПрохождений,, ИндексСтрокиДС, ПовторныеПрохождения);
	
	Для каждого Строка Из КореньДереваСодержания.Строки Цикл
	
		Если НЕ Строка.Пройдено Тогда
			КореньДереваСодержания.Пройдено = Ложь;
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	
	КореньДереваСодержания.Картинка = ПолучитьКартинкуЭлементаСодержания(КореньДереваСодержания, Параметры.ПрохождениеОбучения); // Книга
	
	ЗначениеВРеквизитФормы(ДеревоСодержания, "НавигационноеДерево");
	
	// Ищем попытку выполнения статичного объекта, которая могла остаться при аварийном завершении программы
    //
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПопыткаВыполненияСтатичногоОбъектаСУЗ.Ссылка
		|ИЗ
		|	Документ.ПопыткаВыполненияСтатичногоОбъектаСУЗ КАК ПопыткаВыполненияСтатичногоОбъектаСУЗ
		|ГДЕ
		|	ПопыткаВыполненияСтатичногоОбъектаСУЗ.ПрохождениеОбучения = &ПрохождениеОбучения
		|	И ПопыткаВыполненияСтатичногоОбъектаСУЗ.Задание = &Задание
		|	И ПопыткаВыполненияСтатичногоОбъектаСУЗ.СводЗнаний = &СводЗнаний
		|	И ПопыткаВыполненияСтатичногоОбъектаСУЗ.Пользователь = &Пользователь
		|	И ПопыткаВыполненияСтатичногоОбъектаСУЗ.ПопыткаЗавершена = ЛОЖЬ
		|	И ПопыткаВыполненияСтатичногоОбъектаСУЗ.ПометкаУдаления = ЛОЖЬ
		|	И ПопыткаВыполненияСтатичногоОбъектаСУЗ.Отменено = ЛОЖЬ";

	Запрос.УстановитьПараметр("Задание", Параметры.Задание);
	Запрос.УстановитьПараметр("Пользователь", ТекущийПользовательПрохождения(Параметры.РежимПросмотра, Параметры.ПрохождениеОбучения, ТекущийПользователь));
	Запрос.УстановитьПараметр("ПрохождениеОбучения", Параметры.ПрохождениеОбучения);
	Запрос.УстановитьПараметр("СводЗнаний", Параметры.СводЗнаний);
	
	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбъектыСУЗ.ЗавершитьПопыткуВыполненияСтатичногоОбъекта(ВыборкаДетальныеЗаписи.Ссылка);
		КонецЦикла;
		
	КонецЕсли;
	
	// Выгружаем общий ресурс в каталог ресурсов свода знаний на сервере.
	//
	
	Если НЕ ИспользуетсяКэшНаКлиенте Тогда
		
		ОбщегоНазначенияСУКлиентСервер.ВыгрузитьОбщийРесурсВКэш(ПутьКОбщемуКаталогу, ИмяКаталогаРесурсов, ПредпочитаемыйПоставщик);
		
		Если ЗависимыеРесурсы.Количество() > 0 Тогда
			
			МассивРесурсовДляВыгрузки = Новый Массив();
			
			Для каждого Строка Из ЗависимыеРесурсы Цикл
				МассивРесурсовДляВыгрузки.Добавить(ОбъектыСУЗ.ПолучитьСтруктуруРесурса(Строка.Ресурс));
			КонецЦикла;
			
			ОбщегоНазначенияСУКлиентСервер.ВыгрузитьРесурсыВКэш(МассивРесурсовДляВыгрузки, ПутьККаталогуРесурсов, ПредпочитаемыйПоставщик, Параметры.СводЗнаний);
			
		КонецЕсли;
			
	КонецЕсли;
	
	// Устанавливаем заголовок по умолчанию для формы.
	//
	
	Если ЗначениеЗаполнено(Параметры.Заголовок) Тогда
		
		ЗаголовокПоУмолчанию = Параметры.Заголовок;
		
	Иначе
	
		Если ЗначениеЗаполнено(Параметры.СводЗнаний) Тогда
			
			Если ЗначениеЗаполнено(Параметры.АдресОбъекта)
				И ТипЗнч(Параметры.АдресОбъекта) <> Тип("Строка") Тогда
				ЗаголовокПоУмолчанию = Параметры.СводЗнаний.Наименование + " (" + Параметры.АдресОбъекта.Наименование + ")";
			Иначе
				ЗаголовокПоУмолчанию = Параметры.СводЗнаний.Наименование;
			КонецЕсли;
			
		Иначе
			
			Если ЗначениеЗаполнено(Параметры.АдресОбъекта)
				И ТипЗнч(Параметры.АдресОбъекта) <> Тип("Строка") Тогда
				
				ЗаголовокПоУмолчанию = "Просмотр " + """" + Параметры.АдресОбъекта.Наименование + """";
				
			Иначе
				
				ЗаголовокПоУмолчанию = "Просмотр элемента";
				
			КонецЕсли;		
				
		КонецЕсли;
		
	КонецЕсли;
		
	// Загружаем из настроек сохраняемые реквизиты.
	//
	
	ДанныеНастроек = ХранилищеСистемныхНастроек.Загрузить(ЭтотОбъект.ИмяФормы+"/ТекущиеДанные");
	
	Если ДанныеНастроек <> Неопределено Тогда
		ДополнительныеМатериалыВидны = ДанныеНастроек.Получить("ДополнительныеМатериалыВидны");
	КонецЕсли;
	
	// Устанавливаем начальное состояние элементов формы.
	//
	
	НавигацияДоступна = Истина;
	
	УстановитьДоступностьЭлементовФормыНаСервере(НастройкиПредыдущегоПрохождения);
	
	ДатаОткрытияФормы = ТекущаяДата();	
	
	ЭлектронныеРесурсыПереопределяемый.ПриПросмотреЭлектронногоРесурса(Параметры.СводЗнаний, Параметры.ПрохождениеОбучения, Параметры.Задание);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если ВебКлиент Тогда
	Если НРег(Лев(АдресКаталогаРесурсов, СтрДлина("http"))) = "http" Тогда
		АдресКаталогаРесурсовСтруктура = ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресКаталогаРесурсов);
		АдресКаталогаРесурсов = "/" + АдресКаталогаРесурсовСтруктура.ПутьНаСервере;
	КонецЕсли;
	#КонецЕсли
	
	УстановитьЗаголовокФормы();
	
	// Выгружаем общий ресурс в каталог ресурсов свода знаний на клиенте.
	
	Если ИспользуетсяКэшНаКлиенте Тогда
		
		ОбщегоНазначенияСУКлиентСервер.ВыгрузитьОбщийРесурсВКэш(ПутьКОбщемуКаталогу, ИмяКаталогаРесурсов, ПредпочитаемыйПоставщик);
		
		Если ЗависимыеРесурсы.Количество() > 0 Тогда
			
			МассивРесурсовДляВыгрузки = Новый Массив();
			
			Для каждого Строка Из ЗависимыеРесурсы Цикл
				МассивРесурсовДляВыгрузки.Добавить(Новый Структура("Ресурс, Размер", Строка.Ресурс, Строка.Размер));	
			КонецЦикла;
			
			МассивРесурсовДляВыгрузки = Новый ФиксированныйМассив(МассивРесурсовДляВыгрузки);
			
			ОписаниеРесурсовДляВыгрузки = ПолучитьОписаниеРесурсовДляВыгрузки(МассивРесурсовДляВыгрузки);
			
			ОбщегоНазначенияСУКлиентСервер.ВыгрузитьРесурсыВКэш(ОписаниеРесурсовДляВыгрузки, ПутьККаталогуРесурсов, ПредпочитаемыйПоставщик, Параметры.СводЗнаний, Отказ);
			
		КонецЕсли;
		
		ПодключитьОбработчикОжидания("Подключаемый_ВыполнитьПроверкуОбщегоКаталога", 0.1, Истина);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.АдресОбъекта) Тогда
		
		Если ТипЗнч(Параметры.АдресОбъекта) = Тип("Строка") Тогда
			Адрес = Параметры.АдресОбъекта;
		Иначе
			Адрес = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(Параметры.АдресОбъекта);
		КонецЕсли;
		
		Адрес = ?(Лев(Адрес, 1) = "?", "", "?") + Адрес;
		
	ИначеЕсли ЗначениеЗаполнено(ТекущийЭлементСодержания) Тогда
		
		Адрес = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(ТекущийЭлементСодержания);
		
	Иначе
		
		Адрес = "";
		
	КонецЕсли;
	
	ПропуститьАктивациюЭлементаСодержания = Истина;
	
	УстановитьТекущийОбъект(Адрес);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы = Неопределено Тогда
		ЗавершениеРаботы = Ложь;
	КонецЕсли;
	
	Если ЗавершениеРаботы Тогда			
		Отказ = Истина;			
		ТекстПредупреждения = НСтр("ru = 'Изучение электронного курса будет прервано без сохранения последних результатов.
		|Перед выходом из программы закройте все открытые электронные курсы для сохранения данных об изучении.'");			
		Возврат;
	КонецЕсли;
	
	Если ВыполняетсяТестирование И ЗначениеЗаполнено(СессияТестирования) Тогда
		Отказ = Истина;
		СпроситьОЗакрытииСессииТестирования("Закрыть");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	Если ЗавершениеРаботы = Неопределено Тогда
		ЗавершениеРаботы = Ложь;
	КонецЕсли;
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьДействияПриЗакрытии(ПопыткаВыполненияСтатичногоОбъекта,
	                             Параметры,
								 Комментарий,
								 ТекущийЭлементСодержания,
								 Элементы.НавигационноеДерево.Видимость,
								 ЗначенияНастроекЭР,
								 Параметры.РежимПросмотра,
								 ТекущийПользователь,
								 Параметры.ПрохождениеОбучения);
	
	Если ЗначениеЗаполнено(Параметры.ПрохождениеОбучения) Тогда
		Оповестить("ОбновитьПрохождениеОбучения", Параметры.ПрохождениеОбучения, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(НовыйОбъект)
		ИЛИ ТипЗнч(НовыйОбъект) = Тип("РегистрСведенийКлючЗаписи.УчебныеБазыСУЗ") Тогда
		Возврат;
	КонецЕсли;
	
	НовыйЭлементИнформация = ЗаписатьДополнительныйМатериал(,,?(ЗначениеЗаполнено(ТекущийЭлементСодержания), ТекущийЭлементСодержания, Параметры.СводЗнаний), НовыйОбъект, ТекущийПользователь);
	
	НоваяСтрока = ДополнительныеМатериалы.Добавить();
	
	Для каждого Колонка Из КолонкиТаблицыДополнительныеМатериалы Цикл
//		Если НовыйЭлементИнформация.Свойство(Колонка) Тогда
			НоваяСтрока[Колонка] = НовыйЭлементИнформация[Колонка];
//		КонецЕсли;
	КонецЦикла;
	
	Элементы.НавигационноеДерево.ТекущиеДанные.КартинкаДополнительногоМатериала = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбъектСУЗЗаписан"
		И Источник <> ЭтотОбъект
		И ЗначениеЗаполнено(Параметр) Тогда
		
		// Оповещение срабатывает, когда был отредактирован
		// ОбъектСУЗ дополнительного материала и требуется обновить
		// Его наименование.
		
		ДополнительныйМатериалНайден = Ложь;
		
		Для каждого Строка Из ДополнительныеМатериалы Цикл
		
			Если Строка.СсылкаНаОбъектСУЗ = Параметр Тогда
				ДополнительныйМатериалНайден = Истина;
				Прервать;
			КонецЕсли;
		
		КонецЦикла;
		
		Если ДополнительныйМатериалНайден Тогда
			
			ДополнительныйМатериалИнформация = ЗаписатьДополнительныйМатериал(Строка.Дата, Строка.Автор, ?(ЗначениеЗаполнено(ТекущийЭлементСодержания), ТекущийЭлементСодержания, Параметры.СводЗнаний), Строка.СсылкаНаОбъектСУЗ, ТекущийПользователь);
			
			Если ДополнительныйМатериалИнформация <> Неопределено Тогда
				Строка.Наименование = ДополнительныйМатериалИнформация.Наименование;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяСобытия = Строка("goToLink_" + Строка(УникальныйИдентификатор)) Тогда
		УстановитьТекущийОбъект(Параметр);
		Активизировать();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

// Навигация

&НаКлиенте
Процедура Назад(Команда)
	Элементы.ОбластьПросмотра.Назад();
КонецПроцедуры

&НаКлиенте
Процедура Вперед(Команда)
	Элементы.ОбластьПросмотра.Вперед();
КонецПроцедуры

&НаКлиенте
Процедура НавигацияВперед(Команда)
	ТекущийЭлементСодержания = СледующийЭлементСодержания;  // Сохраняем в реквизите
	ПропуститьАктивациюЭлементаСодержания = Истина;
	Если Элементы.НавигационноеДерево.Видимость Тогда
		Элементы.НавигационноеДерево.ТекущаяСтрока = ПолучитьИндексЭлементаСодержания(ТекущийЭлементСодержания);
	КонецЕсли;
	УстановитьТекущийОбъект(ТекущийЭлементСодержания);
КонецПроцедуры

&НаКлиенте
Процедура НавигацияНазад(Команда)
	ТекущийЭлементСодержания = ПредыдущийЭлементСодержания; // Сохраняем в реквизите
	ПропуститьАктивациюЭлементаСодержания = Истина;
	Если Элементы.НавигационноеДерево.Видимость Тогда
		Элементы.НавигационноеДерево.ТекущаяСтрока = ПолучитьИндексЭлементаСодержания(ТекущийЭлементСодержания);
	КонецЕсли;
	УстановитьТекущийОбъект(ТекущийЭлементСодержания);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьНавигационноеДерево(Команда)
	
	Если НЕ ВозможноОтобразитьСодержание Тогда
		Возврат;
	КонецЕсли;
	
	ПропуститьАктивациюЭлементаСодержания = Истина;
	АдресЗагруженногоОбъекта = "";
	
	Кнопка = Элементы.ПоказатьСкрытьНавигационноеДерево;
	
	Кнопка.Пометка = ?(Кнопка.Пометка, Ложь, Истина);
	Кнопка.ЦветФона = ?(Кнопка.Пометка, Новый Цвет(235, 231, 205), Новый Цвет(245, 242, 221));
	Элементы.НавигационноеДерево.Видимость = ?(Кнопка.Пометка, Истина, Ложь);
	Элементы.ДобавитьВИзбранное.Видимость = ?(Кнопка.Пометка, Истина, Ложь);

	Если Элементы.НавигационноеДерево.Видимость Тогда
		Элементы.НавигационноеДерево.ТекущаяСтрока = ПолучитьИндексЭлементаСодержания(ТекущийЭлементСодержания);
		ПропуститьФормированиеКорневогоДокумента = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВИзбранное(Команда)
	
	ДобавитьИлиУдалитьЭлементСодержанияВИзбранном(ТекущийЭлементСодержания, ТекущийПользователь);
	
	ТекущиеДанные          = Элементы.НавигационноеДерево.ТекущиеДанные; 
	ТекущиеДанные.Отмечено = НЕ ТекущиеДанные.Отмечено;
	ТекущиеДанные.Картинка = ПолучитьКартинкуЭлементаСодержания(ТекущиеДанные, Параметры.ПрохождениеОбучения)
	
КонецПроцедуры

&НаКлиенте
Процедура Комментарий(Команда)
	
	ПропуститьАктивациюЭлементаСодержания = Истина;
	ПропуститьФормированиеКорневогоДокумента = Истина;
	
	АдресЗагруженногоОбъекта = "";
	
	Кнопка = Элементы.КомандаКомментарий;
	Кнопка.Пометка  = ?(Кнопка.Пометка, Ложь, Истина);
	Кнопка.ЦветФона = ?(Кнопка.Пометка, Новый Цвет(235, 231, 205), Новый Цвет(245, 242, 221));
	
	Элементы.Комментарий.Видимость = ?(Кнопка.Пометка, Истина, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СправочнаяИнформация(Команда)
	ОбъектыСУЗКлиент.ОткрытьОбозреватель(,СправочнаяИнформация,,,,,,Истина,,Параметры.ТекущийПользователь,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура Глоссарий(Команда)
	ОбъектыСУЗКлиент.ОткрытьОбозреватель(,Глоссарий,,,,,,Истина,,Параметры.ТекущийПользователь,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	
	ПропуститьАктивациюЭлементаСодержания = Истина;
	ПропуститьФормированиеКорневогоДокумента = Истина;
	
	АдресЗагруженногоОбъекта = "";
	
	Кнопка = Элементы.КомандаНастройки;
	Кнопка.Пометка  = ?(Кнопка.Пометка, Ложь, Истина);
	Кнопка.ЦветФона = ?(Кнопка.Пометка, Новый Цвет(235, 231, 205), Новый Цвет(245, 242, 221));
	
	Элементы.ЗначенияНастроекЭР.Видимость = ?(Кнопка.Пометка, Истина, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолнотекстовыйПоиск(Команда)
	
	ПараметрыФормы = Новый Структура("ЭлектронныйРесурс_СУ, ФормаДляОповещения_СУ", Параметры.СводЗнаний, Строка(УникальныйИдентификатор));
	 
	РезультатПоиска = ОткрытьФорму("Обработка.ПолнотекстовыйПоискВДанных.Форма", ПараметрыФормы, ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.Независимый);
	 
КонецПроцедуры

// Дополнительные материалы

&НаКлиенте
Процедура ДополнительныеМатериалы(Команда=Неопределено)
	
	ПропуститьАктивациюЭлементаСодержания = Истина;
	ПропуститьФормированиеКорневогоДокумента = Истина;
	
	АдресЗагруженногоОбъекта = "";
	
	Кнопка = Элементы.КомандаДополнительныеМатериалы;
	Кнопка.Пометка  = ?(Кнопка.Пометка, Ложь, Истина);
	Кнопка.ЦветФона = ?(Кнопка.Пометка, Новый Цвет(235, 231, 205), Новый Цвет(245, 242, 221));
	
	Элементы.ГруппаДополнительныеМатериалы.Видимость = ?(Кнопка.Пометка, Истина, Ложь);

	ДополнительныеМатериалыВидны = Элементы.ГруппаДополнительныеМатериалы.Видимость;
	
	ОтобразитьТекущийОбъект();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтраницуВДополнительныеМатериалы(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("Родитель", ГруппаОбщиеСтраницы));
	
	ОткрытьФорму("Справочник.СтраницыСУЗ.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлВДополнительныеМатериалы(Команда)
	
	ПараметрыФормы = Новый Структура("РодительРесурса", ГруппаОбщиеРесурсы);
	ОткрытьФорму("Справочник.ФайлыСУЗ.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьЭлементДополнительныхМатериалов(Команда)
	
	ТекущиеДанные = Элементы.ДополнительныеМатериалы.ТекущиеДанные;
	
	Если НЕ ОбщегоНазначенияСУКлиент.ТекущиеДанныеТаблицыДоступны(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.СсылкаНаОбъектСУЗ) Тогда
		ПоказатьЗначение(, ТекущиеДанные.СсылкаНаОбъектСУЗ);
	Иначе
		Оповещение = Новый ОписаниеОповещения("РедактироватьЭлементДополнительныхМатериаловПродолжение", ЭтотОбъект, Новый Структура("Дата, Автор", ТекущиеДанные.Дата, ТекущиеДанные.Автор));
		ПоказатьВводСтроки(Оповещение, ТекущиеДанные.Текст, НСтр("ru = 'Текст дополнительного материала'"), 0, Истина);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьЭлементДополнительныхМатериаловПродолжение(Текст, ДопПараметры) Экспорт
	
	Если Текст = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ДопПараметры.Автор <> ТекущийПользователь Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Запрещено редактировать общий материал другого автора'"));
	КонецЕсли;
	
	ДополнительныйМатериалНайден = Ложь;
		
	Для каждого Строка Из ДополнительныеМатериалы Цикл
	
		Если Строка.Дата = ДопПараметры.Дата Тогда
			ДополнительныйМатериалНайден = Истина;
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	
	Если ДополнительныйМатериалНайден Тогда	
	
		ДополнительныйМатериалИнформация = ЗаписатьДополнительныйМатериал(ДопПараметры.Дата, ДопПараметры.Автор, ?(ЗначениеЗаполнено(ТекущийЭлементСодержания), ТекущийЭлементСодержания, Параметры.СводЗнаний),,ТекущийПользователь, Текст);
		
		Если ДополнительныйМатериалИнформация <> Неопределено Тогда
			Строка.Наименование = ДополнительныйМатериалИнформация.Текст;
			Строка.Текст        = ДополнительныйМатериалИнформация.Текст;
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЭлементИзДополнительныхМатериалов(Команда)

	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьДополнительныйМатериалПродолжение", ЭтотОбъект);		
	
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Удалить дополнительный материал?'"), РежимДиалогаВопрос.ДаНет, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДополнительныйМатериалПродолжение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
	    Возврат;
	КонецЕсли;
		
	ТекущиеДанные = Элементы.ДополнительныеМатериалы.ТекущиеДанные;
	
	Если НЕ ОбщегоНазначенияСУКлиент.ТекущиеДанныеТаблицыДоступны(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьДополнительныйМатериал(ТекущиеДанные.Дата, ?(ЗначениеЗаполнено(ТекущийЭлементСодержания), ТекущийЭлементСодержания, Параметры.СводЗнаний));
	
	СтрокаДляУдаления = ДополнительныеМатериалы.НайтиПоИдентификатору(Элементы.ДополнительныеМатериалы.ТекущаяСтрока);
	ДополнительныеМатериалы.Удалить(СтрокаДляУдаления);	
	
	Элементы.НавигационноеДерево.ТекущиеДанные.КартинкаДополнительногоМатериала = ?(ДополнительныеМатериалы.Количество() = 0, 1, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДополнительныйМатериалКакОбщий(Команда)
	
	ТекущиеДанные = Элементы.ДополнительныеМатериалы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьНастройкиДополнительногоМатериала(ТекущиеДанные.Дата,
											  ?(ЗначениеЗаполнено(ТекущийЭлементСодержания), ТекущийЭлементСодержания, Параметры.СводЗнаний),
											  ?(ТекущиеДанные.Общий, Ложь, Истина));
											  
	ТекущиеДанные.Общий    = ?(ТекущиеДанные.Общий, Ложь, Истина);
	ТекущиеДанные.Картинка = ?(ТекущиеДанные.Общий, 0, 1);
											  
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОбластьПросмотраДокументСформирован(Элемент)
	
	ОбщегоНазначенияСУКлиент.ОпределитьБраузер(ЭтотОбъект, Элемент.Документ);
	
	Если НЕ ЗначениеЗаполнено(Браузер) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаПоиска = ПолучитьСтрокуПоискаДокумента();
	
	Если ПропуститьФормированиеКорневогоДокумента Тогда
		
		ПропуститьФормированиеКорневогоДокумента = Ложь;
		
		Если СтрокаПоиска = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(Параметры.СводЗнаний) Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбластьПросмотраЗагружена = Истина;
	
	ДобавитьОбработчик Элемент.Документ.onkeypress, ДокументПриНажатииКлавиши;
	
	Если АдресЗагруженногоОбъекта <> СтрокаПоиска Тогда
		ОтобразитьТекущийОбъект();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументПриНажатииКлавиши(ДанныеСобытия) Экспорт	
	ОбработатьСобытиеОбластиПросмотра();
КонецПроцедуры

&НаКлиенте
Процедура ОбластьПросмотраПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)	
	ОбработатьСобытиеОбластиПросмотра();	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСобытиеОбластиПросмотра()
	
	// Делаем необходимые проверки и получаем URL объекта.
	
	Если НЕ ОбластьПросмотраЗагружена Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеКоманды <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеКоманды = ОбщегоНазначенияСУКлиент.ПолучитьДанныеКоманды(Элементы.ОбластьПросмотра.Документ, Браузер); // Реквизит
	
	Если ДанныеКоманды = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Найти(ДанныеКоманды.Параметры, "action=SCORequest") > 0 
		ИЛИ ОбщегоНазначенияСУКлиент.ЭтоВстроенныйWeKit(Браузер) Тогда
		ВыполнитьДействие();
	Иначе
		ПодключитьОбработчикОжидания("ВыполнитьДействие", 0.01, Истина); //Web-client 404 bug
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ "НавигационноеДерево"

&НаКлиенте
Процедура НавигационноеДеревоПриАктивизацииСтроки(Элемент)
	
	Если ПропуститьАктивациюЭлементаСодержания Тогда
		ПропуститьАктивациюЭлементаСодержания = Ложь;
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		АктивированныйЭлементСодержания = Элемент.ТекущиеДанные.Ссылка;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("АктивироватьЭлементСодержания", 0.01, Истина); //V8 bug

КонецПроцедуры

&НаКлиенте
Процедура АктивироватьЭлементСодержания()
	
	Если ВыполняетсяТестирование И ЗначениеЗаполнено(СессияТестирования) Тогда
		СпроситьОЗакрытииСессииТестирования("АктивироватьЭлементСодержанияПродолжение");
	Иначе
		АктивироватьЭлементСодержанияПродолжение();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьЭлементСодержанияПродолжение()
	
	УстановитьТекущийОбъект(АктивированныйЭлементСодержания);
	АктивированныйЭлементСодержания = Неопределено;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ "ДополнительныеМатериалы"

&НаКлиенте
Процедура ДополнительныеМатериалыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.СсылкаНаОбъектСУЗ) Тогда
		ОбъектыСУЗКлиент.ОткрытьОбозреватель(, ТекущиеДанные.СсылкаНаОбъектСУЗ, Истина,,,,, Истина, Параметры.ТекущийПользователь,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Оповещение = Новый ОписаниеОповещения("РедактироватьЭлементДополнительныхМатериаловПродолжение", ЭтотОбъект, Новый Структура("Дата, Автор", ТекущиеДанные.Дата, ТекущиеДанные.Автор));
		ПоказатьВводСтроки(Оповещение, ТекущиеДанные.Текст, НСтр("ru = 'Текст дополнительного материала'"), 0, Истина);				
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеМатериалыПриАктивизацииСтроки(Элемент)
	
	Если ЕстьПравоИзмененияОбщихДополнительныхМатериалов Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Автор <> ТекущийПользовательСеанса Тогда
		Элементы.УстановитьДополнительныйМатериалКакОбщий.Доступность     = Ложь;
		Элементы.РедактироватьЭлементДополнительныхМатериалов.Доступность = Ложь;
		Элементы.УдалитьЭлементИзДополнительныхМатериалов.Доступность     = Ложь;
	Иначе
		Элементы.УстановитьДополнительныйМатериалКакОбщий.Доступность     = Истина;
		Элементы.РедактироватьЭлементДополнительныхМатериалов.Доступность = Истина;
		Элементы.УдалитьЭлементИзДополнительныхМатериалов.Доступность     = Истина;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

ПропуститьАктивациюЭлементаСодержания    = Ложь;
ПропуститьФормированиеКорневогоДокумента = Ложь;

КолонкиТаблицыДополнительныеМатериалы = Новый Массив();
КолонкиТаблицыДополнительныеМатериалы.Добавить("Наименование");
КолонкиТаблицыДополнительныеМатериалы.Добавить("Автор");
КолонкиТаблицыДополнительныеМатериалы.Добавить("Дата");
КолонкиТаблицыДополнительныеМатериалы.Добавить("СсылкаНаОбъектСУЗ");
КолонкиТаблицыДополнительныеМатериалы.Добавить("НаименованиеАвтора");
КолонкиТаблицыДополнительныеМатериалы.Добавить("Картинка");
КолонкиТаблицыДополнительныеМатериалы.Добавить("Общий");
КолонкиТаблицыДополнительныеМатериалы.Добавить("Текст");