
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьПравоИзменения = ПравоДоступа("Изменение", Метаданные.Справочники.СводыЗнанийСУЗ);
	
	УстановитьНачальнуюДоступностьЭлементовФормы();
	
	Список.Параметры.УстановитьЗначениеПараметра("Отсутствует", НСтр("ru = 'Отсутствует'"));
	Список.Параметры.УстановитьЗначениеПараметра("ТребуетОбновления", НСтр("ru = 'Требует обновления'"));
	Список.Параметры.УстановитьЗначениеПараметра("Актуальна", НСтр("ru = 'Актуальна'"));
	Список.Параметры.УстановитьЗначениеПараметра("ПустаяСтрока", "");
	Список.Параметры.УстановитьЗначениеПараметра("ЖелательноОбновить", НСтр("ru = 'Желательно обновить'"));
	Список.Параметры.УстановитьЗначениеПараметра("ДатаСущественныхИзмененийМакетов", 
		Обработки.ПубликацияЭлектронныхРесурсовСУЗ.ДатаСущественногоИзмененияМакетов());

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ШаблоныДокументов.Видимость = РазработкаСУЗКлиент.ЕстьПоддержкаДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "НастройкиЭлектронныхРесурсовИзменены" Тогда
		УстановитьНачальнуюДоступностьЭлементовФормы();
	КонецЕсли;
	
	Если ИмяСобытия = "ЭлектронныйРесурсЗаписан"
		ИЛИ ИмяСобытия = "ЭлектронныйРесурсОпубликован"
		ИЛИ ИмяСобытия = "НастройкиЭлектронныхРесурсовИзменены" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ИспользоватьВстроенныйПлеерВебКабинета(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИспользоватьВстроенныйПлеерВебКабинетаНаСервере(ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьАвтономныйПлеерВебКабинета(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Успех = Ложь;
	ПроведенияОбученияСоВстроеннымПлеером = Новый Массив;	
	ИспользоватьАвтономныйПлеерВебКабинетаНаСервере(ТекущиеДанные.Ссылка, Успех, ПроведенияОбученияСоВстроеннымПлеером);
	Если НЕ Успех Тогда
		ТекстВопроса = НСтр("ru = 'Для смены встроенного плеера требуется отменить или завершить проведения обучения, использующие его. Показать их?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ИспользоватьАвтономныйПлеерВебКабинетаПродолжение", ЭтотОбъект, ПроведенияОбученияСоВстроеннымПлеером);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьАвтономныйПлеерВебКабинетаПродолжение(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Ссылка", Параметры));
	ОткрытьФорму("Документ.ПроведениеОбученияСУО.ФормаСписка", ПараметрыФормы, ЭтотОбъект);


КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Список

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если НЕ ОбщегоНазначенияСУКлиент.ТекущиеДанныеТаблицыДоступны(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЕстьПравоИзменения Тогда
		СтандартнаяОбработка = Ложь;
        ОбъектыСУЗКлиент.ОткрытьОбозреватель(ТекущиеДанные.Ссылка);
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Тип = ПредопределенноеЗначение("Перечисление.ТипыЭлектронныхРесурсовСУЗ.Тест") Тогда
		
		Подборка = ПодборкаТеста(ТекущиеДанные.Ссылка);
		
		Если ЗначениеЗаполнено(Подборка) Тогда
		
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура("Ключ, ЭлектронныйРесурс", Подборка, ТекущиеДанные.Ссылка);
			ОткрытьФорму("Справочник.ПодборкиСУЗ.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
			Возврат;
			
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Публикации(Команда)
	ОткрытьФорму("РегистрСведений.ПубликацииЭлектронныхРесурсовСУЗ.ФормаСписка");
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Вопросы(Команда)
	ОткрытьФорму("Справочник.ВопросыСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Глоссарии(Команда)
	ОткрытьФорму("Справочник.ГлоссарииСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Подборки(Команда)
	ОткрытьФорму("Справочник.ПодборкиСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Страницы(Команда)
	ОткрытьФорму("Справочник.СтраницыСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Термины(Команда)
	ОткрытьФорму("Справочник.ТерминыСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Файлы(Команда)
	ОткрытьФорму("Справочник.ФайлыСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Фреймы(Команда)
	ОткрытьФорму("Справочник.ФреймыСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Ресурсы(Команда)
	ОткрытьФорму("Справочник.РесурсыСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Рубрикаторы(Команда)
	ОткрытьФорму("Справочник.РубрикаторыСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ПоставщикиРесурсов(Команда)
	ОткрытьФорму("Справочник.ПоставщикиСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныКарт(Команда)
	ОткрытьФорму("Справочник.КартыСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныОформления(Команда)
	ОткрытьФорму("Справочник.ШаблоныСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныТекста(Команда)
	ОткрытьФорму("Справочник.ШаблоныТекстаСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныДокументов(Команда)
	ОткрытьФорму("Справочник.ШаблоныДокументовСУЗ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура КонвертерВидео(Команда)
	ОткрытьФорму("Справочник.ФайлыСУЗ.Форма.ФормаКонвертерВидео");
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьНачальнуюДоступностьЭлементовФормы()

	Если НЕ ЕстьПравоИзменения Тогда		
		Элементы.КоманднаяПанельИнструменты.Видимость = Ложь;	
	КонецЕсли;
			
	ИспользоватьВебКабинет = ПолучитьФункциональнуюОпцию("ИспользоватьВебКабинетСУ"); //--# КОНСТРУКТОР КУРСОВ: Заменить на ЛОЖЬ
	Элементы.ПубликацияАктуальна.Видимость = ИспользоватьВебКабинет;
	Элементы.ПубликацияОтсутствует.Видимость = ИспользоватьВебКабинет;
	Элементы.СтатусПубликации.Видимость = ИспользоватьВебКабинет;
	
	ИспользоватьВстроенныйПлеерКурсовВебКабинета = РазработкаСУЗ.ИспользоватьВстроенныйПлеерКурсовВебКабинета();
		
	Элементы.ПлеерВебКабинета.Видимость = ИспользоватьВстроенныйПлеерКурсовВебКабинета;
	Элементы.ВключитьПросмотрПлееромВебКабинета.Видимость = ИспользоватьВстроенныйПлеерКурсовВебКабинета;
	Элементы.ВыключитьПросмотрПлееромВебКабинета.Видимость = ИспользоватьВстроенныйПлеерКурсовВебКабинета;
	
	Список.Параметры.УстановитьЗначениеПараметра("Отсутствует", НСтр("ru = 'Отсутствует'"));
	Список.Параметры.УстановитьЗначениеПараметра("ТребуетОбновления", НСтр("ru = 'Требует обновления'"));
	Список.Параметры.УстановитьЗначениеПараметра("Актуальна", НСтр("ru = 'Актуальна'"));
	Список.Параметры.УстановитьЗначениеПараметра("ПустаяСтрока", "");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодборкаТеста(Знач ЭлектронныйРесурс)
	Возврат Справочники.СводыЗнанийСУЗ.Тест(ЭлектронныйРесурс);	
КонецФункции

&НаСервере
Процедура ИспользоватьВстроенныйПлеерВебКабинетаНаСервере(Знач ЭлектронныйРесурс)	
	РегистрыСведений.ПлеерКурсовВебКабинетаСУЗ.УстановитьИспользованиеВстроенногоПлеера(ЭлектронныйРесурс, Истина);
	Элементы.Список.Обновить();	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьАвтономныйПлеерВебКабинетаНаСервере(Знач ЭлектронныйРесурс, Успех, ПроведенияОбученияСоВстроеннымПлеером)
	РегистрыСведений.ПлеерКурсовВебКабинетаСУЗ.ОтменитьИспользованиеВстроенногоПлеера(ЭлектронныйРесурс, Успех, ПроведенияОбученияСоВстроеннымПлеером);
	Если Успех Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

