Процедура ДобавитьОтбор(Объект, Пользователь, Отбор) Экспорт
	
	ИдентификаторОтбора = Перечисления.ОтборыДанныхВебКабинетаСУО.Идентификатор(Отбор);
	
	НаборЗаписей = РегистрыСведений.ОтборыДанныхВебКабинетаСУО_П.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Отбор.Установить(ИдентификаторОтбора);
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);

	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Отбор = ИдентификаторОтбора;
	НоваяЗапись.Объект = Объект;
	НоваяЗапись.Пользователь = Пользователь;
	НоваяЗапись.ОтборСсылка = Отбор;
	НоваяЗапись.ДатаИзменения = ТекущаяДатаСеанса();

	НаборЗаписей.Записать();	
	
КонецПроцедуры

Процедура УдалитьОтбор(Объект, Пользователь=Неопределено, Отбор=Неопределено) Экспорт	
	
	НаборЗаписей = РегистрыСведений.ОтборыДанныхВебКабинетаСУО_П.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Объект.Установить(Объект);
	
	Если Пользователь <> Неопределено Тогда
		НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	КонецЕсли;
	
	Если Отбор <> Неопределено Тогда
		ИдентификаторОтбора = Перечисления.ОтборыДанныхВебКабинетаСУО.Идентификатор(Отбор);
		НаборЗаписей.Отбор.Отбор.Установить(ИдентификаторОтбора);
	КонецЕсли;	
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
