#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция АдресЦели(ЭлементСправочникаСсылки) Экспорт
	
	АдресЦели = "";
	
	Если ЗначениеЗаполнено(ЭлементСправочникаСсылки.СсылкаНаОбъектСУЗ) Тогда

		ДопСвойстваСсылки = Новый Структура();
		ДопСвойстваСсылки.Вставить("ЭлементПодборки", ЭлементСправочникаСсылки.ЭлементПодборки);
		ДопСвойстваСсылки.Вставить("ПривязатьКИдентификаторуЭлементаПодборки", Истина);
		
		АдресЦели = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(ЭлементСправочникаСсылки.СсылкаНаОбъектСУЗ, ЭлементСправочникаСсылки.ЦелевоеОкно, ЭлементСправочникаСсылки.Якорь, ДопСвойстваСсылки);

	Иначе

		АдресЦели = ЭлементСправочникаСсылки.ВнешняяСсылка;

		Если Найти(АдресЦели, "://") = 0 Тогда

			АдресЦели = ОбъектыСУзПовтИсп.АдресКаталогаОбъектов() + АдресЦели;
			АдресЦели = ОбщегоНазначенияСУКлиентСервер.ПривестиСлэши(АдресЦели);
			
		КонецЕсли;

	КонецЕсли;
	
	Возврат АдресЦели;
	
КонецФункции

Функция АдресСсылки(ЭлементСправочникаСсылки) Экспорт

	Если ЗначениеЗаполнено(ЭлементСправочникаСсылки) Тогда
		Возврат "?id=" + Строка(ЭлементСправочникаСсылки.УникальныйИдентификатор()) + "&action=openObjectLink";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли

