#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;		
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаОбъектСУЗ) И НЕ ЗначениеЗаполнено(ВнешняяСсылка) Тогда
		Текст = НСтр("ru = 'Укажите объект ссылки или адрес внешней ссылки'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
	КонецЕсли;
	
	УстановитьЗначенияРеквизитов();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура УстановитьЗначенияРеквизитов() Экспорт
	
	Если ЗначениеЗаполнено(СсылкаНаОбъектСУЗ) Тогда
		
		ИмяСправочникаОбъекта = СсылкаНаОбъектСУЗ.Метаданные().Имя;
		
		Если НЕ ИмяСправочникаОбъекта = "ПодборкиСУЗ" Тогда
			ЭлементПодборки = Справочники.ЭлементыПодборкиСУЗ.ПустаяСсылка();	
		КонецЕсли;
		
		Если ИмяСправочникаОбъекта = "ФайлыСУЗ" Тогда
			ЦелевоеОкно = Перечисления.ЦелевыеОкнаДляСсылокСУЗ.new;
		Иначе
			Якорь = "";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВнешняяСсылка) Тогда
		СсылкаНаОбъектСУЗ = Неопределено;
		ЦелевоеОкно = Перечисления.ЦелевыеОкнаДляСсылокСУЗ.new;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаНаОбъектСУЗ) И ЗначениеЗаполнено(ВнешняяСсылка) Тогда
		ВнешняяСсылка = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

