
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьЛичныйКабинетСУО") Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		
	// Заполняем переменные
	
	Пользователь = ?(ЗначениеЗаполнено(Параметры.Пользователь), Параметры.Пользователь, Пользователи.ТекущийПользователь());
	
	ЗаполнитьТаблицуОбучения();
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьМоеОбучение"
		ИЛИ ИмяСобытия = "ОбновитьПрохождениеОбучения" Тогда
		ЗаполнитьТаблицуОбучения();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМоеОбучение

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ МоеОбучение

&НаКлиенте
Процедура МоеОбучениеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = МоеОбучение.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если ТекущаяСтрока.Команда = "activity" ИЛИ ТекущаяСтрока.Команда = "teacherActivity" Тогда
		ОбучениеСУОКлиент.ОткрытьОбучение(ТекущаяСтрока.Ссылка);
	КонецЕсли;	
	
	Если ТекущаяСтрока.Команда = "application" Тогда
		ОбучениеСУОКлиент.ОткрытьЗаявку(ТекущаяСтрока.Ссылка, Пользователь);	
	КонецЕсли;
	
	Если ТекущаяСтрока.Команда = "free" Тогда		
		ОткрытьФорму("ОбщаяФорма.ЗаписьНаОбучениеСУО", Новый Структура("ПредметЗаписи", ТекущаяСтрока.Ссылка), ЭтаФорма);
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОбновитьМоеОбучение(Команда)
	ЗаполнитьТаблицуОбучения();
КонецПроцедуры

&НаКлиенте
Процедура МоиРезультаты(Команда)
	ОткрытьФорму("ОбщаяФорма.МоиРезультатыСУО");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаполнитьТаблицуОбучения()
	
	ЭтоПолныйИнтерфейс = ПолучитьФункциональнуюОпцию("ПолныйИнтерфейсСУО");

	// Очищаем таблицу
	
	МоеОбучение.Очистить();
	
	// Заполняем таблицу обучения
	
	РолиПользователя = ОбучениеСУОПовтИсп.СписокБазовыхПравПользователя(Пользователь);
	МассивЦветов = Новый Массив;
	ТекущаяДата = ТекущаяДатаСеанса();	
	
	Для каждого РольПользователя Из РолиПользователя Цикл
	
		Если РольПользователя = Перечисления.БазовыйРолиПользователейСУО.Учащийся Тогда
			
			ВыборкаДетальныеЗаписи = РегистрыСведений.РасписаниеОбученияСУО.ВыбратьЭлементыРасписания(Пользователь);
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				ОписаниеПрохождения = Документы.ПрохождениеОбученияСУО.УчебнаяАктивностьСтруктура(ВыборкаДетальныеЗаписи.ПрохождениеОбучения);
				
				НоваяСтрока = МоеОбучение.Добавить();
				НоваяСтрока.Ссылка = ВыборкаДетальныеЗаписи.ПрохождениеОбучения;
				НоваяСтрока.Представление = ОписаниеПрохождения.Наименование;
				НоваяСтрока.Цвет = ?(ЗначениеЗаполнено(ОписаниеПрохождения.Цвет), ОписаниеПрохождения.Цвет, "3366cc");
				НоваяСтрока.Картинка = 0;
				НоваяСтрока.Команда = "activity";
				НоваяСтрока.ЦветовойМаркер = "";
				НоваяСтрока.Описание = ОписаниеПрохождения.КомментарийДляУчастника;
				НоваяСтрока.ДатаНачалаЧисло = ОписаниеПрохождения.ДатаНачала;
				НоваяСтрока.ДатаОкончанияЧисло = ОписаниеПрохождения.ДатаОкончания;
				
				Если ОписаниеПрохождения.ВариантПродолжительности = 3
					ИЛИ ОписаниеПрохождения.ВариантПродолжительности = 4 Тогда
					
					НоваяСтрока.ПериодСтрока = Документы.ПрохождениеОбученияСУО.ОсталосьВремениСтрока(
						ОписаниеПрохождения.Актуально,
						Перечисления.СтатусыПроцессаОбученияСУО.ЧислоВЗначение(ОписаниеПрохождения.СтатусОбучения),
						Перечисления.ПродолжительностьОбученияСУО.ЧислоВЗначение(ОписаниеПрохождения.ВариантПродолжительности),
						ОписаниеПрохождения.ПродолжительностьВСекундах,
						ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(ОписаниеПрохождения.ДатаНачалаОтсчетаПродолжительности),
						Перечисления.ПродолжительностьОбученияСУО.ЧислоВЗначение(ОписаниеПрохождения.ДатаОкончания));
										
				Иначе
					
					НоваяСтрока.ПериодСтрока = ОбщегоНазначенияСУКлиентСервер.ПериодВСтроку(ОписаниеПрохождения.ДатаНачала, ОписаниеПрохождения.ДатаОкончания, ОписаниеПрохождения.СкрытьВремяПроведения);
					
				КонецЕсли;
				
				НоваяСтрока.Статус = Перечисления.СтатусыПроцессаОбученияСУО.ЧислоВПредставление(ОписаниеПрохождения.СтатусОбучения);
				
				Если МассивЦветов.Найти(НоваяСтрока.Цвет) = Неопределено Тогда
					МассивЦветов.Добавить(НоваяСтрока.Цвет);	
				КонецЕсли;
				
			КонецЦикла;
			
			ВыборкаДетальныеЗаписи = РегистрыСведений.ОткрытоеОбучениеСУО.ВыбратьЭлементыРасписания(,Пользователь);
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПрохождениеОбучения) Тогда
					
					Продолжить; // Уже зачислен
					
				КонецЕсли;				
				
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаОткрытияЗаписи)
					И ТекущаяДата < ВыборкаДетальныеЗаписи.ДатаОткрытияЗаписи Тогда
					
					Продолжить; // Запись еще не началась
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаЗакрытияЗаписи)
					И ТекущаяДата > ВыборкаДетальныеЗаписи.ДатаЗакрытияЗаписи Тогда
					
					Продолжить; // Запись закончилась
					
				КонецЕсли;				
				
				Если ТипЗнч(ВыборкаДетальныеЗаписи.ДатаЗаявки) = Тип("Дата")
					И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаЗаявки)
					И (ВыборкаДетальныеЗаписи.СтатусЗаявки = Перечисления.СтатусыЗаявокНаОбучениеСУО.Отклонена
					ИЛИ ВыборкаДетальныеЗаписи.СтатусЗаявки = Перечисления.СтатусыЗаявокНаОбучениеСУО.Отменена)
					И ДобавитьМесяц(ВыборкаДетальныеЗаписи.ДатаЗаявки, 1) < ТекущаяДатаСеанса() Тогда
					
					Продолжить; // Старые отклоненные и отмененные заявки не показываем
					
				КонецЕсли;
				
				НоваяСтрока = МоеОбучение.Добавить();
				НоваяСтрока.Ссылка = ВыборкаДетальныеЗаписи.ПроведениеОбучения;
				НоваяСтрока.Представление = ВыборкаДетальныеЗаписи.Наименование;
				НоваяСтрока.Цвет = "cccccc";
				НоваяСтрока.Картинка = 0;
				НоваяСтрока.Команда = ?(ВыборкаДетальныеЗаписи.ТребуетсяЗаявка, "application", "free");
				НоваяСтрока.ЦветовойМаркер = "";
				НоваяСтрока.Описание = "";
				НоваяСтрока.ДатаНачалаЧисло = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ВыборкаДетальныеЗаписи.ДатаНачалаПроведения);
				НоваяСтрока.ДатаОкончанияЧисло = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ВыборкаДетальныеЗаписи.ДатаОкончанияПроведения);
				НоваяСтрока.ПериодСтрока = ОбщегоНазначенияСУКлиентСервер.ПериодВСтроку(НоваяСтрока.ДатаНачалаЧисло, НоваяСтрока.ДатаОкончанияЧисло, ВыборкаДетальныеЗаписи.СкрытьВремяПроведения);
				
				Если ВыборкаДетальныеЗаписи.ТребуетсяЗаявка Тогда
					НоваяСтрока.Статус = НСтр("ru = 'Открыто для подачи заявки'");
					Если ВыборкаДетальныеЗаписи.СтатусЗаявки = Перечисления.СтатусыЗаявокНаОбучениеСУО.НаРассмотрении Тогда
						НоваяСтрока.Статус = НСтр("ru = 'Заявка рассматривается'");
					КонецЕсли;
					Если ВыборкаДетальныеЗаписи.СтатусЗаявки = Перечисления.СтатусыЗаявокНаОбучениеСУО.Утверждена Тогда
						НоваяСтрока.Статус = НСтр("ru = 'Заявка утверждена'");
					КонецЕсли;
					Если ВыборкаДетальныеЗаписи.СтатусЗаявки = Перечисления.СтатусыЗаявокНаОбучениеСУО.Отклонена Тогда
						НоваяСтрока.Статус = НСтр("ru = 'Заявка отклонена'");
						НоваяСтрока.ВыделитьСтатус = Истина;
					КонецЕсли;
					Если ВыборкаДетальныеЗаписи.СтатусЗаявки = Перечисления.СтатусыЗаявокНаОбучениеСУО.Отменена Тогда
						НоваяСтрока.Статус = НСтр("ru = 'Заявка отменена и может быть подана повторно'");
						НоваяСтрока.ВыделитьСтатус = Истина;
					КонецЕсли;
				Иначе
					НоваяСтрока.Статус = НСтр("ru = 'Открыто для записи'");
				КонецЕсли;				
				
				Если МассивЦветов.Найти(НоваяСтрока.Цвет) = Неопределено Тогда
					МассивЦветов.Добавить(НоваяСтрока.Цвет);	
				КонецЕсли;
				
			КонецЦикла;
			
			
		КонецЕсли;
		
		Если РольПользователя = Перечисления.БазовыйРолиПользователейСУО.Преподаватель Тогда
			
			ВыборкаДетальныеЗаписи = РегистрыСведений.РасписаниеПреподавателейСУО.ВыбратьЭлементыРасписания(Пользователь);
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				ОписаниеПрохождения = Документы.ПроведениеПреподавателемОбученияСУО.ПреподавательскаяАктивностьСтруктура(ВыборкаДетальныеЗаписи.ПроведениеОбученияПреподавателем);
				
				НоваяСтрока = МоеОбучение.Добавить();
				НоваяСтрока.Ссылка = ВыборкаДетальныеЗаписи.ПроведениеОбученияПреподавателем;
				НоваяСтрока.Представление = ОписаниеПрохождения.Наименование;
				НоваяСтрока.Цвет = ?(ЗначениеЗаполнено(ОписаниеПрохождения.Цвет), ОписаниеПрохождения.Цвет, "2fb62f");
				НоваяСтрока.Картинка = 1;
				НоваяСтрока.Команда = "teacherActivity";
				НоваяСтрока.ЦветовойМаркер = "";
				НоваяСтрока.Описание = ОписаниеПрохождения.КомментарийДляПреподавателя;
				НоваяСтрока.ДатаНачалаЧисло = ОписаниеПрохождения.ДатаНачала;
				НоваяСтрока.ДатаОкончанияЧисло = ОписаниеПрохождения.ДатаОкончания;
				НоваяСтрока.ПериодСтрока = ОбщегоНазначенияСУКлиентСервер.ПериодВСтроку(ОписаниеПрохождения.ДатаНачала, ОписаниеПрохождения.ДатаОкончания, ОписаниеПрохождения.СкрытьВремяПроведения);  
				НоваяСтрока.Статус = Перечисления.СтатусыПроцессаПреподаванияСУО.ЧислоВПредставление(ОписаниеПрохождения.СтатусПреподавания);
				
				Если МассивЦветов.Найти(НоваяСтрока.Цвет) = Неопределено Тогда
					МассивЦветов.Добавить(НоваяСтрока.Цвет);	
				КонецЕсли;
				
			КонецЦикла;
			
			
		КонецЕсли;
			
	КонецЦикла;
	
	МоеОбучение.Сортировать("ДатаНачалаЧисло Убыв, Команда Возр");
	
	Если МассивЦветов.Количество() > 1 И ЭтоПолныйИнтерфейс И МоеОбучение.Количество() > 10 Тогда
		
		Элементы.МоеОбучениеЦветовойМаркер.Видимость = Истина;
		
		// Заполняем цветовые маркеры
		
		Для каждого ЦветМаркера Из МассивЦветов Цикл
		
			НовоеОформление = УсловноеОформление.Элементы.Добавить();
		
			НовоеОформление.Использование = Истина;
			НовоеОформление.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
			НовоеОформление.ПредставлениеПользовательскойНастройки = "Цветовой маркер """ + ЦветМаркера +""""; 
			
			Отбор = НовоеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Отбор.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("МоеОбучение.Цвет");
			Отбор.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
			Отбор.Использование    = Истина;
			Отбор.Представление    = "МоеОбучение.Цвет";
			Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
			Отбор.ПравоеЗначение   = ЦветМаркера;
			
			
			ЭлементОформленияЦветФона = НовоеОформление.Оформление.Элементы.Найти("ЦветФона");
			ЭлементОформленияЦветФона.Значение      = ОбщегоНазначенияСУКлиентСервер.ВебЦветВОбъект(ЦветМаркера);
			ЭлементОформленияЦветФона.Использование = Истина;
			
			// Устанавливаем поле для оформления
			
			ПолеОформления = НовоеОформление.Поля.Элементы.Добавить();
			ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("МоеОбучениеЦветовойМаркер"); 
		
		КонецЦикла;
		
	Иначе
		
		Элементы.МоеОбучениеЦветовойМаркер.Видимость = Ложь;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

