
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	ИспользоватьПинКодыВПерсональныхНастройках = Константы.ИспользоватьПинКодыВПерсональныхНастройкахСУО.Получить();
	
	Если НЕ ПравоДоступа("Изменение", Метаданные.Константы.ИспользоватьПинКодыВПерсональныхНастройкахСУО)
		ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьСлушателейСУО") Тогда
		
		Элементы.ИспользоватьПинКодыВПерсональныхНастройках.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ИспользоватьПинКодыВПерсональныхНастройкахПриИзменении(Элемент)	
	ИспользоватьПинКодыВПерсональныхНастройкахПриИзмененииНаСервере(ИспользоватьПинКодыВПерсональныхНастройках);	
	#Если Не ВебКлиент Тогда
		ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	#КонецЕсли
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИспользоватьПинКодыВПерсональныхНастройкахПриИзмененииНаСервере(ИспользоватьПинКодыВПерсональныхНастройках)
	Константы.ИспользоватьПинКодыВПерсональныхНастройкахСУО.Установить(ИспользоватьПинКодыВПерсональныхНастройках);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()	
	ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();	
КонецПроцедуры

#КонецОбласти