Функция ВопросыТестирований(СессииВыполненияТеста) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВопросыТестированийСУЗ.Вес,
		|	ВопросыТестированийСУЗ.Вопрос,
		|	ВопросыТестированийСУЗ.СессияВыполненияТеста КАК СессияВыполненияТеста,
		|	ОтветыНаВопросыСУЗ.Период КАК Дата,
		|	ОтветыНаВопросыСУЗ.Результат,
		|	ОтветыНаВопросыСУЗ.ПсихологическийВопрос,
		|	ОтветыНаВопросыСУЗ.ПроверяетсяПреподавателем,
		|	ОтветыНаВопросыСУЗ.ПроверенПреподавателем,
		|	ОтветыНаВопросыСУЗ.ПроверившийПреподаватель,
		|	ОтветыНаВопросыСУЗ.КоличествоПоказов,
		|	ОтветыНаВопросыСУЗ.ИспользованаПодсказка,
		|	ОтветыНаВопросыСУЗ.РазвернутыйОтветПользователя,
		|	ОтветыНаВопросыСУЗ.КомментарийПреподавателя,
		|	ВопросыТестированийСУЗ.Вопрос.Наименование КАК НаименованиеВопроса,
		|	ВопросыТестированийСУЗ.Вопрос.ИспользуетсяФорматированныйДокумент КАК ИспользуетсяФорматированныйДокумент,
		|	ВопросыТестированийСУЗ.Вопрос.ТипВопроса КАК ТипВопроса
		|ИЗ
		|	РегистрСведений.ВопросыТестированийСУЗ КАК ВопросыТестированийСУЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветыНаВопросыСУЗ КАК ОтветыНаВопросыСУЗ
		|		ПО ВопросыТестированийСУЗ.СессияВыполненияТеста = ОтветыНаВопросыСУЗ.СессияВыполненияТеста
		|			И ВопросыТестированийСУЗ.Вопрос = ОтветыНаВопросыСУЗ.Вопрос
		|ГДЕ
		|	ВопросыТестированийСУЗ.СессияВыполненияТеста В(&СессииВыполненияТеста)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СессияВыполненияТеста,
		|	Дата";
	
	Запрос.УстановитьПараметр("СессииВыполненияТеста", СессииВыполненияТеста);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции