#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ЗначениеSCORM(ДействиеПослеИстеченияВремени) Экспорт
	
	Если ЗначениеЗаполнено(ДействиеПослеИстеченияВремени) Тогда
		
		Если ДействиеПослеИстеченияВремени = Перечисления.ДействияПослеИстеченияВремениЭлектронногоКурса.СообщитьИВыйти Тогда
			Возврат "exit,message";
		КонецЕсли;
		
		Если ДействиеПослеИстеченияВремени = Перечисления.ДействияПослеИстеченияВремениЭлектронногоКурса.Выйти Тогда
			Возврат "exit,no message";
		КонецЕсли;
		
		Если ДействиеПослеИстеченияВремени = Перечисления.ДействияПослеИстеченияВремениЭлектронногоКурса.СообщитьИПродолжитьРаботу Тогда
			Возврат "continue,message";
		КонецЕсли;
		
		Если ДействиеПослеИстеченияВремени = Перечисления.ДействияПослеИстеченияВремениЭлектронногоКурса.ПродолжитьРаботу Тогда
			Возврат "continue,no message";
		КонецЕсли;
		
	Иначе
		
		Возврат "continue,no message";
		
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

#КонецЕсли
