#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

Функция ПредставлениеКонтекстаСообщения(Кому, Контекст) Экспорт
	
	Если Кому = Перечисления.АдресатыСообщенийСУО.УчастникамМероприятия
		ИЛИ Кому = Перечисления.АдресатыСообщенийСУО.Преподавателям Тогда
		
		ДанныеОКонтексте = ОбщегоНазначенияСУ.ЗначенияРеквизитовВПривилегированномРежиме(Контекст, "Мероприятие, ЭлектронныйРесурс, НаОсновеЭлектронногоРесурса, НаОсновеМероприятия, БезСценария, Наименование, ВидОбучения");
		
		Если ДанныеОКонтексте.НаОсновеЭлектронногоРесурса Тогда
			
			ДанныеОМероприятии = ОбщегоНазначенияСУ.ЗначенияРеквизитовВПривилегированномРежиме(ДанныеОКонтексте.ЭлектронныйРесурс, "Наименование");
			ДанныеОМероприятии.Вставить("Вид", "Электронный ресурс");
			
		КонецЕсли;
		
		Если ДанныеОКонтексте.БезСценария Тогда
			
			ДанныеОМероприятии = Новый Структура("Наименование, Вид", ДанныеОКонтексте.Наименование, ДанныеОКонтексте.ВидОбучения);
			
		КонецЕсли;
		
		Если ДанныеОКонтексте.НаОсновеМероприятия Тогда

			ДанныеОМероприятии = ОбщегоНазначенияСУ.ЗначенияРеквизитовВПривилегированномРежиме(ДанныеОКонтексте.Мероприятие, "Наименование, Вид");
			
		КонецЕсли;
			
		Представление = "%2 ""%1""";
		Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Представление, ДанныеОМероприятии.Наименование, ДанныеОМероприятии.Вид);
		
	КонецЕсли;
	
	Если Кому = Перечисления.АдресатыСообщенийСУО.УчастникамПрограммыОбучения Тогда
		
		Представление = "%1";
		ПрограммаОбучения = ОбщегоНазначенияСУ.ЗначениеРеквизитаВПривилегированномРежиме(Контекст, "ПрограммаОбучения");
		НаименованиеПрограммыОбучения = ОбщегоНазначенияСУ.ЗначениеРеквизитаВПривилегированномРежиме(ПрограммаОбучения, "Наименование");
		
		Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Представление, НаименованиеПрограммыОбучения);
		
	КонецЕсли;
	
	Если Кому = Перечисления.АдресатыСообщенийСУО.УчебнойГруппе Тогда
		
		Представление = "%1";
		НаименованиеУчебнойГруппы = ОбщегоНазначенияСУ.ЗначениеРеквизитаВПривилегированномРежиме(Контекст, "Наименование");
		
		Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Представление, НаименованиеУчебнойГруппы);
		
	КонецЕсли;
	
	Если Кому = Перечисления.АдресатыСообщенийСУО.НаФоруме Тогда
		
		Представление = "%1";
		НаименованиеРазделаФорума = ОбщегоНазначенияСУ.ЗначениеРеквизитаВПривилегированномРежиме(Контекст, "Наименование");
		
		Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Представление, НаименованиеРазделаФорума);
		
	КонецЕсли;
	
	Если Кому = Перечисления.АдресатыСообщенийСУО.УчастникуМероприятия Тогда
		
		Представление = "%2 ""%1"" - %3";
		
		ДанныеОКонтексте    = ОбщегоНазначенияСУ.ЗначенияРеквизитовВПривилегированномРежиме(Контекст, "Мероприятие, ЭлектронныйРесурс, НаОсновеЭлектронногоРесурса, Пользователь, НаОсновеМероприятия, ПроведениеОбучения");
		
		Если ДанныеОКонтексте.НаОсновеЭлектронногоРесурса Тогда
			
			ДанныеОМероприятии  = ОбщегоНазначенияСУ.ЗначенияРеквизитовВПривилегированномРежиме(ДанныеОКонтексте.ЭлектронныйРесурс, "Наименование");
			
			ДанныеОМероприятии.Вставить("Вид", "Электронный ресурс");
			
		ИначеЕсли ДанныеОКонтексте.НаОсновеМероприятия Тогда
			
			ДанныеОМероприятии  = ОбщегоНазначенияСУ.ЗначенияРеквизитовВПривилегированномРежиме(ДанныеОКонтексте.Мероприятие, "Наименование, Вид");
			
		Иначе
			
			ДанныеПроведенияОбучения = ОбщегоНазначенияСУ.ЗначенияРеквизитовВПривилегированномРежиме(ДанныеОКонтексте.ПроведениеОбучения, "Наименование, ВидОбучения");
			ДанныеОМероприятии = Новый Структура("Наименование, Вид", ДанныеПроведенияОбучения.Наименование, ДанныеПроведенияОбучения.ВидОбучения);			
			
		КонецЕсли;
		
		ДанныеОПользователе = ОбщегоНазначенияСУ.ЗначенияРеквизитовВПривилегированномРежиме(ДанныеОКонтексте.Пользователь, "Наименование");
		
		Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Представление, ДанныеОМероприятии.Наименование, ДанныеОМероприятии.Вид, ДанныеОПользователе.Наименование);
		
	КонецЕсли;
	
	Если Кому = Перечисления.АдресатыСообщенийСУО.УчастникуПрограммыОбучения Тогда
		
		Представление = "%1 - %2";
		ДанныеОКонтексте    = ОбщегоНазначенияСУ.ЗначенияРеквизитовВПривилегированномРежиме(Контекст, "ПрограммаОбучения, Пользователь");
		ДанныеОПрограммеОбучения = ОбщегоНазначенияСУ.ЗначенияРеквизитовВПривилегированномРежиме(ДанныеОКонтексте.ПрограммаОбучения, "Наименование");
		ДанныеОПользователе = ОбщегоНазначенияСУ.ЗначенияРеквизитовВПривилегированномРежиме(ДанныеОКонтексте.Пользователь, "Наименование");
		
		Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Представление, ДанныеОПрограммеОбучения.Наименование, ДанныеОПользователе.Наименование);
		
	КонецЕсли;
	
	Если Кому = Перечисления.АдресатыСообщенийСУО.Преподавателю Тогда
		
		Представление = "%2 ""%1"" - %3";
		ДанныеОКонтексте    = ОбщегоНазначенияСУ.ЗначенияРеквизитовВПривилегированномРежиме(Контекст, "Мероприятие, ЭлектронныйРесурс, НаОсновеЭлектронногоРесурса, НаОсновеМероприятия, Пользователь, ПроведениеОбучения");
		
		Если ДанныеОКонтексте.НаОсновеЭлектронногоРесурса Тогда
			ДанныеОМероприятии  = ОбщегоНазначенияСУ.ЗначенияРеквизитовВПривилегированномРежиме(ДанныеОКонтексте.ЭлектронныйРесурс, "Наименование");
			ДанныеОМероприятии.Вставить("Вид", "Электронный ресурс");
		ИначеЕсли ДанныеОКонтексте.НаОсновеМероприятия Тогда
			ДанныеОМероприятии  = ОбщегоНазначенияСУ.ЗначенияРеквизитовВПривилегированномРежиме(ДанныеОКонтексте.Мероприятие, "Наименование, Вид");
		Иначе
			ДанныеПроведенияОбучения = ОбщегоНазначенияСУ.ЗначенияРеквизитовВПривилегированномРежиме(ДанныеОКонтексте.ПроведениеОбучения, "Наименование, ВидОбучения");
			ДанныеОМероприятии = Новый Структура("Наименование, Вид", ДанныеПроведенияОбучения.Наименование, ДанныеПроведенияОбучения.ВидОбучения);
		КонецЕсли;
		
		ДанныеОПользователе = ОбщегоНазначенияСУ.ЗначенияРеквизитовВПривилегированномРежиме(ДанныеОКонтексте.Преподаватель, "Наименование");
		
		Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Представление, ДанныеОМероприятии.Наименование, ДанныеОМероприятии.Вид, ДанныеОПользователе.Наименование);
		
	КонецЕсли;
	
	Если Кому = Перечисления.АдресатыСообщенийСУО.Пользователю
		ИЛИ Кому = Перечисления.АдресатыСообщенийСУО.Администратору Тогда
		
		Представление = "%1";
		НаименованиеПользователя = ОбщегоНазначенияСУ.ЗначениеРеквизитаВПривилегированномРежиме(Контекст, "Наименование");
		
		Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Представление, НаименованиеПользователя);
		
	КонецЕсли;
	
	Если Кому = Перечисления.АдресатыСообщенийСУО.Организатору Тогда
		
		Представление = "%1";
		НаименованиеОрганизатора = ОбщегоНазначенияСУ.ЗначениеРеквизитаВПривилегированномРежиме(Контекст, "Наименование");
		
		Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Представление, НаименованиеОрганизатора);		
		
	КонецЕсли;	
	
	Возврат Представление;
	
КонецФункции

// Функция возвращает форматированный документ сообщения пригодный
// для показа и отправке пользователю.
//
Функция ФорматированныйДокументСообщения(Знач Сообщение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(Сообщение) = Тип("ДокументСсылка.СообщениеСУО") Тогда
		ДанныеСообщения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сообщение, "ФорматированныйДокумент, Пользователь, Тема, Шаблон, Рассылка");
	Иначе
		ДанныеСообщения = Сообщение;
		Сообщение = ДанныеСообщения.Ссылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСообщения.Шаблон) Тогда
		ФорматированныйДокумент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСообщения.Шаблон, "ФорматированныйДокумент").Получить();
	Иначе
		ФорматированныйДокумент = Сообщение.ФорматированныйДокумент.Получить();
	КонецЕсли;
	
	Если ФорматированныйДокумент = Неопределено Тогда
		Возврат неопределено;
	КонецЕсли;	
	
	ТекстHTML = "";
	Вложения  = Неопределено;	
	
	ФорматированныйДокумент.ПолучитьHTML(ТекстHTML, Вложения);
	
	Отправитель = ДанныеСообщения.Пользователь;
	
	ТекстHTML = СтрЗаменить(ТекстHTML, "{{Отправитель}}", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Отправитель, "Наименование"));
	
	Тема     = ДанныеСообщения.Тема;
	Контекст = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Тема, "Контекст");
	
	ЕдинственныйАдресат = Справочники.ТемыСообщенийСУО.ЕдинственныйАдресат(Контекст);
	
	Если ЗначениеЗаполнено(ЕдинственныйАдресат) Тогда
		
		ДанныеАдресата = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЕдинственныйАдресат, "ИдентификаторПользователяИБ, Наименование");
		
		СвойстваПользователяИБ = Новый Структура;
		Пользователи.ПрочитатьПользователяИБ(ДанныеАдресата.ИдентификаторПользователяИБ, СвойстваПользователяИБ);
		
		// Контекстные переменные
		
		ТекстHTML = СтрЗаменить(ТекстHTML, "{{ПолноеИмяАдресата}}", ДанныеАдресата.Наименование);
		ТекстHTML = СтрЗаменить(ТекстHTML, "{{ИмяАдресата}}", СвойстваПользователяИБ.ПолноеИмя);
		ТекстHTML = СтрЗаменить(ТекстHTML, "{{ЛогинАдресата}}", СвойстваПользователяИБ.Имя);
		ТекстHTML = СтрЗаменить(ТекстHTML, "{{ПарольАдресата}}", СвойстваПользователяИБ.Пароль);
		
	КонецЕсли;
	
	// Пользовательские переменные
	
	Если ЗначениеЗаполнено(ДанныеСообщения.Рассылка) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РассылкаСообщенийСУОЗначенияПеременных.Переменная,
			|	РассылкаСообщенийСУОЗначенияПеременных.Значение,
			|	РассылкаСообщенийСУОЗначенияПеременных.Переменная.Код КАК Код
			|ИЗ
			|	Документ.РассылкаСообщенийСУО.ЗначенияПеременных КАК РассылкаСообщенийСУОЗначенияПеременных
			|ГДЕ
			|	РассылкаСообщенийСУОЗначенияПеременных.Ссылка = &Рассылка";
		
		Запрос.УстановитьПараметр("Рассылка", ДанныеСообщения.Рассылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ЗначенияПеременных = РезультатЗапроса.Выгрузить();
		ШаблонСообщения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСообщения.Рассылка, "Шаблон");
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СообщениеСУОЗначенияПеременных.Переменная,
			|	СообщениеСУОЗначенияПеременных.Значение,
			|	СообщениеСУОЗначенияПеременных.Переменная.Код КАК Код
			|ИЗ
			|	Документ.СообщениеСУО.ЗначенияПеременных КАК СообщениеСУОЗначенияПеременных
			|ГДЕ
			|	СообщениеСУОЗначенияПеременных.Ссылка = &Сообщение";
		
		Запрос.УстановитьПараметр("Сообщение", Сообщение);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ЗначенияПеременных = РезультатЗапроса.Выгрузить();		
		ШаблонСообщения = ДанныеСообщения.Шаблон;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ШаблонСообщения) Тогда		
		
		ТаблицаПеременных = Справочники.ШаблоныСообщенийСУО.Переменные(ШаблонСообщения);
		
		Для каждого Строка Из ЗначенияПеременных Цикл
		
			СтрокаТП = ТаблицаПеременных.Найти(Строка.Переменная, "Переменная");
			Если СтрокаТП <> Неопределено И СтрокаТП.ИмяПеременной <> NULL Тогда
				Строка.Код = СтрокаТП.ИмяПеременной;
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
	Для каждого Строка Из ЗначенияПеременных Цикл 
		
		Если ЗначениеЗаполнено(Строка.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		// Заполняем переменные, которые могут быть заполнены только в контексте сообщения.
		
		Если ТипЗнч(Строка.Переменная) = Тип("ПланВидовХарактеристикСсылка.ПеременныеШаблоновСообщенийСУО") 
			И Строка.Переменная.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Пользователи")) Тогда
			
			Строка.Значение = ДанныеСообщения.Пользователь;
			
		КонецЕсли;
		
		Если Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ЛогинПользователя Тогда
			
			ПрочитанныеСвойства = Неопределено;
			
			Если Пользователи.ПрочитатьПользователяИБ(
		         ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСообщения.Пользователь, "ИдентификаторПользователяИБ"),
		         ПрочитанныеСвойства) Тогда
	
				Строка.Значение = ПрочитанныеСвойства.Имя;	
			
			КонецЕсли;			
			
		КонецЕсли;
			
		Если Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПинКод Тогда
			
			СерияПинКодов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСообщения.Рассылка, "Основание");
			
			Если ТипЗнч(СерияПинКодов) = Тип("СправочникСсылка.СерииПинКодовСУО")
				И ЗначениеЗаполнено(СерияПинКодов) Тогда
				
				Строка.Значение = РегистрыСведений.ВыданныеПинКодыСУО.ВыдатьКод(СерияПинКодов, Сообщение);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначенияПеременных.Колонки.Добавить("Представление");
	
	
	Для каждого Строка Из ЗначенияПеременных Цикл
		
		Если НЕ ЗначениеЗаполнено(Строка.Значение) Тогда
			Строка.Представление = "";
		ИначеЕсли ТипЗнч(Строка.Значение) = Тип("Строка") Тогда
			Строка.Представление = Строка.Значение;
		ИначеЕсли Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаПроведенияМероприятия Тогда
			Строка.Представление = Документы.ПроведениеОбученияСУО.ДатаНачалаПроведения(Строка.Значение);
			Если НЕ ЗначениеЗаполнено(Строка.Представление) Тогда
				Строка.Представление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Значение, "ДатаНачалаДоступа");
			КонецЕсли;						
		ИначеЕсли Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияПроведенияМероприятия Тогда	
			Строка.Представление = Документы.ПроведениеОбученияСУО.ДатаОкончанияПроведения(Строка.Значение);
			Если НЕ ЗначениеЗаполнено(Строка.Представление) Тогда
				Строка.Представление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Значение, "ДатаКонтроля");
			КонецЕсли;			
		ИначеЕсли Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаПроведенияПрограммыОбучения Тогда
			Строка.Представление = Строка.Значение.ДатаНачалаПроведения;
		ИначеЕсли Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияПроведенияПрограммыОбучения Тогда			
			Строка.Представление = Строка.Значение.ДатаОкончанияПроведения;
		ИначеЕсли Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаПрохожденияМероприятия Тогда
			Строка.Представление = Строка.Значение.ДатаНачалаПрохождения;
		ИначеЕсли Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияПрохожденияМероприятия Тогда
			Строка.Представление = Строка.Значение.ДатаОкончанияПрохождения;
		ИначеЕсли Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПродолжительностьОбучения Тогда				
			Строка.Представление = ОбъектыSCORM.ПолучитьПолнуюСтрокуИзКоличестваСекунд(
				Документы.ПроведениеОбученияСУО.Продолжительность(Строка.Значение),,Истина);			
		ИначеЕсли Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПродолжительностьПрограммыОбучения Тогда		
			Строка.Представление = Документы.ПроведениеПрограммыОбученияСУО.ПолучитьПродолжительностьПрограммыОбучения(Строка.Значение);
		ИначеЕсли Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь Тогда
			Строка.Представление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Значение, "Наименование");
		ИначеЕсли Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Книга Тогда
			Строка.Представление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Значение, "Наименование");
		ИначеЕсли Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Месторасположение Тогда
			ДанныеМесторасположения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Строка.Значение, "Наименование, Владелец");
			Строка.Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 (%2)'"), ДанныеМесторасположения.Владелец, ДанныеМесторасположения.Наименование);			
		ИначеЕсли Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеОбучения Тогда
			Если ТипЗнч(Строка.Значение) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
				Строка.Представление = Документы.ПроведениеОбученияСУО.НаименованиеОбучения(Строка.Значение);
			КонецЕсли;
			Если ТипЗнч(Строка.Значение) = Тип("ДокументСсылка.ПрохождениеОбученияСУО") Тогда
				ПроведениеОбучения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Значение, "ПроведениеОбучения");
				Строка.Представление = Документы.ПроведениеОбученияСУО.НаименованиеОбучения(ПроведениеОбучения);
			КонецЕсли;						
		ИначеЕсли Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеПрограммыОбучения Тогда			
			Если ТипЗнч(Строка.Значение) = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО") Тогда
				Строка.Представление = Документы.ПроведениеПрограммыОбученияСУО.Наименование(Строка.Значение);
			КонецЕсли;
			Если ТипЗнч(Строка.Значение) = Тип("ДокументСсылка.ПрохождениеПрограммыОбученияСУО") Тогда
				ПроведениеПрограммыОбучения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Значение, "ПроведениеПрограммыОбучения");
				Строка.Представление = Документы.ПроведениеПрограммыОбученияСУО.Наименование(ПроведениеПрограммыОбучения);
			КонецЕсли;			
		ИначеЕсли Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ЗавершеноВПроцентах Тогда			
			Строка.Представление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Значение, "ЗавершеноВПроцентах"); 
		ИначеЕсли Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоЗавершенныхМероприятий Тогда
			ПодчиненныеМероприятия = Документы.ПрохождениеОбученияСУО.ДанныеОПрохожденииПодчиненныхМероприятий(Строка.Значение);
			Строка.Представление = ПодчиненныеМероприятия.КоличествоЗавершенных;
		ИначеЕсли Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоЗавершенныхТестов Тогда
			Строка.Представление = РегистрыСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.КоличествоЗавершенныхТестов(Строка.Значение);
		ИначеЕсли Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоЗавершенныхЭлектронныхКурсов Тогда
			Строка.Представление = РегистрыСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.КоличествоЗавершенныхЭлектронныхКурсов(Строка.Значение);
		ИначеЕсли Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоОтправленныхНаПроверкуЗаданий Тогда
			Строка.Представление = Документы.ПопыткаВыполненияЗаданияСУО.КоличествоОтправленныхНаПроверку(Строка.Значение);
		ИначеЕсли Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ОценкаЗаЗадание Тогда
			ДанныеОценки = Документы.ПопыткаВыполненияЗаданияСУО.ОценкаЗаЗадание(Строка.Значение);
			Если ДанныеОценки = Неопределено Тогда
				Строка.Представление = НСтр("ru = '<Без оценки>'");
			Иначе
				Строка.Представление = ДанныеОценки.Наименование;
			КонецЕсли;
		ИначеЕсли Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ОценкаЗаОбучение Тогда			
			ДанныеОценки = Документы.ПрохождениеОбученияСУО.ОценкаЗаОбучение(Строка.Значение);
			Если ДанныеОценки = Неопределено Тогда
				Строка.Представление = НСтр("ru = '<Без оценки>'");
			Иначе
				Строка.Представление = ДанныеОценки.Наименование;
			КонецЕсли;
		ИначеЕсли Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоПроверенныхЗаданий Тогда
			Строка.Представление = Документы.ПопыткаВыполненияЗаданияСУО.КоличествоПроверенных(Строка.Значение);
		ИначеЕсли Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.АдресСертификата Тогда
			СертификатЗаПрохождение = Документы.СертификатСУО.НайтиСертификат(Строка.Значение, Истина);
			ПричинаОшибкиПолученияАдреса = "";
			Строка.Представление = Документы.СертификатСУО.АдресВВебКабинете(СертификатЗаПрохождение,,ПричинаОшибкиПолученияАдреса);
			Если НЕ ЗначениеЗаполнено(Строка.Представление) Тогда
				ОбщегоНазначенияСУ.ЗаписатьОшибкуВЖурналРегистрации(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Невозможно получить адрес сертификата по причине: %1'"), ПричинаОшибкиПолученияАдреса), Строка.Значение); 
			КонецЕсли;
		ИначеЕсли Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеЗадания
			И ТипЗнч(Строка.Значение) = Тип("ДокументСсылка.ПопыткаВыполненияЗаданияСУО") Тогда
			Строка.Представление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Значение, "Задание.Наименование");
		ИначеЕсли Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Мероприятие Тогда
			Строка.Представление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Значение, "Наименование");			
		Иначе
			Строка.Представление = Строка(Строка.Значение);
		КонецЕсли;
	
	КонецЦикла;
	
	Для каждого Строка Из ЗначенияПеременных Цикл
		Если ТипЗнч(Строка.Представление) = Тип("Дата") Тогда
			Строка.Представление = ОбщегоНазначенияСУКлиентСервер.ДатаВСтроку(Строка.Представление, Ложь, Ложь, Истина);
			Строка.Представление = ОбщегоНазначенияСУКлиентСервер.HTMLСтрока(Строка.Представление);
		КонецЕсли;
		ТекстHTML = СтрЗаменить(ТекстHTML, "{{"+Строка.Код+"}}", Строка.Представление);
	КонецЦикла;	
	
	ФорматированныйДокумент.УстановитьHTML(ТекстHTML, Вложения); 
	
	Возврат ФорматированныйДокумент;
	
КонецФункции

Функция ФайлыСообщения(Знач Сообщение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(Сообщение) = Тип("ДокументСсылка.СообщениеСУО") Тогда
		ДанныеСообщения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сообщение, "Шаблон, Рассылка");
	Иначе
		ДанныеСообщения = Сообщение;
		Сообщение = ДанныеСообщения.Ссылка;
	КонецЕсли;
	
	СписокФайлов = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	
	Если ЗначениеЗаполнено(ДанныеСообщения.Шаблон) Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ШаблоныСообщенийСУОПрисоединенныеФайлы.Ссылка,
			|	ШаблоныСообщенийСУОПрисоединенныеФайлы.Наименование,
			|	ШаблоныСообщенийСУОПрисоединенныеФайлы.Расширение
			|ИЗ
			|	Справочник.ШаблоныСообщенийСУОПрисоединенныеФайлы КАК ШаблоныСообщенийСУОПрисоединенныеФайлы
			|ГДЕ
			|	ШаблоныСообщенийСУОПрисоединенныеФайлы.ВладелецФайла = &ШаблонСообщения
			|	И ШаблоныСообщенийСУОПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ";

		Запрос.УстановитьПараметр("ШаблонСообщения", ДанныеСообщения.Шаблон);
		
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СообщениеСУОПрисоединенныеФайлы.Ссылка,
			|	СообщениеСУОПрисоединенныеФайлы.Наименование,
			|	СообщениеСУОПрисоединенныеФайлы.Расширение
			|ИЗ
			|	Справочник.СообщениеСУОПрисоединенныеФайлы КАК СообщениеСУОПрисоединенныеФайлы
			|ГДЕ
			|	СообщениеСУОПрисоединенныеФайлы.ВладелецФайла = &Сообщение
			|	И СообщениеСУОПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ";

		Запрос.УстановитьПараметр("Сообщение", Сообщение);

	КонецЕсли;

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
			
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИмяФайла = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Расширение), ВыборкаДетальныеЗаписи.Наименование + "." + ВыборкаДетальныеЗаписи.Расширение, ВыборкаДетальныеЗаписи.Наименование);
		СписокФайлов.Добавить(ВыборкаДетальныеЗаписи.Ссылка, ИмяФайла);
	КонецЦикла;			
	
	Если ЗначениеЗаполнено(ДанныеСообщения.Рассылка) Тогда
		
		ДанныеРассылки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеСообщения.Рассылка, "ПрикреплятьФайлыОснования, ОснованиеАвтоматическойРассылки");
		
		Если ДанныеРассылки.ПрикреплятьФайлыОснования Тогда
			
			Запрос = Новый Запрос;
			
			Если ТипЗнч(ДанныеРассылки.ОснованиеАвтоматическойРассылки) = Тип("ДокументСсылка.ПрохождениеОбученияСУО") Тогда
				
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ПрисоединенныеФайлы.Ссылка,
					|	ПрисоединенныеФайлы.Наименование,
					|	ПрисоединенныеФайлы.Расширение
					|ИЗ
					|	Справочник.ПрохождениеОбученияСУОПрисоединенныеФайлы КАК ПрисоединенныеФайлы
					|ГДЕ
					|	ПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
					|	И ПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ";
				
			КонецЕсли;
			
			Если ТипЗнч(ДанныеРассылки.ОснованиеАвтоматическойРассылки) = Тип("ДокументСсылка.ПопыткаВыполненияЗаданияСУО") Тогда
				
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ПрисоединенныеФайлы.Ссылка,
					|	ПрисоединенныеФайлы.Наименование,
					|	ПрисоединенныеФайлы.Расширение
					|ИЗ
					|	Справочник.ПопыткаВыполненияЗаданияСУОПрисоединенныеФайлы КАК ПрисоединенныеФайлы
					|ГДЕ
					|	ПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
					|	И ПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ";				
				
			КонецЕсли;			
			
			Если ЗначениеЗаполнено(Запрос.Текст) Тогда
			
				Запрос.УстановитьПараметр("ВладелецФайла", ДанныеРассылки.ОснованиеАвтоматическойРассылки);
				
				Результат = Запрос.Выполнить();

				ВыборкаДетальныеЗаписи = Результат.Выбрать();
						
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ИмяФайла = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Расширение), ВыборкаДетальныеЗаписи.Наименование + "." + ВыборкаДетальныеЗаписи.Расширение, ВыборкаДетальныеЗаписи.Наименование);
					СписокФайлов.Добавить(ВыборкаДетальныеЗаписи.Ссылка, ИмяФайла);
				КонецЦикла;						
				
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СписокФайлов;
	
КонецФункции

Функция ДанныеТелаСообщения(Знач Сообщение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(Сообщение) = Тип("ДокументСсылка.СообщениеСУО") Тогда
		ДанныеСообщения = Сообщение;
		Сообщение = Сообщение;		
	Иначе
		ДанныеСообщения = Сообщение;
		Сообщение = ДанныеСообщения.Ссылка;
	КонецЕсли;
	
	ДанныеТелаСообщения = Новый Структура("ФорматированныйДокумент, Файлы");
	
	ДанныеТелаСообщения.ФорматированныйДокумент = ФорматированныйДокументСообщения(ДанныеСообщения);		
	ДанныеТелаСообщения.Файлы = ФайлыСообщения(Сообщение);
	
	Возврат ДанныеТелаСообщения;
	
КонецФункции

Функция СообщениеXDTO(Сообщение, ДанныеСообщения = Неопределено, СообщениеXDTOТип = Неопределено, ПользовательXDTOТип = Неопределено, Зависимости = Неопределено) Экспорт
	
	Если ДанныеСообщения = Неопределено Тогда
		
		ДанныеСообщения	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сообщение, "Ссылка, Номер, Дата, Пользователь, Пользователь.Наименование, РодительскоеСообщение.Номер, ФорматированныйДокумент, Тема, Рассылка, Шаблон");
		
		ДанныеСообщения.Вставить("ИмяПользователя", ДанныеСообщения.ПользовательНаименование);
		
		Если ЗначениеЗаполнено(ДанныеСообщения.РодительскоеСообщениеНомер) Тогда
			ДанныеСообщения.Вставить("НомерРодительскогоСообщения", ДанныеСообщения.РодительскоеСообщениеНомер);
		Иначе
			ДанныеСообщения.Вставить("НомерРодительскогоСообщения", "");
		КонецЕсли;
		
		ДанныеТелаСообщения = ДанныеТелаСообщения(ДанныеСообщения);
		
		ТекстСообщенияСтруктура = ОбщегоНазначенияСУ.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ДанныеТелаСообщения.ФорматированныйДокумент, Строка(Сообщение.УникальныйИдентификатор()),,Ложь,Истина);		
		ДанныеСообщения.Вставить("ТекстHTML", СокрЛП(ТекстСообщенияСтруктура.ПредставлениеHTML));		
		
		ПрикрепленныеФайлы = ДанныеТелаСообщения.Файлы;
		
	КонецЕсли;	
	
	Если СообщениеXDTOТип = Неопределено Тогда
		СообщениеXDTOТип    = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/Forum", "Сообщение");
	КонецЕсли;
	
	Если ПользовательXDTOТип = Неопределено Тогда
		ПользовательXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/User", "Пользователь");
	КонецЕсли;
	
	СообщениеXDTO = ФабрикаXDTO.Создать(СообщениеXDTOТип);
	
	СообщениеXDTO.Номер         = ДанныеСообщения.Номер;
	СообщениеXDTO.Идентификатор = Строка(Сообщение.УникальныйИдентификатор()); 
	СообщениеXDTO.Дата          = Формат(ДанныеСообщения.Дата, "ДЛФ=DDT; ДП=");
	СообщениеXDTO.ДатаЧисло     = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ДанныеСообщения.Дата);
	СообщениеXDTO.Текст         = ДанныеСообщения.ТекстHTML;
	
	ПользовательXDTO = ФабрикаXDTO.Создать(ПользовательXDTOТип);
	
	ПользовательXDTO.Ссылка    = ДанныеСообщения.Пользователь;;
	ПользовательXDTO.ПолноеИмя = ДанныеСообщения.ИмяПользователя;
	
	Если РегистрыСведений.ФотографииПользователейСУО.ЕстьАватар(ДанныеСообщения.Пользователь) Тогда
		ПользовательXDTO.Аватар = Строка(ДанныеСообщения.Пользователь.УникальныйИдентификатор()) + "/" + РегистрыСведений.ФотографииПользователейСУО.ИмяФайлаАватара();
	КонецЕсли;

	СообщениеXDTO.Автор = ПользовательXDTO;
	
	СообщениеXDTO.НомерРодительскогоСообщения = ДанныеСообщения.НомерРодительскогоСообщения;
	
	Если ПрикрепленныеФайлы <> неопределено Тогда
	
		Если ПрикрепленныеФайлы.Количество() > 0 Тогда
			
			СообщениеXDTO.ЕстьПрикрепленныеФайлы = Истина;
			
			// Формируем список файлов

			СписокФайловXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/3/EduFiles", "Файлы");
			СписокФайловXDTO    = ФабрикаXDTO.Создать(СписокФайловXDTOТип);

			ФайлXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/3/EduFiles", "Файл");
			
			Для каждого ПрикрепленныйФайл Из ПрикрепленныеФайлы Цикл
			
				ФайлXDTO = ФабрикаXDTO.Создать(ФайлXDTOТип);
				ФайлXDTO.Наименование  = ПрикрепленныйФайл.Представление;
			    ФайлXDTO.Идентификатор = ПрикрепленныйФайл.Значение.УникальныйИдентификатор();
				ФайлXDTO.Расширение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПрикрепленныйФайл.Значение, "Расширение");
				
				СписокФайловXDTO.Файл.Добавить(ФайлXDTO);
				
				Если Зависимости <> Неопределено тогда
					Зависимости.Добавить(ПрикрепленныйФайл.Значение);
				КонецЕсли;				
				
			КонецЦикла;
			
			СообщениеXDTO.Файлы = СписокФайловXDTO;
			
		Иначе
		
			СообщениеXDTO.ЕстьПрикрепленныеФайлы = Ложь;
		
		КонецЕсли;
		
	Иначе
		
		СообщениеXDTO.ЕстьПрикрепленныеФайлы = ЕстьВложения(Сообщение);
		
	КонецЕсли;
	
	
	Возврат СообщениеXDTO;	
	
КонецФункции

Функция ОтправитьСообщениеНаЭлектроннуюПочту(Знач Сообщение, Знач Соединение = Неопределено) Экспорт
	
	// Важно: функцию надо вызывать, когда документ "СообщениеСУО" уже проведен.
	
	УстановитьПривилегированныйРежим(Истина);
	         	
	РезультатОтправки = Новый Структура("Отправлено, ТекстОшибки, ОтправкаНаЭлектроннуюПочтуЗапрещена", Истина, "", Ложь);
	ПараметрыПисьма   = Новый Структура;
	
	ТребуемыеДанныеСообщения = Новый Структура("ТолькоЭлектроннаяПочта, Тема, Пользователь, ВидКИ, Номер", "ТолькоЭлектроннаяПочта", "Тема", "Пользователь", "Рассылка.ЭлектроннаяПочта", "Номер");
	ДанныеСообщения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сообщение, ТребуемыеДанныеСообщения);
	
	АдресаЭлектронноеПочтыАвтораСообщения = Новый Массив;
	
	// Указываем получателей
	
	МассивПользователейКому = Новый Массив();	
		
	ДанныеОТеме = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеСообщения.Тема, "Контекст, Кому, Автор, ДатаСоздания, ДополнительныеПолучатели, ИсключенныеПолучатели");
	
	МассивПользователейКому = ПолучателиСообщения(ДанныеОТеме);
	
	Если МассивПользователейКому.Количество() > 1 Тогда
	
		ИндексАвтора = МассивПользователейКому.Найти(ДанныеСообщения.Пользователь);
		
		Если ИндексАвтора <> Неопределено Тогда
			МассивПользователейКому.Удалить(ИндексАвтора); // Удаляем автора из получателей
		КонецЕсли;
		
	КонецЕсли;			
	
	Если МассивПользователейКому.Количество() = 0 Тогда
		
		ОписаниеОшибки = НСтр("ru = 'не указаны получатели сообщения'");
		
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка отправки сообщения на электронную почту %1: %2.'"), ДанныеСообщения.Номер, ОписаниеОшибки);

		РезультатОтправки.ТекстОшибки = Текст;
		РезультатОтправки.Отправлено  = Ложь;
		
		Возврат РезультатОтправки;		
		
	КонецЕсли;
	
	МассивВидовКИ = Новый Массив;
	
	Если ЗначениеЗаполнено(ДанныеСообщения.ВидКИ) Тогда
		МассивВидовКИ.Добавить(ДанныеСообщения.ВидКИ);
	Иначе
		МассивВидовКИ.Добавить(Справочники.ВидыКонтактнойИнформации.EmailПользователя);
	КонецЕсли;
	
	ТаблицаАдресовЭлектроннойПочты = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивПользователейКому,,МассивВидовКИ);
	
	МассивПолучателей = Новый Массив();
	
	Для каждого Строка Из ТаблицаАдресовЭлектроннойПочты Цикл	
		МассивПолучателей.Добавить(Новый Структура("Адрес, Представление, Пользователь", Строка.Представление, Строка(Строка.Объект), Строка.Объект));	
	КонецЦикла;
	
	Если МассивПолучателей.Количество() = 0 Тогда
		
		ОписаниеОшибки = НСтр("ru = 'не указаны электронные адреса получателей сообщения'");
		
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка отправки сообщения на электронную почту %1: %2'"), ДанныеСообщения.Номер, ОписаниеОшибки);

		РезультатОтправки.ТекстОшибки = Текст;
		РезультатОтправки.Отправлено  = Ложь;
		РезультатОтправки.ОтправкаНаЭлектроннуюПочтуЗапрещена = Истина; // Чтобы больше не отправлять
		
		Возврат РезультатОтправки;
		
	КонецЕсли;	
	
	
	Получатели = Новый Массив();	
	ОписаниеОшибки = Неопределено;
	
	НастройкиПолучателей = РегистрыСведений.НастройкиПользователейСУО.ПолучитьНастройкуПользователей(МассивПользователейКому, "ЗапретитьРассылкуНаАдресЭлектроннойПочты");	
	
	Для каждого Элемент Из МассивПолучателей Цикл
				
		// Можно отправлять на почту, если это не запрещено в настройках
		// и вход в программу разрешен.

		НастройкаСтрока = НастройкиПолучателей.Найти(Элемент.Пользователь, "Пользователь");
		
		Если НастройкаСтрока <> Неопределено
			И НастройкаСтрока.ЗапретитьРассылкуНаАдресЭлектроннойПочты Тогда
			ОписаниеОшибки = НСтр("ru = 'электронное письмо не отправлено, так как рассылка запрещена пользователем'");
			Продолжить;
		КонецЕсли;		
		
		Если НЕ УправлениеОбучениемСУО.ВходВПрограммуРазрешен(Элемент.Пользователь) Тогда
			ОписаниеОшибки = НСтр("ru = 'электронное письмо не отправлено, так как вход в программу не разрешен пользователю'");
			Продолжить;
		КонецЕсли;
		
		Получатели.Добавить(Новый Структура("Адрес, Представление", Элемент.Адрес, Элемент.Представление)); 
		
	КонецЦикла;	
	
	Если Получатели.Количество() = 0 Тогда
		
		Если ОписаниеОшибки = Неопределено Тогда
			ОписаниеОшибки = НСтр("ru = 'причина неизвестна'");
		КонецЕсли;
		
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Предупреждение при отправке сообщения на электронную почту %1: %2'"), ДанныеСообщения.Номер, ОписаниеОшибки);

		РезультатОтправки.ТекстОшибки = Текст;
		РезультатОтправки.Отправлено  = Ложь;
		РезультатОтправки.ОтправкаНаЭлектроннуюПочтуЗапрещена = Истина;
		
		Возврат РезультатОтправки;
		
	КонецЕсли;	
			
	Для каждого ОписаниеПолучателя Из МассивПолучателей Цикл
		Если ОписаниеПолучателя.Пользователь = ДанныеСообщения.Пользователь Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	СообщениеСУОДополнительныеАдреса.АдресЭлектроннойПочты КАК Адрес
				|ИЗ
				|	Документ.СообщениеСУО.ДополнительныеАдреса КАК СообщениеСУОДополнительныеАдреса
				|ГДЕ
				|	СообщениеСУОДополнительныеАдреса.Ссылка = &Сообщение";
			
			Запрос.УстановитьПараметр("Сообщение", Сообщение);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Получатели.Добавить(Новый Структура("Адрес, Представление", ВыборкаДетальныеЗаписи.Адрес, ОписаниеПолучателя.Представление));
			КонецЦикла;
	
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыПисьма.Вставить("Кому", Получатели);
	
	// Указываем тему
	
	ПараметрыПисьма.Вставить("Тема", Строка(ДанныеСообщения.Тема));
	
	Если НЕ ЗначениеЗаполнено(ПараметрыПисьма.Тема) Тогда
		ПараметрыПисьма.Тема = НСтр("ru = 'Сообщение'");
	КонецЕсли;
	
	// Формируем тело
	
	
	ДанныеТелаСообщения = ДанныеТелаСообщения(Сообщение);
	ФорматированныйДокумент = ДанныеТелаСообщения.ФорматированныйДокумент;
	
	ТекстHTML = "";
	ВложенияHTML  = Неопределено;	
	
	ФорматированныйДокумент.ПолучитьHTML(ТекстHTML, ВложенияHTML);
	
	ФайлыДляУдаления = Новый Массив();
	
	ЗаменитьПутиККартинкамДляЭлектроннойПочты(ТекстHTML, ВложенияHTML, ФайлыДляУдаления);
	
	ПараметрыПисьма.Вставить("Тело", ТекстHTML);
	ПараметрыПисьма.Вставить("ТипТекста", Перечисления.ТипыТекстовЭлектронныхПисем.HTMLСКартинками);
	
	
	// Добавляем вложения
	
	ВложенияПисьма = Новый Соответствие;
	
	Если ВложенияHTML <> Неопределено Тогда
		
		Для каждого ВложениеHTML Из ВложенияHTML Цикл		
			ВложенияПисьма.Вставить(ВложениеHTML.Ключ, ВложениеHTML.Значение); 
		КонецЦикла;
		
	КонецЕсли;
	
	Если ДанныеТелаСообщения.Файлы <> Неопределено 
		И ДанныеТелаСообщения.Файлы.Количество() > 0 Тогда
		
		Для каждого Файл Из ДанныеТелаСообщения.Файлы Цикл			
			ВложенияПисьма.Вставить(Файл.Представление, ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(Файл.Значение)); 
		КонецЦикла;
		
	КонецЕсли;	
	
	ПараметрыПисьма.Вставить("Вложения", ВложенияПисьма);	
	
	// Отправляем письмо
	
	СистемнаяУчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	Попытка
		
		РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыПисьма, Соединение);
		
	Исключение
		
		ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка отправки сообщения на электронную почту %1: %2'"), ДанныеСообщения.Номер, ОписаниеОшибки);

		РезультатОтправки.ТекстОшибки = Текст;
		РезультатОтправки.Отправлено  = Ложь;
		
		Возврат РезультатОтправки;
		
	КонецПопытки;
	
	// Удаляем файлы
	
	Для каждого ПутьКФайлуДляУдаления Из ФайлыДляУдаления Цикл
		ФайлДляУдаленияОбъект = Новый Файл(ПутьКФайлуДляУдаления);		
		УдалитьФайлы(ФайлДляУдаленияОбъект.Путь);	
	КонецЦикла;
	
	Возврат РезультатОтправки;
	
КонецФункции

Процедура ЗаменитьПутиККартинкамДляЭлектроннойПочты(ТекстHTML, Вложения, ФайлыДляУдаления) Экспорт
	
	Для каждого Элемент Из Вложения Цикл
	
		Если ТипЗнч(Элемент.Значение) = Тип("Картинка") Тогда
			
			ДвоичныеДанныеКартинки = Элемент.Значение.ПолучитьДвоичныеДанные();
			
			ПутьККартинкеНаСервере = ПолучитьИмяВременногоФайла("");
			
			СоздатьКаталог(ПутьККартинкеНаСервере);
			
			ПутьККартинкеНаСервере = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККартинкеНаСервере); 
			ПутьККартинкеНаСервере = ПутьККартинкеНаСервере + Элемент.Ключ;
			
			ДвоичныеДанныеКартинки.Записать(ПутьККартинкеНаСервере);
			
			Вложения.Вставить(Элемент.Ключ, ДвоичныеДанныеКартинки);
			
			ТекстHTML = СтрЗаменить(ТекстHTML, "src="""+Элемент.Ключ+"""", "src="""+ПутьККартинкеНаСервере+"""");
			ТекстHTML = СтрЗаменить(ТекстHTML, "src='"+Элемент.Ключ+"'", "src="""+ПутьККартинкеНаСервере+"""");
			
			ФайлыДляУдаления.Добавить(ПутьККартинкеНаСервере);
			
		КонецЕсли;
		
	КонецЦикла;

	
КонецПроцедуры

Функция ПолучателиСообщения(ДанныеОТеме) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	ЭтоГрупповоеОбсуждение = Истина;
	
	// Получаем таблицу, содержащую тех пользователей, которым доступна новая тема
	
	Если ДанныеОТеме.Кому = Перечисления.АдресатыСообщенийСУО.УчастникамМероприятия Тогда
		
		ТаблицаПользователей = Документы.ПроведениеОбученияСУО.УчастникиОбучения(ДанныеОТеме.Контекст, Истина);
		
		ТаблицаПреподавателей = Документы.ПроведениеОбученияСУО.Преподаватели(ДанныеОТеме.Контекст);
		
		Для каждого СтрокаТПР Из ТаблицаПреподавателей Цикл
		
			Если ТаблицаПользователей.Найти(СтрокаТПР.Преподаватель, "Пользователь") = Неопределено Тогда
				НоваяСтрокаТП = ТаблицаПользователей.Добавить();
				НоваяСтрокаТП.Пользователь = СтрокаТПР.Преподаватель;
			КонецЕсли;
		
		КонецЦикла;
		
	ИначеЕсли ДанныеОТеме.Кому = Перечисления.АдресатыСообщенийСУО.УчастникамПрограммыОбучения Тогда
		
		ТаблицаПользователей = Документы.ПроведениеПрограммыОбученияСУО.Участники(ДанныеОТеме.Контекст);
		
		ТаблицаПроведенийМероприятий = Документы.ПроведениеПрограммыОбученияСУО.ПроведенияОбучения(ДанныеОТеме.Контекст);
		
		Для каждого СтрокаТПМ Из ТаблицаПроведенийМероприятий Цикл
		
			ТаблицаПреподавателей = Документы.ПроведениеОбученияСУО.Преподаватели(СтрокаТПМ.ПроведениеОбучения);
			
			Для каждого СтрокаТПР Из ТаблицаПреподавателей Цикл
			
				Если ТаблицаПользователей.Найти(СтрокаТПР.Преподаватель, "Пользователь") = Неопределено Тогда
					НоваяСтрокаТП = ТаблицаПользователей.Добавить();
					НоваяСтрокаТП.Пользователь = СтрокаТПР.Преподаватель;
				КонецЕсли;
			
			КонецЦикла;
		
		КонецЦикла;
		
	ИначеЕсли ДанныеОТеме.Кому = Перечисления.АдресатыСообщенийСУО.УчебнойГруппе Тогда
		
		Если ТипЗнч(ДанныеОТеме.Контекст) = Тип("СправочникСсылка.УчебныеГруппыСУО") Тогда
			ТаблицаПользователей = Справочники.УчебныеГруппыСУО.Участники(ДанныеОТеме.Контекст);
		Иначе
			ТаблицаПользователей = Справочники.УчебныеГруппыОО.Участники(ДанныеОТеме.Контекст);
		КонецЕсли;
		
	ИначеЕсли ДанныеОТеме.Кому = Перечисления.АдресатыСообщенийСУО.НаФоруме Тогда
		
		ТаблицаПользователей = Справочники.РазделыФорумаСУО.Участники(ДанныеОТеме.Контекст);
		
	ИначеЕсли ДанныеОТеме.Кому = Перечисления.АдресатыСообщенийСУО.Преподавателям Тогда
		
		ТаблицаПользователей = Новый ТаблицаЗначений;
		ТаблицаПользователей.Колонки.Добавить("Пользователь");
		
		ТаблицаПреподавателей = Документы.ПроведениеОбученияСУО.Преподаватели(ДанныеОТеме.Контекст);
		
		Для каждого СтрокаТПР Из ТаблицаПреподавателей Цикл
		
			Если ТаблицаПользователей.Найти(СтрокаТПР.Преподаватель, "Пользователь") = Неопределено Тогда
				НоваяСтрокаТП = ТаблицаПользователей.Добавить();
				НоваяСтрокаТП.Пользователь = СтрокаТПР.Преподаватель;
			КонецЕсли;
		
		КонецЦикла;
		
	Иначе // Индивидуальные темы:
		
		ЭтоГрупповоеОбсуждение = Ложь;
		
		ТаблицаПользователей = Новый ТаблицаЗначений();
		ТаблицаПользователей.Колонки.Добавить("Пользователь");
		
		Если ДанныеОТеме.Кому = Перечисления.АдресатыСообщенийСУО.УчастникуМероприятия
			ИЛИ ДанныеОТеме.Кому = Перечисления.АдресатыСообщенийСУО.УчастникуПрограммыОбучения Тогда
			
			НоваяСтрока = ТаблицаПользователей.Добавить();
			НоваяСтрока.Пользователь = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОТеме.Контекст, "Пользователь");
			
		КонецЕсли;
		
		Если ДанныеОТеме.Кому = Перечисления.АдресатыСообщенийСУО.Преподавателю Тогда
			
			НоваяСтрока = ТаблицаПользователей.Добавить();
			НоваяСтрока.Пользователь = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОТеме.Контекст, "Пользователь");
			
		КонецЕсли;
		
		Если ДанныеОТеме.Кому = Перечисления.АдресатыСообщенийСУО.Пользователю
			ИЛИ ДанныеОТеме.Кому = Перечисления.АдресатыСообщенийСУО.Администратору Тогда
			
			НоваяСтрока = ТаблицаПользователей.Добавить();
			НоваяСтрока.Пользователь = ДанныеОТеме.Контекст;
			
		КонецЕсли;
		
		Если ДанныеОТеме.Кому = Перечисления.АдресатыСообщенийСУО.Организатору Тогда
			
			НоваяСтрока = ТаблицаПользователей.Добавить();
			НоваяСтрока.Пользователь = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОТеме.Контекст, "Пользователь");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТаблицаПользователей.Найти(ДанныеОТеме.Автор, "Пользователь") = Неопределено Тогда
		
		НоваяСтрока = ТаблицаПользователей.Добавить();
		НоваяСтрока.Пользователь = ДанныеОТеме.Автор;
		
	КонецЕсли;
	
	Если ЭтоГрупповоеОбсуждение Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	МодераторыОбщенияСУО.Модератор КАК Пользователь
			|ИЗ
			|	РегистрСведений.МодераторыОбщенияСУО КАК МодераторыОбщенияСУО";

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ТаблицаПользователей.Найти(ВыборкаДетальныеЗаписи.Пользователь, "Пользователь") = Неопределено Тогда
				
				НоваяСтрока = ТаблицаПользователей.Добавить();
				НоваяСтрока.Пользователь = ВыборкаДетальныеЗаписи.Пользователь;
				
			КонецЕсли;

		КонецЦикла;
		
	КонецЕсли;
	
	// Дополнительные получатели
	
	ДополнительныеПолучатели = ДанныеОТеме.ДополнительныеПолучатели.Выгрузить();
	
	Для каждого СтрокаТЧ Из ДополнительныеПолучатели Цикл
	
		Если ТаблицаПользователей.Найти(СтрокаТЧ.Пользователь, "Пользователь") = Неопределено Тогда
			
			НоваяСтрока = ТаблицаПользователей.Добавить();
			НоваяСтрока.Пользователь = СтрокаТЧ.Пользователь;
			
		КонецЕсли;
	
	КонецЦикла;	
	
	// Исключенные получатели
	
	ИсключенныеПолучатели = ДанныеОТеме.ИсключенныеПолучатели.Выгрузить();
	
	Если ИсключенныеПолучатели.Количество() > 0 Тогда
	
		Индекс = ТаблицаПользователей.Количество() - 1;
			
		Пока Индекс >= 0 Цикл
			
			Строка = ТаблицаПользователей.Получить(Индекс);
			
			Если Строка.Пользователь <> ДанныеОТеме.Автор 
				И ИсключенныеПолучатели.Найти(Строка.Пользователь, "Пользователь") <> Неопределено Тогда 
				
				ТаблицаПользователей.Удалить(Строка);
				
			КонецЕсли;
			
			Индекс = Индекс - 1;
			
		КонецЦикла;	
		
	КонецЕсли;
	
	Возврат ТаблицаПользователей.ВыгрузитьКолонку("Пользователь");
	
КонецФункции

Функция ПолучательЛичногоСообщения(Пользователь, МассивПолучателейСообщения) Экспорт
	
	КоличествоПолучателей = МассивПолучателейСообщения.Количество();
	
	Если КоличествоПолучателей < 2 Тогда
		
		ПолучательСообщения = Пользователь;
		
	Иначе
		
		Для каждого ПолучательТемы Из МассивПолучателейСообщения Цикл
		
			Если ПолучательТемы <> Пользователь Тогда	
		    	ПолучательСообщения = ПолучательТемы;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;	
	
	Возврат ПолучательСообщения;
	
КонецФункции

Функция ЭтоГрупповоеОбсуждение(Кому) Экспорт
	
	Если Кому = Перечисления.АдресатыСообщенийСУО.НаФоруме
		ИЛИ Кому = Перечисления.АдресатыСообщенийСУО.УчастникамМероприятия
		ИЛИ Кому = Перечисления.АдресатыСообщенийСУО.УчастникамПрограммыОбучения
		ИЛИ Кому = Перечисления.АдресатыСообщенийСУО.УчебнойГруппе
		ИЛИ Кому = Перечисления.АдресатыСообщенийСУО.Преподавателям Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
	
КонецФункции

Функция ПредставлениеГрупповогоОбсуждения(Контекст) Экспорт
	
	Если ТипЗнч(Контекст) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		
		ДанныеПроведения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контекст, "ДатаНачалаПроведения, Дата");
		
		Наименование = Документы.ПроведениеОбученияСУО.НаименованиеОбучения(Контекст);
		
		Если ЗначениеЗаполнено(ДанныеПроведения.ДатаНачалаПроведения) Тогда
			Дата = ДанныеПроведения.ДатаНачалаПроведения;
		Иначе
			Дата = ДанныеПроведения.Дата;			
		КонецЕсли;
		
		Дата = Формат(Дата, "ДЛФ=D");	
		
		ШаблонПредставления = НСтр("ru = '%1 - %2'");
		
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПредставления, Наименование, Дата);
		
	ИначеЕсли ТипЗнч(Контекст) = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО") Тогда
		
		ДанныеПроведения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контекст, "ПрограммаОбучения, Дата, ДатаНачалаПроведения");
		
		Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеПроведения.ПрограммаОбучения, "Наименование");
		
		Если ЗначениеЗаполнено(ДанныеПроведения.ДатаНачалаПроведения) Тогда
			Дата = ДанныеПроведения.ДатаНачалаПроведения;
		Иначе
			Дата = ДанныеПроведения.Дата;			
		КонецЕсли;
		
		Дата = Формат(Дата, "ДЛФ=D");	
		
		ШаблонПредставления = НСтр("ru = '%1 - %2'");
		
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПредставления, Наименование, Дата);		
		
	Иначе
		
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контекст, "Наименование");		
		
	КонецЕсли;
	
	
КонецФункции

Функция КоличествоНовыхЛичныхСообщений(Знач Пользователь=Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛичныеСообщенияПользователейСУО.Регистратор КАК Сообщение
		|ИЗ
		|	РегистрСведений.ЛичныеСообщенияПользователейСУО КАК ЛичныеСообщенияПользователейСУО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиЛичныхСообщенийСУО КАК НастройкиЛичныхСообщенийСУО
		|		ПО ЛичныеСообщенияПользователейСУО.Регистратор = НастройкиЛичныхСообщенийСУО.Сообщение
		|			И ЛичныеСообщенияПользователейСУО.Пользователь = НастройкиЛичныхСообщенийСУО.Пользователь
		|ГДЕ
		|	ЛичныеСообщенияПользователейСУО.Пользователь = &Пользователь
		|	И НастройкиЛичныхСообщенийСУО.ДатаПросмотра ЕСТЬ NULL 
		|	И НЕ ЛичныеСообщенияПользователейСУО.Отправленное";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Возврат ВыборкаДетальныеЗаписи.Количество(); 
	
КонецФункции

Функция ПользователиСНовымиЛичнымиСообщениями() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛичныеСообщенияПользователейСУО.Регистратор КАК Сообщение,
		|	ЛичныеСообщенияПользователейСУО.Пользователь КАК Пользователь,
		|	1 КАК КоличествоСообщений
		|ИЗ
		|	РегистрСведений.ЛичныеСообщенияПользователейСУО КАК ЛичныеСообщенияПользователейСУО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиЛичныхСообщенийСУО КАК НастройкиЛичныхСообщенийСУО
		|		ПО ЛичныеСообщенияПользователейСУО.Регистратор = НастройкиЛичныхСообщенийСУО.Сообщение
		|			И ЛичныеСообщенияПользователейСУО.Пользователь = НастройкиЛичныхСообщенийСУО.Пользователь
		|ГДЕ
		|	НастройкиЛичныхСообщенийСУО.ДатаПросмотра ЕСТЬ NULL 
		|	И НЕ ЛичныеСообщенияПользователейСУО.Отправленное";

	Результат = Запрос.Выполнить();
	
	ТаблицаНепрочитанныхСообщений = Результат.Выгрузить();

	МассивПользователей = Новый Массив;
	
	Для каждого Строка Из ТаблицаНепрочитанныхСообщений Цикл
	
		Если МассивПользователей.Найти(Строка.Пользователь) = Неопределено Тогда
			МассивПользователей.Добавить(Строка.Пользователь);
		КонецЕсли;
	
	КонецЦикла;
	
	ХешСуммыПользователей = Новый Соответствие;
	
	Для каждого Пользователь Из МассивПользователей Цикл
	
		СтрокиПользователя = ТаблицаНепрочитанныхСообщений.НайтиСтроки(Новый Структура("Пользователь", Пользователь));
		
		ХешированиеСобытия = Новый ХешированиеДанных(ХешФункция.CRC32);
		
		Для каждого Строка Из СтрокиПользователя Цикл		
			ХешированиеСобытия.Добавить(Строка(Строка.Сообщение.УникальныйИдентификатор()));		
		КонецЦикла;
		
		ХешСуммыПользователей.Вставить(Пользователь, ХешированиеСобытия.ХешСумма);
	
	КонецЦикла;
	
	ТаблицаНепрочитанныхСообщений.Свернуть("Пользователь", "КоличествоСообщений");
	
	ТаблицаНепрочитанныхСообщений.Колонки.Добавить("КонтрольнаяСумма");
	
	Для каждого Строка Из ТаблицаНепрочитанныхСообщений Цикл	
		Строка.КонтрольнаяСумма = ХешСуммыПользователей.Получить(Строка.Пользователь);	
	КонецЦикла;
	
	
	Возврат ТаблицаНепрочитанныхСообщений;
	
КонецФункции

Функция КоличествоНовыхГрупповыхСообщений(Знач Пользователь=Неопределено, МассивРазделов=Неопределено, ВернутьТаблицу=Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	// Выбираем общие разделы
	
	Если МассивРазделов = Неопределено Тогда
	
		ТаблицаОбщихРазделов  = Справочники.РазделыФорумаСУО.РазделыПользователя(Пользователь, Ложь);
		ТаблицаЛичныхРазделов = РегистрыСведений.АвтоРазделыФорумаСУО.РазделыПользователя(Пользователь);
		
		МассивЛичныхРазделов = ТаблицаЛичныхРазделов.ВыгрузитьКолонку("Ссылка"); 
		МассивОбщихРазделов = ТаблицаОбщихРазделов.ВыгрузитьКолонку("Ссылка");
		
		МассивРазделов = Новый Массив;
		
		Для каждого Раздел Из МассивОбщихРазделов Цикл
			МассивРазделов.Добавить(Раздел);	
		КонецЦикла;
		
		Для каждого Раздел Из МассивЛичныхРазделов Цикл
			МассивРазделов.Добавить(Раздел);	
		КонецЦикла;	
		
	КонецЕсли;
		
	// Выбираем все темы разделов
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТемыСообщенийСУО.Ссылка
		|ИЗ
		|	Справочник.ТемыСообщенийСУО КАК ТемыСообщенийСУО
		|ГДЕ
		|	ТемыСообщенийСУО.Контекст В(&МассивРазделов)";

	Запрос.УстановитьПараметр("МассивРазделов", МассивРазделов);

	Результат = Запрос.Выполнить();

	МассивТем = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");

	// Выбираем непрочитанные темы
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователь);
	Запрос.УстановитьПараметр("Темы", МассивТем);

	Если ВернутьТаблицу Тогда
			
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НастройкиТемФорумаСУО.Тема,
			|	НастройкиТемФорумаСУО.Тема.Контекст КАК РазделФорума,
			|   1 КАК КоличествоТем
			|ИЗ
			|	РегистрСведений.НастройкиТемФорумаСУО КАК НастройкиТемФорумаСУО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СообщенияТемСУО.СрезПоследних КАК СообщенияТемСУОСрезПоследних
			|		ПО НастройкиТемФорумаСУО.Тема = СообщенияТемСУОСрезПоследних.Тема
			|ГДЕ
			|	НастройкиТемФорумаСУО.Пользователь = &ТекущийПользователь
			|	И СообщенияТемСУОСрезПоследних.Период > НастройкиТемФорумаСУО.ДатаПросмотра
			|	И НастройкиТемФорумаСУО.Тема В(&Темы)";

		Результат = Запрос.Выполнить();			
		
		ТаблицаТем = Результат.Выгрузить(); 
		
		ТаблицаТем.Свернуть("РазделФорума", "КоличествоТем");
		
		Возврат ТаблицаТем;
		
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	НастройкиТемФорумаСУО.Тема
			|ИЗ
			|	РегистрСведений.НастройкиТемФорумаСУО КАК НастройкиТемФорумаСУО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СообщенияТемСУО.СрезПоследних КАК СообщенияТемСУОСрезПоследних
			|		ПО НастройкиТемФорумаСУО.Тема = СообщенияТемСУОСрезПоследних.Тема
			|ГДЕ
			|	НастройкиТемФорумаСУО.Пользователь = &ТекущийПользователь
			|	И СообщенияТемСУОСрезПоследних.Период > НастройкиТемФорумаСУО.ДатаПросмотра
			|	И НастройкиТемФорумаСУО.Тема В(&Темы)";
		
			
		Результат = Запрос.Выполнить();
			
		Возврат Результат.Выгрузить().Количество();	
		
	КонецЕсли;
	
	
КонецФункции

Функция ПользователиСНовымиГрупповымиСообщениями() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Выбираем общие разделы
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТемыПользователейСУО.Тема,
		|	ТемыПользователейСУО.Пользователь,
		|	1 КАК КоличествоТем,
		|	СообщенияТемСУОСрезПоследних.Период КАК ДатаПоследнегоСообщения
		|ИЗ
		|	РегистрСведений.ТемыПользователейСУО КАК ТемыПользователейСУО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиТемФорумаСУО КАК НастройкиТемФорумаСУО
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СообщенияТемСУО.СрезПоследних КАК СообщенияТемСУОСрезПоследних
		|			ПО НастройкиТемФорумаСУО.Тема = СообщенияТемСУОСрезПоследних.Тема
		|		ПО ТемыПользователейСУО.Пользователь = НастройкиТемФорумаСУО.Пользователь
		|			И ТемыПользователейСУО.Тема = НастройкиТемФорумаСУО.Тема
		|ГДЕ
		|	СообщенияТемСУОСрезПоследних.Период > НастройкиТемФорумаСУО.ДатаПросмотра";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаНепрочитанныхТем = РезультатЗапроса.Выгрузить();

	МассивПользователей = Новый Массив;
	
	Для каждого Строка Из ТаблицаНепрочитанныхТем Цикл
	
		Если МассивПользователей.Найти(Строка.Пользователь) = Неопределено Тогда
			МассивПользователей.Добавить(Строка.Пользователь);
		КонецЕсли;
	
	КонецЦикла;
	
	ХешСуммыПользователей = Новый Соответствие;
	
	Для каждого Пользователь Из МассивПользователей Цикл
	
		СтрокиПользователя = ТаблицаНепрочитанныхТем.НайтиСтроки(Новый Структура("Пользователь", Пользователь));
		
		ХешированиеСобытия = Новый ХешированиеДанных(ХешФункция.CRC32);
		
		Для каждого Строка Из СтрокиПользователя Цикл		
			ХешированиеСобытия.Добавить(Строка(Строка.Тема.УникальныйИдентификатор()) + Формат(Строка.ДатаПоследнегоСообщения, "ДФ=ddMMyyyyhhmm"));		
		КонецЦикла;
		
		ХешСуммыПользователей.Вставить(Пользователь, ХешированиеСобытия.ХешСумма);
	
	КонецЦикла;
	
	
	ТаблицаНепрочитанныхТем.Свернуть("Пользователь", "КоличествоТем");
	
	ТаблицаНепрочитанныхТем.Колонки.Добавить("КонтрольнаяСумма");
	
	Для каждого Строка Из ТаблицаНепрочитанныхТем Цикл	
		Строка.КонтрольнаяСумма = ХешСуммыПользователей.Получить(Строка.Пользователь);	
	КонецЦикла;
	
	
	Возврат ТаблицаНепрочитанныхТем;
	
КонецФункции

Функция ЕстьВложения(Знач Сообщение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СообщениеСУОПрисоединенныеФайлы.Ссылка
		|ИЗ
		|	Справочник.СообщениеСУОПрисоединенныеФайлы КАК СообщениеСУОПрисоединенныеФайлы
		|ГДЕ
		|	СообщениеСУОПрисоединенныеФайлы.ВладелецФайла = &Сообщение
		|	И СообщениеСУОПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("Сообщение", Сообщение);

	Результат = Запрос.Выполнить();

	Возврат ?(Результат.Пустой(), Ложь, Истина);	
	
КонецФункции

// Веб-кабинет

Процедура ОбновитьДанныеВебКабинета(Сообщение, ДополнительныеДанные=Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем дополнительные настройки обновления данных
	
	ОбновитьТолькоПользовательскиеДанные = Ложь;
	
	Если ДополнительныеДанные <> Неопределено
		И ДополнительныеДанные.Свойство("ОбновитьТолькоПользовательскиеДанные") Тогда
		
		ОбновитьТолькоПользовательскиеДанные = ДополнительныеДанные.ОбновитьТолькоПользовательскиеДанные;
		
	КонецЕсли;
	
	// Получаем переменные
	
	ДанныеСообщения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сообщение, "ТолькоЭлектроннаяПочта, Тема, Проведен, Дата, Пользователь, ФорматированныйДокумент, ПервоеСообщениеВТеме, УдаленоМодератором");
	
	Если ДанныеСообщения.ТолькоЭлектроннаяПочта Тогда
		Возврат;
	КонецЕсли;	
	
	ДанныеОТеме = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеСообщения.Тема, "Контекст, Кому, Автор, ДатаСоздания, ДополнительныеПолучатели, ИсключенныеПолучатели, Наименование, Закрыта");
	ЭтоГрупповоеОбсуждение     = ЭтоГрупповоеОбсуждение(ДанныеОТеме.Кому);
	МассивПолучателейСообщения = ПолучателиСообщения(ДанныеОТеме);
	
	Зависимости = Новый Массив;
	
	// Добавляем новые данные и удаляем старые	
	
	Если НЕ ОбновитьТолькоПользовательскиеДанные Тогда
		
		// Описание раздела форума (содержит статистику по темам и сообщениям)
		
		Если ЭтоГрупповоеОбсуждение Тогда
			
			РазделФорума = ДанныеОТеме.Контекст;
			
			РегистрыСведений.ДанныеВебКабинетаСУО_ОН.УдалитьДанные(РазделФорума, Перечисления.ТипыДанныхВебКабинетаСУО.РазделФорумаОписание);
			
			Если ДанныеСообщения.Проведен И НЕ ДанныеСообщения.УдаленоМодератором Тогда
				РегистрыСведений.ДанныеВебКабинетаСУО_ОН.ДобавитьДанные(Перечисления.ТипыДанныхВебКабинетаСУО.РазделФорумаОписание, РазделФорума, Справочники.РазделыФорумаСУО.РазделОписаниеОбщееJSON(РазделФорума), Перечисления.ФорматыВебДанныхСУ.json);
			КонецЕсли;
			
		КонецЕсли;		
		
		// Описание темы (содержит статистику по сообщениям)
		
		РегистрыСведений.ДанныеВебКабинетаСУО_ОН.УдалитьДанные(ДанныеСообщения.Тема, Перечисления.ТипыДанныхВебКабинетаСУО.ТемаОбщенияОписание);
		
		Если ДанныеСообщения.Проведен И НЕ ДанныеСообщения.УдаленоМодератором Тогда
			РегистрыСведений.ДанныеВебКабинетаСУО_ОН.ДобавитьДанные(Перечисления.ТипыДанныхВебКабинетаСУО.ТемаОбщенияОписание, ДанныеСообщения.Тема, Справочники.ТемыСообщенийСУО.ТемаСообщенийОписаниеОбщееJSON(ДанныеСообщения.Тема), Перечисления.ФорматыВебДанныхСУ.json);
		КонецЕсли;		
		
		// Список сообщений
		
		РегистрыСведений.ДанныеВебКабинетаСУО_ОП.УдалитьДанные(Сообщение, Перечисления.ТипыДанныхВебКабинетаСУО.Сообщение);
		
		Если ДанныеСообщения.Проведен И НЕ ДанныеСообщения.УдаленоМодератором Тогда
			РегистрыСведений.ДанныеВебКабинетаСУО_ОП.ДобавитьДанные(ДанныеСообщения.Дата, Перечисления.ТипыДанныхВебКабинетаСУО.Сообщение, Сообщение, СообщениеJSON(Сообщение, МассивПолучателейСообщения), Перечисления.ФорматыВебДанныхСУ.json);
		КонецЕсли;		

		// Описание сообщения
		
		РегистрыСведений.ДанныеВебКабинетаСУО_ОН.УдалитьДанные(Сообщение, Перечисления.ТипыДанныхВебКабинетаСУО.СообщениеОписание);
		
		Если ДанныеСообщения.Проведен И НЕ ДанныеСообщения.УдаленоМодератором Тогда
			РегистрыСведений.ДанныеВебКабинетаСУО_ОН.ДобавитьДанные(Перечисления.ТипыДанныхВебКабинетаСУО.СообщениеОписание, Сообщение, СообщениеОписаниеОбщееXML(Сообщение, Зависимости), Перечисления.ФорматыВебДанныхСУ.xml);
		КонецЕсли;
		
		// Файлы форматированного документа сообщения
		
		СообщениеСтруктура = ОбщегоНазначенияСУ.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ДанныеСообщения.ФорматированныйДокумент.Получить(), Строка(Сообщение.УникальныйИдентификатор()),, Истина, Ложь);
		
		Если СообщениеСтруктура.ЕстьВложения Тогда
			ВебКабинетСУО.ВыгрузитьФайлыФорматированногоДокументаВКаталогВебКабинета(СообщениеСтруктура.ДвоичныеДанные, СообщениеСтруктура.ИдентификаторКаталога);
		КонецЕсли;		
				
		// Обновляем данные темы
		
		Если ДанныеСообщения.ПервоеСообщениеВТеме Тогда
			Справочники.ТемыСообщенийСУО.ОбновитьДанныеВебКабинета(ДанныеСообщения.Тема);
		КонецЕсли;
		
		// Зависимости
		
		РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.УдалитьДанные(Сообщение, "Документ.СообщениеСУО");
		
		Если ДанныеСообщения.Проведен И ДанныеСообщения.Дата + (7*24*60*60) > ТекущаяДатаСеанса() И НЕ ДанныеСообщения.УдаленоМодератором Тогда			
			
			Зависимости.Добавить(ДанныеСообщения.Тема);
			Зависимости.Добавить(ДанныеСообщения.Пользователь);
			Зависимости.Добавить(ДанныеОТеме.Контекст);
			
			РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.ДобавитьДанные(Сообщение, "Документ.СообщениеСУО", Зависимости);
			
		КонецЕсли;		
		
	КонецЕсли;
	
	// Отборы и личные настройки
	
	РегистрыСведений.ОтборыДанныхВебКабинетаСУО_П.УдалитьОтбор(Сообщение);
	РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.УдалитьОтбор(Сообщение);
	
	РегистрыСведений.ДанныеВебКабинетаСУО_ПН.УдалитьДанные(Сообщение, Перечисления.ТипыДанныхВебКабинетаСУО.СообщениеОписание);
	
	РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.ДобавитьОтбор(Сообщение, ДанныеСообщения.Тема); // Отбор по темам
	
	Если ДанныеСообщения.Проведен И НЕ ЭтоГрупповоеОбсуждение Тогда
		
		// Помечаем сообщение, как входящее или исходящее, независимо от того, есть личные настройки или нет
		
		ПолучательСообщения = ПолучательЛичногоСообщения(ДанныеСообщения.Пользователь, МассивПолучателейСообщения);	
		
		РегистрыСведений.ОтборыДанныхВебКабинетаСУО_П.ДобавитьОтбор(Сообщение, ПолучательСообщения, Перечисления.ОтборыДанныхВебКабинетаСУО.Входящие);
		РегистрыСведений.ОтборыДанныхВебКабинетаСУО_П.ДобавитьОтбор(Сообщение, ДанныеСообщения.Пользователь, Перечисления.ОтборыДанныхВебКабинетаСУО.Исходящие);
		
		// Изменяем отборы, в соответствии с личными настройками
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НастройкиЛичныхСообщенийСУО.Пользователь,
			|	НастройкиЛичныхСообщенийСУО.Удалено,
			|	НастройкиЛичныхСообщенийСУО.Помечено,
			|	НастройкиЛичныхСообщенийСУО.ДатаПросмотра
			|ИЗ
			|	РегистрСведений.НастройкиЛичныхСообщенийСУО КАК НастройкиЛичныхСообщенийСУО
			|ГДЕ
			|	НастройкиЛичныхСообщенийСУО.Сообщение = &Сообщение";
		
		Запрос.УстановитьПараметр("Сообщение", Сообщение);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				// Пользовательское описание			
				
				ОписаниеПользовательскоеJSON = Документы.СообщениеСУО.СообщениеОписаниеПользовательскоеJSON(Сообщение, ВыборкаДетальныеЗаписи.Пользователь, ВыборкаДетальныеЗаписи);
				
				РегистрыСведений.ДанныеВебКабинетаСУО_ПН.ДобавитьДанные(ВыборкаДетальныеЗаписи.Пользователь, Перечисления.ТипыДанныхВебКабинетаСУО.СообщениеОписание, Сообщение, ОписаниеПользовательскоеJSON, Перечисления.ФорматыВебДанныхСУ.json);
				
				// Отбор для удаленных сообщений
				
				Если ВыборкаДетальныеЗаписи.Удалено Тогда
					
					РегистрыСведений.ОтборыДанныхВебКабинетаСУО_П.ДобавитьОтбор(Сообщение, ВыборкаДетальныеЗаписи.Пользователь, Перечисления.ОтборыДанныхВебКабинетаСУО.Удаленные);
					
					// Удаляем, как входящее или исходящее (место для оптимизации)
					
					РегистрыСведений.ОтборыДанныхВебКабинетаСУО_П.УдалитьОтбор(Сообщение, ВыборкаДетальныеЗаписи.Пользователь, Перечисления.ОтборыДанныхВебКабинетаСУО.Входящие);
					РегистрыСведений.ОтборыДанныхВебКабинетаСУО_П.УдалитьОтбор(Сообщение, ВыборкаДетальныеЗаписи.Пользователь, Перечисления.ОтборыДанныхВебКабинетаСУО.Исходящие);
					
				КонецЕсли;
				
				Если ВыборкаДетальныеЗаписи.Помечено Тогда					
					РегистрыСведений.ОтборыДанныхВебКабинетаСУО_П.ДобавитьОтбор(Сообщение, ВыборкаДетальныеЗаписи.Пользователь, Перечисления.ОтборыДанныхВебКабинетаСУО.Помеченные);					
				КонецЕсли;	
				
			КонецЦикла;
			
		КонецЕсли;
		
		
	КонецЕсли;	

	
	
КонецПроцедуры

Функция СообщениеСтруктура(Сообщение, МассивПолучателейСообщения=Неопределено) Экспорт
	
	ДанныеСообщения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сообщение, "Дата, Тема, Тема.Кому, Тема.Наименование, Пользователь, Пользователь.Наименование, РодительскоеСообщение");
	
	ЭтоГрупповоеОбсуждение = ЭтоГрупповоеОбсуждение(ДанныеСообщения.ТемаКому);
	
	СтруктураСообщения = Новый Структура("
	|Тема,
	|НаименованиеТемы,
	|Дата,
	|Автор,
	|Идентификатор,
	|ЭтоГрупповоеОбсуждение,
	|РодительскоеСообщение,
	|ЕстьВложения",
	ДанныеСообщения.Тема,
	ДанныеСообщения.ТемаНаименование,
	Сообщение.Дата,
	ВебКабинетСУО.ПользовательСтруктура(ДанныеСообщения.Пользователь, ДанныеСообщения.ПользовательНаименование),
	Строка(Сообщение.УникальныйИдентификатор()),
	ЭтоГрупповоеОбсуждение,
	Строка(ДанныеСообщения.РодительскоеСообщение.УникальныйИдентификатор()),
	ЕстьВложения(Сообщение)
	);
	
	Если НЕ ЭтоГрупповоеОбсуждение Тогда
	
		Если МассивПолучателейСообщения = Неопределено Тогда
			ДанныеОТеме = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеСообщения.Тема, "Контекст, Кому, Автор, ДатаСоздания, ДополнительныеПолучатели, ИсключенныеПолучатели, Наименование, Закрыта");
			МассивПолучателейСообщения = ПолучателиСообщения(ДанныеОТеме);
		КонецЕсли;

		ПолучательСообщения = ПолучательЛичногоСообщения(ДанныеСообщения.Пользователь, МассивПолучателейСообщения);
		
		СтруктураСообщения.Вставить("ПолучательСообщения", ВебКабинетСУО.ПользовательСтруктура(ПолучательСообщения));
		
	КонецЕсли;	
	
	Возврат СтруктураСообщения;
	
КонецФункции

Функция СообщениеJSON(Сообщение, МассивПолучателейСообщения=Неопределено) Экспорт
	
	Возврат ОбщегоНазначенияСУ.ДанныеВJSON(СообщениеСтруктура(Сообщение, МассивПолучателейСообщения));	
	
КонецФункции

Функция СообщениеОписаниеОбщееXML(Сообщение, Зависимости=Неопределено) Экспорт
	
	СообщениеXDTO = СообщениеXDTO(Сообщение,,,, Зависимости);
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, СообщениеXDTO);
	
	Возврат ЗаписьXML.Закрыть();

КонецФункции

Функция СообщениеОписаниеПользовательскоеJSON(Сообщение, Пользователь, ВыборкаДетальныеЗаписи=Неопределено) Экспорт
	
	ДатаПросмотра = Дата("00010101");
	
	Если ВыборкаДетальныеЗаписи = Неопределено Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НастройкиЛичныхСообщенийСУО.ДатаПросмотра
			|ИЗ
			|	РегистрСведений.НастройкиЛичныхСообщенийСУО КАК НастройкиЛичныхСообщенийСУО
			|ГДЕ
			|	НастройкиЛичныхСообщенийСУО.Пользователь = &Пользователь
			|	И НастройкиЛичныхСообщенийСУО.Сообщение = &Сообщение";
		
		Запрос.УстановитьПараметр("Пользователь", Пользователь);
		Запрос.УстановитьПараметр("Сообщение", Сообщение);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
		
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			ВыборкаДетальныеЗаписи.Следующий();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВыборкаДетальныеЗаписи <> Неопределено Тогда
		
		ДатаПросмотра = ВыборкаДетальныеЗаписи.ДатаПросмотра;	
		
	КонецЕсли;
	
	// Результат
	
	ОписаниеРаздела = Новый Структура("ДатаПросмотра", ДатаПросмотра);
	ОписаниеРаздела	= ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеРаздела);	
	
	Возврат ОписаниеРаздела;	
	
КонецФункции

#КонецЕсли