#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ОписаниеПеременных

Перем ДанныеОТеме;	

#КонецОбласти	

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	// Заполняем переменные модуля
	//
	
	ДанныеОТеме = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Тема, "Контекст, Кому, Автор, ДатаСоздания, ДополнительныеПолучатели, ИсключенныеПолучатели, Наименование, Закрыта");
	
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
	// Делаем проверки
	//
	
	Если ЭтоНовый() И НЕ ПервоеСообщениеВТеме Тогда
		
		Если ДанныеОТеме.Закрыта Тогда
			
			ТекстСообщения = НСтр("ru = 'Тема закрыта для новых сообщений'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);	
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Заполняем рекизиты
	//
	
	ДатаИзменения = ТекущаяДата();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ЛичныеСообщенияПользователейСУО.Записывать = Истина;
	Движения.СообщенияТемСУО.Записывать = Истина;
	Движения.ТемыМодераторовСУО.Записывать = Истина;
	Движения.ТемыПользователейСУО.Записывать = Истина;
	
	// Помечаем шаблон как действующий
	
	Если ЗначениеЗаполнено(Шаблон)
		И ТипЗнч(Шаблон) = Тип("СправочникСсылка.ШаблоныСообщенийСУО")
		И НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Шаблон, "Действующий") Тогда
		
		ШаблонОбъект = Шаблон.ПолучитьОбъект();
		ШаблонОбъект.Действующий = Истина;
		ШаблонОбъект.Записать();
		
	КонецЕсли;
	
	Если НЕ ТолькоЭлектроннаяПочта И НЕ УдаленоМодератором Тогда
		
		ЭтоГрупповоеОбсуждение     = Документы.СообщениеСУО.ЭтоГрупповоеОбсуждение(ДанныеОТеме.Кому);
		МассивПолучателейСообщения = Документы.СообщениеСУО.ПолучателиСообщения(ДанныеОТеме);
		КоличествоПолучателей      = МассивПолучателейСообщения.Количество();
		
		// Проводки по регистру СообщенияТемСУО
		
		Движение = Движения.СообщенияТемСУО.Добавить();
		Движение.Период                  = Дата;
		Движение.Тема                    = Тема;
		Движение.Номер                   = Номер;
		Движение.Пользователь            = Пользователь;
		Движение.Шаблон                  = Шаблон;
		Движение.РодительскоеСообщение   = РодительскоеСообщение;
		
		Если ЭтоГрупповоеОбсуждение Тогда
			Движение.РазделФорума = ДанныеОТеме.Контекст;	
		КонецЕсли;
		
		ТекстСообщенияОбработанный = Документы.СообщениеСУО.ФорматированныйДокументСообщения(Ссылка);
		Движение.ФорматированныйДокумент =  Новый ХранилищеЗначения(ТекстСообщенияОбработанный, Новый СжатиеДанных(9));
		
		// Проводки по регистру ЛичныеСообщенияПользователейСУО
		
		Если НЕ ЭтоГрупповоеОбсуждение И КоличествоПолучателей >= 2 Тогда
			
			ПолучательСообщения = Документы.СообщениеСУО.ПолучательЛичногоСообщения(Пользователь, МассивПолучателейСообщения);
			
			ЕстьВложения = Документы.СообщениеСУО.ЕстьВложения(Ссылка);
			
			// Входящие
			
			Движение = Движения.ЛичныеСообщенияПользователейСУО.Добавить();
			Движение.Период                   = Дата;
			Движение.Пользователь             = ПолучательСообщения; // Получатель
			Движение.Отправленное             = Ложь;
			
			Движение.Тема                     = Тема;
			Движение.ОтправительИлиПолучатель = Пользователь; // Отправитель	
			Движение.ЕстьВложения             = ЕстьВложения;
			
			// Исходящее
			
			Движение = Движения.ЛичныеСообщенияПользователейСУО.Добавить();
			Движение.Период                   = Дата;
			Движение.Пользователь             = Пользователь; // Отправитель
			Движение.Отправленное             = Истина;
			
			Движение.Тема                     = Тема;
			Движение.ОтправительИлиПолучатель = ПолучательСообщения; // Получатель	
			Движение.ЕстьВложения             = ЕстьВложения;
			
		КонецЕсли;
		
		// Проводки по регистру ТемыМодераторовСУО
		
		Если ПервоеСообщениеВТеме И ЭтоГрупповоеОбсуждение Тогда
			
			МассивМодераторов = Новый Массив();
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	МодераторыОбщенияСУО.Модератор КАК Модератор
			|ИЗ
			|	РегистрСведений.МодераторыОбщенияСУО КАК МодераторыОбщенияСУО
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РазделыФорумаСУОВидимость.Пользователь КАК Модератор
			|ИЗ
			|	Справочник.РазделыФорумаСУО.Видимость КАК РазделыФорумаСУОВидимость
			|ГДЕ
			|	РазделыФорумаСУОВидимость.Ссылка = &РазделФорума
			|	И РазделыФорумаСУОВидимость.Модератор = ИСТИНА";
			
			Запрос.УстановитьПараметр("РазделФорума", ДанныеОТеме.Контекст);
			
			МассивРезультатов = Запрос.ВыполнитьПакет();
			
			Для каждого Результат Из МассивРезультатов Цикл
				
				ВыборкаДетальныеЗаписи = Результат.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					Если МассивМодераторов.Найти(ВыборкаДетальныеЗаписи.Модератор) = Неопределено Тогда
						МассивМодераторов.Добавить(ВыборкаДетальныеЗаписи.Модератор);		
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
			Для каждого Модератор Из МассивМодераторов Цикл
				
				Движение = Движения.ТемыМодераторовСУО.Добавить();
				
				Движение.Пользователь = Модератор;
				Движение.Тема         = Тема;
				
			КонецЦикла;
			
		КонецЕсли;
		
		// Движения по регистру ТемыПользователейСУО 
		
		Если ПервоеСообщениеВТеме Тогда
			
			Для каждого ПолучательСообщения Из МассивПолучателейСообщения Цикл
				
				Движение = Движения.ТемыПользователейСУО.Добавить();
				
				Движение.Пользователь = ПолучательСообщения;
				Движение.Тема         = Тема;				
				
				Движение.Кому         = ДанныеОТеме.Кому;
				Движение.Контекст     = ДанныеОТеме.Контекст;
				Движение.ДатаСоздания = ДанныеОТеме.ДатаСоздания;
				Движение.ЭтоАвтор     = ?(ДанныеОТеме.Автор = ПолучательСообщения, Истина, Ложь);				
				Движение.Рассылка     = Рассылка;				
				Движение.Закрыта      = ДанныеОТеме.Закрыта;
				
				Движение.ЭтоГрупповоеОбсуждение = ЭтоГрупповоеОбсуждение;
				
			КонецЦикла;			
			
		КонецЕсли;
		
	КонецЕсли; // НЕ ТолькоЭлектроннаяПочта	
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	// {{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ШаблоныСообщенийСУО") Тогда
		// Заполнение шапки
		Шаблон = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаПеременные Из ДанныеЗаполнения.Переменные Цикл
			НоваяСтрока = ЗначенияПеременных.Добавить();
			НоваяСтрока.Переменная = ТекСтрокаПеременные.Переменная;
		КонецЦикла;
	КонецЕсли;
	// }}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

#КонецОбласти


#КонецЕсли
