
&НаСервере
Функция ПроверитьВозможностьУстановки()
	Возврат ВебКабинетСУ.ПроверитьВозможностьУстановки();
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТекстСообщения = ПроверитьВозможностьУстановки();
	Если ТекстСообщения = Неопределено Тогда
		ОткрытьФорму("Справочник.ПубликацииВебКабинетаСУ.Форма.УстановкаИОбновление",, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПредупреждения", ЭтотОбъект);
		ПоказатьПредупреждение(ОписаниеОповещения, ТекстСообщения);		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПредупреждения(ДополнительныеПараметры) Экспорт
	ОткрытьФорму("ОбщаяФорма.НастройкиВебСервераСУ");
КонецПроцедуры