
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЕстьПоддержкаСотрудников	= УправлениеОбучениемСУОВызовСервера.ЕстьПоддержкаСотрудников(); 
	ЕстьПоддержкаСтудентов = УправлениеОбучениемСУОВызовСервера.ЕстьПоддержкаСтудентов();
	
	Если ЕстьПоддержкаСотрудников И НЕ ЕстьПоддержкаСтудентов Тогда
		ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Новый Структура("ПрохождениеОбучения", ПараметрКоманды), Истина);
		ОткрытьФорму("Отчет.ИспользованиеЭлектронныхРесурсовСУО.Форма", ПараметрыФормы);		
	ИначеЕсли ЕстьПоддержкаСтудентов И НЕ ЕстьПоддержкаСотрудников Тогда
		ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Новый Структура("ПрохождениеОбучения", ПараметрКоманды), Истина);
		ОткрытьФорму("Отчет.ИспользованиеЭлектронныхРесурсовОО.Форма", ПараметрыФормы);				
	Иначе
		ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Новый Структура("ПрохождениеОбучения", ПараметрКоманды), Истина);
		ОткрытьФорму("Отчет.ИспользованиеЭлектронныхРесурсовСУЗ.Форма", ПараметрыФормы);		
	КонецЕсли;	
	
КонецПроцедуры
