
Процедура ОткрытьЗадание(Знач ОписаниеЗадания, ПрохождениеОбучения = Неопределено, ОткрытоВнешнимПользователем = Ложь, ОткрытоИзБиблиотеки = Ложь, Знач ТолькоПросмотр = Ложь) Экспорт
	
	// Описание задания должно включать следующие свойства:
	// - Задание
	// - НаОсновеЭлектронногоРесурса
	
	Если ПрохождениеОбучения = Неопределено Тогда		
		ПрохождениеЗадания = ОбучениеСУО.ПоследнееПрохождениеЗадания(, ОписаниеЗадания.Задание);		
		ПрохождениеОбучения = ОбщегоНазначенияСУВызовСервера.ЗначениеРеквизитаОбъекта(ПрохождениеЗадания, "ПрохождениеОбучения");		
	КонецЕсли;
	
	ОписаниеПрохождения = ОбучениеСУО.ПриПрохожденииЗадания(ПрохождениеОбучения, ОписаниеЗадания.Задание,,,Истина);
	
	Если НЕ ОписаниеПрохождения.ОписаниеПрохожденияМероприятия.Актуально Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если НЕ ОписаниеПрохождения.ОписаниеПрохожденияМероприятия.ЗаданияДоступны Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Задания недоступны'"));
	КонецЕсли;
	
	Если ОткрытоИзБиблиотеки Тогда
		
		ПараметрыФормы = Новый Структура("ПрохождениеЗадания, ОткрытоВнешнимПользователем, ОткрытоИзБиблиотеки", ОписаниеПрохождения.ПопыткаВыполненияЗадания, ОткрытоВнешнимПользователем, ОткрытоИзБиблиотеки);
		ОткрытьФорму("ОбщаяФорма.КарточкаЗаданияСУО", ПараметрыФормы);
		
	Иначе
		
		Если ОписаниеЗадания.НаОсновеЭлектронногоРесурса Тогда
			
			
			ОбъектыСУЗКлиент.ОткрытьОбозреватель(ОписаниеПрохождения.ЭлектронныйРесурс,
												 ОписаниеПрохождения.Фрагмент,
												 ?(ЗначениеЗаполнено(ОписаниеПрохождения.Фрагмент), Истина, Ложь),
												 ОписаниеПрохождения.Фрагмент,
												 ПрохождениеОбучения,
												 ОписаниеЗадания.Задание,
			                                     ОписаниеПрохождения.Вариант,
			                                     ,
			                                     ТолькоПросмотр,
			                                     ?(ОткрытоВнешнимПользователем, ОписаниеПрохождения.Пользователь, Неопределено));
												 
			
		ИначеЕсли ТипЗнч(ОписаниеЗадания.Задание) = Тип("СправочникСсылка.ЭлектронныеКурсы") Тогда
												 
			ИзучениеЭлектронныхКурсовКлиент.ИзучитьЭлектронныйКурс(
				ОписаниеЗадания.Задание, ОписаниеПрохождения.ПроведениеОбучения, ОписаниеПрохождения.Пользователь);
												 
		Иначе
												 
			
			ПараметрыФормы = Новый Структура("ПрохождениеЗадания, ОткрытоВнешнимПользователем", ОписаниеПрохождения.ПопыткаВыполненияЗадания, ОткрытоВнешнимПользователем);
			ОткрытьФорму("ОбщаяФорма.КарточкаЗаданияСУО", ПараметрыФормы);

		КонецЕсли;
					
	КонецЕсли;
		
КонецПроцедуры

Процедура ОткрытьЗаявку(Знач ПредметЗаявки, Знач Пользователь, СоздатьНовую=Ложь) Экспорт
	
	ПараметрыФормы = Новый Структура("ПредметЗаявки", ПредметЗаявки);
	
	Если НЕ СоздатьНовую Тогда 
		
		// Ищем существующую заявку
		
		ДанныеЗаявки = ОбучениеСУОВызовСервера.ЗаявкаНаОбучениеПользователя(ПредметЗаявки, Пользователь);
		
		Если ДанныеЗаявки <> Неопределено Тогда
			ПараметрыФормы.Вставить("Ключ", ДанныеЗаявки.Заявка);
		КонецЕсли;	
		
	КонецЕсли;
		
	ОткрытьФорму("ОбщаяФорма.КарточкаЗаявкиСУО", ПараметрыФормы);
	
КонецПроцедуры

Процедура ОткрытьОбучение(Обучение) Экспорт
	ОткрытьФорму("ОбщаяФорма.КарточкаОбученияСУО", Новый Структура("Обучение", Обучение));
КонецПроцедуры

Процедура ЗаписатьсяНаОбучение(Знач ПроведениеОбучения, Знач Пользователь) Экспорт
	
	Оповещение = Новый ОписаниеОповещения("ЗаписатьсяНаОбучениеПродолжение", ЭтотОбъект, Новый Структура("ПроведениеОбучения, Пользователь", ПроведениеОбучения, Пользователь));
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Записаться на обучение?'"), РежимДиалогаВопрос.ДаНет, 0);	
	
КонецПроцедуры

Процедура ЗаписатьсяНаОбучениеПродолжение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    РезультатЗачисления = ОбучениеСУОВызовСервера.ЗаписатьПользователяНаОткрытоеОбучение(Параметры.ПроведениеОбучения, Параметры.Пользователь);
	
	Если РезультатЗачисления = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатЗачисления.ЕстьОшибки Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатЗачисления.ТекстОшибки);
		Возврат;
	Иначе
		Оповестить("ОбновитьМоеОбучение");
		ОткрытьОбучение(РезультатЗачисления.ПрохождениеОбучения);
	КонецЕсли;

КонецПроцедуры
