
#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьБыстрыйОтборСписка(ИмяОтбора, Значение)
	
	Если ИмяОтбора = "Период" Тогда
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, "ДатаНачалаПроведения");
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Список.Отбор, "ДатаНачалаПроведения", ВидСравненияКомпоновкиДанных.БольшеИлиРавно, Значение.ДатаНачала, "ДатаНачалаПроведения", ЗначениеЗаполнено(Значение.ДатаНачала));	
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Список.Отбор, "ДатаНачалаПроведения", ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, Значение.ДатаОкончания, "ДатаНачалаПроведения", ЗначениеЗаполнено(Значение.ДатаОкончания));
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, ИмяОтбора, Значение,,, ЗначениеЗаполнено(Значение));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатус(ИмяСтатуса)
	
	Если ТипЗнч(Элементы.Список.ВыделенныеСтроки) = Тип("Массив")
		И Элементы.Список.ВыделенныеСтроки.Количество() > 0 Тогда
		
		НовыйСтатус = Перечисления.СтатусыПроведенияОбъектовСУО[ИмяСтатуса];
		
		НачатьТранзакцию();
		
		Для каждого Строка Из Элементы.Список.ВыделенныеСтроки Цикл
			
			Если ТипЗнч(Строка) <> Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО") Тогда
				Продолжить;
			КонецЕсли;
			
			ПроведениеПрограммыОбученияОбъект = Строка.ПолучитьОбъект();
			ПроведениеПрограммыОбученияОбъект.Статус = НовыйСтатус;
			
			Если ПроведениеПрограммыОбученияОбъект.Проведен Тогда
				РежимЗаписи = РежимЗаписиДокумента.Проведение;
			Иначе
				РежимЗаписи = РежимЗаписиДокумента.Запись;
			КонецЕсли;
			
			Попытка 
				ПроведениеПрограммыОбученияОбъект.Заблокировать();
			Исключение
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСТР("ru = 'Не удалось заблокировать объект %1'"),
					Строка(ПроведениеПрограммыОбученияОбъект));
			КонецПопытки;
				
			ПроведениеПрограммыОбученияОбъект.Записать(РежимЗаписи);
			ПроведениеПрограммыОбученияОбъект.Разблокировать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеНастроек = ХранилищеСистемныхНастроек.Загрузить(ИмяФормы+"/ТекущиеДанные");
	
	Если ДанныеНастроек <> Неопределено Тогда
		
		ОтборПрограммаОбучения = ДанныеНастроек.Получить("ОтборПрограммаОбучения");
		
		УстановитьБыстрыйОтборСписка("ПрограммаОбучения", ОтборПрограммаОбучения);
		
		ОтборПериод = ДанныеНастроек.Получить("ОтборПериод");
		
		УстановитьБыстрыйОтборСписка("Период", ОтборПериод);
		
		ОтборСтатус = ДанныеНастроек.Получить("ОтборСтатус");
		
		УстановитьБыстрыйОтборСписка("Статус", ОтборСтатус);
		
	КонецЕсли;

	ИспользоватьКаталогОбучений = ПолучитьФункциональнуюОпцию("ИспользоватьКаталогОбученийСУО");
	Элементы.ПодменюСоздать.Видимость = ИспользоватьКаталогОбучений;
	Элементы.ФормаСоздатьБезСценарияОсновная.Видимость = НЕ ИспользоватьКаталогОбучений;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписокПрограммОбучения" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОтборСтатусПриИзменении(Элемент)
	УстановитьБыстрыйОтборСписка("Статус", ОтборСтатус);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодПриИзменении(Элемент)
	УстановитьБыстрыйОтборСписка("Период", ОтборПериод);
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтборПрограммаОбученияПриИзменении(Элемент)
	УстановитьБыстрыйОтборСписка("ПрограммаОбучения", ОтборПрограммаОбучения);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Статус мероприятия

&НаКлиенте
Процедура УстановитьСтатусАктивно(Команда)
	УстановитьСтатус("Активно");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусЗавершено(Команда)
	УстановитьСтатус("Завершено");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусЗапланировано(Команда)
	УстановитьСтатус("Запланировано");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусОтменено(Команда)
	УстановитьСтатус("Отменено");
КонецПроцедуры

// Создание

&НаКлиенте
Процедура СоздатьБезСценария(Команда)
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("БезСценария", Истина));
	ОткрытьФорму("Документ.ПроведениеПрограммыОбученияСУО.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаОсновеПрограммы(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПровестиПрограммуОбучениеНаОсновеСценарияПродолжение", ЭтотОбъект);	
	
	ОткрытьФорму("Справочник.КаталогПрограммОбученияСУО.ФормаВыбора",,,,,,ОписаниеОповещения);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиПрограммуОбучениеНаОсновеСценарияПродолжение(ВыбраннаяПрограммаОбучения, ДополнительныеПараметры) Экспорт
	
	Если ВыбраннаяПрограммаОбучения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("ПрограммаОбучения, БезСценария", ВыбраннаяПрограммаОбучения, Ложь));
	ОткрытьФорму("Документ.ПроведениеПрограммыОбученияСУО.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры

// Копирование

&НаКлиенте
Процедура СкопироватьПроведениеОбучения(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ДополнительныеПараметры = Новый Структура("ПроведениеПрограммыОбучения", ТекущиеДанные.Ссылка);
	ПараметрыФормы = Новый Структура("ПроведениеПрограммыОбучения", ТекущиеДанные.Ссылка);
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("СкопироватьПроведениеПрограммыОбученияПродолжение", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("Документ.ПроведениеОбученияСУО.Форма.ФормаВыбораНастроекКопирования", ПараметрыФормы, ЭтотОбъект,,,,ОписаниеОповещенияОЗакрытии);	
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьПроведениеПрограммыОбученияПродолжение(НастройкиКопирования, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(НастройкиКопирования) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	НовоеПроведениеПрограммыОбучения = СкопироватьПроведениеПрограммыОбученияНаСервере(ДополнительныеПараметры.ПроведениеПрограммыОбучения, НастройкиКопирования);
	Элементы.Список.Обновить();
	Элементы.Список.ТекущаяСтрока = НовоеПроведениеПрограммыОбучения;
		
КонецПроцедуры

&НаСервере
Функция СкопироватьПроведениеПрограммыОбученияНаСервере(ПроведениеПрограммыОбучения, НастройкиКопирования)
	
	НачатьТранзакцию();
	
	Попытка
		
		// Копируем проведение программы
		
		НоваяПрограммаОбъект = ПроведениеПрограммыОбучения.Скопировать();
		
		НоваяПрограммаОбъект.Дата = ТекущаяДатаСеанса();
		НоваяПрограммаОбъект.ДатаИзменения = НоваяПрограммаОбъект.Дата;
		НоваяПрограммаОбъект.ИдентификаторОбъектаКопирования = ПроведениеПрограммыОбучения.УникальныйИдентификатор();		
		НоваяПрограммаОбъект.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1 (копия)'"), НоваяПрограммаОбъект.Наименование);
		НоваяПрограммаОбъект.ЗапросНаОбучение = Неопределено;
		НоваяПрограммаОбъект.Проведен = Ложь;
		НоваяПрограммаОбъект.Записать(РежимЗаписиДокумента.Запись);
		
		// Копируем проведения обучения
		
		НастройкиКопирования.Вставить("ПроведениеПрограммыОбучения", НоваяПрограммаОбъект.Ссылка);
		
		ТаблицаПроведенийОбучения = Документы.ПроведениеПрограммыОбученияСУО.ПроведенияОбучения(ПроведениеПрограммыОбучения);
		
		Для каждого СтрокаТП Из ТаблицаПроведенийОбучения Цикл			
			НовоеПроведениеОбучения = Документы.ПроведениеОбученияСУО.СкопироватьПроведениеОбучения(СтрокаТП.Ссылка, НастройкиКопирования);
		КонецЦикла;		
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;	 
	
	Возврат НоваяПрограммаОбъект.Ссылка;
	
КонецФункции


#КонецОбласти

