#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ЗначениеВЧисло(Значение) Экспорт
	
	Если Значение = Перечисления.СтатусыЗаявокНаОбучениеСУО.НаРассмотрении Тогда
		Возврат 1;
	КонецЕсли;
	
	Если Значение = Перечисления.СтатусыЗаявокНаОбучениеСУО.Утверждена Тогда
		Возврат 2;
	КонецЕсли;
	
	Если Значение = Перечисления.СтатусыЗаявокНаОбучениеСУО.Отклонена Тогда
		Возврат 3;
	КонецЕсли;
	
	Если Значение = Перечисления.СтатусыЗаявокНаОбучениеСУО.Отменена Тогда
		Возврат 4;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ЧислоВЗначение(ЗначениеЧисло) Экспорт
	
	Если ЗначениеЧисло = 1 Тогда
		Возврат Перечисления.СтатусыЗаявокНаОбучениеСУО.НаРассмотрении;
	КонецЕсли;
	
	Если ЗначениеЧисло = 2 Тогда
		Возврат Перечисления.СтатусыЗаявокНаОбучениеСУО.Утверждена;
	КонецЕсли;
	
	Если ЗначениеЧисло = 3 Тогда
		Возврат Перечисления.СтатусыЗаявокНаОбучениеСУО.Отклонена;
	КонецЕсли;
	
	Если ЗначениеЧисло = 4 Тогда
		Возврат Перечисления.СтатусыЗаявокНаОбучениеСУО.Отменена;
	КонецЕсли;
	
	Возврат Перечисления.СтатусыЗаявокНаОбучениеСУО.ПустаяСсылка();	
	
КонецФункции

Функция ПредставлениеЗначения(Значение) Экспорт
	Возврат Строка(Значение);
КонецФункции

Функция ЧислоВПредставление(ЗначениеЧисло) Экспорт
	Возврат ПредставлениеЗначения(ЧислоВЗначение(ЗначениеЧисло));
КонецФункции

#КонецЕсли
