

#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем реквизиты
	
	Редакция = ВебКабинетСУ.Редакция();
	ПутьКОбщемуКаталогу = ОбъектыСУЗПовтИсп.ПутьКОбщемуКаталогу();
	АвтоматическаяНастройка = ВебКабинетСУ.ИспользуетсяАвтоматическаяНастройка();
	ПутьККаталогуКабинета = ВебКабинетСУ.ПутьККаталогуУстановки(ПутьКОбщемуКаталогу);
	АдресИнформационнойБазы = ОбщегоНазначенияСУ.АдресИнформационнойБазы();
	Тема = Перечисления.ТемыВебКабинетаСУ.Облако;
	ФоновымЗаданием = Истина;			
	ИмяФайлаДистрибутива = ВебКабинетСУ.ИмяФайлаДистрибутива();
	РедакцияСтрока = ВебКабинетСУ.РедакцияСтрока();
	
	Если АвтоматическаяНастройка Тогда
		ЕдинственнаяАвтоПубликация = Справочники.ПубликацииВебКабинетаСУ.ЕдинственнаяПубликацияВОбщемКаталоге();
		Если ЗначениеЗаполнено(ЕдинственнаяАвтоПубликация) Тогда
			РегистрационныйНомер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЕдинственнаяАвтоПубликация, "РегистрационныйНомер");
		КонецЕсли;
	КонецЕсли;
	
	РегистрационныйНомерПриИзмененииНаСервере();
	
	УстановитьКартинкуТемы();
	
	// Устанавливаем видимость элементов
	
	Элементы.РегистрационныйНомер.Видимость = АвтоматическаяНастройка;
	Элементы.ОписаниеРегистрационногоНомера.Видимость = АвтоматическаяНастройка;
	
	Элементы.ГруппаРедакция30.Видимость = ?(Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция30, Истина, Ложь);
	Элементы.ГруппаРедакция20.Видимость = ?(Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция20, Истина, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВерсияВебКабинетаНаКлиенте = Неопределено;
	ПутьКДистрибутивуНаКлиенте = Неопределено;	
	
	#Если НЕ ВебКлиент Тогда
		
	СистемнаяИнформация = Новый СистемнаяИнформация();
	
	Если (СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86) 
		ИЛИ (СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64) Тогда
		
		КаталогиШаблоновКонфигураций = ОбщегоНазначенияСУКлиент.КаталогиШаблоновКонфигураций();
		
		Для каждого ПутьККаталогуШаблонов Из КаталогиШаблоновКонфигураций Цикл
			
			ПутьККаталогуДистрибутивовВебКабинета = ПутьККаталогуШаблонов + "1c\SDO\WebCabinet\";
			НомерРедакцииМаска = СтрЗаменить(РедакцияСтрока, ".", "_");
			
			МассивСборокВКаталоге = НайтиФайлы(ПутьККаталогуДистрибутивовВебКабинета, НомерРедакцииМаска + "_*", Ложь);
			
			Для каждого ТекущийКаталог Из МассивСборокВКаталоге Цикл			
				
				Если ТекущийКаталог.ЭтоКаталог() Тогда
					
					ИмяКаталогаСтрока = ТекущийКаталог.Имя;
					НомерВерсииСтрока = СтрЗаменить(ИмяКаталогаСтрока, "_", ".");
					
					Если НЕ ЗначениеЗаполнено(ВерсияВебКабинетаНаКлиенте)
						ИЛИ ОбщегоНазначенияКлиентСервер.СравнитьВерсии(НомерВерсииСтрока, ВерсияВебКабинетаНаКлиенте) > 0 Тогда
						
						ВерсияВебКабинетаНаКлиенте = НомерВерсииСтрока;
						ПутьКДистрибутивуНаКлиенте = ТекущийКаталог.ПолноеИмя + "\" + ИмяФайлаДистрибутива;
						
					КонецЕсли;
										
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;		
			
	#КонецЕсли	
	
	Элементы.ГруппаДистрибутивНаКлиенте.Видимость = ЗначениеЗаполнено(ПутьКДистрибутивуНаКлиенте);
	Элементы.ДекорацияДистрибутивНеНайден.Видимость = НЕ ЗначениеЗаполнено(ПутьКДистрибутивуНаКлиенте);
	Элементы.ДекорацияДистрибутивНеНайден30.Видимость = НЕ ЗначениеЗаполнено(ПутьКДистрибутивуНаКлиенте);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ТемаПриИзменении(Элемент)
	УстановитьКартинкуТемы();
КонецПроцедуры

&НаКлиенте
Процедура РегистрационныйНомерПриИзменении(Элемент)
	РегистрационныйНомерПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Установить(Команда)
	
	Если АвтоматическаяНастройка
		И НЕ ЗначениеЗаполнено(РегистрационныйНомер) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите регистрационный номер'"),,"РегистрационныйНомер");
		Возврат;
		
	КонецЕсли;
	
	Если АвтоматическаяНастройка
		И НЕ РегистрационныйНомерКорректный Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите корректный регистрационный номер'"),,"РегистрационныйНомер");
		Возврат;
		
	КонецЕсли;
	
	// Определяем переменные
	
	АдресХраненияДистрибутиваНаСервере = "";
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжениеУстановки", ЭтотОбъект);
	
	Если ЗначениеЗаполнено(ПутьКДистрибутивуНаКлиенте) Тогда
		НачатьПомещениеФайла(ОписаниеОповещения,, ПутьКДистрибутивуНаКлиенте, Ложь, УникальныйИдентификатор);
	Иначе
		НачатьПомещениеФайла(ОписаниеОповещения,,, Истина, УникальныйИдентификатор);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПродолжениеУстановки(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат ИЛИ НЕ ЗначениеЗаполнено(ВыбранноеИмяФайла) Тогда
		Возврат;
	КонецЕсли;
	
	АдресХраненияДистрибутиваНаСервере = Адрес; // Сохраняем в реквизите
	Статус = НСтр("ru = 'Дистрибутив помещен во временное хранилище'", "ru");	
	
	Если ОпубликоватьВебКабинет() = ИСТИНА Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Установка успешно завершена'"));
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ОпубликоватьВебКабинет() Экспорт
	
	Если НЕ МонопольныйРежим() Тогда
				
		Попытка
			МассивПараметровФЗ = Новый Массив;
			МассивПараметровФЗ.Добавить("УстановкаВебКабинета");
			ФоновыеЗадания.Выполнить("ОбновлениеИнформационнойБазыСУО.ОтправитьСтатистикуИспользования", МассивПараметровФЗ); //--# Заменить на ОбновлениеИнформационнойБазыКК
		Исключение
			// Не требуется
		КонецПопытки;				
		
	КонецЕсли;	
	
	// Копируем файлы веб-кабинета
	
	РезультатИнициализации = ВебКабинетСУ.ИнициализироватьКаталогВебКабинета(ДляТестирования, ОчищатьПередВыгрузкой, Тема, АдресХраненияДистрибутиваНаСервере);
	
	Если НЕ РезультатИнициализации.КаталогИнициализирован Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Каталог не инициализирован. Причина ошибки: '") + РезультатИнициализации.ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;	
	
	// Определяем будут ли формироваться задания
			
	Если ОчищатьПередВыгрузкой Тогда
		СформироватьЗаданияНаОбновление = Истина;
	ИначеЕсли Справочники.ПубликацииВебКабинетаСУ.ЕстьПубликации() Тогда
		СформироватьЗаданияНаОбновление = ОбновитьДанныеБазы;
	Иначе		
		СформироватьЗаданияНаОбновление = Истина;
	КонецЕсли;
	
	// Формируем публикацию для автоматической настройки
	
	Если АвтоматическаяНастройка Тогда
		
		Если НЕ ЗначениеЗаполнено(РегистрационныйНомер) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите регистрационный номер'"),,"РегистрационныйНомер");
			Возврат Ложь;
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Попытка
			
			ПубликацияСсылка = Справочники.ПубликацииВебКабинетаСУ.ЕдинственнаяПубликацияВОбщемКаталоге();
			
			Если ЗначениеЗаполнено(ПубликацияСсылка) Тогда
				ПубликацияОбъект = ПубликацияСсылка.ПолучитьОбъект();
			Иначе
				ПубликацияОбъект = Справочники.ПубликацииВебКабинетаСУ.СоздатьЭлемент();
				ПубликацияОбъект.ДополнительныеСвойства.Вставить("ИспользоватьПоУмолчанию", Истина);
				ПубликацияОбъект.Редакция = ВебКабинетСУ.Редакция();
			КонецЕсли;		
			
			ПубликацияОбъект.РегистрационныйНомер = РегистрационныйНомер;
			ПубликацияОбъект.ЗаполнитьАвтоматическуюПубликацию();
			
			ПубликацияОбъект.Записать();
			
			ПубликацияОбъект.ЗаписатьФайлНастроек();
			
			ЗафиксироватьТранзакцию();
		
		Исключение
		
		 	ОтменитьТранзакцию();
			ВызватьИсключение;
			
		КонецПопытки;
				
	КонецЕсли;
	
	// Формируем данные веб-кабинета

	Если СформироватьЗаданияНаОбновление Тогда
		Возврат ВебКабинетСУ.ЗаполнитьДанныеВебКабинета(ОчищатьПередВыгрузкой, ФоновымЗаданием);
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УстановитьКартинкуТемы()
	
	Элементы.ДекорацияВидТемы.Картинка = Новый Картинка();
	
	Если Тема = Перечисления.ТемыВебКабинетаСУ.Облако Тогда
		Элементы.ДекорацияВидТемы.Картинка = БиблиотекаКартинок.ТемаВебКабинетаОблако;
	КонецЕсли;
	
	Если Тема = Перечисления.ТемыВебКабинетаСУ.Аквамарин Тогда
		Элементы.ДекорацияВидТемы.Картинка = БиблиотекаКартинок.ТемаВебКабинетаАквамарин;
	КонецЕсли;	
	
	Если Тема = Перечисления.ТемыВебКабинетаСУ.Лето Тогда
		Элементы.ДекорацияВидТемы.Картинка = БиблиотекаКартинок.ТемаВебКабинетаЛето;
	КонецЕсли;
	
	Если Тема = Перечисления.ТемыВебКабинетаСУ.Пляж Тогда
		Элементы.ДекорацияВидТемы.Картинка = БиблиотекаКартинок.ТемаВебКабинетаПляж;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура РегистрационныйНомерПриИзмененииНаСервере()
	
	РегистрационныйНомерКорректный = Ложь;
	
	Если НЕ ЗначениеЗаполнено(РегистрационныйНомер) Тогда
		ОписаниеРегистрационногоНомера = НСтр("ru = 'Укажите регистрационный номер.'");
		Возврат;
	КонецЕсли;		
	
	ОписаниеНомера = ЛицензированиеВебКабинетаСУ.НайтиРегистрационныйНомер(РегистрационныйНомер);
	РезультатПроверки = ЛицензированиеВебКабинетаСУ.РезультатПроверкиРегистрационногоНомера(ОписаниеНомера);
	
	Если ЗначениеЗаполнено(РезультатПроверки) Тогда
		ОписаниеРегистрационногоНомера = РезультатПроверки;
	Иначе
		РегистрационныйНомерКорректный = Истина;
		ОписаниеРегистрационногоНомера = ОписаниеНомера.ЛицензионныеОграничения;
	КонецЕсли;
		
КонецПроцедуры


#КонецОбласти


