#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Перем ТаблицаСтатистикиПараметровSCORM Экспорт;
	
#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// 1. Движение по регистру ПопыткиПрохожденияЭлектронныхРесурсовСУЗ 
	
	Движения.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Записывать = Истина;
	
	Если ЭлектронныеРесурсыПереопределяемый.ОбучениеОтменено(Отменено, ПрохождениеОбучения, Задание) Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьДвижения();
	
КонецПроцедуры

Функция ПараметрSCORMИспользуется(Параметр, НастройкиПакетаSCORM, ТаблицаСтатистикиПараметровSCORM)
	
	СтрокаТСП = ТаблицаСтатистикиПараметровSCORM.Найти(Параметр, "Параметр");
	
	Если СтрокаТСП <> Неопределено Тогда
		Если НЕ СтрокаТСП.Передан Тогда
			Возврат Ложь;
		КонецЕсли;
		Если СтрокаТСП.ПереданСОшибкой Тогда
			Возврат Ложь;
		КонецЕсли;		
	КонецЕсли;
	
	СтрокаТН = НастройкиПакетаSCORM.ТаблицаНастроек.Найти(Параметр, "Параметр");
	
	Если СтрокаТН <> Неопределено Тогда
		Возврат СтрокаТН.Используется;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура СформироватьДвижения() Экспорт

	// Заполняем таблицу статистики использования параметров SCORM
	
	ТаблицаСтатистикиПараметровSCORM = Перечисления.ИспользуемыеПараметрыSCORM.НоваяТаблицаСтатистикиПараметровSCORM();	
	
	Если ДополнительныеСвойства.Свойство("ЭтоПолучениеСтатистикиSCORM")
		И ДополнительныеСвойства.ЭтоПолучениеСтатистикиSCORM Тогда
		НастройкиПакетаSCORM  = Справочники.РесурсыСУЗ.НастройкиSCORMДляПолученияСтатистики();
	Иначе
		НастройкиПакетаSCORM  = Справочники.РесурсыСУЗ.НастройкиПакетаSCORM(Ресурс);
	КонецЕсли;
	
	Если СтатистикаПараметров.Количество() = 0 Тогда
		
		СоответствиеРеквизитовИПараметров = Новый Соответствие;
		СоответствиеРеквизитовИПараметров.Вставить(Перечисления.ИспользуемыеПараметрыSCORM.completion_status, "СостояниеВыполнения");	
		СоответствиеРеквизитовИПараметров.Вставить(Перечисления.ИспользуемыеПараметрыSCORM.exit, "ПричинаВыхода");
		СоответствиеРеквизитовИПараметров.Вставить(Перечисления.ИспользуемыеПараметрыSCORM.progress_measure, "ПроцентВыполнения");
		СоответствиеРеквизитовИПараметров.Вставить(Перечисления.ИспользуемыеПараметрыSCORM.score, "Результат");
		СоответствиеРеквизитовИПараметров.Вставить(Перечисления.ИспользуемыеПараметрыSCORM.session_time, "ПродолжительностьПоследнейСессии");
		СоответствиеРеквизитовИПараметров.Вставить(Перечисления.ИспользуемыеПараметрыSCORM.success_status, "СостояниеПрохождения");		
		
		Для каждого ЭлементСоответствия Из СоответствиеРеквизитовИПараметров Цикл
			
			ТекущееЗначение = ЭтотОбъект[ЭлементСоответствия.Значение];
			
			Если ТекущееЗначение = Перечисления.СостоянияВыполненияОбъектовSCORM.unknown Тогда
				ТекущееЗначение = Неопределено;
			КонецЕсли;
			
			Если ТекущееЗначение = Перечисления.СостоянияПрохожденияОбъектовSCORM.unknown Тогда
				ТекущееЗначение = Неопределено;
			КонецЕсли;			
			
			Перечисления.ИспользуемыеПараметрыSCORM.ДобавитьСтрокуВТаблицуСтатистики(
				ТаблицаСтатистикиПараметровSCORM,
				СводЗнаний,
				ЭлементСодержанияСводаЗнаний,
				ЭлементСоответствия.Ключ,
				ЗначениеЗаполнено(ТекущееЗначение),
				Ложь,
				ТекущееЗначение);				
		
		КонецЦикла;
		
	Иначе
		
		Для каждого СтрокаСПТЧ Из СтатистикаПараметров Цикл
			
			Перечисления.ИспользуемыеПараметрыSCORM.ДобавитьСтрокуВТаблицуСтатистики(
				ТаблицаСтатистикиПараметровSCORM,
				СводЗнаний,
				ЭлементСодержанияСводаЗнаний,
				СтрокаСПТЧ.Параметр,
				СтрокаСПТЧ.Передан,
				СтрокаСПТЧ.ПереданСОшибкой,
				СтрокаСПТЧ.Значение);
				
		КонецЦикла;		
		
	КонецЕсли;	
	
	Движение = Движения.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Добавить();
	
	Движение.Период                   = Дата;
	Движение.Пользователь             = Пользователь;
	Движение.ЭлементСодержания        = ЭлементСодержанияСводаЗнаний;
	Движение.ПрохождениеОбучения      = ПрохождениеОбучения;
	Движение.Задание                  = ОбъектыСУЗ.ЗаданиеПопытки(ПрохождениеОбучения, СводЗнаний, Задание);
	Движение.ЭлектронныйРесурс        = СводЗнаний;
	Движение.СсылкаНаОбъектСУЗ        = Ресурс;
	Движение.ДатаНачалаПрохождения    = ДатаНачалаВыполнения;
	Движение.ДатаОкончанияПрохождения = Дата;
	Движение.ЭтоТест                  = Ложь;
	Движение.НомерРегистратора        = Номер;
	
	ЭлектронныеРесурсыПереопределяемый.ПроведениеОбучения(Движение.ПроведениеОбучения, ПрохождениеОбучения);
	
	// Попытка завершена
	
	Движение.ПопыткаЗавершена = Ложь;
	
	Если ПараметрSCORMИспользуется(Перечисления.ИспользуемыеПараметрыSCORM.completion_status, НастройкиПакетаSCORM, ТаблицаСтатистикиПараметровSCORM) Тогда
		
		Если СостояниеВыполнения = Перечисления.СостоянияВыполненияОбъектовSCORM.completed Тогда			
			Движение.ПопыткаЗавершена = Истина;
		КонецЕсли;
		
	Иначе
		
		Если ПараметрSCORMИспользуется(Перечисления.ИспользуемыеПараметрыSCORM.success_status, НастройкиПакетаSCORM, ТаблицаСтатистикиПараметровSCORM) Тогда
			Если СостояниеПрохождения = Перечисления.СостоянияПрохожденияОбъектовSCORM.failed
				ИЛИ СостояниеПрохождения = Перечисления.СостоянияПрохожденияОбъектовSCORM.passed Тогда
				Движение.ПопыткаЗавершена = Истина;
			КонецЕсли;			
		КонецЕсли;
		
		Если ПараметрSCORMИспользуется(Перечисления.ИспользуемыеПараметрыSCORM.progress_measure, НастройкиПакетаSCORM, ТаблицаСтатистикиПараметровSCORM) Тогда
			Если ПроцентВыполнения = 100 Тогда
				Движение.ПопыткаЗавершена = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрSCORMИспользуется(Перечисления.ИспользуемыеПараметрыSCORM.score, НастройкиПакетаSCORM, ТаблицаСтатистикиПараметровSCORM) Тогда
			Движение.ПопыткаЗавершена = Истина;	
		КонецЕсли;

	КонецЕсли;
	
	Если ПараметрSCORMИспользуется(Перечисления.ИспользуемыеПараметрыSCORM.exit, НастройкиПакетаSCORM, ТаблицаСтатистикиПараметровSCORM) Тогда
		Если ПричинаВыхода = "suspend" Тогда
			Движение.ПопыткаЗавершена = Ложь;
		Иначе
			Движение.ПопыткаЗавершена = Истина;
		КонецЕсли;
	КонецЕсли;	
			
	// Результат
	
	Движение.ВыставляетсяОценка = ПараметрSCORMИспользуется(Перечисления.ИспользуемыеПараметрыSCORM.score, НастройкиПакетаSCORM, ТаблицаСтатистикиПараметровSCORM);
	
	Движение.Результат = 0;
	
	Если Движение.ПопыткаЗавершена Тогда
		
		Если Движение.ВыставляетсяОценка Тогда
			
			Если ЗначениеЗаполнено(РезультатВПроцентах) Тогда
				Если РезультатВПроцентах < 0 Тогда
					Движение.Результат = 0;
				Иначе
					Движение.Результат = РезультатВПроцентах * 100;
				КонецЕсли;
			Иначе
				Если (МинимальноВозможныйРезультат + МаксимальноВозможныйРезультат) = 0 Тогда
					Движение.Результат = 0;
				Иначе
					Движение.Результат = (Результат / (МинимальноВозможныйРезультат + МаксимальноВозможныйРезультат))*100;
				КонецЕсли;
			КонецЕсли;		
			
		Иначе
			
			Движение.Результат = 100;
			
		КонецЕсли;
			
	КонецЕсли;
	
	// Прогресс
	
	Если Движение.ПопыткаЗавершена Тогда
		Движение.ЗавершеноВПроцентах = 100;
	Иначе
		Если ПараметрSCORMИспользуется(Перечисления.ИспользуемыеПараметрыSCORM.progress_measure, НастройкиПакетаSCORM, ТаблицаСтатистикиПараметровSCORM) Тогда
			Движение.ЗавершеноВПроцентах = ПроцентВыполнения * 100;
		Иначе
			Движение.ЗавершеноВПроцентах = 0;
		КонецЕсли;
	КонецЕсли;
	
	Если Движение.ЗавершеноВПроцентах > 100 Тогда
		Движение.ЗавершеноВПроцентах = 100;
	КонецЕсли;		
	
	// Время сессии
	
	Движение.ВремяПрохожденияВСекундах = 0;
	
	Если ПараметрSCORMИспользуется(Перечисления.ИспользуемыеПараметрыSCORM.session_time, НастройкиПакетаSCORM, ТаблицаСтатистикиПараметровSCORM) Тогда
		Движение.ВремяПрохожденияВСекундах = ОбъектыSCORM.ПолучитьКоличествоСекундВременногоИнтервалаSCORM(ОбщаяПродолжительностьСессий);
	Иначе
		Для каждого ДанныеСессии Из Сессии Цикл
			Если НЕ ЗначениеЗаполнено(ДанныеСессии.ДатаИнициализации) Тогда
				Продолжить;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ДанныеСессии.ДатаЗакрытия) Тогда
				Продолжить;
			КонецЕсли;
			Движение.ВремяПрохожденияВСекундах = Движение.ВремяПрохожденияВСекундах
				+ Число(ДанныеСессии.ДатаЗакрытия - ДанныеСессии.ДатаИнициализации);				
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
