

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая()
		И ЗначениеЗаполнено(Объект.ИдентификаторОбъектаКопирования) Тогда
		
		ЭлементКопирования = Документы.РассылкаСообщенийСУО.ПолучитьСсылку(Объект.ИдентификаторОбъектаКопирования);
		ТекстРассылки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементКопирования, "ФорматированныйДокумент").Получить();
		
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая()
		И ЗначениеЗаполнено(Объект.Шаблон) Тогда
		ЗаполнитьПеременные();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ГруппаПроведенийОбучения) Тогда
		
		ПроведенияОбученияГруппы = РегистрыСведений.СоставыГруппПроведенийОбученияСУО.ПроведенияОбученияГруппы(Параметры.ГруппаПроведенийОбучения);
		
		Для каждого ПроведениеОбучения Из ПроведенияОбученияГруппы Цикл
			
			УчастникиПроведенияОбучения = Документы.ПроведениеОбученияСУО.УчастникиОбучения(ПроведениеОбучения);
			
			Для каждого СтрокаУПО Из УчастникиПроведенияОбучения Цикл
				Если Объект.Адресаты.НайтиСтроки(Новый Структура("Пользователь", СтрокаУПО.Пользователь)).Количество() = 0 Тогда
					НоваяСтрока = Объект.Адресаты.Добавить();
					НоваяСтрока.Пользователь             = СтрокаУПО.Пользователь; 
					НоваяСтрока.НаименованиеПользователя = СтрокаУПО.Наименование;
				КонецЕсли;	
			КонецЦикла;			
		
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормы();
	ЗаполнитьДополнительныеРеквизитыАдресатов();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
			
	ТекстРассылки = ТекущийОбъект.ФорматированныйДокумент.Получить();
	// ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ФорматированныйДокумент = Новый ХранилищеЗначения(ТекстРассылки, Новый СжатиеДанных(9));
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьДоступностьЭлементовФормы();
	ЗаполнитьДополнительныеРеквизитыАдресатов();
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПриИзменении(Элемент)
	ЗаполнитьПеременные();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура БезШаблонаПриИзменении(Элемент)
	Объект.Шаблон = Неопределено;
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыАдресаты

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Адресаты

&НаКлиенте
Процедура АдресатыПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Сообщение) Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(,НСтр("ru = 'Сообщение уже было отправлено. Адресат не может быть удален'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресатыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Копирование Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресатыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда		
		Возврат;		
	КонецЕсли;
	
	Для каждого ВыбранныйПользователь Из ВыбранноеЗначение Цикл
		
		Если Объект.Адресаты.НайтиСтроки(Новый Структура("Пользователь", ВыбранныйПользователь)).Количество() = 0 Тогда
			
			НоваяСтрока = Объект.Адресаты.Добавить();
			
			НоваяСтрока.Пользователь             = ВыбранныйПользователь; 
			НоваяСтрока.НаименованиеПользователя = ОбщегоНазначенияСУВызовСервера.ЗначениеРеквизитаОбъекта(ВыбранныйПользователь, "Наименование");

		КонецЕсли;
			
	КонецЦикла;	
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПодобратьПользователей(Команда)
	
	АдресСпискаВХранилище = ПоместитьСписокАдресатовВХранилище();
	
	ПараметрыФормы = Новый Структура("ПараметрыРасширеннойФормыПодбора, РасширенныйПодбор", АдресСпискаВХранилище, Истина);
	ОткрытьФорму("ОбщаяФорма.ПодборПользователейСУО", ПараметрыФормы, Элементы.Адресаты);

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаЭлектроннуюПочту(Команда)
	
	Если Модифицированность ИЛИ НЕ Объект.Проведен Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Перед выполнением операции проведите документ'"));
		Возврат;
	КонецЕсли;
	
	ОтправитьСообщенияНаЭлектроннуюПочту();
	
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТестовоеСообщение(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Перед отправкой тестового сообщения запишите документ'"));
		Возврат;
	КонецЕсли;
	
	ОтправитьТестовоеСообщение(Объект.Ссылка);
	
	ПоказатьПредупреждение(,НСтр("ru = 'Сообщение отправлено'"));
				
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаполнитьПеременные()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.РассылкаСообщенийСУО"));
	
	ДокументОбъект.ЗаполнитьПеременные();
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры

// Процедура заполняет у табличной части "Адресаты" реквизиты 
// "Проведен" и "ПометкаУдаления", которые участвуют в условном оформлении.
//
&НаСервере
Процедура ЗаполнитьДополнительныеРеквизитыАдресатов()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ВнешнийИсточник", Объект.Адресаты);
	Запрос.Текст =	"ВЫБРАТЬ Сообщение, Пользователь
	                |	ПОМЕСТИТЬ Сообщения
	                |	ИЗ &ВнешнийИсточник КАК ВнешнийИсточник";
					
	СправочникОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.РассылкаСообщенийСУО")); 
					
	Запрос.УстановитьПараметр("ВнешнийИсточник", СправочникОбъект.Адресаты);
					
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СообщениеСУО.Проведен,
	               |	СообщениеСУО.ПометкаУдаления,
	               |	Сообщения.Сообщение,
				   |	Сообщения.Пользователь.Наименование КАК НаименованиеПользователя
	               |ИЗ
	               |	Сообщения КАК Сообщения
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеСУО КАК СообщениеСУО
	               |		ПО Сообщения.Сообщение = СообщениеСУО.Ссылка";
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Для каждого Строка Из Объект.Адресаты Цикл
		
		Результат.Сбросить();
		
		Если Результат.НайтиСледующий(Строка.Сообщение, "Сообщение") Тогда
			Строка.Проведен                 = Результат.Проведен;
			Строка.ПометкаУдаления          = Результат.ПометкаУдаления;
			Строка.НаименованиеПользователя = Результат.НаименованиеПользователя;
		КонецЕсли;
	
	КонецЦикла;
	
	Если Объект.ДополнительныеАдреса.Количество() > 0 Тогда		
		ВсеПользователиСДополнительнымиАдресами = Новый Массив;
		Для каждого СтрокаДА Из Объект.ДополнительныеАдреса Цикл
			Если ЗначениеЗаполнено(СтрокаДА.Пользователь)
				И ВсеПользователиСДополнительнымиАдресами.Найти(СтрокаДА.Пользователь) = Неопределено Тогда
				ВсеПользователиСДополнительнымиАдресами.Добавить(СтрокаДА.Пользователь);
			КонецЕсли;
		КонецЦикла;
		Для каждого Пользователь Из ВсеПользователиСДополнительнымиАдресами Цикл
			ВсеАдресаСтрока = "";
			СтрокиАдресов = Объект.ДополнительныеАдреса.НайтиСтроки(Новый Структура("Пользователь", Пользователь));
			Если СтрокиАдресов.Количество() > 0 Тогда
				Для каждого СтрокаА Из СтрокиАдресов Цикл
					ВсеАдресаСтрока = ВсеАдресаСтрока + СтрокаА.АдресЭлектроннойПочты + ", ";
				КонецЦикла;
				ВсеАдресаСтрока = Сред(ВсеАдресаСтрока, 1, СтрДлина(ВсеАдресаСтрока) - 2);
			КонецЕсли;
			СтрокиТЧАдресаты = Объект.Адресаты.НайтиСтроки(Новый Структура("Пользователь", Пользователь));
			Для каждого СтрокаТЧАдресаты Из СтрокиТЧАдресаты Цикл
				СтрокаТЧАдресаты.ДополнительныеАдреса = ВсеАдресаСтрока;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Элементы.Шаблон.ТолькоПросмотр = ?(Объект.БезШаблона ИЛИ Объект.Действующая, Истина, Ложь);
	
	Элементы.БезШаблона.ТолькоПросмотр = ?(ЗначениеЗаполнено(Объект.Шаблон) ИЛИ Объект.Действующая, Истина, Ложь);;
	
	Элементы.ГруппаЗначенияПеременных.ТолькоПросмотр = Объект.Действующая;
	Элементы.ГруппаЗначенияПеременных.Видимость = НЕ Объект.БезШаблона;
	
	Элементы.АвтоматическаяРассылка.ТолькоПросмотр = НЕ Объект.Ссылка.Пустая();
	
	Элементы.ГруппаТекст.Видимость = Объект.БезШаблона;	
	
	Элементы.Основание.Видимость = ЗначениеЗаполнено(Объект.Основание);
	Элементы.ОснованиеАвтоматическойРассылки.Видимость = ЗначениеЗаполнено(Объект.ОснованиеАвтоматическойРассылки);
	
	Элементы.АдминистраторуАвтоматическойРассылки.Видимость = Объект.АвтоматическаяРассылка;
	Элементы.Преподавателям.Видимость = Объект.АвтоматическаяРассылка;
	Элементы.Организаторам.Видимость = Объект.АвтоматическаяРассылка;
	
	// Все команды
	
	Если ТолькоПросмотр Тогда
		// Делаем недоступными все элементы
		Для Каждого ТекущийЭлементФормы Из Элементы Цикл
			Если ТипЗнч(ТекущийЭлементФормы) = Тип("КнопкаФормы")
				И Найти(ТекущийЭлементФормы.Имя, НСтр("ru = 'Отчет'")) = 0
				И Найти(ТекущийЭлементФормы.Имя, НСтр("ru = 'Заметку'")) = 0 Тогда
				ТекущийЭлементФормы.Доступность = Ложь;
			КонецЕсли;			
			Если ТипЗнч(ТекущийЭлементФормы) = Тип("ГруппаФормы") Тогда
				ТекущийЭлементФормы.ТолькоПросмотр = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;		
	
	// Дополнительные адреса
	
	Если Объект.ДополнительныеАдреса.Количество() = 0 Тогда
		Элементы.АдресатыДополнительныеАдреса.Видимость = Ложь;
	Иначе
		Элементы.АдресатыДополнительныеАдреса.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьСписокАдресатовВХранилище()
	
	ВременнаяТаблицаАдресатов = Новый ТаблицаЗначений();
	ВременнаяТаблицаАдресатов.Колонки.Добавить("Пользователь");
	ВременнаяТаблицаАдресатов.Колонки.Добавить("Наименование");
	
	Для каждого Строка Из Объект.Адресаты Цикл
	
		НоваяСтрока = ВременнаяТаблицаАдресатов.Добавить();
		НоваяСтрока.Пользователь = Строка.Пользователь;
		НоваяСтрока.Наименование = Строка.НаименованиеПользователя;
	
	КонецЦикла;
	
	ЗаголовокФормыПодбора = НСтр("ru = 'Подбор пользователей'");
	ПараметрыРасширеннойФормыПодбора = 
		Новый Структура("ЗаголовокФормыПодбора, ВыбранныеПользователи, ПодборГруппНевозможен",
		                 ЗаголовокФормыПодбора, ВременнаяТаблицаАдресатов, Истина);
	АдресХранилища = ПоместитьВоВременноеХранилище(ПараметрыРасширеннойФормыПодбора, УникальныйИдентификатор);
	Возврат АдресХранилища;		
	
КонецФункции

&НаСервере
Функция ОтправитьСообщенияНаЭлектроннуюПочту()
	
	РезультатРассылки = "";
	СоединениеРассылки = УправлениеОбучениемСУО.ПодключитьСоединениеРассылок();
	
	Для каждого Строка Из Объект.Адресаты Цикл
	
		Если ЗначениеЗаполнено(Строка.Сообщение)
			И НЕ Строка.ОтправленоНаЭлектроннуюПочту Тогда
								
			РезультатОтправки = Документы.СообщениеСУО.ОтправитьСообщениеНаЭлектроннуюПочту(Строка.Сообщение, СоединениеРассылки);
			
			Строка.ОтправленоНаЭлектроннуюПочту = РезультатОтправки.Отправлено;
			Строка.ОтправкаНаЭлектроннуюПочтуЗапрещена = РезультатОтправки.ОтправкаНаЭлектроннуюПочтуЗапрещена;	
				
			Если НЕ РезультатОтправки.Отправлено Тогда
				РезультатРассылки =  РезультатРассылки + РезультатОтправки.ТекстОшибки + Символы.ПС;
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;
	
	УправлениеОбучениемСУО.ОтключитьСоединениеРассылок(СоединениеРассылки);
	
	РезультатРассылки = РезультатРассылки + НСтр("ru = 'Рассылка завершена'");
	
	Элементы.РезультатРассылки.Видимость = Истина;
	
КонецФункции

&НаСервере
Процедура ОтправитьТестовоеСообщение(Рассылка)
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.РассылкаСообщенийСУО"));
	НовоеСообщение = ДокументОбъект.ЗаписатьНовоеСообщение(Пользователи.ТекущийПользователь());
	
	НовоеСообщениеОбъект = НовоеСообщение.ПолучитьОбъект();
	НовоеСообщениеОбъект.ДополнительныеСвойства.Вставить("ТестовоеСообщение", Истина);
	НовоеСообщениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры


#КонецОбласти



