#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДокументРезультат.Очистить();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ИдентификаторыНесуществующихПользователейИБ = Новый Массив;
	
	/////////////////////////////////////////////////
	
	СвойстваВОтборе = Новый Массив;	
	ГруппировкаСвойстваПользователя = НайтиГруппировку(Настройки.Структура, "Пользователь.ИмяСвойства");

	
	Если ГруппировкаСвойстваПользователя <> Неопределено Тогда 
	
		Поле = Новый ПолеКомпоновкиДанных("Пользователь.ИмяСвойства");
		Для каждого ЭлементОтбора Из ГруппировкаСвойстваПользователя.Отбор.Элементы Цикл
			Если ЭлементОтбора.ЛевоеЗначение = Поле
				И ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("СписокЗначений") Тогда
				Для каждого ЭлементСписка Из ЭлементОтбора.ПравоеЗначение Цикл
					СвойстваВОтборе.Добавить(ЭлементСписка.Значение);
				КонецЦикла;
			КонецЕсли;	
		КонецЦикла;
		
	КонецЕсли;
		
	ТаблицаСвойствПользователя = Новый ТаблицаЗначений;
	ТаблицаСвойствПользователя.Колонки.Добавить("Свойство");
	ТаблицаСвойствПользователя.Колонки.Добавить("Номер");
	
	Если СвойстваВОтборе.Количество() = 0 Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВидыКонтактнойИнформации.Ссылка
			|ИЗ
			|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
			|ГДЕ
			|	ВидыКонтактнойИнформации.Родитель = &ГруппаВидовПользователя
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДополнительныеРеквизитыИСведения.Ссылка
			|ИЗ
			|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
			|ГДЕ
			|	ДополнительныеРеквизитыИСведения.НаборСвойств = &НаборСвойств";
		
		Запрос.Параметры.Вставить("ГруппаВидовПользователя", Справочники.ВидыКонтактнойИнформации.СправочникПользователи);	
		Запрос.Параметры.Вставить("НаборСвойств", УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Пользователи"));
			
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СвойстваВОтборе.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		КонецЦикла;	
	
	КонецЕсли;
	
	Счетчик = 0;
	Для каждого ЗначениеСвойства Из СвойстваВОтборе Цикл

		НоваяСтрока = ТаблицаСвойствПользователя.Добавить();
        НоваяСтрока.Свойство = ЗначениеСвойства;
        НоваяСтрока.Номер = Счетчик;
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("СвойстваПользователей", ТаблицаСвойствПользователя);
	
	/////////////////////////////////////////////////////
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.НачатьВывод();
	ЭлементРезультата = ПроцессорКомпоновки.Следующий();
	Пока ЭлементРезультата <> Неопределено Цикл
		ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
		ЭлементРезультата = ПроцессорКомпоновки.Следующий();
	КонецЦикла;
	ПроцессорВывода.ЗакончитьВывод();

	Если Настройки.ДополнительныеСвойства.Свойство("ВариантНаименование")
		И Настройки.ДополнительныеСвойства.ВариантНаименование = "Задания участников" Тогда
		ДокументРезультат.ПоказатьУровеньГруппировокСтрок(2);
	КонецЕсли
	
КонецПроцедуры


// Функция находит группировку в компоновке
//    Структура - КомпоновщикНастроек.Настройки.Структура
//    Имя       - Имя поля в группировке
Функция НайтиГруппировку(Структура, Имя)	
	Для Каждого Элемент Из Структура Цикл
		Если ТипЗнч(Элемент) = Тип("ТаблицаКомпоновкиДанных") Тогда
			Результат = НайтиГруппировку(Элемент.Строки,  Имя);
			Если Результат <> Неопределено Тогда
				Возврат Результат;
			КонецЕсли;   
			
			Результат = НайтиГруппировку(Элемент.Колонки, Имя);
			Если Результат <> Неопределено Тогда
				Возврат Результат;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Элемент) = Тип("ГруппировкаТаблицыКомпоновкиДанных")
			ИЛИ ТипЗнч(Элемент) = Тип("ГруппировкаКомпоновкиДанных") Тогда
			Для Каждого Поле Из Элемент.ПоляГруппировки.Элементы Цикл
				Если Поле.Поле = Новый ПолеКомпоновкиДанных(Имя) Тогда
					Результат = Элемент;
					Возврат Результат;
				КонецЕсли;
			КонецЦикла;
			Результат = НайтиГруппировку(Элемент.Структура, Имя);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

 
#КонецЕсли

