Функция ТаблицаПользовательскихМеток(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БиблиотекаПользователейМеткиРесурсовСУО.Ресурс,
		|	БиблиотекаПользователейМеткиРесурсовСУО.Фрагмент,
		|	БиблиотекаПользователейМеткиРесурсовСУО.Метка
		|ИЗ
		|	РегистрСведений.БиблиотекаПользователейМеткиРесурсовСУО КАК БиблиотекаПользователейМеткиРесурсовСУО
		|ГДЕ
		|	БиблиотекаПользователейМеткиРесурсовСУО.Пользователь = &Пользователь";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
	
КонецФункции
