////////////////////////////////////////////////////////////////////////////////
// ОБЩЕЕ

Функция СсылкаСуществуетВБазе(Ссылка, СчитатьПомеченныеНаУдалениеОтсутствующими=Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если СчитатьПомеченныеНаУдалениеОтсутствующими Тогда
		
		ДанныеСсылки = ОбщегоНазначенияСУВызовСервера.ЗначенияРеквизитовОбъекта(Ссылка, "Ссылка, ПометкаУдаления");
		
		Возврат ?(ЗначениеЗаполнено(ДанныеСсылки.Ссылка) И ДанныеСсылки.ПометкаУдаления = ЛОЖЬ, Истина, Ложь);
		
	Иначе
		
		Возврат ЗначениеЗаполнено(ОбщегоНазначенияСУВызовСервера.ЗначениеРеквизитаОбъекта(Ссылка, "Ссылка"));
		
	КонецЕсли;
	
КонецФункции

// Получает остаток от деления.
//
// Параметры
//  Делимое  - Число.
//  Делитель – Число.
//
// Возвращаемое значение:
//   Число - остаток от деления.
//
Функция ОстатокОтДеления(Делимое, Делитель) Экспорт
	
	Остаток = Делимое;
	
	Пока Остаток >= Делитель Цикл
		Остаток = Остаток - Делитель;
	КонецЦикла;	
	
	Возврат Остаток;
	
КонецФункции

// Позволяет определить, есть ли в коллекции значений одинаковые элементы.
//
Функция ЕстьСовпаденияВКоллекцииЗначений(Знач Таблица, Знач ПроверяемоеПоле, УчитыватьПустыеПоля=Истина) Экспорт
	
	Для Каждого Строка Из Таблица Цикл
		
		Значение = Строка[ПроверяемоеПоле];
		
		Если НЕ УчитыватьПустыеПоля И НЕ ЗначениеЗаполнено(Значение) Тогда
			Продолжить; // Не учитываем пустые поля
		КонецЕсли;
		
		КолВхождений = 0;
		
		Для Каждого Строка2 Из Таблица Цикл
			Если Значение = Строка2[ПроверяемоеПоле] Тогда
				КолВхождений = КолВхождений + 1;
			КонецЕсли;	
		КонецЦикла;
		
		Если КолВхождений > 1 Тогда
			Возврат Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Для внутреннего использования
// 
Функция СобытиеЖурналаРегистрацииЭлектронныхКурсов() Экспорт
	
	Возврат НСтр("ru = 'Электронное обучение'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ТИПЫ ДАННЫХ

Функция РасщепитьСтроку(Знач ВходСтрока, Знач Разделитель) Экспорт
	
	КоличествоСтрокВоВходнойСтроке = СтрЧислоСтрок(ВходСтрока);
	
	Если КоличествоСтрокВоВходнойСтроке > 1 Тогда
		ВременнаяСтрока = СтрЗаменить(ВходСтрока, Символы.ПС, "#x0A");
		ВременнаяСтрока = СтрЗаменить(ВременнаяСтрока, Символы.ВК, "#x0D");
	Иначе
		ВременнаяСтрока = ВходСтрока;
	КонецЕсли;
		
	РезультирующийМассив = Новый Массив;
	
    ВременнаяСтрока = СтрЗаменить(ВременнаяСтрока, Разделитель, Символы.ПС);
	ЧислоСтрокВременнойСтроки = СтрЧислоСтрок(ВременнаяСтрока);
	Для Индекс = 1 По ЧислоСтрокВременнойСтроки Цикл
		РазделеннаяСтрока = СтрПолучитьСтроку(ВременнаяСтрока, Индекс);
		Если КоличествоСтрокВоВходнойСтроке > 1 Тогда
			РазделеннаяСтрока = СтрЗаменить(РазделеннаяСтрока, "#x0A", Символы.ПС);
			РазделеннаяСтрока = СтрЗаменить(РазделеннаяСтрока, "#x0D", Символы.ВК);
		КонецЕсли;
		РезультирующийМассив.Добавить(РазделеннаяСтрока);
	КонецЦикла;
	
	Возврат РезультирующийМассив;
	
КонецФункции

Функция ЭтоЧисло(ВходСтрока) Экспорт
	
	Если ТипЗнч(ВходСтрока) = Тип("Число") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТипЗнч(ВходСтрока) = Тип("Строка") Тогда
	
		Попытка
			СтрокаВЧисло = Число(ВходСтрока);
			Возврат Истина;
		Исключение
			Возврат Ложь;
		КонецПопытки;	
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ФОРМЫ

// Устанавливает отбор в динамическом списке
//
Процедура УстановитьОтборЭлементовДинамическогоСписка(ДинамическийСписок, ПравоеЗначение, ИмяОтбора="Владелец", ВидСравнения=Неопределено) Экспорт
	
	Отбор = Неопределено;
	Для каждого ЭлементОтбора Из ДинамическийСписок.Отбор.Элементы Цикл
		
		Если ЭлементОтбора.Представление = ИмяОтбора Тогда
			Отбор = ЭлементОтбора;
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	
	Если ВидСравнения = Неопределено Тогда
		ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
	Если Отбор = Неопределено Тогда
		Отбор = ДинамическийСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных(ИмяОтбора);
		Отбор.ВидСравнения     = ВидСравнения;
		Отбор.Использование    = Истина;
		Отбор.Представление    = ИмяОтбора;
		Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		Отбор.ПравоеЗначение   = ПравоеЗначение;
	КонецЕсли;
	
	Если Отбор <> Неопределено
		И Отбор.ПравоеЗначение <> ПравоеЗначение Тогда
		
		Отбор.ПравоеЗначение = ПравоеЗначение;
		
	КонецЕсли;
	
	Если Отбор <> Неопределено
		И Отбор.ВидСравнения <> ВидСравнения Тогда
		
		Отбор.ВидСравнения = ВидСравнения;
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ИзменитьИспользованиеГруппировкиДинамическогоСписка(ДинамическийСписок, ИмяГруппировки, Использование) Экспорт
	
	Если ЗначениеЗаполнено(ИмяГруппировки) Тогда
		
		ПолеКомпоновкиДанных = Новый ПолеКомпоновкиДанных(ИмяГруппировки);
		
		Для каждого ЭлементГруппировки Из ДинамическийСписок.Группировка.Элементы Цикл
		
			Если ЭлементГруппировки.Поле = ПолеКомпоновкиДанных Тогда
				ЭлементГруппировки.Использование = Использование;
				Возврат;
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Для каждого ЭлементГруппировки Из ДинамическийСписок.Группировка.Элементы Цикл
			ЭлементГруппировки.Использование = Использование;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьВидимостьЭлементаФормы(Форма, ИмяЭлемента, Видимость) Экспорт
	
	Если Форма.Элементы.Найти(ИмяЭлемента) <> Неопределено Тогда
		Форма.Элементы[ИмяЭлемента].Видимость = Видимость;
	КонецЕсли;	
	
КонецПроцедуры

Процедура УстановитьЗаголовокЭлементаФормы(Форма, ИмяЭлемента, Заголовок) Экспорт
	
	Если Форма.Элементы.Найти(ИмяЭлемента) <> Неопределено Тогда
		Форма.Элементы[ИмяЭлемента].Заголовок = Заголовок;
	КонецЕсли;	
	
КонецПроцедуры

Процедура УстановитьПодсказкуЭлементаФормы(Форма, ИмяЭлемента, Подсказка) Экспорт
	
	Если Форма.Элементы.Найти(ИмяЭлемента) <> Неопределено Тогда
		Форма.Элементы[ИмяЭлемента].Подсказка = Подсказка;
	КонецЕсли;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ФОРМАТ

// Число

// Конвертирует целое число в строку без учета
// региональных настроек отображения чисел.
//
Функция ЧислоВСтроку(Знач Число) Экспорт
	
	Если ТипЗнч(Число) = Тип("Строка") Тогда
		Возврат Число;
	КонецЕсли;
	
	Если ТипЗнч(Число) = Тип("Число") Тогда
		Возврат Формат(Число, "ЧРД=.; ЧН=0; ЧГ=");
	КонецЕсли;
	
	Возврат Строка(Число);
	
КонецФункции

Функция ЧислоВДату(Число) Экспорт
	
	Если ЗначениеЗаполнено(Число) Тогда
		Возврат Дата("19700101") + (Число(Число) / 1000) + ОбщегоНазначенияСУПовтИсп.СмещениеСтандартногоВремениБазы();
	Иначе
		Возврат Дата("00010101");	
	КонецЕсли;
	
КонецФункции

// Булево

Функция БулевоВСтроку(Знач Булево) Экспорт
	
	Если ТипЗнч(Булево) = Тип("Булево") Тогда
		
		Возврат ?(Булево, НСтр("ru = 'Да'"), НСТр("ru = 'Нет'"));
		
	Иначе
		
		Возврат Булево;
		
	КонецЕсли;
	
КонецФункции

Функция БулевоВJSСтроку(Булево) Экспорт
	
	Если ТипЗнч(Булево) = Тип("Булево") Тогда
		
		Возврат ?(Булево, "true", "false");
		
	Иначе
		
		Возврат "";
		
	КонецЕсли;	

КонецФункции

Функция БулевоВЧисло(Булево) Экспорт
	
	Если ТипЗнч(Булево) = Тип("Булево") Тогда
		
		Возврат ?(Булево, 1, 0);
		
	Иначе
		
		Возврат 0;
		
	КонецЕсли;		
	
КонецФункции

// Строка

Функция СтрокаВБулево(Знач Значение) Экспорт
	
	Если ТипЗнч(Значение) = Тип("Булево") Тогда
		Возврат Значение;
	КонецЕсли;
	
	Если Значение = "1"
		ИЛИ Значение = 1
		ИЛИ НРег(Значение) = "да"
		ИЛИ НРег(Значение) = "истина"
		ИЛИ НРег(Значение) = "true"
		ИЛИ Значение = "+" Тогда
		
		Возврат Истина;
		
	КонецЕсли;	
	
	Если Значение = "0"
		ИЛИ Значение = 0
		ИЛИ НРег(Значение) = "нет"
		ИЛИ НРег(Значение) = "ложь"
		ИЛИ НРег(Значение) = "false"
		ИЛИ Значение = "-" Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат ЗначениеЗаполнено(Значение);
	
КонецФункции

// Получает строку, пригодную для использования в JavaScript
//
Функция JSСтрока(Знач Строка, ЭкранироватьОдинарныеКавычки=Истина, УдалитьСлужебныеСимволы=Ложь) Экспорт
	
	Если УдалитьСлужебныеСимволы Тогда	
	
		Строка = СтрЗаменить(Строка, "\", "");
		
		Если ЭкранироватьОдинарныеКавычки Тогда
			Строка = СтрЗаменить(Строка, "'", "");
		КонецЕсли;
		
		Строка = СтрЗаменить(Строка, """", "");
		Строка = СтрЗаменить(Строка, Символы.ПС, " ");
		Строка = СтрЗаменить(Строка, Символы.ВК, " ");
		Строка = СтрЗаменить(Строка, Символы.Таб, " ");
		Строка = СтрЗаменить(Строка, Символы.ВТаб, " ");
		Строка = СтрЗаменить(Строка, Символы.НПП, " ");
		Строка = СтрЗаменить(Строка, Символы.ПФ, " ");
		
	Иначе
		
		Строка = СтрЗаменить(Строка, "\", "\\");
		
		Если ЭкранироватьОдинарныеКавычки Тогда
			Строка = СтрЗаменить(Строка, "'", "\'");
		КонецЕсли;
		
		Строка = СтрЗаменить(Строка, """", "\""");
		Строка = СтрЗаменить(Строка, Символы.ПС, "\n");
		Строка = СтрЗаменить(Строка, Символы.ВК, "\r");
		Строка = СтрЗаменить(Строка, Символы.Таб, "\t");
		Строка = СтрЗаменить(Строка, Символы.ВТаб, "\t");
		Строка = СтрЗаменить(Строка, Символы.НПП, " ");
		Строка = СтрЗаменить(Строка, Символы.ПФ, " ");		
		
	КонецЕсли;
	
		
	Возврат Строка;
	
КонецФункции

Функция СтрокаИзJSСтроки(Знач Строка) Экспорт
	
	Строка = СтрЗаменить(Строка, "\\", "\");
	
	Строка = СтрЗаменить(Строка, "\'", "'");
	Строка = СтрЗаменить(Строка, "\""", """");
	Строка = СтрЗаменить(Строка, "\n", Символы.ПС);
	Строка = СтрЗаменить(Строка, "\r", Символы.ВК);
	Строка = СтрЗаменить(Строка, "\t", Символы.Таб);
	
	Возврат Строка;
	
КонецФункции

// Получает строку, пригодную для размещения в HTML файле
//
Функция HTMLСтрока(Знач Строка) Экспорт
	
	Строка = СтрЗаменить(Строка, "&", "&amp;");
	
	Строка = СтрЗаменить(Строка, """", "&quot;");
	Строка = СтрЗаменить(Строка, "<", "&lt;");
	Строка = СтрЗаменить(Строка, ">", "&gt;");
	Строка = СтрЗаменить(Строка, Символы.ПС, "");
	
	Возврат Строка;
	
КонецФункции

Функция ТипПлатформыВСтроку(Тип) Экспорт	
	
	Если Тип = ТипПлатформы.Linux_x86 Тогда
		Возврат "Linux_x86";
		
	ИначеЕсли Тип = ТипПлатформы.Linux_x86_64 Тогда
		Возврат "Linux_x86_64";
		
	ИначеЕсли Тип = ТипПлатформы.Windows_x86 Тогда
		Возврат "Windows_x86";
		
	ИначеЕсли Тип = ТипПлатформы.Windows_x86_64 Тогда
		Возврат "Windows_x86_64";		
		
	ИначеЕсли Тип = ТипПлатформы.MacOS_x86 Тогда
		Возврат "MacOS_x86";
		
	ИначеЕсли Тип = ТипПлатформы.MacOS_x86_64 Тогда
		Возврат "MacOS_x86_64";
		
	ИначеЕсли Тип = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Неизвестный тип платформы ""%1""'"),
		Строка(ТипПлатформы));
	
КонецФункции

Функция СтрокаВТипПлатформы(ТипПлатформыСтрока) Экспорт
	
	Возврат ТипПлатформы[ТипПлатформыСтрока];
	
КонецФункции

// Дата

// Функция выделяет время из даты.
//
Функция ВыделитьВремя(Знач Дата) Экспорт

	Возврат Час(Дата) * 3600 + Минута(Дата) * 60 + Секунда(Дата);

КонецФункции // ВыделитьВремя()

Функция ДатаВЧислоJS(ЗначениеДаты) Экспорт
	
	Если ЗначениеЗаполнено(ЗначениеДаты) Тогда
	
		Возврат ((УниверсальноеВремя(ЗначениеДаты) - Дата("19700101"))*1000);
		
	Иначе
		
		Возврат 0;
		
	КонецЕсли;
		
КонецФункции

Функция СтрокаISO8601ВДату(ДатаСтрока) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДатаСтрока) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДатаМассив = РасщепитьСтроку(ДатаСтрока, "-");
	
	Если ДатаМассив.Количество() <> 3 Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Попытка
		Возврат Дата(ДатаМассив[0]+ДатаМассив[1]+ДатаМассив[2]);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ПериодВСтроку(Знач ДатаНачала, Знач ДатаОкончания, Знач СкрытьВремя = Ложь) Экспорт
	
	// Получаем переменные
	
	Если ТипЗнч(ДатаНачала) = Тип("Число") Тогда
		НачалоПериода = ЧислоВДату(ДатаНачала); 
	Иначе
		НачалоПериода = ДатаНачала; 
	КонецЕсли;
	
	Если ТипЗнч(ДатаОкончания) = Тип("Число") Тогда
		КонецПериода = ЧислоВДату(ДатаОкончания); 
	Иначе
		КонецПериода = ДатаОкончания; 
	КонецЕсли;
	
	Если СкрытьВремя Тогда
		Формат = "ДЛФ=DD";
	Иначе
		Формат = "ДЛФ=DDT";
	КонецЕсли;
	
	// Делаем проверки
	
	Если ТипЗнч(НачалоПериода) <> Тип("Дата") Тогда
		НачалоПериода = Дата("00010101");
	КонецЕсли;
	
	Если ТипЗнч(КонецПериода) <> Тип("Дата") Тогда
		КонецПериода = Дата("00010101");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НачалоПериода) И НЕ ЗначениеЗаполнено(КонецПериода) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НачалоПериода) И ЗначениеЗаполнено(КонецПериода) И НачалоПериода > КонецПериода Тогда
		Возврат "";
	КонецЕсли;
	
	// Получаем представление
	
	Если ЗначениеЗаполнено(НачалоПериода) И ЗначениеЗаполнено(КонецПериода) Тогда
		
		Если КонецПериода - НачалоПериода <= 86400 И День(НачалоПериода) = День(КонецПериода) Тогда
			
			Если КонецПериода - НачалоПериода >= 86399 И СкрытьВремя Тогда
				// Показываем просто дату, когда указаны полные сутки и скрыто время.
				// Данная ситуация невозможна для проведения обучения, так как запрещено
				// указание одной даты без указания времени.
				Возврат Формат(НачалоПериода, "ДЛФ=DD");
			Иначе
				Если НачалоПериода = КонецПериода Тогда 
					Возврат Формат(НачалоПериода, "ДЛФ=DD") + " в " + Формат(НачалоПериода, "ДФ=ЧЧ:мм; ДЛФ=T");
				Иначе
					Возврат Формат(НачалоПериода, "ДЛФ=DD") + " с " + Формат(НачалоПериода, "ДФ=ЧЧ:мм; ДЛФ=T") + " по " + Формат(КонецПериода, "ДФ=ЧЧ:мм; ДЛФ=T");
				КонецЕсли;				
			КонецЕсли;			
			
		Иначе
			
			Если СкрытьВремя И ОстатокОтДеления(КонецПериода - НачалоПериода, 86400) = 0 Тогда
				КонецПериода = КонецПериода - 1; // Убираем секунду, чтобы не вылезать в следующие сутки
			КонецЕсли;
			
			Если НачалоПериода = КонецПериода Тогда
				Возврат "в " + Формат(НачалоПериода, Формат);
			Иначе				
				Возврат "с " + Формат(НачалоПериода, Формат) + " по " + Формат(КонецПериода, Формат);
			КонецЕсли;			
			
		КонецЕсли;		
		
	Иначе
		
		Если ЗначениеЗаполнено(НачалоПериода) Тогда
			Возврат "с " + Формат(НачалоПериода, Формат); 
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КонецПериода) Тогда
			Возврат "по " + Формат(КонецПериода, Формат);
		КонецЕсли;
		
	КонецЕсли;	
	
КонецФункции

Функция ДатаВСтроку(Знач ЗначениеДаты, Знач СкрытьВремяПринудительно = Ложь, Знач ПисатьВключительно = Ложь, Знач ПисатьНеУказано = Ложь) Экспорт
	
	ЗначениеДатыСтрока = "";
	
	Если ТипЗнч(ЗначениеДаты) = Тип("Дата") И ЗначениеЗаполнено(ЗначениеДаты) Тогда
		
		Если СкрытьВремяПринудительно Тогда
			ЗначениеДаты = КонецДня(ЗначениеДаты);
		КонецЕсли;
		
		Если НачалоДня(ЗначениеДаты) = ЗначениеДаты Тогда
			ЗначениеДатыСтрока = Формат(ЗначениеДаты, "ДЛФ=DD");
			Если ПисатьВключительно Тогда
				ЗначениеДатыСтрока = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСТр("ru = '%1 (включительно)'"), ЗначениеДатыСтрока);
			КонецЕсли;
		ИначеЕсли КонецДня(ЗначениеДаты) = ЗначениеДаты Тогда	
			ЗначениеДатыСтрока = Формат(ЗначениеДаты, "ДЛФ=DD");
			Если ПисатьВключительно Тогда
				ЗначениеДатыСтрока = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСТр("ru = '%1 (включительно)'"), ЗначениеДатыСтрока);								
			КонецЕсли;
		Иначе
			ЗначениеДатыСтрока = Формат(ЗначениеДаты, "ДЛФ=DDT");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПисатьНеУказано И НЕ ЗначениеЗаполнено(ЗначениеДатыСтрока) Тогда
		ЗначениеДатыСтрока = НСтр("ru = '<Не указано>'");
	КонецЕсли;
	
	Возврат ЗначениеДатыСтрока;
	
КонецФункции

// Цвет

// Преобразует цвет в формате HEX в объект 1С
//
Функция ВебЦветВОбъект(Знач ВебЦвет) Экспорт
	
	ВебЦвет = СокрЛП(ВебЦвет);
	
	Если НЕ ЗначениеЗаполнено(ВебЦвет) Тогда
		Возврат Новый Цвет(0, 0, 0);
	КонецЕсли;
	
	МассивЦветовHEX = Новый Массив;
	МассивЦветовHEX.Добавить("0");
	МассивЦветовHEX.Добавить("0");
	МассивЦветовHEX.Добавить("0");
	
	Если СтрДлина(ВебЦвет) = 3 Тогда
		МассивЦветовHEX[0] = Сред(ВебЦвет, 1, 1);
		МассивЦветовHEX[1] = Сред(ВебЦвет, 2, 1);
		МассивЦветовHEX[2] = Сред(ВебЦвет, 3, 1);
	КонецЕсли;
	
	Если СтрДлина(ВебЦвет) = 6 Тогда
		МассивЦветовHEX[0] = Сред(ВебЦвет, 1, 2);
		МассивЦветовHEX[1] = Сред(ВебЦвет, 3, 2);
		МассивЦветовHEX[2] = Сред(ВебЦвет, 5, 2);
	КонецЕсли;
	
	МассивЦветовDEC = Новый Массив;
	
	Для каждого ЦветHEX Из МассивЦветовHEX Цикл
		
		ЦветDEC = 0;
		
		Если ЦветHEX <> "0" Тогда
		
			Длина = СтрДлина(ЦветHEX);
			
			Для Н=1 По Длина Цикл
				
				М=1;
				
				Для У=1 По Длина-Н Цикл
					М = М*16
				КонецЦикла;
				
				ЦветDEC = ЦветDEC + (Найти("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ",Сред(ВРег(ЦветHEX),Н,1))-1)*М;
				
			КонецЦикла;
			
		КонецЕсли;
			
		МассивЦветовDEC.Добавить(Окр(ЦветDEC));	
	
	КонецЦикла;
	
	Возврат Новый Цвет(МассивЦветовDEC[0], МассивЦветовDEC[1], МассивЦветовDEC[2]);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ЛОКАЛЬНЫЙ КЭШ (НА СЕРВЕРЕ ИЛИ КЛИЕНТЕ)

#Если НЕ ВебКлиент Тогда
	
// В тонком клиенте выгружает файлы ресурсов в локальный кэш.
//
Процедура ВыгрузитьРесурсыВКэш(МассивРесурсов, ПутьККаталогуРесурсов, ПредпочитаемыйПоставщик = Неопределено, ЭлектронныйРесурс = Неопределено, Отказ = Ложь, ПараметрыЭкспорта = Неопределено, Знач КонтекстВыполнения = Неопределено) Экспорт
	
	ПутьККаталогуРесурсов = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуРесурсов);
	
	// МассивРесурсов - массив содержащий структуры,
	// Свойства которых задаются в функции
	// ОбъектыСУЗ.ПолучитьСтруктуруРесурса().
	
	Если МассивРесурсов = Неопределено
		ИЛИ МассивРесурсов.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	// Получаем список только тех ресурсов, которые необходимо кэшировать
	
	МассивРесурсовДляОбновления = Новый Массив();
	КаталогиДляОбновления = Новый Массив();
	
	Для каждого Ресурс Из МассивРесурсов Цикл
		
		ПутьККаталогуРесурса = ПутьККаталогуРесурсов + Ресурс.Идентификатор + Ресурс.Постфикс;
		ПутьККаталогуРесурса = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуРесурса);
		
		Если КаталогиДляОбновления.Найти(ПутьККаталогуРесурса) <> Неопределено Тогда
			МассивРесурсовДляОбновления.Добавить(Ресурс);
			Продолжить;
		КонецЕсли;
		
		КаталогРесурса = Новый Файл(ПутьККаталогуРесурса);
		
		Если НЕ КаталогРесурса.Существует() Тогда
			
			Попытка
				СоздатьКаталог(КаталогРесурса.ПолноеИмя);
				КаталогРесурсаСоздан = Истина;
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Произошла ошибка при создании нового ресурса. Повторите операцию. Каталог: '") + КаталогРесурса.ПолноеИмя + описаниеОшибки());
				КаталогРесурсаСоздан = Ложь;
			КонецПопытки;
			
			Если КаталогРесурсаСоздан Тогда
				МассивРесурсовДляОбновления.Добавить(Ресурс);
				КаталогиДляОбновления.Добавить(ПутьККаталогуРесурса);
			КонецЕсли;
			
		Иначе
			
			Если (Ресурс.ДатаИзменения <> Неопределено И КаталогРесурса.ПолучитьВремяИзменения() < Ресурс.ДатаИзменения) ИЛИ НайтиФайлы(КаталогРесурса.ПолноеИмя, "*", Ложь).Количество() = 0 Тогда
				
				Попытка
					УдалитьФайлы(КаталогРесурса.ПолноеИмя);
					КаталогРесурсаУдален = Истина;
				Исключение
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Произошла ошибка при обновлении ресурса. Повторите операцию. Каталог: '") + КаталогРесурса.ПолноеИмя);
					КаталогРесурсаУдален = Ложь;
				КонецПопытки;
				
				Если КаталогРесурсаУдален Тогда
					
					Попытка
						СоздатьКаталог(КаталогРесурса.ПолноеИмя);
						КаталогРесурсаСоздан = Истина;
					Исключение
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Произошла ошибка при создании ресурса. Повторите операцию. Каталог: '") + КаталогРесурса.ПолноеИмя);
						КаталогРесурсаСоздан = Ложь;
					КонецПопытки;
					
					Если КаталогРесурсаСоздан Тогда
						МассивРесурсовДляОбновления.Добавить(Ресурс);
						КаталогиДляОбновления.Добавить(ПутьККаталогуРесурса);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивРесурсовДляОбновления.Количество() > 0 Тогда
		
		// Примечание: при нахождении на клиенте будет вызван сервер.
		МассивФайлов = ОбщегоНазначенияСУВызовСервера.ПолучитьДанныеРесурсовДляВыгрузкиВКэш(МассивРесурсовДляОбновления, ЭлектронныйРесурс, ПредпочитаемыйПоставщик, ПараметрыЭкспорта, КонтекстВыполнения);
		
		ВыгрузитьФайлы(МассивФайлов, ПутьККаталогуРесурсов);			
		
	КонецЕсли;
		
КонецПроцедуры

// Выгружает файлы в локальный кэш на клиенте
//
Процедура ВыгрузитьФайлы(МассивФайлов, ПутьККаталогу) Экспорт
	
	ПутьККаталогу = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогу);
		
	Для каждого Элемент Из МассивФайлов Цикл
		
		Если Элемент.ЭтоКаталог Тогда
			
			ПутьКВложенномуКаталогу = ПутьККаталогу + Элемент.ИмяФайла;
			ПутьКВложенномуКаталогу = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКВложенномуКаталогу);
			
			СоздатьКаталог(ПутьКВложенномуКаталогу);
			
			Если Элемент.ПодчиненныеФайлы <> Неопределено Тогда
				ВыгрузитьФайлы(Элемент.ПодчиненныеФайлы, ПутьКВложенномуКаталогу);
			КонецЕсли;
			
		Иначе
			
			Если Элемент.ТипФайла = "Folder" ИЛИ Элемент.ТипФайла = "Document" Тогда
						
				КаталогСохраняемогоФайла = ПутьККаталогу + Элемент.ИмяФайла;
				
				СоздатьКаталог(КаталогСохраняемогоФайла);

				ПолноеИмяСохраняемогоФайла = ПутьККаталогу + Элемент.ИмяФайла + ".zip";
				Элемент.ДвоичныеДанные.Записать(ПолноеИмяСохраняемогоФайла);
				
				ФайлАрхива = Новый ЧтениеZIPФайла(ПолноеИмяСохраняемогоФайла);
				ФайлАрхива.ИзвлечьВсе(КаталогСохраняемогоФайла, РежимВосстановленияПутейФайловZIP.Восстанавливать); 
				ФайлАрхива.Закрыть(); 				

				УдалитьФайлы(ПолноеИмяСохраняемогоФайла);
				
			Иначе
				
				Если Элемент.ДвоичныеДанные <> Неопределено Тогда
					
					Если ТипЗнч(Элемент.ДвоичныеДанные) = Тип("ОписаниеПередаваемогоФайла") Тогда
						
						#Если НаКлиенте Тогда
						
						ПолучаемыеФайла = Новый Массив;
						ПолучаемыеФайла.Добавить(Элемент.ДвоичныеДанные);
						
						ПолучитьФайлы(ПолучаемыеФайла,,ПутьККаталогу,Ложь);
						
						#Иначе
							
						ВызватьИсключение НСтр("ru = 'Операция на сервере не поддерживается'");							
						
						#КонецЕсли						
						
					Иначе
						
						Элемент.ДвоичныеДанные.Записать(ПутьККаталогу + Элемент.ИмяФайла);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Выгружает элемент справочника РесурсыСУЗ "Общий"
// в локальный кэш на клиенте.
//
Процедура ВыгрузитьОбщийРесурсВКэш(ПутьККэшу, ИмяКаталогаРесурсов="res_common", ПредпочитаемыйПоставщик=Неопределено) Экспорт
	
	МассивРесурсов = Новый Массив();
	МассивРесурсов.Добавить(ОбъектыСУЗ.ПолучитьСтруктуруОбщегоРесурса());
	МассивРесурсов.Добавить(ОбъектыСУЗ.ПолучитьСтруктуруРесурсаМодулей());
	
	ВыгрузитьРесурсыВКэш(МассивРесурсов, ПутьККэшу + ИмяКаталогаРесурсов, ПредпочитаемыйПоставщик);
	
КонецПроцедуры

Функция ЛокальныйКэшПоврежден(ПутьККэшу) Экспорт
	
	КаталогиКэша = НайтиФайлы(ПутьККэшу, "*", Ложь);
	
	Если КаталогиКэша.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	ВсегоКаталогов = 0;
	ЕстьОбщийКаталог = Ложь;
	
	Для каждого Каталог Из КаталогиКэша Цикл
		
		Если НЕ Каталог.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		
		Если Каталог.Имя = "res_common" Тогда
			ЕстьОбщийКаталог = Истина;
		КонецЕсли;
		
		ВсегоКаталогов = ВсегоКаталогов + 1;
		ПутьККаталогу = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(Каталог.ПолноеИмя);
		
		//Проверяем наличие файла objects.htm
		
		ФайлОбъектов = Новый Файл(ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(Каталог.ПолноеИмя) + "objects.htm");
		
		Если НЕ ФайлОбъектов.Существует() Тогда
			Возврат Истина;
		КонецЕсли;
		
		//Проверяем каталог img
		
		Если КоличествоФайловВКаталоге(ПутьККаталогу + "img") < 29 Тогда
			Возврат Истина;
		КонецЕсли;
		
		//Проверяем каталог js
		
		Если КоличествоФайловВКаталоге(ПутьККаталогу + "js") < 85 Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ВсегоКаталогов = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если НЕ ЕстьОбщийКаталог Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// РАБОТА С ФАЙЛАМИ

Процедура СформироватьОписаниеФайлов(Знач НайденныеФайлы, СтруктураФайлов, СписокФайлов, ВключатьСкрытые=Истина, Контекст=Неопределено) Экспорт
	
	Для каждого Файл Из НайденныеФайлы Цикл
		
		Если НЕ Файл.Существует() Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ВключатьСкрытые И Файл.ПолучитьНевидимость() Тогда
			Продолжить;
		КонецЕсли;
				
		СтруктураФайла = НовоеОписаниеФайла(Файл, Контекст);
			
		Если СтруктураФайла.ЭтоКаталог Тогда
			
			НайденныеПодчиненныеФайлы = НайтиФайлы(Файл.ПолноеИмя, "*", Ложь); 
			МассивПодчиненныхФайлов   = Новый Массив;
			
			СформироватьОписаниеФайлов(НайденныеПодчиненныеФайлы, МассивПодчиненныхФайлов, СписокФайлов, ВключатьСкрытые, Контекст); // Рекурсия
			
			СтруктураФайла.Вставить("ПодчиненныеФайлы", МассивПодчиненныхФайлов);
			
		Иначе
			
			ОписаниеФайла = Новый ОписаниеПередаваемогоФайла(Файл.ПолноеИмя);
			
			СписокФайлов.Добавить(ОписаниеФайла);	
			
		КонецЕсли;
		
		СтруктураФайлов.Добавить(СтруктураФайла);
		
	КонецЦикла;
	
	
КонецПроцедуры

Функция НовоеОписаниеФайла(Файл, Контекст) Экспорт
	
	СтруктураФайла = Новый Структура;
	СтруктураФайла.Вставить("Путь", Файл.ПолноеИмя);
	СтруктураФайла.Вставить("Имя", Файл.Имя);
	СтруктураФайла.Вставить("ИмяБезРасширения", Файл.ИмяБезРасширения);
	СтруктураФайла.Вставить("Расширение", Файл.Расширение);
	СтруктураФайла.Вставить("ПолноеИмя", Файл.ПолноеИмя);
	СтруктураФайла.Вставить("ПодчиненныеФайлы", Новый Массив);
	СтруктураФайла.Вставить("ЭтоКаталог", Файл.ЭтоКаталог());
	СтруктураФайла.Вставить("Контекст", Контекст);
	
	Возврат СтруктураФайла;
	
КонецФункции

// Делает одинаковые слэши в пути к файлу
//
Функция ПривестиСлэши(Знач Путь) Экспорт
	
	ОсновнойСлэш = РазделительПути(Путь);
	
	Путь = СтрЗаменить(Путь, "\", ОсновнойСлэш);
	Путь = СтрЗаменить(Путь, "/", ОсновнойСлэш);
	
	Возврат Путь;
	
КонецФункции

Функция ПроверитьДоступностьКаталогаДляЗаписи(Знач ПутьККаталогу) Экспорт
	
	РезультатПроверки = Новый Структура("ДоступенДляЗаписи, ОписаниеОшибки, КодОшибки", Ложь, "", -1);
	
	Если НЕ ЗначениеЗаполнено(ПутьККаталогу) Тогда
		РезультатПроверки.ОписаниеОшибки = НСтр("ru = 'Каталог не задан'");
		Возврат РезультатПроверки;	
	КонецЕсли;
	
	ПутьККаталогу = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогу);
	
	Каталог = Новый Файл(ПутьККаталогу);
	
	Если НЕ Каталог.Существует() Тогда
		РезультатПроверки.ОписаниеОшибки = НСтр("ru = 'Каталог не существует'");
		РезультатПроверки.КодОшибки = 1;
		Возврат РезультатПроверки;	
	КонецЕсли;
	
	Если НЕ Каталог.ЭтоКаталог() Тогда
		РезультатПроверки.ОписаниеОшибки = НСтр("ru = 'Путь указывает не на каталог'");
		РезультатПроверки.КодОшибки = 2;
		Возврат РезультатПроверки;	
	КонецЕсли;	
	
	ПутьКТестовомуКаталогу = ПутьККаталогу + "!@%";
	
	Попытка
		СоздатьКаталог(ПутьКТестовомуКаталогу);
		УдалитьФайлы(ПутьКТестовомуКаталогу);
	Исключение
		РезультатПроверки.ОписаниеОшибки = НСтр("ru = 'Нет прав на редактирование каталога'");
		РезультатПроверки.КодОшибки = 3;
		Возврат РезультатПроверки;
	КонецПопытки;
	
	РезультатПроверки.ДоступенДляЗаписи = Истина;
	
	Возврат РезультатПроверки;
	
КонецФункции

Функция ДобавитьКонечныйРазделительПути(Знач Путь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Путь) Тогда
		Возврат Путь;
	КонецЕсли;
	
	ОсновнойСлэш = РазделительПути(Путь);
	
	Если Прав(Путь, 1) = ОсновнойСлэш Тогда
		Возврат Путь;
	Иначе 
		Возврат Путь + ОсновнойСлэш;
	КонецЕсли;
	
КонецФункции

Функция УбратьКонечныйРазделительПути(Знач Путь) Экспорт
	
	ПоследнийСимвол = Сред(Путь, СтрДлина(Путь), 1);
	
	Если ПоследнийСимвол = "/" ИЛИ ПоследнийСимвол = "\" Тогда
		Возврат Сред(Путь, 1, СтрДлина(Путь)-1);
	Иначе
		Возврат Путь;
	КонецЕсли;
	
КонецФункции

Функция РазделительПути(Знач Путь) Экспорт
	
	// Тот слэш, который идет первым является основным.
	
	ПозицияПрямогоСлэша   = Найти(Путь, "/");
	ПозицияОбратногоСлэша = Найти(Путь, "\");
	
	ОсновнойСлэш = "";
	
	Если ПозицияПрямогоСлэша = 0 И ПозицияОбратногоСлэша = 0 Тогда
		
		ОсновнойСлэш = ПолучитьРазделительПути();
		
	Иначе
		
		Если ПозицияПрямогоСлэша = 0 Тогда
			ОсновнойСлэш = "\"; // Нет прямого, значит основной - обратный
		КонецЕсли;
		
		Если ПозицияОбратногоСлэша = 0 Тогда
			ОсновнойСлэш = "/"; // Нет обратного, значит основной - прямой
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОсновнойСлэш) Тогда // Есть оба слэша, значит выбираем первый
			ОсновнойСлэш = ?(ПозицияПрямогоСлэша < ПозицияОбратногоСлэша, "/", "\"); 
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОсновнойСлэш;
	
КонецФункции

// Получает расширение файла по типу картинки
//
Функция РасширениеКартинки(Формат) Экспорт
	
	Если Формат = ФорматКартинки.BMP Тогда
		Возврат ".bmp";
	КонецЕсли;
		
	Если Формат = ФорматКартинки.EMF Тогда
		Возврат ".emf";
	КонецЕсли;
	
	Если Формат = ФорматКартинки.GIF Тогда
		Возврат ".gif";
	КонецЕсли;
	
	Если Формат = ФорматКартинки.Icon Тогда
		Возврат ".ico";
	КонецЕсли;
	
	Если Формат = ФорматКартинки.JPEG Тогда
		Возврат ".jpg";
	КонецЕсли;
	
	Если Формат = ФорматКартинки.PNG Тогда
		Возврат ".png";
	КонецЕсли;
	
	Если Формат = ФорматКартинки.TIFF Тогда
		Возврат ".tiff";
	КонецЕсли;
	
	Если Формат = ФорматКартинки.WMF Тогда
		Возврат ".wmf";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Функция возвращает часть строки после последнего встреченного символа в строке
//
Функция ПолучитьСтрокуОтделеннойСимволом(Знач ИсходнаяСтрока, Знач СимволПоиска)
	
	ПозицияСимвола = СтрДлина(ИсходнаяСтрока);
	Пока ПозицияСимвола >= 1 Цикл
		
		Если Сред(ИсходнаяСтрока, ПозицияСимвола, 1) = СимволПоиска Тогда
						
			Возврат Сред(ИсходнаяСтрока, ПозицияСимвола + 1); 
			
		КонецЕсли;
		
		ПозицияСимвола = ПозицияСимвола - 1;	
	КонецЦикла;

	Возврат "";
  	
КонецФункции

// Выделяет из имени файла его расширение (набор символов после последней точки).
//
// Параметры
//  ИмяФайла     – Строка, содержащая имя файла, неважно с именем каталога или без.
//
// Возвращаемое значение:
//   Строка – расширение файла.
//
Функция РасширениеИмениФайла(Знач ИмяФайла) Экспорт
	
	Расширение = ПолучитьСтрокуОтделеннойСимволом(ИмяФайла, ".");
	Возврат Расширение;
	
КонецФункции

// Проверяет наличие запрещенных в среде MS Windows символов в имени файла.
//
// Параметры
//  ИмяФайла     – Строка, содержащая имя файла, без каталога.
//
// Возвращаемое значение:
//   Булево – Истина, если есть запрещенные символы, Ложь, если нет.
//
Функция ЗаменитьЗапрещенныеСимволыВИмениФайла(Знач ИмяФайла, СимволДляЗамены = "") Экспорт

	нИмяФайла = ИмяФайла;
	нИмяФайла = СтрЗаменить(нИмяФайла, "\", СимволДляЗамены);
	нИмяФайла = СтрЗаменить(нИмяФайла, "/", СимволДляЗамены);
	нИмяФайла = СтрЗаменить(нИмяФайла, ":", СимволДляЗамены);
	нИмяФайла = СтрЗаменить(нИмяФайла, "*", СимволДляЗамены);
	нИмяФайла = СтрЗаменить(нИмяФайла, """", СимволДляЗамены);
	нИмяФайла = СтрЗаменить(нИмяФайла, "<", СимволДляЗамены);
	нИмяФайла = СтрЗаменить(нИмяФайла, ">", СимволДляЗамены);
	нИмяФайла = СтрЗаменить(нИмяФайла, "|", СимволДляЗамены);
	
	Возврат нИмяФайла;
	
КонецФункции // ЗаменитьЗапрещенныеСимволыВИмениФайла()

Функция КоличествоФайловВКаталоге(ПутьККаталогу) Экспорт
	
	ПроверяемыйКаталог = Новый Файл(ПутьККаталогу);
		
	Если НЕ ПроверяемыйКаталог.Существует() ИЛИ НЕ ПроверяемыйКаталог.ЭтоКаталог() Тогда
		Возврат 0;
	КонецЕсли;
	
	ФайлыКаталога = НайтиФайлы(ПутьККаталогу, "*", Истина);
	
	Возврат ФайлыКаталога.Количество();
	
КонецФункции

Функция УникальноеИмяФайла(ИмяФайла, Уровень=0) Экспорт
	
	Если Уровень > 0 Тогда
		ФайлОбъект = Новый Файл(ИмяФайла + " - " + ЧислоВСтроку(Уровень));		
	Иначе
		ФайлОбъект = Новый Файл(ИмяФайла);
	КонецЕсли;
	
	Если ФайлОбъект.Существует() Тогда
		
		Если Уровень > 100 Тогда
			ВызватьИсключение НСтр("ru = 'Невозможно установить уникальное имя файла'")
		КонецЕсли;
		
		Уровень = Уровень + 1;
		
		ФайлОбъект = Новый Файл(УникальноеИмяФайла(ИмяФайла, Уровень)); //Рекурсия
		
	КонецЕсли;
	
	Возврат ФайлОбъект.ПолноеИмя;
	
КонецФункции

Процедура СкопироватьКаталог(Знач ИмяКаталогаИсточника, Знач ИмяКаталогаПриемника) Экспорт	
	
	КаталогИсточника = Новый Файл(ИмяКаталогаИсточника);
	
	Если НЕ КаталогИсточника.Существует() ИЛИ НЕ КаталогИсточника.ЭтоКаталог() Тогда
		ВызватьИсключение НСтр("ru = 'Каталог источника не найден'")
	КонецЕсли;
	
	КаталогПриемника = Новый Файл(ИмяКаталогаПриемника);

	Если НЕ КаталогПриемника.Существует() Тогда
		СоздатьКаталог(ИмяКаталогаПриемника);
	КонецЕсли;
	
	ВсеФайлыИсточника = НайтиФайлы(ИмяКаталогаИсточника, "*", Ложь);
	
	ИмяКаталогаПриемника = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяКаталогаПриемника);
	
	Для каждого ФайлИсточника Из ВсеФайлыИсточника Цикл	
		
		ИмяФайлаВПриемнике = ИмяКаталогаПриемника + ФайлИсточника.Имя;
		
		Если ФайлИсточника.ЭтоКаталог() Тогда
			СкопироватьКаталог(ФайлИсточника.ПолноеИмя, ИмяФайлаВПриемнике); //Рекурсия
		Иначе
			КопироватьФайл(ФайлИсточника.ПолноеИмя, ИмяФайлаВПриемнике);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция MIMEТипПоРасширению(Расширение) Экспорт
	
	// Источник: https://github.com/samuelneff/MimeTypeMap/blob/master/src/MimeTypes/MimeTypeMap.cs
	// От 062f83f  on 12 Oct 2018
		
	Список = Новый Соответствие();
	Список.Вставить(".323", "text/h323");
	Список.Вставить(".3g2", "video/3gpp2");
	Список.Вставить(".3gp", "video/3gpp");
	Список.Вставить(".3gp2", "video/3gpp2");
	Список.Вставить(".3gpp", "video/3gpp");
	Список.Вставить(".7z", "application/x-7z-compressed");
	Список.Вставить(".aa", "audio/audible");
	Список.Вставить(".AAC", "audio/aac");

		
	Список.Вставить(".aaf", "application/octet-stream");

	Список.Вставить(".aax", "audio/vnd.audible.aax");
	Список.Вставить(".ac3", "audio/ac3");
	Список.Вставить(".aca", "application/octet-stream");
	Список.Вставить(".accda", "application/msaccess.addin");
	Список.Вставить(".accdb", "application/msaccess");
	Список.Вставить(".accdc", "application/msaccess.cab");
	Список.Вставить(".accde", "application/msaccess");
	Список.Вставить(".accdr", "application/msaccess.runtime");
	Список.Вставить(".accdt", "application/msaccess");
	Список.Вставить(".accdw", "application/msaccess.webapplication");
	Список.Вставить(".accft", "application/msaccess.ftemplate");
	Список.Вставить(".acx", "application/internet-property-stream");
	Список.Вставить(".AddIn", "text/xml");
	Список.Вставить(".ade", "application/msaccess");
	Список.Вставить(".adobebridge", "application/x-bridge-url");
	Список.Вставить(".adp", "application/msaccess");
	Список.Вставить(".ADT", "audio/vnd.dlna.adts");
	Список.Вставить(".ADTS", "audio/aac");
	Список.Вставить(".afm", "application/octet-stream");
	Список.Вставить(".ai", "application/postscript");
	Список.Вставить(".aif", "audio/aiff");
	Список.Вставить(".aifc", "audio/aiff");
	Список.Вставить(".aiff", "audio/aiff");
	Список.Вставить(".air", "application/vnd.adobe.air-application-installer-package+zip");
	Список.Вставить(".amc", "application/mpeg");
	Список.Вставить(".anx", "application/annodex");
	Список.Вставить(".apk", "application/vnd.android.package-archive" );
	Список.Вставить(".application", "application/x-ms-application");
	Список.Вставить(".art", "image/x-jg");
	Список.Вставить(".asa", "application/xml");
	Список.Вставить(".asax", "application/xml");
	Список.Вставить(".ascx", "application/xml");
	Список.Вставить(".asd", "application/octet-stream");
	Список.Вставить(".asf", "video/x-ms-asf");
	Список.Вставить(".ashx", "application/xml");
	Список.Вставить(".asi", "application/octet-stream");
	Список.Вставить(".asm", "text/plain");
	Список.Вставить(".asmx", "application/xml");
	Список.Вставить(".aspx", "application/xml");
	Список.Вставить(".asr", "video/x-ms-asf");
	Список.Вставить(".asx", "video/x-ms-asf");
	Список.Вставить(".atom", "application/atom+xml");
	Список.Вставить(".au", "audio/basic");
	Список.Вставить(".avi", "video/x-msvideo");
	Список.Вставить(".axa", "audio/annodex");
	Список.Вставить(".axs", "application/olescript");
	Список.Вставить(".axv", "video/annodex");
	Список.Вставить(".bas", "text/plain");
	Список.Вставить(".bcpio", "application/x-bcpio");
	Список.Вставить(".bin", "application/octet-stream");
	Список.Вставить(".bmp", "image/bmp");
	Список.Вставить(".c", "text/plain");
	Список.Вставить(".cab", "application/octet-stream");
	Список.Вставить(".caf", "audio/x-caf");
	Список.Вставить(".calx", "application/vnd.ms-office.calx");
	Список.Вставить(".cat", "application/vnd.ms-pki.seccat");
	Список.Вставить(".cc", "text/plain");
	Список.Вставить(".cd", "text/plain");
	Список.Вставить(".cdda", "audio/aiff");
	Список.Вставить(".cdf", "application/x-cdf");
	Список.Вставить(".cer", "application/x-x509-ca-cert");
	Список.Вставить(".cfg", "text/plain");
	Список.Вставить(".chm", "application/octet-stream");
	Список.Вставить(".class", "application/x-java-applet");
	Список.Вставить(".clp", "application/x-msclip");
	Список.Вставить(".cmd", "text/plain");
	Список.Вставить(".cmx", "image/x-cmx");
	Список.Вставить(".cnf", "text/plain");
	Список.Вставить(".cod", "image/cis-cod");
	Список.Вставить(".config", "application/xml");
	Список.Вставить(".contact", "text/x-ms-contact");
	Список.Вставить(".coverage", "application/xml");
	Список.Вставить(".cpio", "application/x-cpio");
	Список.Вставить(".cpp", "text/plain");
	Список.Вставить(".crd", "application/x-mscardfile");
	Список.Вставить(".crl", "application/pkix-crl");
	Список.Вставить(".crt", "application/x-x509-ca-cert");
	Список.Вставить(".cs", "text/plain");
	Список.Вставить(".csdproj", "text/plain");
	Список.Вставить(".csh", "application/x-csh");


	Список.Вставить(".csproj", "text/plain");
	Список.Вставить(".css", "text/css");
	Список.Вставить(".csv", "text/csv");
	Список.Вставить(".cur", "application/octet-stream");
	Список.Вставить(".cxx", "text/plain");
	Список.Вставить(".dat", "application/octet-stream");
	Список.Вставить(".datasource", "application/xml");
	Список.Вставить(".dbproj", "text/plain");
	Список.Вставить(".dcr", "application/x-director");
	Список.Вставить(".def", "text/plain");
	Список.Вставить(".deploy", "application/octet-stream");
	Список.Вставить(".der", "application/x-x509-ca-cert");
	Список.Вставить(".dgml", "application/xml");
	Список.Вставить(".dib", "image/bmp");
	Список.Вставить(".dif", "video/x-dv");
	Список.Вставить(".dir", "application/x-director");
	Список.Вставить(".disco", "text/xml");
	Список.Вставить(".divx", "video/divx");
	Список.Вставить(".dll", "application/x-msdownload");
	Список.Вставить(".dll.config", "text/xml");
	Список.Вставить(".dlm", "text/dlm");
	Список.Вставить(".doc", "application/msword");
	Список.Вставить(".docm", "application/vnd.ms-word.document.macroEnabled.12");
	Список.Вставить(".docx", "application/vnd.openxmlformats-officedocument.wordprocessingml.document");
	Список.Вставить(".dot", "application/msword");
	Список.Вставить(".dotm", "application/vnd.ms-word.template.macroEnabled.12");
	Список.Вставить(".dotx", "application/vnd.openxmlformats-officedocument.wordprocessingml.template");
	Список.Вставить(".dsp", "application/octet-stream");
	Список.Вставить(".dsw", "text/plain");
	Список.Вставить(".dtd", "text/xml");
	Список.Вставить(".dtsConfig", "text/xml");
	Список.Вставить(".dv", "video/x-dv");
	Список.Вставить(".dvi", "application/x-dvi");
	Список.Вставить(".dwf", "drawing/x-dwf");
	Список.Вставить(".dwg", "application/acad");
	Список.Вставить(".dwp", "application/octet-stream");
	Список.Вставить(".dxf", "application/x-dxf");
	Список.Вставить(".dxr", "application/x-director");
	Список.Вставить(".eml", "message/rfc822");
	Список.Вставить(".emz", "application/octet-stream");
	Список.Вставить(".eot", "application/vnd.ms-fontobject");
	Список.Вставить(".eps", "application/postscript");
	Список.Вставить(".es", "application/ecmascript");
	Список.Вставить(".etl", "application/etl");
	Список.Вставить(".etx", "text/x-setext");
	Список.Вставить(".evy", "application/envoy");
	Список.Вставить(".exe", "application/octet-stream");
	Список.Вставить(".exe.config", "text/xml");
	Список.Вставить(".fdf", "application/vnd.fdf");
	Список.Вставить(".fif", "application/fractals");
	Список.Вставить(".filters", "application/xml");
	Список.Вставить(".fla", "application/octet-stream");
	Список.Вставить(".flac", "audio/flac");
	Список.Вставить(".flr", "x-world/x-vrml");
	Список.Вставить(".flv", "video/x-flv");
	Список.Вставить(".fsscript", "application/fsharp-script");
	Список.Вставить(".fsx", "application/fsharp-script");
	Список.Вставить(".generictest", "application/xml");
	Список.Вставить(".gif", "image/gif");
	Список.Вставить(".gpx", "application/gpx+xml");
	Список.Вставить(".group", "text/x-ms-group");
	Список.Вставить(".gsm", "audio/x-gsm");
	Список.Вставить(".gtar", "application/x-gtar");
	Список.Вставить(".gz", "application/x-gzip");
	Список.Вставить(".h", "text/plain");
	Список.Вставить(".hdf", "application/x-hdf");
	Список.Вставить(".hdml", "text/x-hdml");
	Список.Вставить(".hhc", "application/x-oleobject");
	Список.Вставить(".hhk", "application/octet-stream");
	Список.Вставить(".hhp", "application/octet-stream");
	Список.Вставить(".hlp", "application/winhlp");
	Список.Вставить(".hpp", "text/plain");
	Список.Вставить(".hqx", "application/mac-binhex40");
	Список.Вставить(".hta", "application/hta");
	Список.Вставить(".htc", "text/x-component");
	Список.Вставить(".htm", "text/html");
	Список.Вставить(".html", "text/html");
	Список.Вставить(".htt", "text/webviewhtml");
	Список.Вставить(".hxa", "application/xml");


	Список.Вставить(".hxc", "application/xml");
	Список.Вставить(".hxd", "application/octet-stream");
	Список.Вставить(".hxe", "application/xml");
	Список.Вставить(".hxf", "application/xml");
	Список.Вставить(".hxh", "application/octet-stream");
	Список.Вставить(".hxi", "application/octet-stream");
	Список.Вставить(".hxk", "application/xml");
	Список.Вставить(".hxq", "application/octet-stream");
	Список.Вставить(".hxr", "application/octet-stream");
	Список.Вставить(".hxs", "application/octet-stream");
	Список.Вставить(".hxt", "text/html");
	Список.Вставить(".hxv", "application/xml");
	Список.Вставить(".hxw", "application/octet-stream");
	Список.Вставить(".hxx", "text/plain");
	Список.Вставить(".i", "text/plain");
	Список.Вставить(".ico", "image/x-icon");
	Список.Вставить(".ics", "application/octet-stream");
	Список.Вставить(".idl", "text/plain");
	Список.Вставить(".ief", "image/ief");
	Список.Вставить(".iii", "application/x-iphone");
	Список.Вставить(".inc", "text/plain");
	Список.Вставить(".inf", "application/octet-stream");
	Список.Вставить(".ini", "text/plain");
	Список.Вставить(".inl", "text/plain");
	Список.Вставить(".ins", "application/x-internet-signup");
	Список.Вставить(".ipa", "application/x-itunes-ipa");
	Список.Вставить(".ipg", "application/x-itunes-ipg");
	Список.Вставить(".ipproj", "text/plain");
	Список.Вставить(".ipsw", "application/x-itunes-ipsw");
	Список.Вставить(".iqy", "text/x-ms-iqy");
	Список.Вставить(".isp", "application/x-internet-signup");
	Список.Вставить(".ite", "application/x-itunes-ite");
	Список.Вставить(".itlp", "application/x-itunes-itlp");
	Список.Вставить(".itms", "application/x-itunes-itms");
	Список.Вставить(".itpc", "application/x-itunes-itpc");
	Список.Вставить(".IVF", "video/x-ivf");
	Список.Вставить(".jar", "application/java-archive");
	Список.Вставить(".java", "application/octet-stream");
	Список.Вставить(".jck", "application/liquidmotion");
	Список.Вставить(".jcz", "application/liquidmotion");
	Список.Вставить(".jfif", "image/pjpeg");
	Список.Вставить(".jnlp", "application/x-java-jnlp-file");
	Список.Вставить(".jpb", "application/octet-stream");
	Список.Вставить(".jpe", "image/jpeg");
	Список.Вставить(".jpeg", "image/jpeg");
	Список.Вставить(".jpg", "image/jpeg");
	Список.Вставить(".js", "application/javascript");
	Список.Вставить(".json", "application/json");
	Список.Вставить(".jsx", "text/jscript");
	Список.Вставить(".jsxbin", "text/plain");
	Список.Вставить(".latex", "application/x-latex");
	Список.Вставить(".library-ms", "application/windows-library+xml");
	Список.Вставить(".lit", "application/x-ms-reader");
	Список.Вставить(".loadtest", "application/xml");
	Список.Вставить(".lpk", "application/octet-stream");
	Список.Вставить(".lsf", "video/x-la-asf");
	Список.Вставить(".lst", "text/plain");
	Список.Вставить(".lsx", "video/x-la-asf");
	Список.Вставить(".lzh", "application/octet-stream");
	Список.Вставить(".m13", "application/x-msmediaview");
	Список.Вставить(".m14", "application/x-msmediaview");
	Список.Вставить(".m1v", "video/mpeg");
	Список.Вставить(".m2t", "video/vnd.dlna.mpeg-tts");
	Список.Вставить(".m2ts", "video/vnd.dlna.mpeg-tts");
	Список.Вставить(".m2v", "video/mpeg");
	Список.Вставить(".m3u", "audio/x-mpegurl");
	Список.Вставить(".m3u8", "audio/x-mpegurl");
	Список.Вставить(".m4a", "audio/m4a");
	Список.Вставить(".m4b", "audio/m4b");
	Список.Вставить(".m4p", "audio/m4p");
	Список.Вставить(".m4r", "audio/x-m4r");
	Список.Вставить(".m4v", "video/x-m4v");
	Список.Вставить(".mac", "image/x-macpaint");
	Список.Вставить(".mak", "text/plain");
	Список.Вставить(".man", "application/x-troff-man");
	Список.Вставить(".manifest", "application/x-ms-manifest");
	Список.Вставить(".map", "text/plain");
	Список.Вставить(".master", "application/xml");
	Список.Вставить(".mbox", "application/mbox");
	Список.Вставить(".mda", "application/msaccess");
	Список.Вставить(".mdb", "application/x-msaccess");
	Список.Вставить(".mde", "application/msaccess");
	Список.Вставить(".mdp", "application/octet-stream");
	Список.Вставить(".me", "application/x-troff-me");
	Список.Вставить(".mfp", "application/x-shockwave-flash");
	Список.Вставить(".mht", "message/rfc822");
	Список.Вставить(".mhtml", "message/rfc822");
	Список.Вставить(".mid", "audio/mid");
	Список.Вставить(".midi", "audio/mid");
	Список.Вставить(".mix", "application/octet-stream");
	Список.Вставить(".mk", "text/plain");
	Список.Вставить(".mk3d", "video/x-matroska-3d");
	Список.Вставить(".mka", "audio/x-matroska");
	Список.Вставить(".mkv", "video/x-matroska");
	Список.Вставить(".mmf", "application/x-smaf");
	Список.Вставить(".mno", "text/xml");
	Список.Вставить(".mny", "application/x-msmoney");
	Список.Вставить(".mod", "video/mpeg");
	Список.Вставить(".mov", "video/quicktime");

	Список.Вставить(".movie", "video/x-sgi-movie");
	Список.Вставить(".mp2", "video/mpeg");
	Список.Вставить(".mp2v", "video/mpeg");
	Список.Вставить(".mp3", "audio/mpeg");
	Список.Вставить(".mp4", "video/mp4");
	Список.Вставить(".mp4v", "video/mp4");
	Список.Вставить(".mpa", "video/mpeg");
	Список.Вставить(".mpe", "video/mpeg");
	Список.Вставить(".mpeg", "video/mpeg");
	Список.Вставить(".mpf", "application/vnd.ms-mediapackage");
	Список.Вставить(".mpg", "video/mpeg");
	Список.Вставить(".mpp", "application/vnd.ms-project");
	Список.Вставить(".mpv2", "video/mpeg");
	Список.Вставить(".mqv", "video/quicktime");
	Список.Вставить(".ms", "application/x-troff-ms");
	Список.Вставить(".msg", "application/vnd.ms-outlook");
	Список.Вставить(".msi", "application/octet-stream");
	Список.Вставить(".mso", "application/octet-stream");
	Список.Вставить(".mts", "video/vnd.dlna.mpeg-tts");
	Список.Вставить(".mtx", "application/xml");
	Список.Вставить(".mvb", "application/x-msmediaview");
	Список.Вставить(".mvc", "application/x-miva-compiled");
	Список.Вставить(".mxp", "application/x-mmxp");
	Список.Вставить(".nc", "application/x-netcdf");
	Список.Вставить(".nsc", "video/x-ms-asf");
	Список.Вставить(".nws", "message/rfc822");
	Список.Вставить(".ocx", "application/octet-stream");
	Список.Вставить(".oda", "application/oda");
	Список.Вставить(".odb", "application/vnd.oasis.opendocument.database");
	Список.Вставить(".odc", "application/vnd.oasis.opendocument.chart");
	Список.Вставить(".odf", "application/vnd.oasis.opendocument.formula");
	Список.Вставить(".odg", "application/vnd.oasis.opendocument.graphics");
	Список.Вставить(".odh", "text/plain");
	Список.Вставить(".odi", "application/vnd.oasis.opendocument.image");
	Список.Вставить(".odl", "text/plain");
	Список.Вставить(".odm", "application/vnd.oasis.opendocument.text-master");
	Список.Вставить(".odp", "application/vnd.oasis.opendocument.presentation");
	Список.Вставить(".ods", "application/vnd.oasis.opendocument.spreadsheet");
	Список.Вставить(".odt", "application/vnd.oasis.opendocument.text");
	Список.Вставить(".oga", "audio/ogg");
	Список.Вставить(".ogg", "audio/ogg");
	Список.Вставить(".ogv", "video/ogg");
	Список.Вставить(".ogx", "application/ogg");
	Список.Вставить(".one", "application/onenote");
	Список.Вставить(".onea", "application/onenote");
	Список.Вставить(".onepkg", "application/onenote");
	Список.Вставить(".onetmp", "application/onenote");
	Список.Вставить(".onetoc", "application/onenote");
	Список.Вставить(".onetoc2", "application/onenote");
	Список.Вставить(".opus", "audio/ogg");
	Список.Вставить(".orderedtest", "application/xml");
	Список.Вставить(".osdx", "application/opensearchdescription+xml");
	Список.Вставить(".otf", "application/font-sfnt");
	Список.Вставить(".otg", "application/vnd.oasis.opendocument.graphics-template");
	Список.Вставить(".oth", "application/vnd.oasis.opendocument.text-web");
	Список.Вставить(".otp", "application/vnd.oasis.opendocument.presentation-template");
	Список.Вставить(".ots", "application/vnd.oasis.opendocument.spreadsheet-template");
	Список.Вставить(".ott", "application/vnd.oasis.opendocument.text-template");
	Список.Вставить(".oxt", "application/vnd.openofficeorg.extension");
	Список.Вставить(".p10", "application/pkcs10");
	Список.Вставить(".p12", "application/x-pkcs12");
	Список.Вставить(".p7b", "application/x-pkcs7-certificates");
	Список.Вставить(".p7c", "application/pkcs7-mime");
	Список.Вставить(".p7m", "application/pkcs7-mime");
	Список.Вставить(".p7r", "application/x-pkcs7-certreqresp");
	Список.Вставить(".p7s", "application/pkcs7-signature");
	Список.Вставить(".pbm", "image/x-portable-bitmap");
	Список.Вставить(".pcast", "application/x-podcast");
	Список.Вставить(".pct", "image/pict");
	Список.Вставить(".pcx", "application/octet-stream");
	Список.Вставить(".pcz", "application/octet-stream");
	Список.Вставить(".pdf", "application/pdf");
	Список.Вставить(".pfb", "application/octet-stream");
	Список.Вставить(".pfm", "application/octet-stream");
	Список.Вставить(".pfx", "application/x-pkcs12");
	Список.Вставить(".pgm", "image/x-portable-graymap");
	Список.Вставить(".pic", "image/pict");
	Список.Вставить(".pict", "image/pict");
	Список.Вставить(".pkgdef", "text/plain");
	Список.Вставить(".pkgundef", "text/plain");
	Список.Вставить(".pko", "application/vnd.ms-pki.pko");
	Список.Вставить(".pls", "audio/scpls");
	Список.Вставить(".pma", "application/x-perfmon");
	Список.Вставить(".pmc", "application/x-perfmon");
	Список.Вставить(".pml", "application/x-perfmon");
	Список.Вставить(".pmr", "application/x-perfmon");
	Список.Вставить(".pmw", "application/x-perfmon");
	Список.Вставить(".png", "image/png");
	Список.Вставить(".pnm", "image/x-portable-anymap");
	Список.Вставить(".pnt", "image/x-macpaint");
	Список.Вставить(".pntg", "image/x-macpaint");
	Список.Вставить(".pnz", "image/png");
	Список.Вставить(".pot", "application/vnd.ms-powerpoint");
	Список.Вставить(".potm", "application/vnd.ms-powerpoint.template.macroEnabled.12");
	Список.Вставить(".potx", "application/vnd.openxmlformats-officedocument.presentationml.template");
	Список.Вставить(".ppa", "application/vnd.ms-powerpoint");
	Список.Вставить(".ppam", "application/vnd.ms-powerpoint.addin.macroEnabled.12");
	Список.Вставить(".ppm", "image/x-portable-pixmap");
	Список.Вставить(".pps", "application/vnd.ms-powerpoint");
	Список.Вставить(".ppsm", "application/vnd.ms-powerpoint.slideshow.macroEnabled.12");
	Список.Вставить(".ppsx", "application/vnd.openxmlformats-officedocument.presentationml.slideshow");
	Список.Вставить(".ppt", "application/vnd.ms-powerpoint");
	Список.Вставить(".pptm", "application/vnd.ms-powerpoint.presentation.macroEnabled.12");
	Список.Вставить(".pptx", "application/vnd.openxmlformats-officedocument.presentationml.presentation");
	Список.Вставить(".prf", "application/pics-rules");
	Список.Вставить(".prm", "application/octet-stream");
	Список.Вставить(".prx", "application/octet-stream");
	Список.Вставить(".ps", "application/postscript");
	Список.Вставить(".psc1", "application/PowerShell");
	Список.Вставить(".psd", "application/octet-stream");
	Список.Вставить(".psess", "application/xml");
	Список.Вставить(".psm", "application/octet-stream");
	Список.Вставить(".psp", "application/octet-stream");
	Список.Вставить(".pst", "application/vnd.ms-outlook");
	Список.Вставить(".pub", "application/x-mspublisher");
	Список.Вставить(".pwz", "application/vnd.ms-powerpoint");
	Список.Вставить(".qht", "text/x-html-insertion");
	Список.Вставить(".qhtm", "text/x-html-insertion");
	Список.Вставить(".qt", "video/quicktime");
	Список.Вставить(".qti", "image/x-quicktime");
	Список.Вставить(".qtif", "image/x-quicktime");
	Список.Вставить(".qtl", "application/x-quicktimeplayer");
	Список.Вставить(".qxd", "application/octet-stream");
	Список.Вставить(".ra", "audio/x-pn-realaudio");
	Список.Вставить(".ram", "audio/x-pn-realaudio");
	Список.Вставить(".rar", "application/x-rar-compressed");
	Список.Вставить(".ras", "image/x-cmu-raster");
	Список.Вставить(".rat", "application/rat-file");
	Список.Вставить(".rc", "text/plain");
	Список.Вставить(".rc2", "text/plain");
	Список.Вставить(".rct", "text/plain");
	Список.Вставить(".rdlc", "application/xml");
	Список.Вставить(".reg", "text/plain");
	Список.Вставить(".resx", "application/xml");
	Список.Вставить(".rf", "image/vnd.rn-realflash");
	Список.Вставить(".rgb", "image/x-rgb");
	Список.Вставить(".rgs", "text/plain");
	Список.Вставить(".rm", "application/vnd.rn-realmedia");
	Список.Вставить(".rmi", "audio/mid");
	Список.Вставить(".rmp", "application/vnd.rn-rn_music_package");
	Список.Вставить(".roff", "application/x-troff");


	Список.Вставить(".rpm", "audio/x-pn-realaudio-plugin");
	Список.Вставить(".rqy", "text/x-ms-rqy");
	Список.Вставить(".rtf", "application/rtf");
	Список.Вставить(".rtx", "text/richtext");
	Список.Вставить(".rvt", "application/octet-stream");
	Список.Вставить(".ruleset", "application/xml");
	Список.Вставить(".s", "text/plain");
	Список.Вставить(".safariextz", "application/x-safari-safariextz");
	Список.Вставить(".scd", "application/x-msschedule");
	Список.Вставить(".scr", "text/plain");
	Список.Вставить(".sct", "text/scriptlet");
	Список.Вставить(".sd2", "audio/x-sd2");
	Список.Вставить(".sdp", "application/sdp");
	Список.Вставить(".sea", "application/octet-stream");
	Список.Вставить(".searchConnector-ms", "application/windows-search-connector+xml");
	Список.Вставить(".setpay", "application/set-payment-initiation");
	Список.Вставить(".setreg", "application/set-registration-initiation");
	Список.Вставить(".settings", "application/xml");
	Список.Вставить(".sgimb", "application/x-sgimb");
	Список.Вставить(".sgml", "text/sgml");
	Список.Вставить(".sh", "application/x-sh");
	Список.Вставить(".shar", "application/x-shar");
	Список.Вставить(".shtml", "text/html");
	Список.Вставить(".sit", "application/x-stuffit");
	Список.Вставить(".sitemap", "application/xml");
	Список.Вставить(".skin", "application/xml");
	Список.Вставить(".skp", "application/x-koan");
	Список.Вставить(".sldm", "application/vnd.ms-powerpoint.slide.macroEnabled.12");
	Список.Вставить(".sldx", "application/vnd.openxmlformats-officedocument.presentationml.slide");
	Список.Вставить(".slk", "application/vnd.ms-excel");
	Список.Вставить(".sln", "text/plain");
	Список.Вставить(".slupkg-ms", "application/x-ms-license");
	Список.Вставить(".smd", "audio/x-smd");
	Список.Вставить(".smi", "application/octet-stream");
	Список.Вставить(".smx", "audio/x-smd");
	Список.Вставить(".smz", "audio/x-smd");
	Список.Вставить(".snd", "audio/basic");
	Список.Вставить(".snippet", "application/xml");
	Список.Вставить(".snp", "application/octet-stream");
	Список.Вставить(".sol", "text/plain");
	Список.Вставить(".sor", "text/plain");
	Список.Вставить(".spc", "application/x-pkcs7-certificates");
	Список.Вставить(".spl", "application/futuresplash");
	Список.Вставить(".spx", "audio/ogg");
	Список.Вставить(".src", "application/x-wais-source");
	Список.Вставить(".srf", "text/plain");
	Список.Вставить(".SSISDeploymentManifest", "text/xml");
	Список.Вставить(".ssm", "application/streamingmedia");
	Список.Вставить(".sst", "application/vnd.ms-pki.certstore");
	Список.Вставить(".stl", "application/vnd.ms-pki.stl");
	Список.Вставить(".sv4cpio", "application/x-sv4cpio");
	Список.Вставить(".sv4crc", "application/x-sv4crc");
	Список.Вставить(".svc", "application/xml");
	Список.Вставить(".svg", "image/svg+xml");
	Список.Вставить(".swf", "application/x-shockwave-flash");
	Список.Вставить(".step", "application/step");
	Список.Вставить(".stp", "application/step");
	Список.Вставить(".t", "application/x-troff");
	Список.Вставить(".tar", "application/x-tar");
	Список.Вставить(".tcl", "application/x-tcl");
	Список.Вставить(".testrunconfig", "application/xml");
	Список.Вставить(".testsettings", "application/xml");
	Список.Вставить(".tex", "application/x-tex");
	Список.Вставить(".texi", "application/x-texinfo");
	Список.Вставить(".texinfo", "application/x-texinfo");
	Список.Вставить(".tgz", "application/x-compressed");
	Список.Вставить(".thmx", "application/vnd.ms-officetheme");
	Список.Вставить(".thn", "application/octet-stream");
	Список.Вставить(".tif", "image/tiff");
	Список.Вставить(".tiff", "image/tiff");
	Список.Вставить(".tlh", "text/plain");
	Список.Вставить(".tli", "text/plain");
	Список.Вставить(".toc", "application/octet-stream");
	Список.Вставить(".tr", "application/x-troff");
	Список.Вставить(".trm", "application/x-msterminal");
	Список.Вставить(".trx", "application/xml");
	Список.Вставить(".ts", "video/vnd.dlna.mpeg-tts");
	Список.Вставить(".tsv", "text/tab-separated-values");
	Список.Вставить(".ttf", "application/font-sfnt");
	Список.Вставить(".tts", "video/vnd.dlna.mpeg-tts");
	Список.Вставить(".txt", "text/plain");
	Список.Вставить(".u32", "application/octet-stream");
	Список.Вставить(".uls", "text/iuls");
	Список.Вставить(".user", "text/plain");
	Список.Вставить(".ustar", "application/x-ustar");
	Список.Вставить(".vb", "text/plain");
	Список.Вставить(".vbdproj", "text/plain");
	Список.Вставить(".vbk", "video/mpeg");
	Список.Вставить(".vbproj", "text/plain");
	Список.Вставить(".vbs", "text/vbscript");
	Список.Вставить(".vcf", "text/x-vcard");
	Список.Вставить(".vcproj", "application/xml");
	Список.Вставить(".vcs", "text/plain");
	Список.Вставить(".vcxproj", "application/xml");
	Список.Вставить(".vddproj", "text/plain");
	Список.Вставить(".vdp", "text/plain");
	Список.Вставить(".vdproj", "text/plain");
	Список.Вставить(".vdx", "application/vnd.ms-visio.viewer");
	Список.Вставить(".vml", "text/xml");
	Список.Вставить(".vscontent", "application/xml");
	Список.Вставить(".vsct", "text/xml");
	Список.Вставить(".vsd", "application/vnd.visio");
	Список.Вставить(".vsi", "application/ms-vsi");
	Список.Вставить(".vsix", "application/vsix");
	Список.Вставить(".vsixlangpack", "text/xml");
	Список.Вставить(".vsixmanifest", "text/xml");
	Список.Вставить(".vsmdi", "application/xml");
	Список.Вставить(".vspscc", "text/plain");
	Список.Вставить(".vss", "application/vnd.visio");
	Список.Вставить(".vsscc", "text/plain");
	Список.Вставить(".vssettings", "text/xml");
	Список.Вставить(".vssscc", "text/plain");
	Список.Вставить(".vst", "application/vnd.visio");
	Список.Вставить(".vstemplate", "text/xml");
	Список.Вставить(".vsto", "application/x-ms-vsto");
	Список.Вставить(".vsw", "application/vnd.visio");
	Список.Вставить(".vsx", "application/vnd.visio");
	Список.Вставить(".vtt", "text/vtt");
	Список.Вставить(".vtx", "application/vnd.visio");
	Список.Вставить(".wasm", "application/wasm");
	Список.Вставить(".wav", "audio/wav");
	Список.Вставить(".wave", "audio/wav");
	Список.Вставить(".wax", "audio/x-ms-wax");
	Список.Вставить(".wbk", "application/msword");
	Список.Вставить(".wbmp", "image/vnd.wap.wbmp");
	Список.Вставить(".wcm", "application/vnd.ms-works");
	Список.Вставить(".wdb", "application/vnd.ms-works");
	Список.Вставить(".wdp", "image/vnd.ms-photo");
	Список.Вставить(".webarchive", "application/x-safari-webarchive");
	Список.Вставить(".webm", "video/webm");
	Список.Вставить(".webp", "image/webp");
	Список.Вставить(".webtest", "application/xml");
	Список.Вставить(".wiq", "application/xml");
	Список.Вставить(".wiz", "application/msword");
	Список.Вставить(".wks", "application/vnd.ms-works");
	Список.Вставить(".WLMP", "application/wlmoviemaker");
	Список.Вставить(".wlpginstall", "application/x-wlpg-detect");
	Список.Вставить(".wlpginstall3", "application/x-wlpg3-detect");
	Список.Вставить(".wm", "video/x-ms-wm");
	Список.Вставить(".wma", "audio/x-ms-wma");
	Список.Вставить(".wmd", "application/x-ms-wmd");
	Список.Вставить(".wmf", "application/x-msmetafile");
	Список.Вставить(".wml", "text/vnd.wap.wml");
	Список.Вставить(".wmlc", "application/vnd.wap.wmlc");
	Список.Вставить(".wmls", "text/vnd.wap.wmlscript");
	Список.Вставить(".wmlsc", "application/vnd.wap.wmlscriptc");
	Список.Вставить(".wmp", "video/x-ms-wmp");
	Список.Вставить(".wmv", "video/x-ms-wmv");
	Список.Вставить(".wmx", "video/x-ms-wmx");
	Список.Вставить(".wmz", "application/x-ms-wmz");
	Список.Вставить(".woff", "application/font-woff");
	Список.Вставить(".woff2", "application/font-woff2");
	Список.Вставить(".wpl", "application/vnd.ms-wpl");
	Список.Вставить(".wps", "application/vnd.ms-works");
	Список.Вставить(".wri", "application/x-mswrite");
	Список.Вставить(".wrl", "x-world/x-vrml");
	Список.Вставить(".wrz", "x-world/x-vrml");
	Список.Вставить(".wsc", "text/scriptlet");
	Список.Вставить(".wsdl", "text/xml");
	Список.Вставить(".wvx", "video/x-ms-wvx");
	Список.Вставить(".x", "application/directx");
	Список.Вставить(".xaf", "x-world/x-vrml");
	Список.Вставить(".xaml", "application/xaml+xml");
	Список.Вставить(".xap", "application/x-silverlight-app");
	Список.Вставить(".xbap", "application/x-ms-xbap");
	Список.Вставить(".xbm", "image/x-xbitmap");
	Список.Вставить(".xdr", "text/plain");
	Список.Вставить(".xht", "application/xhtml+xml");
	Список.Вставить(".xhtml", "application/xhtml+xml");
	Список.Вставить(".xla", "application/vnd.ms-excel");
	Список.Вставить(".xlam", "application/vnd.ms-excel.addin.macroEnabled.12");
	Список.Вставить(".xlc", "application/vnd.ms-excel");
	Список.Вставить(".xld", "application/vnd.ms-excel");
	Список.Вставить(".xlk", "application/vnd.ms-excel");
	Список.Вставить(".xll", "application/vnd.ms-excel");
	Список.Вставить(".xlm", "application/vnd.ms-excel");
	Список.Вставить(".xls", "application/vnd.ms-excel");
	Список.Вставить(".xlsb", "application/vnd.ms-excel.sheet.binary.macroEnabled.12");
	Список.Вставить(".xlsm", "application/vnd.ms-excel.sheet.macroEnabled.12");
	Список.Вставить(".xlsx", "application/vnd.openxmlformats-officedocument.spreadsheetml.sheet");
	Список.Вставить(".xlt", "application/vnd.ms-excel");
	Список.Вставить(".xltm", "application/vnd.ms-excel.template.macroEnabled.12");
	Список.Вставить(".xltx", "application/vnd.openxmlformats-officedocument.spreadsheetml.template");
	Список.Вставить(".xlw", "application/vnd.ms-excel");
	Список.Вставить(".xml", "text/xml");
	Список.Вставить(".xmp", "application/octet-stream");
	Список.Вставить(".xmta", "application/xml");
	Список.Вставить(".xof", "x-world/x-vrml");
	Список.Вставить(".XOML", "text/plain");
	Список.Вставить(".xpm", "image/x-xpixmap");
	Список.Вставить(".xps", "application/vnd.ms-xpsdocument");
	Список.Вставить(".xrm-ms", "text/xml");
	Список.Вставить(".xsc", "application/xml");
	Список.Вставить(".xsd", "text/xml");
	Список.Вставить(".xsf", "text/xml");
	Список.Вставить(".xsl", "text/xml");
	Список.Вставить(".xslt", "text/xml");
	Список.Вставить(".xsn", "application/octet-stream");
	Список.Вставить(".xss", "application/xml");
	Список.Вставить(".xspf", "application/xspf+xml");
	Список.Вставить(".xtp", "application/octet-stream");
	Список.Вставить(".xwd", "image/x-xwindowdump");
	Список.Вставить(".z", "application/x-compress");
	Список.Вставить(".zip", "application/zip");

	MIEТип = Список.Получить(НРег(Расширение));
	
	Возврат ?(MIEТип = Неопределено, "application/octet-stream", MIEТип);

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// РАЗНОЕ

// Процедура удаляет завершающий слэш, если он есть во внутренней гиперссылке
//
Процедура ИсправитьПроблемнуюСсылкуФорматированногоДокумента(АдресГиперссылки) Экспорт
	
	Если Лев(АдресГиперссылки, 8) = "e1c:///?"
		И Прав(АдресГиперссылки, 1) = "/" Тогда
		
		// BUG 8.3.8 - Платформа добавляет к ссылке лишний слэш справа
		
		АдресГиперссылки = Сред(АдресГиперссылки, 1, СтрДлина(АдресГиперссылки)-1);
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ИсправитьBase64Строку(ТекстДляОбработки) Экспорт
	
	Разделитель = "base64,";
	МассивСтрок = СтрРазделитьСтроку(ТекстДляОбработки, Разделитель, Ложь);

	Номер = 0;
	Для каждого СтрокаДляЗамены Из МассивСтрок Цикл
		
		Номер = Номер + 1;
		
		Если Номер = 1 Тогда
			Продолжить;
		КонецЕсли;
		
		НомерКонцаBase64 = Найти(СтрокаДляЗамены, """");
		Если НомерКонцаBase64 = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ОригинальныйBase64 = Сред(СтрокаДляЗамены, 1, НомерКонцаBase64 - 1);
		ПреобразованныйBase64 = СтрЗаменить(ОригинальныйBase64, "-", "+");
	    ПреобразованныйBase64 = СтрЗаменить(ПреобразованныйBase64, "_", "/");
		
		ТекстДляОбработки = СтрЗаменить(ТекстДляОбработки, ОригинальныйBase64, ПреобразованныйBase64);
		
	КонецЦикла;	
	
КонецПроцедуры

Функция СтрРазделитьСтроку(Знач Строка, Знач Разделитель, Знач ВключатьПустые = Истина) Экспорт
	Результат = Новый Массив;
	
	Если Строка = "" Тогда 
		Если ВключатьПустые Тогда
			Результат.Добавить(Строка);
		КонецЕсли;
		Возврат Результат;
	КонецЕсли;
	
	Позиция = Найти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если ВключатьПустые ИЛИ НЕ Подстрока = "" Тогда
			Результат.Добавить(Подстрока);
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Строка, Разделитель);
	КонецЦикла;
	
	Если ВключатьПустые ИЛИ НЕ Строка = "" Тогда
		Результат.Добавить(Строка);
	КонецЕсли;
		
	Возврат Результат;	
КонецФункции
