#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ПрисоединенныйФайлЗаписи(СсылкаНаЭлемент, Поставщик, Версия, КодДанных) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеФайлов.ПрисоединенныйФайл КАК ПрисоединенныйФайл
		|ИЗ
		|	РегистрСведений.ДанныеФайлыСУЗ КАК ДанныеФайлов
		|ГДЕ
		|	ДанныеФайлов.СсылкаНаОбъектСУЗ = &СсылкаНаЭлементКурса
		|	И ДанныеФайлов.Поставщик = &Поставщик
		|	И ДанныеФайлов.Версия = &Версия
		|	И ДанныеФайлов.КодДанных = &КодДанных";
	
	Запрос.УстановитьПараметр("Версия", Версия);
	Запрос.УстановитьПараметр("КодДанных", КодДанных);
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Запрос.УстановитьПараметр("СсылкаНаЭлементКурса", СсылкаНаЭлемент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ВыборкаДетальныеЗаписи.ПрисоединенныйФайл;
		
	КонецЕсли;
	
	
КонецФункции

Функция АдресХраненияДвоичныхДанных(СсылкаНаЭлемент, Поставщик, Версия, КодДанных, ИдентификаторФормы = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеФайлов.ПрисоединенныйФайл КАК ПрисоединенныйФайл
		|ИЗ
		|	РегистрСведений.ДанныеФайлыСУЗ КАК ДанныеФайлов
		|ГДЕ
		|	ДанныеФайлов.СсылкаНаОбъектСУЗ = &СсылкаНаЭлементКурса
		|	И ДанныеФайлов.Поставщик = &Поставщик
		|	И ДанныеФайлов.Версия = &Версия
		|	И ДанныеФайлов.КодДанных = &КодДанных";
	
	Запрос.УстановитьПараметр("Версия", Версия);
	Запрос.УстановитьПараметр("КодДанных", КодДанных);
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Запрос.УстановитьПараметр("СсылкаНаЭлементКурса", СсылкаНаЭлемент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		ВыборкаДетальныеЗаписи.Следующий();
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПрисоединенныйФайл) Тогда
			
			ДанныеФайла = ПрисоединенныеФайлы.ПолучитьДанныеФайла(ВыборкаДетальныеЗаписи.ПрисоединенныйФайл, ИдентификаторФормы, Истина); 
				
			Возврат ДанныеФайла.СсылкаНаДвоичныеДанныеФайла;				
				
		Иначе
			
			КлючЗаписи = РегистрыСведений.ДанныеФайлыСУЗ.СоздатьКлючЗаписи(
				Новый Структура("СсылкаНаОбъектСУЗ, Поставщик, Версия, КодДанных", СсылкаНаЭлемент, Поставщик, Версия, КодДанных)
			);
			
			Возврат ПолучитьНавигационнуюСсылку(КлючЗаписи, "ДвоичныеДанные");			
			
		КонецЕсли;
		
		
	КонецЕсли;
	
	
КонецФункции

Функция ДанныеФайловРазмещенныеВБСП() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеФайлов.СсылкаНаОбъектСУЗ КАК СсылкаНаЭлементКурса,
		|	ДанныеФайлов.Поставщик КАК Поставщик,
		|	ДанныеФайлов.Версия КАК Версия,
		|	ДанныеФайлов.КодДанных КАК КодДанных,
		|	ДанныеФайлов.СсылкаНаОбъектСУЗ.ИмяФайла КАК ИмяФайла,
		|	ДанныеФайлов.СсылкаНаОбъектСУЗ.ДатаИзменения КАК ДатаИзменения
		|ИЗ
		|	РегистрСведений.ДанныеФайлыСУЗ КАК ДанныеФайлов
		|ГДЕ
		|	ДанныеФайлов.ПрисоединенныйФайл <> &ПрисоединенныйФайлПустаяСсылка";
	
	Запрос.УстановитьПараметр("ПрисоединенныйФайлПустаяСсылка", Справочники.ФайлыСУЗПрисоединенныеФайлы.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции

Функция ДанныеФайловДляРазмещенияВБСП() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеФайлов.СсылкаНаОбъектСУЗ КАК СсылкаНаЭлементКурса,
		|	ДанныеФайлов.Поставщик КАК Поставщик,
		|	ДанныеФайлов.Версия КАК Версия,
		|	ДанныеФайлов.КодДанных КАК КодДанных,
		|	ДанныеФайлов.СсылкаНаОбъектСУЗ.ИмяФайла КАК ИмяФайла,
		|	ДанныеФайлов.СсылкаНаОбъектСУЗ.ДатаИзменения КАК ДатаИзменения
		|ИЗ
		|	РегистрСведений.ДанныеФайлыСУЗ КАК ДанныеФайлов
		|ГДЕ
		|	ДанныеФайлов.ПрисоединенныйФайл = &ПрисоединенныйФайлПустаяСсылка
		|	И ДанныеФайлов.СсылкаНаОбъектСУЗ.ТипФайла = &ТипФайлаВидео";
	
	Запрос.УстановитьПараметр("ПрисоединенныйФайлПустаяСсылка", Справочники.ФайлыСУЗПрисоединенныеФайлы.ПустаяСсылка());
	Запрос.УстановитьПараметр("ТипФайлаВидео", Перечисления.ТипыФайловСУЗ.Video);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции

Функция КоличествоФайловРазмещенныхВБСП() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеФайлов.СсылкаНаОбъектСУЗ) КАК КоличествоЭлементов
		|ИЗ
		|	РегистрСведений.ДанныеФайлыСУЗ КАК ДанныеФайлов
		|ГДЕ
		|	ДанныеФайлов.ПрисоединенныйФайл <> &ПрисоединенныйФайлПустаяСсылка";
	
	Запрос.УстановитьПараметр("ПрисоединенныйФайлПустаяСсылка", Справочники.ФайлыСУЗПрисоединенныеФайлы.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.КоличествоЭлементов;	
	
КонецФункции

Функция КоличествоФайловВидео() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеФайлов.СсылкаНаОбъектСУЗ) КАК КоличествоЭлементов
		|ИЗ
		|	РегистрСведений.ДанныеФайлыСУЗ КАК ДанныеФайлов
		|ГДЕ
		|	ДанныеФайлов.СсылкаНаОбъектСУЗ.ТипФайла = &ТипФайлаВидео
		|	И ДанныеФайлов.КодДанных = &КодДанных";
	
	Запрос.УстановитьПараметр("ТипФайлаВидео", Перечисления.ТипыФайловСУЗ.Video);
	Запрос.УстановитьПараметр("КодДанных", "ДвоичныеДанные");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.КоличествоЭлементов;	
	
КонецФункции

Функция КоличествоФайловВидеоРазмещенныхВБазе() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеФайлов.СсылкаНаОбъектСУЗ) КАК КоличествоЭлементов
		|ИЗ
		|	РегистрСведений.ДанныеФайлыСУЗ КАК ДанныеФайлов
		|ГДЕ
		|	ДанныеФайлов.СсылкаНаОбъектСУЗ.ТипФайла = &ТипФайлаВидео
		|	И ДанныеФайлов.ПрисоединенныйФайл = &ПрисоединенныйФайлПустаяСсылка
		|	И ДанныеФайлов.КодДанных = &КодДанных";
	
	Запрос.УстановитьПараметр("ТипФайлаВидео", Перечисления.ТипыФайловСУЗ.Video);
	Запрос.УстановитьПараметр("ПрисоединенныйФайлПустаяСсылка", Справочники.ФайлыСУЗПрисоединенныеФайлы.ПустаяСсылка());
	Запрос.УстановитьПараметр("КодДанных", "ДвоичныеДанные");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.КоличествоЭлементов;	
	
КонецФункции

Функция КоличествоФайловВТомах() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ФайлыСУЗПрисоединенныеФайлы.Ссылка) КАК Количество
		|ИЗ
		|	Справочник.ФайлыСУЗПрисоединенныеФайлы КАК ФайлыСУЗПрисоединенныеФайлы
		|ГДЕ
		|	ФайлыСУЗПрисоединенныеФайлы.ТипХраненияФайла = &ТипХраненияФайлаВТомах";
	
	Запрос.УстановитьПараметр("ТипХраненияФайлаВТомах", Перечисления.ТипыХраненияФайлов.ВТомахНаДиске);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Количество;
	
КонецФункции

#КонецОбласти

#КонецЕсли

