#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

// Процедура удаляет данные версии объекта СУЗ из набора данных записи.
//
Процедура УдалитьВерсиюИзНабора(Поставщик, Версия) Экспорт
	
	а = ЭтотОбъект.Количество()-1;
	Пока а>=0 Цикл
		Строка = ЭтотОбъект.Получить(а);
		Если Строка.Версия = Версия И Строка.Поставщик = Поставщик Тогда
			
			
			Если ЗначениеЗаполнено(Строка.ПрисоединенныйФайл) Тогда
				ПрисоединенныйФайлОбъект = Строка.ПрисоединенныйФайл.ПолучитьОбъект();
				ПрисоединенныйФайлОбъект.УстановитьПометкуУдаления(Истина, Истина);
			КонецЕсли;
			
			
			ЭтотОбъект.Удалить(Строка);
		КонецЕсли;
		а = а - 1;
	КонецЦикла;	
	
КонецПроцедуры


Процедура ПриОтправкеНабора() Экспорт
	
	Для каждого ЗаписьНабора Из ЭтотОбъект Цикл
	
		Если ЗначениеЗаполнено(ЗаписьНабора.ПрисоединенныйФайл) Тогда
			
			ЗаписьНабора.ДвоичныеДанные = Новый ХранилищеЗначения(ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ЗаписьНабора.ПрисоединенныйФайл));
			
			ЗаписьНабора.ДанныеОбмена = Новый ХранилищеЗначения(
				Новый ФиксированнаяСтруктура(ПрисоединенныеФайлы.ПолучитьДанныеФайла(ЗаписьНабора.ПрисоединенныйФайл,,Ложь,Ложь))
			);
			
		КонецЕсли;		
	
	КонецЦикла;	
	
	
КонецПроцедуры

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		
		Для каждого ЗаписьНабора Из ЭтотОбъект Цикл
			
			ДанныеОбмена = ЗаписьНабора.ДанныеОбмена.Получить();
			ДвоичныеДанныеЗаписи = ЗаписьНабора.ДвоичныеДанные.Получить();
			
			Если ДанныеОбмена <> Неопределено
				И ДвоичныеДанныеЗаписи <> Неопределено Тогда
				
				Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ЗаписьНабора.ПрисоединенныйФайл) Тогда
					
					ПрисоединенныеФайлы.ОбновитьПрисоединенныйФайл(ЗаписьНабора.ПрисоединенныйФайл,
					     Новый Структура("АдресФайлаВоВременномХранилище, АдресВременногоХранилищаТекста, ИмяБезРасширения, ДатаМодификацииУниверсальная, Расширение",
							ПоместитьВоВременноеХранилище(ДвоичныеДанныеЗаписи),
							"",
							ДанныеОбмена.Наименование,
							ДанныеОбмена.ДатаМодификацииУниверсальная,
							ДанныеОбмена.Расширение
						)
					 );					 
					
				Иначе
					
					ПрисоединенныеФайлы.ДобавитьФайл(ЗаписьНабора.СсылкаНаОбъектСУЗ, ДанныеОбмена.Наименование, ДанныеОбмена.Расширение, ДанныеОбмена.ДатаМодификацииУниверсальная, ДанныеОбмена.ДатаМодификацииУниверсальная, ПоместитьВоВременноеХранилище(ДвоичныеДанныеЗаписи),,,ЗаписьНабора.ПрисоединенныйФайл);					
										
				КонецЕсли;
					
				ЗаписьНабора.ДвоичныеДанные = Неопределено;
				ЗаписьНабора.ДанныеОбмена = Неопределено;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

#КонецЕсли
