
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Интерактивное создание документа не поддерживается'"),,,,Отказ);
	КонецЕсли;
	
	ЭтоПолныйИнтерфейс = ПолучитьФункциональнуюОпцию("ПолныйИнтерфейсСУО");
	
	// Эти настройки наследуются из сценария мероприятия и не подлежат изменению.
	Элементы.ГруппаНастройкиСценария.ТолькоПросмотр = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ПроведениеОбучения, "НаОсновеМероприятия");		
	Элементы.Роль.Видимость = ЭтоПолныйИнтерфейс;
	Элементы.ТолькоПросмотрВедомости.Видимость = ЭтоПолныйИнтерфейс;
		
КонецПроцедуры
