
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервереБезКонтекста
Процедура ПереместитьМероприятиеВНовыйКаталог(Мероприятие, ИмяНовогоКаталога, ТекущийЭлементНовогоКаталога=Неопределено)
	
	// Ищем нового владельца и нового родителя
	
	Владелец = Справочники.СхемыМероприятийСУО[ИмяНовогоКаталога];
	
	Если ЗначениеЗаполнено(ТекущийЭлементНовогоКаталога) Тогда
		
		ДанныеТекущегоЭлемента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущийЭлементНовогоКаталога, "ЭтоГруппа, Родитель");
		Родитель               = ДанныеТекущегоЭлемента.Родитель;
		
	Иначе
		
		Родитель = Справочники.КаталогМероприятийСУО.ПустаяСсылка();
		
	КонецЕсли;
		
	// Перезаписываем мероприятие
	
	НачатьТранзакцию();
	
	МероприятиеОбъект = Мероприятие.ПолучитьОбъект();
	МероприятиеОбъект.Владелец = Владелец;
	МероприятиеОбъект.Родитель = Родитель;
	
	Попытка 
		МероприятиеОбъект.Заблокировать();
	Исключение
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСТР("ru = 'Не удалось заблокировать объект %1'"),
			Строка(МероприятиеОбъект));
	КонецПопытки;
		
	МероприятиеОбъект.Записать();
	МероприятиеОбъект.Разблокировать();
	
	Если Мероприятие.ЭтоГруппа Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КаталогМероприятийСУО.Ссылка
			|ИЗ
			|	Справочник.КаталогМероприятийСУО КАК КаталогМероприятийСУО
			|ГДЕ
			|	КаталогМероприятийСУО.Ссылка В ИЕРАРХИИ(&Родитель)";

		Запрос.УстановитьПараметр("Родитель", Мероприятие);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			МероприятиеОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			МероприятиеОбъект.Владелец = Владелец;
			
			Попытка 
				МероприятиеОбъект.Заблокировать();
			Исключение
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСТР("ru = 'Не удалось заблокировать объект %1'"),
					Строка(МероприятиеОбъект));
			КонецПопытки;
				
			МероприятиеОбъект.Записать();
			МероприятиеОбъект.Разблокировать();

		КонецЦикла;

	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Владелец") Тогда
		
		Элементы.Скрытые.Видимость = Ложь;
		
	Иначе
		
		Элементы.Скрытые.Видимость = Истина;
		
		ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Список, Справочники.СхемыМероприятийСУО.Общая);
		ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Скрытые, Справочники.СхемыМероприятийСУО.ОбщаяСкрытая);
		
	КонецЕсли;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура ПереместитьВСкрытые(Команда)
	
	ТекущиеДанныеОбщегоКаталога = Элементы.Список.ТекущиеДанные;
	ТекущиеДанныеСкрытогоКаталога = Элементы.Скрытые.ТекущиеДанные;
	
	Если ТекущиеДанныеОбщегоКаталога = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяНовогоКаталога = "ОбщаяСкрытая";
	Мероприятие = ТекущиеДанныеОбщегоКаталога.Ссылка;
	Если ТекущиеДанныеСкрытогоКаталога = Неопределено Тогда
		ТекущийЭлементНовогоКаталога = Неопределено;
	Иначе
		ТекущийЭлементНовогоКаталога = ТекущиеДанныеСкрытогоКаталога.Ссылка;
	КонецЕсли;
	
	ПереместитьМероприятиеВНовыйКаталог(Мероприятие, ИмяНовогоКаталога, ТекущийЭлементНовогоКаталога);
	
	Элементы.Список.Обновить();
	Элементы.Скрытые.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура ПереместитьВОбщие(Команда)
	
	ТекущиеДанныеОбщегоКаталога = Элементы.Список.ТекущиеДанные;
	ТекущиеДанныеСкрытогоКаталога = Элементы.Скрытые.ТекущиеДанные;
	
	Если ТекущиеДанныеСкрытогоКаталога = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяНовогоКаталога = "Общая";
	Мероприятие = ТекущиеДанныеСкрытогоКаталога.Ссылка;
	Если ТекущиеДанныеОбщегоКаталога = Неопределено Тогда
		ТекущийЭлементНовогоКаталога = Неопределено;
	Иначе
		ТекущийЭлементНовогоКаталога = ТекущиеДанныеОбщегоКаталога.Ссылка;
	КонецЕсли;
	
	ПереместитьМероприятиеВНовыйКаталог(Мероприятие, ИмяНовогоКаталога, ТекущийЭлементНовогоКаталога);

	Элементы.Список.Обновить();
	Элементы.Скрытые.Обновить();
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ <Наименование>
