
// Общее

Процедура УстановкаОтветственногоСУОПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;	
	
	Если НЕ Источник.ЭтоГруппа И НЕ ЗначениеЗаполнено(Источник.Ответственный) Тогда
		Источник.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	УправлениеОбучениемСУО.ЗаполнитьОрганизаторовОбъекта(Источник);
	
КонецПроцедуры

Процедура УстановитьОтветственногоДокументаСУОПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Источник.Ответственный) Тогда
		Источник.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	УправлениеОбучениемСУО.ЗаполнитьОрганизаторовОбъекта(Источник);
		
КонецПроцедуры

Процедура УстановкаДатыИзмененияСУОПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;		
	
	Если НЕ Источник.ЭтоГруппа Тогда
		Источник.ДатаИзменения = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриИзмененииИспользованияЭлектронныхКурсовБЭОПриЗаписи(Источник, Отказ) Экспорт
	РегистрыСведений.НастройкиУчебныхМатериаловСУО.УстановитьНастройки();
КонецПроцедуры

// Пользователи

Процедура ДобавитьПользователяВСУОПриЗаписи(Источник, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РегистрыСведений.ФИОПользователейСУО.ДобавитьСведения(Источник.Ссылка, Источник.Наименование);
	
	Если Источник.ДополнительныеСвойства.Свойство("ЭтоНовый")
		И Источник.ДополнительныеСвойства.ЭтоНовый Тогда
		
		ЗапрещеноНазначатьГруппуДоступа = Источник.ДополнительныеСвойства.Свойство("ЗапретитьУстановкуГруппыДоступаДляНовыхПользователей");
		
		ЗапрещеноНазначатьГруппуДоступа = ?(ЗапрещеноНазначатьГруппуДоступа = Неопределено, Ложь, ЗапрещеноНазначатьГруппуДоступа);
		
		Если НЕ ЗапрещеноНазначатьГруппуДоступа Тогда
		
			// Добавляем пользователя в группу доступа по умолчанию
					
			ГруппаДоступаПоУмолчанию = Константы.ГруппаДоступаДляНовыхПользователейСУО.Получить();

			Если ЗначениеЗаполнено(ГруппаДоступаПоУмолчанию) Тогда
				
				ГруппаДоступаОбъект = ГруппаДоступаПоУмолчанию.ПолучитьОбъект();
				
				Если ГруппаДоступаОбъект.Пользователи.Найти(Источник.Ссылка, "Пользователь") = Неопределено Тогда
					ГруппаДоступаОбъект.Пользователи.Добавить().Пользователь = Источник.Ссылка;
				КонецЕсли;
				
				ГруппаДоступаОбъект.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
			
		// Зачисляем на обучение
		
		Запрос = Новый Запрос;

		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПроведениеОбученияСУО.Ссылка
			|ИЗ
			|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
			|ГДЕ
			|	ПроведениеОбученияСУО.Проведен = ИСТИНА
			|	И ПроведениеОбученияСУО.ОткрытоДляВсех = ИСТИНА
			|	И ПроведениеОбученияСУО.ОткрытоДляРуководителей = ЛОЖЬ
			|;";
			
		Запрос.Текст = Запрос.Текст + "
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПроведениеПрограммыОбученияСУО.Ссылка
			|ИЗ
			|	Документ.ПроведениеПрограммыОбученияСУО КАК ПроведениеПрограммыОбученияСУО
			|ГДЕ
			|	ПроведениеПрограммыОбученияСУО.Проведен = ИСТИНА
			|	И ПроведениеПрограммыОбученияСУО.ОткрытоДляВсех = ИСТИНА
			|	И ПроведениеПрограммыОбученияСУО.ОткрытоДляРуководителей = ЛОЖЬ";
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		Для каждого Результат Из МассивРезультатов Цикл
		
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			
			РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокументы(ВыборкаДетальныеЗаписи,,,3);
		
		КонецЦикла;
		
		// Добавляем общие темы форума
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТемыСообщенийСУО.Ссылка
			|ИЗ
			|	Справочник.ТемыСообщенийСУО КАК ТемыСообщенийСУО
			|ГДЕ
			|	ТемыСообщенийСУО.Контекст.ДляВсех = ИСТИНА";
		
		МассивОбщихТем = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СообщениеСУО.Ссылка
			|ИЗ
			|	Документ.СообщениеСУО КАК СообщениеСУО
			|ГДЕ
			|	СообщениеСУО.Проведен = ИСТИНА
			|	И СообщениеСУО.Тема В(&МассивОбщихТем)
			|	И СообщениеСУО.ПервоеСообщениеВТеме = ИСТИНА";
		
		Запрос.УстановитьПараметр("МассивОбщихТем", МассивОбщихТем);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокументы(ВыборкаДетальныеЗаписи,,,3);
		
		// Устанавливаем настройки по умолчанию
		
		НастройкиПоУмолчанию = РегистрыСведений.НастройкиПользователейСУО.СоздатьНаборЗаписей();
		
		НастройкиПоУмолчанию.Отбор.Пользователь.Установить(Справочники.Пользователи.ПустаяСсылка());
		
		НастройкиПоУмолчанию.Прочитать();
		
		Если НастройкиПоУмолчанию.Количество() = 1 Тогда
			
			РеквизитыНастроек = Метаданные.РегистрыСведений.НастройкиПользователейСУО.Реквизиты;
			
			МенеджерЗаписиНастроек = РегистрыСведений.НастройкиПользователейСУО.СоздатьМенеджерЗаписи();
			МенеджерЗаписиНастроек.Пользователь = Источник.Ссылка;
			
			Для каждого РеквизитНастройки Из РеквизитыНастроек Цикл
			
				МенеджерЗаписиНастроек[РеквизитНастройки.Имя] = НастройкиПоУмолчанию[0][РеквизитНастройки.Имя];
			
			КонецЦикла;
			
			МенеджерЗаписиНастроек.Записать(Истина);
			
		КонецЕсли;
		
		// Создаем рассылку
		
		УправлениеОбучениемСУО.СоздатьАвтоматическуюРассылку(Источник);
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПользователиОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт

	Если ВидФормы = "ФормаВыбора" Тогда
		
		Если (Параметры.Свойство("РежимВыбора") И Параметры.РежимВыбора)
			 И НЕ Параметры.Свойство("ВыборГруппПользователей")
			 И НЕ Параметры.Свойство("РасширенныйПодбор") Тогда
			
			// Данная форма подбора не поддерживает подбор групп (ВыборГруппПользователей),
			// поэтому в этом случае используем стандартную форму.
			
			СтандартнаяОбработка = Ложь;
			
			ВыбраннаяФорма = "ОбщаяФорма.ПодборПользователейСУО";	
			
		КонецЕсли;
			
	КонецЕсли;
		
КонецПроцедуры

// Запись информации о руководителях подразделений, организаций и сотрудников.

Процедура ЗаписатьДанныеОРуководителяхОбъектаСУОПриЗаписи(Источник, Отказ) Экспорт
	
	// Делаем проверки
	
	Если Источник.ОбменДанными.Загрузка Тогда
		
		// Примечание: при загрузке данных порядок записи элементов может быть произвольным,
		// Поэтому нет смысла записывать данные о руководителях, так как они могут оказаться неверными.
		
		Возврат;
		
	КонецЕсли;
	
	// Записываем данные о руководителях самого объекта
	
	УправлениеОбучениемСУО.ЗаписатьДанныеОРуководителяхЭлементаСтруктурыПредприятия(Источник, Отказ);

	// Если это учебная группа, то записываем руководителей участников этой группы
	
	Если ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.УчебныеГруппыСУО") Тогда
		
		Для каждого УчастникГруппы Из Источник.Состав Цикл
			УправлениеОбучениемСУО.ЗаписатьДанныеОРуководителяхСотрудника(УчастникГруппы.Пользователь);
		КонецЦикла;
		
	КонецЕсли;
	
	// Если это организация, то записываем данные о руководителях подразделений организации (подчиненная сущьность).
	
	Если ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.Организации") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПодразделенияОрганизацииСУО.Ссылка
			|ИЗ
			|	Справочник.ПодразделенияОрганизацииСУО КАК ПодразделенияОрганизацииСУО
			|ГДЕ
			|	ПодразделенияОрганизацииСУО.Владелец = &Организация";

		Запрос.УстановитьПараметр("Организация", Источник.Ссылка);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			УправлениеОбучениемСУО.ЗаписатьДанныеОРуководителяхЭлементаСтруктурыПредприятия(ВыборкаДетальныеЗаписи.Ссылка, Отказ);
		КонецЦикла;

	КонецЕсли;
	
	// Записываем данные о руководителях сотрудников
	
	Если ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.Организации") Тогда
		ИмяИсточника = "Организация";
	КонецЕсли;
	
	Если ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.ПодразделенияОрганизацииСУО") Тогда
    	ИмяИсточника = "ПодразделениеОрганизации";
	КонецЕсли;
	
	Если ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.ПодразделенияПредприятияСУО") Тогда
		ИмяИсточника = "ПодразделениеПредприятия";
	КонецЕсли;
	
	Если ИмяИсточника <> Неопределено Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СотрудникиСУОСрезПоследних.Пользователь,
			|	СотрудникиСУОСрезПоследних.Организация,
			|	СотрудникиСУОСрезПоследних.ПодразделениеОрганизации,
			|	СотрудникиСУОСрезПоследних.ПодразделениеПредприятия
			|ИЗ
			|	РегистрСведений.СотрудникиСУО.СрезПоследних(,) КАК СотрудникиСУОСрезПоследних
			|
			|ГДЕ СотрудникиСУОСрезПоследних.Уволен = ЛОЖЬ
			| И СотрудникиСУОСрезПоследних."+ИмяИсточника+" = &Источник";

		Запрос.УстановитьПараметр("Источник", Источник.Ссылка);

		Результат = Запрос.Выполнить();

		ВыборкаСотрудников = Результат.Выбрать();
		МассивСотрудников  = Результат.Выгрузить().ВыгрузитьКолонку("Пользователь");

		Для каждого Сотрудник Из МассивСотрудников Цикл
			УправлениеОбучениемСУО.ЗаписатьДанныеОРуководителяхСотрудника(Сотрудник, ВыборкаСотрудников);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Присоединенные файлы

Процедура ПрисоединенныйФайлПриЗаписиСУОПриЗаписи(Источник, Отказ) Экспорт
	
	РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(Источник.ВладелецФайла);
	
КонецПроцедуры












