#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗафиксироватьПросмотр(Знач Пользователь=Неопределено, Знач ДатаПросмотра=Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если ДатаПросмотра = Неопределено Тогда
		ДатаПросмотра = ТекущаяДатаСеанса();
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ПросмотрыЛентыНовостейПользователямиСУО.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Отбор.Период.Установить(ДатаПросмотра);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	
	НоваяЗапись.Период = ДатаПросмотра;
	НоваяЗапись.Пользователь = Пользователь;
	
	НаборЗаписей.Записать();	
	
КонецПроцедуры

Функция ДатаПоследнегоПросмотра(Пользователь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПросмотрыЛентыНовостейПользователямиСУОСрезПоследних.Период КАК ДатаПросмотра
		|ИЗ
		|	РегистрСведений.ПросмотрыЛентыНовостейПользователямиСУО.СрезПоследних(, Пользователь = &Пользователь) КАК ПросмотрыЛентыНовостейПользователямиСУОСрезПоследних";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.ДатаПросмотра;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецЕсли