
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Если ТипЗнч(Объект.СсылкаНаЭлемент) = Тип("СправочникСсылка.РесурсыСУЗ") Тогда
		
		Элементы.СтраницаНастройкиРесурса.Видимость = Истина;
		
		Если Объект.СсылкаНаЭлемент.SCO Тогда
			Элементы.АктивныйРесурс.Видимость = Истина;
		Иначе
			Элементы.АктивныйРесурс.Видимость = Ложь;	
		КонецЕсли;
		
	Иначе
		
		Элементы.СтраницаНастройкиРесурса.Видимость = Ложь;
		Элементы.АктивныйРесурс.Видимость = Ложь;
		
	КонецЕсли;

	Элементы.Наименование.ТолькоПросмотр = НЕ Объект.РазрешитьРедактироватьНаименование;
	
	// Определяем тип объекта
	
	ТипОбъекта = ОбъектыСУЗ.ПолучитьТипОбъектаСУЗ(Объект.СсылкаНаЭлемент);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьДоступностьЭлементовФормы();
	
	//////////////////////////////////////////////////////////////////
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Объект);
	РазработкаСУЗ.УстановитьДоступностьДанныхОтПоставщика(ЭтотОбъект);
	//////////////////////////////////////////////////////////////////
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура УстановитьАвтоНаименование(Команда=Неопределено)
	
	Если ЗначениеЗаполнено(Объект.СсылкаНаЭлемент) Тогда
		Объект.Наименование = Строка(Объект.СсылкаНаЭлемент);
	Иначе
		Объект.Наименование = "";
	КонецЕсли;
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура СсылкаНаЭлементПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда 
		УстановитьАвтоНаименование();
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормы();
	
	// Примечание: вызов серверной процедуры оправдан,
	// Так как здесь необходимо управлять видимостью
	// Закладок, что приведет в любом случае к перерисовке формы
	// На сервере.
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактироватьНаименованиеПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ <Наименование>
