
Функция ПолучитьРезультатыОбучения(ЗапросHTTP)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем параметры запроса
	
	КлючЗапроса = СокрЛП(Строка(ЗапросHTTP.ПараметрыЗапроса.Получить("key")));
	
	Если НЕ ЗначениеЗаполнено(КлючЗапроса) Тогда
		Ответ = Новый HTTPСервисОтвет(400);
		Возврат Ответ;								
	КонецЕсли;		
	
	ДатаПредыдущегоЗапроса = ЗапросHTTP.ПараметрыЗапроса.Получить("previousRequestDate");
	
	Попытка
		ДатаПредыдущегоЗапроса = XMLЗначение(Тип("Дата"), ДатаПредыдущегоЗапроса);
	Исключение
		ДатаПредыдущегоЗапроса = Дата("00010101");
	КонецПопытки;
	
	// Проверяем ключ
	
	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA1);
	Хеширование.Добавить(КлючЗапроса);		
	ХэшКлюча = Base64Строка(Хеширование.ХешСумма);
	ХэшКлючаВБазе = Константы.ХэшКлючаВыгрузкиРезультатовОбученияСУО.Получить();
	
	Если ХэшКлючаВБазе <> ХэшКлюча Тогда
		Ответ = Новый HTTPСервисОтвет(403);
		Возврат Ответ;												
	КонецЕсли;
	
	// Возвращаем ответ, если это запрос для тестирования
	
	ВариантЗапроса = СокрЛП(Строка(ЗапросHTTP.ПараметрыЗапроса.Получить("mode")));
	Если ВариантЗапроса = "test" Тогда
		Ответ = Новый HTTPСервисОтвет(200);
		Возврат Ответ;		
	КонецЕсли;
	
	// Получаем задания, с активностью после указанной даты	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПопыткиПрохожденияЗаданийСУО.ПрохождениеОбучения,
		|	ПопыткиПрохожденияЗаданийСУО.Задание,
		|	ПопыткиПрохожденияЗаданийСУО.Баллы,
		|	ПопыткиПрохожденияЗаданийСУО.ДатаПоследнейАктивности,
		|	ПопыткиПрохожденияЗаданийСУО.Период,
		|	ПопыткиПрохожденияЗаданийСУО.ПроведениеОбучения
		|ИЗ
		|	РегистрСведений.ПопыткиПрохожденияЗаданийСУО КАК ПопыткиПрохожденияЗаданийСУО
		|ГДЕ
		|	&ОтборПоДатеАктивности
		|	И ПопыткиПрохожденияЗаданийСУО.Выполнено = ИСТИНА";
	
	Если ЗначениеЗаполнено(ДатаПредыдущегоЗапроса) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоДатеАктивности", "ПопыткиПрохожденияЗаданийСУО.ДатаПоследнейАктивности > &ПоследняяДатаВыгрузки");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоДатеАктивности", "ПопыткиПрохожденияЗаданийСУО.ДатаПоследнейАктивности >= &ПоследняяДатаВыгрузки");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПоследняяДатаВыгрузки", ДатаПредыдущегоЗапроса);
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаПрохожденийЗаданий = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	// Получаем прохождения обучения, с активностью после указанной даты	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрохожденияОбученияСУО.ПроведениеОбучения,
		|	ПрохожденияОбученияСУО.Пользователь,
		|	ПрохожденияОбученияСУО.Сценарий,
		|	ПрохожденияОбученияСУО.Баллы,
		|	ПрохожденияОбученияСУО.ПроведениеОбучения.Дисциплина КАК Дисциплина,
		|	ПрохожденияОбученияСУО.ДатаПоследнейАктивности,
		|	ПрохожденияОбученияСУО.Сценарий.Наименование КАК НаименованиеОбучения,
		|	ПрохожденияОбученияСУО.Регистратор КАК ПрохождениеОбучения,
		|	ПрохожденияОбученияСУО.ДатаНачалаПрохождения,
		|	ПрохожденияОбученияСУО.СтатусПроцессаОбучения,
		|	ПрохожденияОбученияСУО.Пользователь.Наименование КАК ПолноеИмяПользователя,
		|	ПрохожденияОбученияСУО.Пользователь.Код КАК КодПользователя,
		|	ПрохожденияОбученияСУО.ПроведениеОбучения.ГруппаСлушателей КАК ГруппаСлушателей,
		|	ПрохожденияОбученияСУО.ПроведениеОбучения.ПрограммаОбучения КАК ПрограммаОбучения
		|ИЗ
		|	РегистрСведений.ПрохожденияОбученияСУО КАК ПрохожденияОбученияСУО
		|ГДЕ
		|	&ОтборПоДатеАктивности
		|	И ПрохожденияОбученияСУО.СтатусПроцессаОбучения <> &СтатусПроцессаОбученияНовое
		|	И ПрохожденияОбученияСУО.СтатусПроцессаОбучения <> &СтатусПроцессаОбученияНеДопущен
		|	И ПрохожденияОбученияСУО.СтатусПроцессаОбучения <> &СтатусПроцессаОбученияЗапланировано";
			
	Если ЗначениеЗаполнено(ДатаПредыдущегоЗапроса) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоДатеАктивности", "ПрохожденияОбученияСУО.ДатаПоследнейАктивности > &ПоследняяДатаВыгрузки");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоДатеАктивности", "ПрохожденияОбученияСУО.ДатаПоследнейАктивности >= &ПоследняяДатаВыгрузки");
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("ПоследняяДатаВыгрузки", ДатаПредыдущегоЗапроса);
	Запрос.УстановитьПараметр("СтатусПроцессаОбученияНовое", Перечисления.СтатусыПроцессаОбученияСУО.Новое);
	Запрос.УстановитьПараметр("СтатусПроцессаОбученияНеДопущен", Перечисления.СтатусыПроцессаОбученияСУО.НеДопущен);
	Запрос.УстановитьПараметр("СтатусПроцессаОбученияЗапланировано", Перечисления.СтатусыПроцессаОбученияСУО.Запланировано);
	
	УстановитьПривилегированныйРежим(Истина);	
	ТаблицаПрохожденийОбучения = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	// Получаем задания всех проведений обучения
	
	ВсеПроведенияОбучения = ТаблицаПрохожденийОбучения.ВыгрузитьКолонку("ПроведениеОбучения");
	ОбщегоНазначенияКлиентСервер.СвернутьМассив(ВсеПроведенияОбучения);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроведениеОбученияСУОЭлектронныеЗадания.Задание,
		|	ПроведениеОбученияСУОЭлектронныеЗадания.Ссылка КАК ПроведениеОбучения,
		|	ПроведениеОбученияСУОЭлектронныеЗадания.Задание.Наименование КАК Наименование
		|ИЗ
		|	Документ.ПроведениеОбученияСУО.ЭлектронныеЗадания КАК ПроведениеОбученияСУОЭлектронныеЗадания
		|ГДЕ
		|	ПроведениеОбученияСУОЭлектронныеЗадания.Ссылка В(&ВсеПроведенияОбучения)";
	
	Запрос.УстановитьПараметр("ВсеПроведенияОбучения", ВсеПроведенияОбучения);
	
	УстановитьПривилегированныйРежим(Истина);	
	ТаблицаЗаданий = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);	

	// Формируем итоговую таблицу
	
	ТаблицаПрохожденийОбучения.Колонки.Добавить("ОценкаПятибалльная");
	ТаблицаПрохожденийОбучения.Колонки.Добавить("Задания");
	ТаблицаПрохожденийОбучения.Колонки.Добавить("УдалитьИзВыдачи");
	Для каждого СтрокаПрохождения Из ТаблицаПрохожденийОбучения Цикл
		
		// Заполняем оценку в пятибалльной шкале
		
		СтрокаПрохождения.ОценкаПятибалльная = Справочники.ШкалыОценокСУО.БаллыВПятибалльнуюОценкуЧислом(СтрокаПрохождения.Баллы);		
		
		// Заполням таблицу заданий
		
		ЗаданияТекущегоПроведения = ТаблицаЗаданий.НайтиСтроки(Новый Структура("ПроведениеОбучения", СтрокаПрохождения.ПроведениеОбучения));
		
		Если ЗаданияТекущегоПроведения.Количество() > 0 Тогда
			СтрокаПрохождения.Задания = Новый Массив;						
			Для каждого СтрокаЗадания Из ЗаданияТекущегоПроведения Цикл
				
				СтрокиПрохожденияЗаданий = ТаблицаПрохожденийЗаданий.НайтиСтроки(Новый Структура("Задание, ПрохождениеОбучения", СтрокаЗадания.Задание, СтрокаПрохождения.ПрохождениеОбучения));
				Если СтрокиПрохожденияЗаданий.Количество() = 0 Тогда
					Продолжить;					
				КонецЕсли;
				
				СтрокаПрохожденияЗадания = СтрокиПрохожденияЗаданий[0];
				
				Если ТипЗнч(СтрокаПрохожденияЗадания.Задание) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
					ТестЭР = Справочники.СводыЗнанийСУЗ.Тест(СтрокаПрохожденияЗадания.Задание);
					Если ЗначениеЗаполнено(ТестЭР) Тогда
						НазначениеТеста = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТестЭР, "НазначениеТестирования");
						Если НазначениеТеста = Перечисления.НазначенияТестированийСУЗ.Анкетирование Тогда
							Продолжить;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;				
				
				СтруктураПрохожденияЗадания = Новый Структура("Задание, Баллы, ДатаПоследнейАктивности, ОценкаПятибалльная, Наименование, ДатаНачалаПрохождения");
				СтруктураПрохожденияЗадания.Задание = СтрокаПрохожденияЗадания.Задание;
				СтруктураПрохожденияЗадания.Баллы = СтрокаПрохожденияЗадания.Баллы;
				СтруктураПрохожденияЗадания.ДатаПоследнейАктивности = СтрокаПрохожденияЗадания.ДатаПоследнейАктивности;
				СтруктураПрохожденияЗадания.ОценкаПятибалльная = Справочники.ШкалыОценокСУО.БаллыВПятибалльнуюОценкуЧислом(СтруктураПрохожденияЗадания.Баллы);
				СтруктураПрохожденияЗадания.Наименование = СтрокаЗадания.Наименование;
				СтруктураПрохожденияЗадания.ДатаНачалаПрохождения = СтрокаПрохожденияЗадания.Период;
				СтрокаПрохождения.Задания.Добавить(СтруктураПрохожденияЗадания);
				
			КонецЦикла;
			Если СтрокаПрохождения.Задания.Количество() = 0 Тогда
				СтрокаПрохождения.УдалитьИзВыдачи = Истина;
			КонецЕсли;
		Иначе
			Если СтрокаПрохождения.СтатусПроцессаОбучения <> Перечисления.СтатусыПроцессаОбученияСУО.Окончено
				И СтрокаПрохождения.СтатусПроцессаОбучения <> Перечисления.СтатусыПроцессаОбученияСУО.ОконченоАвтоматом Тогда
				СтрокаПрохождения.УдалитьИзВыдачи = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаПрохождения.ДатаНачалаПрохождения) Тогда
			СтрокаПрохождения.УдалитьИзВыдачи = Истина;
		КонецЕсли;
		
	КонецЦикла;	
	
	// Удаляем лишние строки итоговой таблицы
	
	Сч = ТаблицаПрохожденийОбучения.Количество();

	Пока Сч > 0 Цикл
		
		Строка = ТаблицаПрохожденийОбучения.Получить(Сч - 1);

		Если Строка.УдалитьИзВыдачи = Истина Тогда		
			ТаблицаПрохожденийОбучения.Удалить(Строка);			
		КонецЕсли;		
		
		Сч = Сч - 1;
		
	КонецЦикла;
	
	ТаблицаПрохожденийОбучения.Колонки.Удалить("УдалитьИзВыдачи");
	
	// Возвращаем результат
	
	ТаблицаJSON = ОбщегоНазначенияСУ.ДанныеВJSON(ТаблицаПрохожденийОбучения);	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(ТаблицаJSON);
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьУведомленияGET(ЗапросHTTP)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем параметры запроса
	
	КлючЗапроса = СокрЛП(Строка(ЗапросHTTP.ПараметрыЗапроса.Получить("key")));
	
	Если НЕ ЗначениеЗаполнено(КлючЗапроса) Тогда
		Ответ = Новый HTTPСервисОтвет(400);
		Возврат Ответ;								
	КонецЕсли;		
	
	// Проверяем ключ
	
	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA1);
	Хеширование.Добавить(КлючЗапроса);		
	ХэшКлюча = Base64Строка(Хеширование.ХешСумма);
	ХэшКлючаВБазе = Константы.ХэшКлючаВыгрузкиРезультатовОбученияСУО.Получить();
	
	Если ХэшКлючаВБазе <> ХэшКлюча Тогда
		Ответ = Новый HTTPСервисОтвет(403);
		Возврат Ответ;												
	КонецЕсли;
	
	// Получаем переменные
	//
	
	ИдентификаторПользователяСтрока = ЗапросHTTP.ПараметрыURL.Получить("ИдентификаторПользователя");
	Пользователь = Неопределено;
	
	Попытка
		Пользователь = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторПользователяСтрока));
	Исключение		
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Ответ = Новый HTTPСервисОтвет(400);
		Возврат Ответ;
	КонецЕсли;	
	
	// Формируем ответ
	
	ОтветСтруктура = Новый Структура();
	ОтветСтруктура.Вставить("КоличествоНовыхОбучений", Документы.ПрохождениеОбученияСУО.КоличествоНовыхОбучений(Пользователь));
	ОтветСтруктура.Вставить("АдресВебКабинета", Справочники.ПубликацииВебКабинетаСУ.АдресВебКабинета());
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(ОбщегоНазначенияСУ.ДанныеВJSON(ОтветСтруктура));
	
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	
	Возврат Ответ;	
	
КонецФункции


