
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	/////////////////////////////////////////////////////////////////////////////////
	// Делаем проверки
	
	Если НЕ ЗначениеЗаполнено(Параметры.ПутьКФайлуПакета) Тогда
		Текст = НСтр("ru = 'Путь к файлу пакета данных не передан!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	// Импортируем
	
	ОписаниеИмпорта = Новый Структура;
	ОшибкаИмпорта   = Ложь;	
	
	ПланыОбмена.ОбменМатериаламиСУЗ.ВыполнитьИмпортПакетаДанныхXML(Параметры.ПутьКФайлуПакета, Параметры.СтарыеПакеты, ОписаниеИмпорта, ОшибкаИмпорта);
	
	Код          = ОписаниеИмпорта.Код;
	Наименование = ОписаниеИмпорта.Наименование;
	Результат    = ОписаниеИмпорта.Результат;
	
	Если НЕ ОшибкаИмпорта Тогда
		ИмпортВыполнен = Истина; // Используется в условном оформлении
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Оповестить("ЭлектронныйРесурсЗаписан");
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ <Наименование>
