#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СвойстваСтудентаСтруктура(Пользователь) Экспорт
	
	МассивСвойств = Новый Массив;
	МассивСвойств.Добавить("Курс");	
	МассивСвойств.Добавить("УчебнаяГруппа");
	МассивСвойств.Добавить("Статус");
	МассивСвойств.Добавить("Специализация");
	МассивСвойств.Добавить("Специальность");
	МассивСвойств.Добавить("ФормаОбучения");
	МассивСвойств.Добавить("Отделение");
	
	МассивНаименований = Новый Массив;
	МассивНаименований.Добавить("Курс");	
	МассивНаименований.Добавить("Учебная группа");
	МассивНаименований.Добавить("Статус");
	МассивНаименований.Добавить("Специализация");
	МассивНаименований.Добавить("Специальность");
	МассивНаименований.Добавить("Форма обучения");
	МассивНаименований.Добавить("Отделение");
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтудентыООСрезПоследних.Курс  КАК Курс,
		|	СтудентыООСрезПоследних.УчебнаяГруппа  КАК УчебнаяГруппа,
		|	СтудентыООСрезПоследних.Статус  КАК Статус,
		|	СтудентыООСрезПоследних.Специализация  КАК Специализация,
		|	СтудентыООСрезПоследних.Специальность  КАК Специальность,
		|	СтудентыООСрезПоследних.ФормаОбучения  КАК ФормаОбучения,
		|	СтудентыООСрезПоследних.Отделение  КАК Отделение,
		|	СтудентыООСрезПоследних.Курс.Наименование  КАК КурсНаименование,
		|	СтудентыООСрезПоследних.УчебнаяГруппа.Наименование  КАК УчебнаяГруппаНаименование,
		|	СтудентыООСрезПоследних.Статус.Наименование  КАК СтатусНаименование,
		|	СтудентыООСрезПоследних.Специализация.Наименование  КАК СпециализацияНаименование,
		|	СтудентыООСрезПоследних.Специальность.Наименование  КАК СпециальностьНаименование,
		|	СтудентыООСрезПоследних.ФормаОбучения.Наименование КАК ФормаОбученияНаименование,
		|	СтудентыООСрезПоследних.Отделение.Наименование КАК ОтделениеНаименование,
		|	СтудентыООСрезПоследних.Период
		|ИЗ
		|	РегистрСведений.СтудентыОО.СрезПоследних КАК СтудентыООСрезПоследних
		|ГДЕ
		|	СтудентыООСрезПоследних.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
 	ВыборкаДетальныеЗаписи.Следующий();
	
	СвойстваСтудента = Новый Структура;
	СвойстваСтудента.Вставить("Период", ВыборкаДетальныеЗаписи.Период);
	СвойстваСтудента.Вставить("Свойства", Новый Массив());
	
	Индекс = 0;
	Для каждого ИмяСвойстваСтудента Из МассивСвойств Цикл
		
		СвойствоСтудента = Новый Структура();		
		СвойствоСтудента.Вставить("Идентификатор", ВыборкаДетальныеЗаписи[ИмяСвойстваСтудента]);
		СвойствоСтудента.Вставить("Значение", ВыборкаДетальныеЗаписи[ИмяСвойстваСтудента + "Наименование"]);
		СвойствоСтудента.Вставить("ИмяСвойства", ИмяСвойстваСтудента);
		СвойствоСтудента.Вставить("Заголовок", МассивНаименований[Индекс]);
		
		СвойстваСтудента.Свойства.Добавить(СвойствоСтудента);	
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	Возврат СвойстваСтудента; 
	
КонецФункции

Процедура РазместитьНаФормеДанныеОСтуденте(Форма, Пользователь, ИмяГруппыЭлементов) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьСтудентовСУО") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ПравоДоступа("Просмотр", Метаданные.РегистрыСведений.СтудентыОО) Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтудентыООСрезПоследних.Курс,
		|	СтудентыООСрезПоследних.УчебнаяГруппа,
		|	СтудентыООСрезПоследних.Статус,
		|	СтудентыООСрезПоследних.Специализация,
		|	СтудентыООСрезПоследних.Специальность,
		|	СтудентыООСрезПоследних.ФормаОбучения,
		|	СтудентыООСрезПоследних.Отделение
		|ИЗ
		|	РегистрСведений.СтудентыОО.СрезПоследних(, ) КАК СтудентыООСрезПоследних
		|ГДЕ
		|	СтудентыООСрезПоследних.Пользователь = &Пользователь";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
		
	// Добавляем реквизиты формы
	
	ДобавляемыеРеквизиты = Новый Массив();
	
	НовыйРеквизит = Новый РеквизитФормы("Курс",
								   Новый ОписаниеТипов("СправочникСсылка.КурсыОО"),
								   "",
								   НСтр("ru = 'Курс'"),
								   Ложь);
								   
	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	
	НовыйРеквизит = Новый РеквизитФормы("УчебнаяГруппа",
								   Новый ОписаниеТипов("СправочникСсылка.УчебныеГруппыОО"),
								   "",
								   НСтр("ru = 'Учебная группа'"),
								   Ложь);
								   
	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	
	НовыйРеквизит = Новый РеквизитФормы("Статус",
								   Новый ОписаниеТипов("СправочникСсылка.СтатусыСтудентовОО"),
								   "",
								   НСтр("ru = 'Статус'"),
								   Ложь);
								   
	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	
	НовыйРеквизит = Новый РеквизитФормы("Специализация",
								   Новый ОписаниеТипов("СправочникСсылка.СпециализацииОО"),
								   "",
								   НСтр("ru = 'Специализация'"),
								   Ложь);
								   
	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы("Специальность",
								   Новый ОписаниеТипов("СправочникСсылка.СпециальностиОО"),
								   "",
								   НСтр("ru = 'Специальность'"),
								   Ложь);
								   
	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы("ФормаОбучения",
								   Новый ОписаниеТипов("СправочникСсылка.ФормыОбученияОО"),
								   "",
								   НСтр("ru = 'Форма обучения'"),
								   Ложь);
								   
	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы("Отделение",
								   Новый ОписаниеТипов("СправочникСсылка.ОтделенияОО"),
								   "",
								   НСтр("ru = 'Отделение'"),
								   Ложь);
								   
	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

	
	// Устанавливаем значение реквизитов
	
	Форма["Курс"]          = ВыборкаДетальныеЗаписи.Курс;
	Форма["УчебнаяГруппа"] = ВыборкаДетальныеЗаписи.УчебнаяГруппа;
	Форма["Статус"]        = ВыборкаДетальныеЗаписи.Статус;
	Форма["Специализация"] = ВыборкаДетальныеЗаписи.Специализация;
	Форма["Специальность"] = ВыборкаДетальныеЗаписи.Специальность;
	Форма["ФормаОбучения"] = ВыборкаДетальныеЗаписи.ФормаОбучения;
	Форма["Отделение"]     = ВыборкаДетальныеЗаписи.Отделение;
	
	// Добавляем элементы формы
	
	ЭлементФормы = Форма.Элементы.Добавить("Курс",
									 Тип("ПолеФормы"),
									 Форма.Элементы[ИмяГруппыЭлементов]); 	
					  
	ЭлементФормы.Вид            = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.Заголовок      = НСтр("ru = 'Курс'");
	ЭлементФормы.ПутьКДанным    = "Курс";
	ЭлементФормы.КнопкаОткрытия = Истина;
	ЭлементФормы.ТолькоПросмотр = Истина;
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	
	ЭлементФормы = Форма.Элементы.Добавить("УчебнаяГруппа",
									 Тип("ПолеФормы"),
									 Форма.Элементы[ИмяГруппыЭлементов]); 	
					  
	ЭлементФормы.Вид            = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.Заголовок      = НСтр("ru = 'Учебная группа'");
	ЭлементФормы.ПутьКДанным    = "УчебнаяГруппа";
	ЭлементФормы.КнопкаОткрытия = Истина;
	ЭлементФормы.ТолькоПросмотр = Истина;
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	
	ЭлементФормы = Форма.Элементы.Добавить("Статус",
									 Тип("ПолеФормы"),
									 Форма.Элементы[ИмяГруппыЭлементов]); 	
					  
	ЭлементФормы.Вид            = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.Заголовок      = НСтр("ru = 'Статус'");
	ЭлементФормы.ПутьКДанным    = "Статус";
	ЭлементФормы.КнопкаОткрытия = Истина;
	ЭлементФормы.ТолькоПросмотр = Истина;
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	
	ЭлементФормы = Форма.Элементы.Добавить("Специализация",
									 Тип("ПолеФормы"),
									 Форма.Элементы[ИмяГруппыЭлементов]); 	
					  
	ЭлементФормы.Вид            = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.Заголовок      = НСтр("ru = 'Специализация'");
	ЭлементФормы.ПутьКДанным    = "Специализация";
	ЭлементФормы.КнопкаОткрытия = Истина;
	ЭлементФормы.ТолькоПросмотр = Истина;
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	
	ЭлементФормы = Форма.Элементы.Добавить("Специальность",
									 Тип("ПолеФормы"),
									 Форма.Элементы[ИмяГруппыЭлементов]); 	
					  
	ЭлементФормы.Вид            = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.Заголовок      = НСтр("ru = 'Специальность'");
	ЭлементФормы.ПутьКДанным    = "Специальность";
	ЭлементФормы.КнопкаОткрытия = Истина;
	ЭлементФормы.ТолькоПросмотр = Истина;
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	
	ЭлементФормы = Форма.Элементы.Добавить("ФормаОбучения",
									 Тип("ПолеФормы"),
									 Форма.Элементы[ИмяГруппыЭлементов]); 	
					  
	ЭлементФормы.Вид            = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.Заголовок      = НСтр("ru = 'Форма обучения'");
	ЭлементФормы.ПутьКДанным    = "ФормаОбучения";
	ЭлементФормы.КнопкаОткрытия = Истина;
	ЭлементФормы.ТолькоПросмотр = Истина;
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	
	ЭлементФормы = Форма.Элементы.Добавить("Отделение",
									 Тип("ПолеФормы"),
									 Форма.Элементы[ИмяГруппыЭлементов]); 	
					  
	ЭлементФормы.Вид            = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.Заголовок      = НСтр("ru = 'Отделение'");
	ЭлементФормы.ПутьКДанным    = "Отделение";
	ЭлементФормы.КнопкаОткрытия = Истина;
	ЭлементФормы.ТолькоПросмотр = Истина;
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;

	
КонецПроцедуры

Процедура ОбновитьДанныеВебКабинета(Отбор) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Отбор.Найти("Пользователь") <> Неопределено Тогда
		
		Пользователь = Отбор.Пользователь.Значение;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПрохождениеОбученияСУО.Ссылка КАК ПрохождениеОбучения
			|ИЗ
			|	Документ.ПрохождениеОбученияСУО КАК ПрохождениеОбученияСУО
			|ГДЕ
			|	ПрохождениеОбученияСУО.Пользователь = &Пользователь
			|	И ПрохождениеОбученияСУО.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("Пользователь", Пользователь);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ИмяТаблицы = ОбщегоНазначения.ИмяТаблицыПоСсылке(Документы.ПрохождениеОбученияСУО.ПустаяСсылка());
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ПараметрыФЗ = Новый Массив;
			ПараметрыФЗ.Добавить(ВыборкаДетальныеЗаписи.ПрохождениеОбучения);
			ПараметрыФЗ.Добавить(Неопределено);			
			
			ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных(ИмяТаблицы, "ВебКабинетСУ.ОбновитьДанныеОбъекта", ПараметрыФЗ, Строка(ВыборкаДетальныеЗаписи.ПрохождениеОбучения.УникальныйИдентификатор()), 1);

			ПараметрыФЗ = Новый Массив;
			ПараметрыФЗ.Добавить(Пользователь);
			ПараметрыФЗ.Добавить(Неопределено);		
		
			ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных("Справочник.Пользователи", "ВебКабинетСУО.ОбновитьДанныеПользователяВебКабинета", ПараметрыФЗ, Строка(Пользователь.УникальныйИдентификатор()), 1);
			
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ВсеСтуденты() Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтудентыООСрезПоследних.Пользователь
		|ИЗ
		|	РегистрСведений.СтудентыОО.СрезПоследних КАК СтудентыООСрезПоследних";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
	
КонецФункции

#КонецОбласти

#КонецЕсли
