
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьЭлементовФормы();	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УстановитьВидимостьЭлементовФормы();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьВидимостьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновленыВидыОбучения",,ЭтотОбъект);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ВыставляетсяОценкаПриИзменении(Элемент)
	Если НЕ Объект.ВыставляетсяОценка Тогда
		Объект.ШкалаОценки = Неопределено;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	РасширеннаяФункциональность = ПолучитьФункциональнуюОпцию("РасширеннаяФункциональностьСУО"); 
		
	Если ЗначениеЗаполнено(Объект.ИмяПредопределенныхДанных) Тогда
		Элементы.Общее.ТолькоПросмотр = Истина;
		Элементы.Электронное.ТолькоПросмотр = Истина;			
	КонецЕсли;
	
	Элементы.ДекорацияПредопределенное.Видимость = ЗначениеЗаполнено(Объект.ИмяПредопределенныхДанных);
	Элементы.Общее.Видимость = РасширеннаяФункциональность ИЛИ Объект.Общее;
	
	Если (НЕ ЗначениеЗаполнено(Объект.ШкалаОценки) ИЛИ Объект.ШкалаОценки = Справочники.ШкалыОценокСУО.Двухбалльная)
		И ПолучитьФункциональнуюОпцию("ИспользоватьСлушателейСУО") Тогда		
		Элементы.ШкалаОценки.Видимость = Ложь;		
	Иначе
		Элементы.ШкалаОценки.Видимость = Истина;		
	КонецЕсли;
	
	Элементы.ВремяИзученияЭлектронныхКурсов.Видимость = ВебКабинетСУ.Используется()
		И ВебКабинетСУ.Редакция() = Перечисления.РедакцииВебКабинетаСУ.Редакция30;
	
КонецПроцедуры


#КонецОбласти

