Функция ВыбратьЭлементыРасписания(НачалоПериода, КонецПериода, Статусы=Неопределено) Экспорт
	
	Запрос = Новый Запрос();

	Запрос.Параметры.Вставить("НачалоПериода", НачалоПериода);
	Запрос.Параметры.Вставить("КонецПериода", КонецПериода);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасписаниеОбученияОбщееСУО.Мероприятие.Наименование КАК НаименованиеМероприятия,
	               |	РасписаниеОбученияОбщееСУО.ДатаНачалаПроведения,
	               |	РасписаниеОбученияОбщееСУО.ДатаОкончанияПроведения,
	               |	РасписаниеОбученияОбщееСУО.Регистратор КАК ПроведениеОбучения,
	               |	РасписаниеОбученияОбщееСУО.Статус,
	               |	РасписаниеОбученияОбщееСУО.ЦветНаКалендаре
	               |ИЗ
	               |	РегистрСведений.РасписаниеОбученияОбщееСУО КАК РасписаниеОбученияОбщееСУО
	               |ГДЕ
	               |	РасписаниеОбученияОбщееСУО.ДатаНачалаПроведения МЕЖДУ &НачалоПериода И &КонецПериода
	               |			ИЛИ РасписаниеОбученияОбщееСУО.ДатаОкончанияПроведения МЕЖДУ &НачалоПериода И &КонецПериода
	               |			ИЛИ (РасписаниеОбученияОбщееСУО.ДатаНачалаПроведения < &НачалоПериода
	               |				И РасписаниеОбученияОбщееСУО.ДатаОкончанияПроведения > &КонецПериода)";
				   
	Если Статусы <> Неопределено Тогда
		
		Запрос.Текст = Запрос.Текст + "
	               |	И РасписаниеОбученияОбщееСУО.Статус В(&Статусы)";
				   
		Запрос.Параметры.Вставить("Статусы", Статусы);

	КонецЕсли;
				   
	Результат = Запрос.Выполнить();

	Возврат Результат.Выбрать();
	
КонецФункции
