#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция КорневаяСессияПрохожденияЭлектронногоКурса(Знач Пользователь, Знач ПрохождениеОбучения, Знач ЭлектронныйРесурс, Знач Задание, Знач ТипСессии = Неопределено) Экспорт
	
	// Примечание: не следует искать корневую сессию по таблицам движений,
	// так как при отмене обучения движения будут удалены и есть риск
	// создать дубль сессии изучения курса, если они не успеют восстановиться.
	
	Если ЗначениеЗаполнено(ПрохождениеОбучения)
		И НЕ ЗначениеЗаполнено(Задание) Тогда
		
		ВызватьИсключение НСтр("ru = 'Задание прохождения обучения не задано'");
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
		ПрохождениеОбучения = Метаданные.ОпределяемыеТипы.ПрохождениеЭлектронногоОбучения.Тип.ПривестиЗначение(ПрохождениеОбучения);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Задание) Тогда
		Задание = Метаданные.ОпределяемыеТипы.ЗаданиеЭлектронногоОбучения.Тип.ПривестиЗначение(Задание);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СессияЭлектронногоРесурсаСУЗ.Ссылка КАК Сессия,
		|	СессияЭлектронногоРесурсаСУЗ.Дата КАК Дата
		|ИЗ
		|	Документ.СессияЭлектронногоРесурсаСУЗ КАК СессияЭлектронногоРесурсаСУЗ
		|ГДЕ
		|	СессияЭлектронногоРесурсаСУЗ.ЭлектронныйРесурс = &ЭлектронныйРесурс
		|	И СессияЭлектронногоРесурсаСУЗ.Пользователь = &Пользователь
		|	И &ОтборТипСессииCourse
		|	И &ОтборПрохожденияОбучения
		|	И &ОтборЗадания
		|	
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	СессияЭлектронногоРесурсаСУЗ.Ссылка,
		|	СессияЭлектронногоРесурсаСУЗ.Дата
		|ИЗ
		|	Документ.СессияЭлектронногоРесурсаСУЗ КАК СессияЭлектронногоРесурсаСУЗ
		|ГДЕ
		|	СессияЭлектронногоРесурсаСУЗ.ЭлектронныйРесурс = &ЭлектронныйРесурс
		|	И СессияЭлектронногоРесурсаСУЗ.Пользователь = &Пользователь
		|	И &ОтборТипСессииCabinetLearning
		|	И &ОтборПрохожденияОбучения
		|	И &ОтборЗадания
		|	
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";

	Если ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПрохожденияОбучения", "СессияЭлектронногоРесурсаСУЗ.ПрохождениеОбучения = &ПрохождениеОбучения");
		Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбучения);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПрохожденияОбучения", "ИСТИНА");		
	КонецЕсли;
	
	Если ТипСессии = Перечисления.ТипыСессийЭлектронныхРесурсовСУЗ.course Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборТипСессииCourse", "СессияЭлектронногоРесурсаСУЗ.ТипСессии = ЗНАЧЕНИЕ(Перечисление.ТипыСессийЭлектронныхРесурсовСУЗ.course)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборТипСессииCabinetLearning", "ЛОЖЬ");		
	ИначеЕсли ТипСессии = Перечисления.ТипыСессийЭлектронныхРесурсовСУЗ.cabinetLearning Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборТипСессииCourse", "ЛОЖЬ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборТипСессииCabinetLearning", "СессияЭлектронногоРесурсаСУЗ.ТипСессии = ЗНАЧЕНИЕ(Перечисление.ТипыСессийЭлектронныхРесурсовСУЗ.cabinetLearning)");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборТипСессииCourse", "СессияЭлектронногоРесурсаСУЗ.ТипСессии = ЗНАЧЕНИЕ(Перечисление.ТипыСессийЭлектронныхРесурсовСУЗ.course)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборТипСессииCabinetLearning", "СессияЭлектронногоРесурсаСУЗ.ТипСессии = ЗНАЧЕНИЕ(Перечисление.ТипыСессийЭлектронныхРесурсовСУЗ.cabinetLearning)");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Задание) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборЗадания", "СессияЭлектронногоРесурсаСУЗ.Задание = &Задание");
		Запрос.УстановитьПараметр("Задание", Задание);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборЗадания", "ИСТИНА");		
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.Сессия;
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

#КонецЕсли
