#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Вид");
	Поля.Добавить("Наименование");

КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Данные.Наименование) И ЗначениеЗаполнено(Данные.Вид) Тогда
	
		СтандартнаяОбработка = Ложь;
		
		Представление = "%1 ""%2""";
		
		Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Представление, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные.Вид, "Наименование"), Данные.Наименование);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПреподавателюДоступенТолькоПросмотрВедомости(Мероприятие, РольПреподавателя) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Мероприятие)
		ИЛИ НЕ ЗначениеЗаполнено(РольПреподавателя) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КаталогМероприятийСУОДополнительныеПреподаватели.РольПреподавателя
		|ИЗ
		|	Справочник.КаталогМероприятийСУО.ДополнительныеПреподаватели КАК КаталогМероприятийСУОДополнительныеПреподаватели
		|ГДЕ
		|	КаталогМероприятийСУОДополнительныеПреподаватели.РольПреподавателя = &РольПреподавателя
		|	И КаталогМероприятийСУОДополнительныеПреподаватели.ТолькоПросмотрВедомости = ИСТИНА
		|	И КаталогМероприятийСУОДополнительныеПреподаватели.Ссылка = &Мероприятие";

	Запрос.УстановитьПараметр("Мероприятие", Мероприятие);
	Запрос.УстановитьПараметр("РольПреподавателя", РольПреподавателя);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции

Функция ПреподавательСкрытОтУченика(Мероприятие, РольПреподавателя) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КаталогМероприятийСУОДополнительныеПреподаватели.РольПреподавателя
		|ИЗ
		|	Справочник.КаталогМероприятийСУО.ДополнительныеПреподаватели КАК КаталогМероприятийСУОДополнительныеПреподаватели
		|ГДЕ
		|	КаталогМероприятийСУОДополнительныеПреподаватели.РольПреподавателя = &РольПреподавателя
		|	И КаталогМероприятийСУОДополнительныеПреподаватели.СкрыватьОтУченика = ИСТИНА
		|	И КаталогМероприятийСУОДополнительныеПреподаватели.Ссылка = &Мероприятие";

	Запрос.УстановитьПараметр("Мероприятие", Мероприятие);
	Запрос.УстановитьПараметр("РольПреподавателя", РольПреподавателя);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ЕдинственныйВариантОбучения(Мероприятие) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Мероприятие) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеМероприятия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Мероприятие, Новый Структура("Общее", "Вид.Общее"));
	
	Если НЕ ДанныеМероприятия.Общее Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СхемыМероприятийСУО.Ссылка КАК ВариантОбучения
		|ИЗ
		|	Справочник.СхемыМероприятийСУО КАК СхемыМероприятийСУО
		|ГДЕ
		|	СхемыМероприятийСУО.ПометкаУдаления = ЛОЖЬ
		|	И СхемыМероприятийСУО.Мероприятие = &Мероприятие";
	
	Запрос.УстановитьПараметр("Мероприятие", Мероприятие);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.ВариантОбучения;
	
КонецФункции

Функция ЭтоПодчиненное(Владелец) Экспорт
	Возврат НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "Предопределенный");
КонецФункции

// Функция возвращает продолжительность мероприятия в виде строки.
//
Функция Продолжительность(Мероприятие, СхемаПроведения = Неопределено)
	
	Если Мероприятие.Вид.Общее Тогда
		
		Если НЕ ЗначениеЗаполнено(СхемаПроведения) Тогда
			Возврат ""; // Нельзя определить продолжительность
		КонецЕсли;

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КаталогМероприятийСУО.Ссылка,
			|	КаталогМероприятийСУО.ПродолжительностьВСекундах
			|ИЗ
			|	Справочник.КаталогМероприятийСУО КАК КаталогМероприятийСУО
			|ГДЕ
			|	КаталогМероприятийСУО.Владелец = &СхемаПроведения
			|	И КаталогМероприятийСУО.ЭтоГруппа = ЛОЖЬ
			|	И КаталогМероприятийСУО.ПометкаУдаления = ЛОЖЬ";

		Запрос.УстановитьПараметр("СхемаПроведения", СхемаПроведения);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		ОбщаяПродолжительностьВСекундах = 0;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбщаяПродолжительностьВСекундах = ОбщаяПродолжительностьВСекундах + ВыборкаДетальныеЗаписи.ПродолжительностьВСекундах;
		КонецЦикла;
		
		Возврат ОбъектыSCORM.ПолучитьПолнуюСтрокуИзКоличестваСекунд(ОбщаяПродолжительностьВСекундах, 3);
		
	Иначе
		
		Возврат Мероприятие.Продолжительность;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти	


#КонецЕсли
