#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Вид.ТребуетсяПреподаватель Тогда
		
		Если ЗначениеЗаполнено(РольПреподавателя) Тогда
			
			НайденныйОсновнойПреподавательВДополнительных = ДополнительныеПреподаватели.Найти(РольПреподавателя, "РольПреподавателя");
			
			Если НайденныйОсновнойПреподавательВДополнительных <> Неопределено Тогда
				
				Текст = НСтр("ru = 'Дополнительный преподаватель не может иметь роль основного преподавателя'");
				Поле = "ДополнительныеПреподаватели";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле + "[" + Строка(НайденныйОсновнойПреподавательВДополнительных.НомерСтроки - 1) + "].РольПреподавателя", , Отказ);
				
			КонецЕсли;
			
			Если ОбщегоНазначенияСУКлиентСервер.ЕстьСовпаденияВКоллекцииЗначений(ДополнительныеПреподаватели, "РольПреподавателя") Тогда
				
				Текст = НСтр("ru = 'Роли дополнительных преподавателей должны быть уникальными'");
				Поле = "ДополнительныеПреподаватели";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
				
			КонецЕсли;
			
		Иначе
			
			Текст = НСтр("ru = 'Заполните поле ""Роль преподавателя""'");
			Поле = "РольПреподавателя";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ Вид.Общее Тогда
		
		Если НЕ ЗначениеЗаполнено(МестоПроведения) Тогда
		
			Текст = НСтр("ru = 'Заполните поле ""Место проведения""'");
			Поле = "МестоПроведения";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
		
		КонецЕсли;
		
		Если МестоПроведения = Перечисления.МестаПроведенияМероприятийСУО.Аудитория Тогда
			
			Если НЕ ЗначениеЗаполнено(ТипАудитории) Тогда
			
				Текст = НСтр("ru = 'Укажите тип аудитории'");
				Поле = "ТипАудитории";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ПродолжительностьВСекундах) Тогда
			
				Текст = НСтр("ru = 'Укажите продолжительность мероприятия'");
				Поле = "Продолжительность";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Вид.ВыставляетсяОценка
		И НЕ ЗначениеЗаполнено(ШкалаОценки) Тогда
		
		Текст = НСтр("ru = 'Заполните поле ""Шкала оценки""'");
		Поле = "ШкалаОценки";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка
		ИЛИ ЭтоГруппа Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Вид.Общее Тогда
		МестоПроведения = Неопределено;
	КонецЕсли;
	
	Если МестоПроведения = Перечисления.МестаПроведенияМероприятийСУО.Дистанционно Тогда
		ТипАудитории = Справочники.ТипыАудиторийСУО.ПустаяСсылка();
	КонецЕсли;
	
	Если МестоПроведения = Перечисления.МестаПроведенияМероприятийСУО.Аудитория Тогда		
		АдресВИнтернете = "";		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли