// ОБЩЕЕ
//

Функция ВерсияANY(Запрос)
	УстановитьПривилегированныйРежим(Истина);	
	НастройкиAPI = Новый Структура("Версия, База", ВебКабинетСУ.ВерсияAPI(), СтандартныеПодсистемыСервер.ИдентификаторИнформационнойБазы());	
	Возврат ОтветКлиентуJSON(,НастройкиAPI);	
КонецФункции

// ПОЛЬЗОВАТЕЛИ
//

Функция СоздатьПользователяPOST(ЗапросHTTP)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем данные запроса
	//
	
	ТелоЗапроса = ЗапросHTTP.ПолучитьТелоКакСтроку();		
	
	ДанныеПользователя = Новый Структура;
	ДополнительныеСведения = Новый Структура;
	
	Формат = ЗапросHTTP.ПараметрыЗапроса.Получить("format");
	
	Если Формат = Неопределено Тогда
		Формат = "json";
	КонецЕсли;
	
	Если Формат = "json" Тогда
		
		Попытка
			СтруктураДанных = ОбщегоНазначенияСУ.JSONВДанные(ТелоЗапроса);
			ДанныеПользователяМассив = СтруктураДанных.userData;
			ДополнительныеСведенияМассив = СтруктураДанных.additionalInformation;
		Исключение
		КонецПопытки;
		
		Если СтруктураДанных = Неопределено
			ИЛИ ДанныеПользователяМассив = Неопределено Тогда
			
			Возврат ОтветКлиентуJSON("errorData");
			
		КонецЕсли;		
		
		Для каждого СвойствоСтруктура Из ДанныеПользователяМассив Цикл
			ИмяСвойства = Перевод(СвойствоСтруктура.name, "Пользователи");	
			ДанныеПользователя.Вставить(ИмяСвойства, СвойствоСтруктура.value);
		КонецЦикла;
		
		Если ДополнительныеСведенияМассив = Неопределено Тогда
			ДополнительныеСведенияМассив = Новый Массив;
		КонецЕсли;		
		
		Для каждого СвойствоСтруктура Из ДополнительныеСведенияМассив Цикл
			ИмяСвойства = Перевод(СвойствоСтруктура.name, "Пользователи");	
			ДополнительныеСведения.Вставить(ИмяСвойства, СвойствоСтруктура.value);
		КонецЦикла;		
		
	Иначе
		
		СтруктураДанных = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(ТелоЗапроса);
		
		Для каждого ЭлементСтруктуры Из СтруктураДанных Цикл
		
			ИмяСвойства = Перевод(ЭлементСтруктуры.Ключ, "Пользователи");	
			ДанныеПользователя.Вставить(ИмяСвойства, ЭлементСтруктуры.Значение);				
		
		КонецЦикла;
		
		ДополнительныеСведения = ДанныеПользователя; // Все параметры передаются одной строкой
		
	КонецЕсли;
	
	// Делаем проверки
	//	
	
	КодПубликации = Неопределено;
	
	Если СтруктураДанных.Свойство("publication") Тогда
		КодПубликации = СтруктураДанных.publication;
	ИначеЕсли ДанныеПользователя.Свойство("Публикация") Тогда
		КодПубликации = ДанныеПользователя.Публикация;
	КонецЕсли;
	
	Если КодПубликации = Неопределено Тогда
		КодПубликации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.ПубликацииВебКабинетаСУ.ОсновнаяПубликация(), "Код");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КодПубликации) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПубликацииВебКабинетаСУ.ИспользоватьПинКодыДляРегистрации КАК ИспользоватьПинКоды,
		|	ПубликацииВебКабинетаСУ.ПоляРегистрации.(
		|		Имя,
		|		Реквизит,
		|		КонтактнаяИнформация,
		|		Обязательное,
		|		ИспользоватьКакЛогин
		|	),
		|	ПубликацииВебКабинетаСУ.ДоступнаСвободнаяРегистрация
		|ИЗ
		|	Справочник.ПубликацииВебКабинетаСУ КАК ПубликацииВебКабинетаСУ
		|ГДЕ
		|	ПубликацииВебКабинетаСУ.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", КодПубликации);
	
	РезультатЗапроса = Запрос.Выполнить();		
		
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	НастройкиПубликации = РезультатЗапроса.Выбрать();		
	НастройкиПубликации.Следующий();
	
	Если НЕ НастройкиПубликации.ДоступнаСвободнаяРегистрация Тогда
		Возврат ОтветКлиентуJSON("noFunctionality");
	КонецЕсли;
	
	Если НастройкиПубликации.ИспользоватьПинКоды Тогда
		
		//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
		
		Если НЕ ДанныеПользователя.Свойство("ПинКод") Тогда
			Возврат ОтветКлиентуJSON("noPinCode");
		КонецЕсли;
		
		ДанныеПинКода = РегистрыСведений.ВыданныеПинКодыСУО.КодДоступенДляАктивации(
			ДанныеПользователя.ПинКод,
			?(ДополнительныеСведения.Свойство("ОпцияПинКода"), ДополнительныеСведения.ОпцияПинКода, Неопределено)
		);
		
		Если ДанныеПинКода.ТребуетсяОпция Тогда
			
			// Наборы свойств соответствуют дополнительным свойствам настроек пользователя, например.				
			
			ДополнительныеСведения = Новый Массив();
			ДополнительныеСведения.Добавить(Справочники.СерииПинКодовСУО.СтруктураОпцийДляВебКабинета(ДанныеПинКода.Серия));
			
			Возврат ОтветКлиентуJSON(, Новый Структура("additionalInformation", ДополнительныеСведения));
			
		КонецЕсли;
		
		Если НЕ ДанныеПинКода.ДоступенДляАктивации Тогда
			Возврат ОтветКлиентуJSON(ДанныеПинКода.КодОшибки);
		КонецЕсли;
		
		//----------------------------------//
		
		//--# КОНСТРУКТОР КУРСОВ ДОБАВИТЬ #--//

		// Возврат ОтветКлиентуJSON("noFunctionality");
		
		//----------------------------------//				
		
	КонецЕсли;
	
	// Находим имя поля логина
	//
	
	ВыборкаПолейРегистрации = НастройкиПубликации.ПоляРегистрации.Выбрать();
	ВыборкаПолейРегистрации.Сбросить();
	ИмяПоляЛогина = Неопределено;
	
	Пока ВыборкаПолейРегистрации.Следующий() Цикл
		
		ИмяСвойства = Перевод(ВыборкаПолейРегистрации.Имя, "Пользователи");
		
		Если ДанныеПользователя.Свойство(ИмяСвойства)
			И ЗначениеЗаполнено(ДанныеПользователя[ИмяСвойства])
			И ВыборкаПолейРегистрации.ИспользоватьКакЛогин Тогда
			
			ИмяПоляЛогина = ИмяСвойства;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;		
	
	// Получаем данные пользователя
	//	
	
	Если НЕ ДанныеПользователя.Свойство("ПолноеИмя") Тогда
		
		ПолноеИмя = "";
		
		Если ДанныеПользователя.Свойство("Фамилия") Тогда
			ПолноеИмя = ПолноеИмя + СокрЛП(ДанныеПользователя.Фамилия) + " ";	
		КонецЕсли;
		
		Если ДанныеПользователя.Свойство("Имя") Тогда
			ПолноеИмя = ПолноеИмя + СокрЛП(ДанныеПользователя.Имя) + " ";
		КонецЕсли;
		
		Если ДанныеПользователя.Свойство("Отчество") Тогда
			ПолноеИмя = ПолноеИмя + СокрЛП(ДанныеПользователя.Отчество) + " ";
		КонецЕсли;
		
		ПолноеИмя = СокрЛП(ПолноеИмя);
		
		Если НЕ ЗначениеЗаполнено(ПолноеИмя)
			И ДанныеПользователя.Свойство("Логин") Тогда
			
			ПолноеИмя = ДанныеПользователя.Логин;
			
		КонецЕсли;		
		
		Если НЕ ЗначениеЗаполнено(ПолноеИмя)
			И ЗначениеЗаполнено(ИмяПоляЛогина)
			И ДанныеПользователя.Свойство(ИмяПоляЛогина) Тогда
			
			ПолноеИмя = ДанныеПользователя[ИмяПоляЛогина];
			
		КонецЕсли;
		
		ДанныеПользователя.Вставить("ПолноеИмя", ПолноеИмя);
		
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ДанныеПользователя.ПолноеИмя) Тогда
		Возврат ОтветКлиентуJSON("emptyUserName");
	КонецЕсли;
	
	Если ДанныеПользователя.Свойство("Логин") Тогда
		
		ПользовательИБСуществующий = ПользователиИнформационнойБазы.НайтиПоИмени(ДанныеПользователя.Логин);
		
		Если ПользовательИБСуществующий <> Неопределено Тогда
			Возврат ОтветКлиентуJSON("userAlreadyExist");	
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(ИмяПоляЛогина) Тогда
		
		ПользовательИБСуществующий = ПользователиИнформационнойБазы.НайтиПоИмени(ДанныеПользователя[ИмяПоляЛогина]);
		
		ДанныеПользователя.Вставить("Логин", ДанныеПользователя[ИмяПоляЛогина]);
		
		Если ПользовательИБСуществующий <> Неопределено Тогда
			Возврат ОтветКлиентуJSON("userAlreadyExist");	
		КонецЕсли;		
		
	Иначе
		
		// Генерируем авто-логин (не учитываются пользователи ИБ)
		
		Логин                = ПользователиСлужебныйКлиентСервер.ПолучитьКраткоеИмяПользователяИБ(ДанныеПользователя.ПолноеИмя);
		СчетчикПользователей = 0;
		Постфикс             = "";
		
		Пока Истина Цикл
	
			ПользовательИБСуществующий = ПользователиИнформационнойБазы.НайтиПоИмени(Логин + Постфикс);
			
			Если ПользовательИБСуществующий = Неопределено Тогда
				Прервать;
			Иначе
				СчетчикПользователей = СчетчикПользователей + 1;
				Постфикс = ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(СчетчикПользователей);				
			КонецЕсли;
			
			Если СчетчикПользователей > 100 Тогда
				Возврат ОтветКлиентуJSON("tooManyUsers");
			КонецЕсли;
			
		КонецЦикла;
		
		ДанныеПользователя.Вставить("Логин", Логин + Постфикс);
		
		Если СчетчикПользователей > 0 Тогда // Проверяем, что это однофамилец, а не тот же пользователь
			
			Если ДанныеПользователя.Свойство("ЭлектроннаяПочта") Тогда
				ЭлектроннаяПочта = ДанныеПользователя.ЭлектроннаяПочта;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭлектроннаяПочта) Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	КонтактнаяИнформация.Ссылка КАК Пользователь
					|ИЗ
					|	Справочник.Пользователи.КонтактнаяИнформация КАК КонтактнаяИнформация
					|ГДЕ
					|	КонтактнаяИнформация.АдресЭП = &ЭлектроннаяПочта
					|	И КонтактнаяИнформация.Ссылка.Наименование = &ПолноеИмя";
				
				Запрос.УстановитьПараметр("ЭлектроннаяПочта", ЭлектроннаяПочта);
				Запрос.УстановитьПараметр("ПолноеИмя", ДанныеПользователя.ПолноеИмя);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				Если НЕ РезультатЗапроса.Пустой() Тогда
					Возврат ОтветКлиентуJSON("userAlreadyExist");
				КонецЕсли;
				
			КонецЕсли;			
			
		КонецЕсли;

		
	КонецЕсли;	
	
	// Получаем дополнительные реквизиты и дополнительные поля контактной информации

	КонтактнаяИнформацияПользователя = Новый ТаблицаЗначений;
	КонтактнаяИнформацияПользователя.Колонки.Добавить("ВидКонтактнойИнформации");
	КонтактнаяИнформацияПользователя.Колонки.Добавить("Значение");
	
	ДополнительныеРеквизитыПользователя = Новый ТаблицаЗначений;
	ДополнительныеРеквизитыПользователя.Колонки.Добавить("Реквизит");
	ДополнительныеРеквизитыПользователя.Колонки.Добавить("Значение");	
	
	ВыборкаПолейРегистрации.Сбросить();
	
	Пока ВыборкаПолейРегистрации.Следующий() Цикл
		
		Если ДанныеПользователя.Свойство(ВыборкаПолейРегистрации.Имя)
			И ЗначениеЗаполнено(ДанныеПользователя[ВыборкаПолейРегистрации.Имя]) Тогда
			
			Если ЗначениеЗаполнено(ВыборкаПолейРегистрации.КонтактнаяИнформация) Тогда
				
				НоваяСтрока = КонтактнаяИнформацияПользователя.Добавить();
				НоваяСтрока.ВидКонтактнойИнформации = ВыборкаПолейРегистрации.КонтактнаяИнформация;
				НоваяСтрока.Значение = ДанныеПользователя[ВыборкаПолейРегистрации.Имя];
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаПолейРегистрации.Реквизит) Тогда
				
				НоваяСтрока = ДополнительныеРеквизитыПользователя.Добавить();
				НоваяСтрока.Реквизит = ВыборкаПолейРегистрации.Реквизит;
				НоваяСтрока.Значение = ДанныеПользователя[ВыборкаПолейРегистрации.Имя];				
				
			КонецЕсли;			
			
		КонецЕсли;		
		
	КонецЦикла;	
	
	// Записываем данные
	//
	
	НачатьТранзакцию();
	
	// Создаем нового пользователя
		
	Пользователь = ЗаписатьНовогоПользователя(,ДанныеПользователя.Логин, ДанныеПользователя.Пароль, ДанныеПользователя.ПолноеИмя, ?(ДанныеПользователя.Свойство("ЭлектроннаяПочта"), ДанныеПользователя.ЭлектроннаяПочта, ""), Истина, "", КонтактнаяИнформацияПользователя, ДополнительныеРеквизитыПользователя);
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//	
	
	// Сохраняем факт использования пин-кода
	
	Если НастройкиПубликации.ИспользоватьПинКоды Тогда
		РегистрыСведений.ВыданныеПинКодыСУО.АктивироватьКод(ДанныеПинКода.Серия, ДанныеПинКода.Код, Пользователь,, ДанныеПинКода.Опция,Истина);
	КонецЕсли;
	
	// Зачисляем пользователя на мероприятия (через фоновое задание)
		
	МассивПроведенийОбучения = Документы.ПроведениеОбученияСУО.ПроведенияОбученияДляАвтоЗачисленияНовогоВнешнегоПользователя(Пользователь);
	
	Для каждого ПроведениеОбучения Из МассивПроведенийОбучения Цикл
		РегистрыСведений.НовыеЗачисленияНаОбучениеСУО.ДобавитьЗачисление(Пользователь, ПроведениеОбучения);	
	КонецЦикла;	
	
	// Зачисляем на указанный при регистрации курс
	
	Если ДанныеПользователя.Свойство("Курс") Тогда
		
		Попытка
			ЭлектронныйРесурс = Справочники.СводыЗнанийСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеПользователя.Курс));
		Исключение
		КонецПопытки;
		
		Если НЕ ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
			ОтменитьТранзакцию();
			Возврат ОтветКлиентуJSON("errorData", Новый Структура("electronicResource, description", ДанныеПользователя.Курс, "Electronic resource is not found"));
		КонецЕсли;
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПроведениеОбученияСУО.Регистратор КАК ПроведениеОбучения
			|ИЗ
			|	РегистрСведений.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
			|ГДЕ
			|	ПроведениеОбученияСУО.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПроведенияОбъектовСУО.Активно)
			|	И ПроведениеОбученияСУО.ДоступноВсем = ЛОЖЬ
			|	И ПроведениеОбученияСУО.ДоступноВнешнимПользователям = ИСТИНА
			|	И ПроведениеОбученияСУО.НаОсновеЭлектронногоРесурса = ИСТИНА
			|	И ПроведениеОбученияСУО.Сценарий = &ЭлектронныйРесурс
			|	И ПроведениеОбученияСУО.АвтозачислениеНаОбучение = ИСТИНА
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПроведениеОбученияСУО.Период УБЫВ";
			
		Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);
		
		// ПроведениеОбученияСУО.ДоступноВсем = ЛОЖЬ,
		// Так как на обучение доступное всем будут зачислены все (см. выше),
		// А здесь только те, у кого в запросе есть код курса.
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			ОтменитьТранзакцию();
			Возврат ОтветКлиентуJSON("noCourse");	
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			УправлениеОбучениемСУО.ЗачислитьУчастникаНаОбучение(ВыборкаДетальныеЗаписи.ПроведениеОбучения,,Пользователь,,,,,,Истина);
		КонецЦикла;
		
	КонецЕсли;
	
	// Устанавливаем ограничение по времени
	
	Если ДанныеПользователя.Свойство("ОграничениеПоВремени")
		И ЗначениеЗаполнено(ДанныеПользователя.ОграничениеПоВремени) Тогда
		
		ОграничениеПоВремениЧисло = Число(ДанныеПользователя.ОграничениеПоВремени); // В днях
		
		Если ОграничениеПоВремениЧисло > 0 Тогда
			
			ДатаНачалаДоступа = ТекущаяДатаСеанса();
			ДатаОкончанияДоступа = ДатаНачалаДоступа + ОграничениеПоВремениЧисло*24*60*60;
			
			РегистрыСведений.ВремяДоступаПользователейСУО.УстановитьВремяДоступа(Пользователь, ДатаНачалаДоступа, ДатаОкончанияДоступа);
			
		КонецЕсли;
		
	КонецЕсли;
	
	//----------------------------------//
	
	ЗафиксироватьТранзакцию();
	
	//--# КОНСТРУКТОР КУРСОВ ДОБАВИТЬ #--//

	// ВебКабинетСУ.ОбновитьДанныеОбъекта(Справочники.СводыЗнанийСУЗ, Пользователь);
	
	//----------------------------------//	
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	// Запускаем фоновое задание. Если оно не будет выполнено,
	// то попытка будет продолжена через регламентное задание.
	
	МассивПараметровФЗ = Новый Массив;
	МассивПараметровФЗ.Добавить(Пользователь);
	МассивПараметровФЗ.Добавить(Истина);
	
	ФоновыеЗадания.Выполнить("УправлениеОбучениемСУО.ЗачислениеПользователейНаОбучениеСУО", МассивПараметровФЗ);	
	
	//----------------------------------//
	
	//Попытка
	//	ВебКабинетСУ.ВыполнитьВсеЗадания();
	//Исключение
	//КонецПопытки;	
	
	// Возвращаем результат
	//
	
	Если Формат = "json" Тогда
		Возврат ОтветКлиентуJSON(,Новый Структура("login", ДанныеПользователя.Логин));
	Иначе
		Возврат ОтветКлиентуTEXT(,ДанныеПользователя.Логин);
	КонецЕсли;
	
КонецФункции

Функция ВосстановлениеПароляПользователяPOST(ЗапросHTTP)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем номер этапа
	//
	
	Попытка
		НомерЭтапа = Число(ЗапросHTTP.ПараметрыURL.Получить("НомерЭтапа"));
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(НомерЭтапа) ИЛИ НомерЭтапа > 3 Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	// Этап 1. Создание запроса на восстановление пароля
	//
	
	Если НомерЭтапа = 1 Тогда
	
		// Получаем данные запроса
		
		ТелоЗапроса = ЗапросHTTP.ПолучитьТелоКакСтроку();		
		ДанныеПользователя = Новый Структура;
			
		Попытка
			СтруктураДанных = ОбщегоНазначенияСУ.JSONВДанные(ТелоЗапроса);
			ДанныеПользователяМассив = СтруктураДанных.userData;
		Исключение
		КонецПопытки;
		
		Если СтруктураДанных = Неопределено
			ИЛИ ДанныеПользователяМассив = Неопределено Тогда
			
			Возврат ОтветКлиентуJSON("errorData");
			
		КонецЕсли;	
				
		Для каждого СвойствоСтруктура Из ДанныеПользователяМассив Цикл
			ИмяСвойства = Перевод(СвойствоСтруктура.name, "Пользователи");	
			ДанныеПользователя.Вставить(ИмяСвойства, СокрЛП(СвойствоСтруктура.value));
		КонецЦикла;
		
		// Ищем пользователя в базе
		
		Пользователь = Неопределено;
		АдресЭлектроннойПочтыПользователя = "";
		
		Если ДанныеПользователя.Свойство("Логин") И ЗначениеЗаполнено(ДанныеПользователя.Логин) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ПользователиВебКабинетаСУ.Пользователь КАК Пользователь
				|ИЗ
				|	РегистрСведений.ПользователиВебКабинетаСУ КАК ПользователиВебКабинетаСУ
				|ГДЕ
				|	ПользователиВебКабинетаСУ.Имя = &Логин";
			
			Запрос.УстановитьПараметр("Логин", ДанныеПользователя.Логин);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Количество()  = 1 Тогда
				
				ВыборкаДетальныеЗаписи.Следующий();
				
				Пользователь = ВыборкаДетальныеЗаписи.Пользователь;
				
				МассивТиповКИ = Новый Массив;
				МассивТиповКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
				
				МассивПользователей = Новый Массив;
				МассивПользователей.Добавить(Пользователь);
				
				АдресаЭлектроннойПочтыПользователя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивПользователей, МассивТиповКИ);
				
				Если АдресаЭлектроннойПочтыПользователя.Количество() = 0 Тогда
					Возврат ОтветКлиентуJSON("emptyMail");
				КонецЕсли;
				
				Для каждого Строка Из АдресаЭлектроннойПочтыПользователя Цикл				
					Строка.Представление = НРег(Строка.Представление);				
				КонецЦикла;
				
				Если ЗначениеЗаполнено(Пользователь) И ДанныеПользователя.Свойство("ЭлектроннаяПочта") И ЗначениеЗаполнено(ДанныеПользователя.ЭлектроннаяПочта) Тогда
					
					Если АдресаЭлектроннойПочтыПользователя.Найти(НРег(ДанныеПользователя.ЭлектроннаяПочта), "Представление") = Неопределено Тогда
						Возврат ОтветКлиентуJSON("notIdenticalUserMail");	
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Пользователь = Неопределено И ДанныеПользователя.Свойство("ЭлектроннаяПочта") И ЗначениеЗаполнено(ДанныеПользователя.ЭлектроннаяПочта) Тогда
			
			АдресЭлектроннойПочтыПользователя = ДанныеПользователя.ЭлектроннаяПочта;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ПользователиКонтактнаяИнформация.Ссылка КАК Пользователь
				|ИЗ
				|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
				|ГДЕ
				|	ПользователиКонтактнаяИнформация.АдресЭП = &ЭлектроннаяПочта";
			
			Запрос.УстановитьПараметр("ЭлектроннаяПочта", АдресЭлектроннойПочтыПользователя);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
			
				ВыборкаДетальныеЗаписи.Следующий();
				
				Если РегистрыСведений.ПользователиВебКабинетаСУ.ПользовательСуществует(,ВыборкаДетальныеЗаписи.Пользователь) Тогда				
					Пользователь = ВыборкаДетальныеЗаписи.Пользователь;
				КонецЕсли;
				
			КонецЕсли;
			
			Если ВыборкаДетальныеЗаписи.Количество() > 1 Тогда
				Возврат ОтветКлиентуJSON("notUniqueMail");
			КонецЕсли;
			
		КонецЕсли;
		
		Если Пользователь = Неопределено Тогда
			Возврат ОтветКлиентуJSON("noUser");
		КонецЕсли;
		
		// Создаем новый запрос на восстановление
		
		АдресСтраницы = ЗапросHTTP.Заголовки.Получить("Referer");
		
		Если НЕ ЗначениеЗаполнено(АдресСтраницы) Тогда
			Возврат ОтветКлиентуJSON("error");
		КонецЕсли;
		
		ЗапросНаВосстановление = Документы.ВосстановлениеПароляСУ.СоздатьДокумент();
		ЗапросНаВосстановление.Дата = ТекущаяДатаСеанса();
		ЗапросНаВосстановление.Пользователь = Пользователь;
		ЗапросНаВосстановление.АдресСтраницыВосстановления = АдресСтраницы;
		ЗапросНаВосстановление.Записать(РежимЗаписиДокумента.Проведение);
		
		//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
		
		// Создаем автоматическую рассылку
		
		СозданныеРассылки = Новый Массив;
		
		УправлениеОбучениемСУО.СоздатьАвтоматическуюРассылку(ЗапросНаВосстановление,, СозданныеРассылки);
		
		ОбщегоНазначения.ПровестиДокументы(СозданныеРассылки);
		
		// Высылаем письмо фоновым заданием (в случае неудачи, оно будет выслано регламентным заданием)
		
		Для каждого СозданнаяРассылка Из СозданныеРассылки Цикл
			
			МассивПараметровФЗ = Новый Массив;
			МассивПараметровФЗ.Добавить(СозданнаяРассылка);
			
			ФоновыеЗадания.Выполнить("УправлениеОбучениемСУО.РазослатьСообщенияНаЭлектроннуюПочту", МассивПараметровФЗ);
			
		КонецЦикла;
		
		//----------------------------------//
		
		// Возвращаем ответ
		
		РезультатЗапроса = Новый Структура("Идентификатор", Строка(ЗапросНаВосстановление.Ссылка.УникальныйИдентификатор()));
		
	КонецЕсли;
	
	// Этап 2. Получание информации для страницы восстановления запроса
	//
	
	Если НомерЭтапа = 2 Тогда 
		
		// Получаем документ запроса
		
		ТелоЗапроса = ЗапросHTTP.ПолучитьТелоКакСтроку();
		
		Попытка
			СтруктураЗапроса = ОбщегоНазначенияСУ.JSONВДанные(ТелоЗапроса);
			ИдентификаторЗапроса = Новый УникальныйИдентификатор(СтруктураЗапроса.id);
			ДокументЗапроса = Документы.ВосстановлениеПароляСУ.ПолучитьСсылку(ИдентификаторЗапроса);
		Исключение
		КонецПопытки;
		
		Если НЕ ЗначениеЗаполнено(ДокументЗапроса) Тогда
			Возврат ОтветКлиентуJSON("errorData");
		КонецЕсли;
		
		ДанныеЗапроса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументЗапроса, "Пользователь, ПарольВосстановлен, Дата, АдресСтраницыВосстановления");
		
		АдресСтраницы = ЗапросHTTP.Заголовки.Получить("Referer");
		
		Если НЕ ЗначениеЗаполнено(АдресСтраницы) Тогда
			Возврат ОтветКлиентуJSON("error");
		КонецЕсли;	
		
		// Проверяем корректность документа
		
		Если ДанныеЗапроса.ПарольВосстановлен Тогда
			Возврат ОтветКлиентуJSON("oldRequest");
		КонецЕсли;
		
		Если (ТекущаяДатаСеанса() - ДанныеЗапроса.Дата) > 86400 Тогда
			Возврат ОтветКлиентуJSON("overdueRequest");	
		КонецЕсли;	
		
		// Получаем данные пользователя
		
		ДанныеПользователяВК = РегистрыСведений.ПользователиВебКабинетаСУ.ДанныеПользователя(,ДанныеЗапроса.Пользователь);
		
		Если ДанныеПользователяВК = Неопределено Тогда
			Возврат ОтветКлиентуJSON("noUser");
		Иначе
			ЛогинПользователя = ДанныеПользователяВК.Имя;
		КонецЕсли;
		
		// Возвращаем ответ
		
		РезультатЗапроса = Новый Структура("Логин", ЛогинПользователя);
		
	КонецЕсли;
	
	// Этап 3. Изменение пароля
	//	
	
	Если НомерЭтапа = 3 Тогда 
		
		// Получаем данные запроса
		
		ТелоЗапроса = ЗапросHTTP.ПолучитьТелоКакСтроку();		
		ДанныеЗапроса = Новый Структура;
			
		Попытка
			СтруктураДанных = ОбщегоНазначенияСУ.JSONВДанные(ТелоЗапроса);
			ДанныеЗапросаМассив = СтруктураДанных.changePasswordData;
		Исключение
		КонецПопытки;
		
		Если СтруктураДанных = Неопределено
			ИЛИ ДанныеЗапросаМассив = Неопределено Тогда
			
			Возврат ОтветКлиентуJSON("errorData");
			
		КонецЕсли;	
				
		Для каждого СвойствоСтруктура Из ДанныеЗапросаМассив Цикл
			ИмяСвойства = Перевод(СвойствоСтруктура.name, "Пользователи");	
			ДанныеЗапроса.Вставить(ИмяСвойства, СокрЛП(СвойствоСтруктура.value));
		КонецЦикла;
		
		Если НЕ ДанныеЗапроса.Свойство("Пароль") ИЛИ НЕ ДанныеЗапроса.Свойство("Код") ИЛИ НЕ ДанныеЗапроса.Свойство("Идентификатор") Тогда
			Возврат ОтветКлиентуJSON("errorData");
		КонецЕсли;
		
		// Сохраняем изменение в документе "ВосстановлениеПароляСУ"
		
		НачатьТранзакцию();
		
		Попытка
			ВосстановлениеПароляОбъект = Документы.ВосстановлениеПароляСУ.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеЗапроса.Идентификатор)).ПолучитьОбъект();
			КодВосстановленияЧисло = Число(ДанныеЗапроса.Код);
		Исключение
		КонецПопытки;
		
		Если ВосстановлениеПароляОбъект = Неопределено ИЛИ НЕ ВосстановлениеПароляОбъект.Проведен ИЛИ НЕ ЗначениеЗаполнено(КодВосстановленияЧисло) Тогда
			Возврат ОтветКлиентуJSON("errorData");
		КонецЕсли;
		
		Если ВосстановлениеПароляОбъект.ПарольВосстановлен Тогда
			Возврат ОтветКлиентуJSON("oldRequest");
		КонецЕсли;
		
		ТекущаяДата = ТекущаяДатаСеанса();
		
		Если (ТекущаяДата - ВосстановлениеПароляОбъект.Дата) > 86400 Тогда
			Возврат ОтветКлиентуJSON("overdueRequest");	
		КонецЕсли;
		
		АдресСтраницы = ЗапросHTTP.Заголовки.Получить("Referer");
		
		Если НЕ ЗначениеЗаполнено(АдресСтраницы) Тогда
			Возврат ОтветКлиентуJSON("error");
		КонецЕсли;			
		
		Если ВосстановлениеПароляОбъект.КодВосстановления <> КодВосстановленияЧисло Тогда
			Возврат ОтветКлиентуJSON("errorAuthorization");
		КонецЕсли;
		
		ВосстановлениеПароляОбъект.ДатаВосстановления = ТекущаяДата;
		ВосстановлениеПароляОбъект.ПарольВосстановлен = Истина;
		
		ВосстановлениеПароляОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		// Изменяем пароль
		//
		
		ИзменитьПарольПользователя(ВосстановлениеПароляОбъект.Пользователь, ДанныеЗапроса.Пароль);
		
		ДанныеПользователяВК = РегистрыСведений.ПользователиВебКабинетаСУ.ДанныеПользователя(,ВосстановлениеПароляОбъект.Пользователь);
		
		Если ДанныеПользователяВК = Неопределено Тогда
			Возврат ОтветКлиентуJSON("noUser");
		Иначе
			ЛогинПользователя = ДанныеПользователяВК.Имя;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
		РезультатЗапроса = Новый Структура("Логин", ЛогинПользователя);
		
	КонецЕсли;
	
	// Возвращаем ответ
	
	Возврат ОтветКлиентуJSON(,РезультатЗапроса);
	
КонецФункции

Функция ДанныеПользователяPOST(ЗапросHTTP)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(ЗапросHTTP, ДанныеСессии, КодОшибки, Ложь);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;	
	
	// Получаем идентификатор пользователя
	//
	
	Попытка
		ИдентификаторПользователя = Новый УникальныйИдентификатор(ЗапросHTTP.ПараметрыURL.Получить("ИдентификаторПользователя"));
		Пользователь = Справочники.Пользователи.ПолучитьСсылку(ИдентификаторПользователя);
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	// Возвращаем данные
	//
	
	ДанныеПользователя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Пользователь, "Наименование");
	
	ОтветКлиенту = Новый Структура("name, recipient", ДанныеПользователя.Наименование, Строка(ДанныеСессии.Пользователь.УникальныйИдентификатор()));
	
	Возврат ОтветКлиентуJSON(,ОтветКлиенту);	
	
КонецФункции

Функция ИзменитьПарольPOST(ЗапросHTTP)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(ЗапросHTTP, ДанныеСессии, КодОшибки, Ложь);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;	
	
	// Изменяем пароль
	//
	
	ТелоЗапроса = ЗапросHTTP.ПолучитьТелоКакСтроку();
	
	Пароль = "";
		
	Попытка
		СтруктураДанных = ОбщегоНазначенияСУ.JSONВДанные(ТелоЗапроса);
		ДанныеМассив = СтруктураДанных.changePasswordData;
	Исключение
	КонецПопытки;
	
	Если СтруктураДанных = Неопределено
		ИЛИ ДанныеМассив = Неопределено Тогда
		
		Возврат ОтветКлиентуJSON("errorData");
		
	КонецЕсли;	
	
	// Проверяем, есть ли право на изменение пароля
	//
	
	ИдентификаторПользователяИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСессии.Пользователь, "ИдентификаторПользователяИБ");
	СвойстваПользователяИБ = Новый Структура("ЗапрещеноИзменятьПароль", Ложь);
	ОписаниеОшибки = "";
	Если Пользователи.ПрочитатьПользователяИБ(ИдентификаторПользователяИБ, СвойстваПользователяИБ, ОписаниеОшибки) Тогда
		Если СвойстваПользователяИБ.ЗапрещеноИзменятьПароль Тогда
			Возврат ОтветКлиентуJSON("noFunctionality");
		КонецЕсли;
	Иначе
		Возврат ОтветКлиентуJSON("errorData", ОписаниеОшибки);		
	КонецЕсли;
	
	// Изменяем пароль
	//
	
	Для каждого СвойствоСтруктура Из ДанныеМассив Цикл
		Если СвойствоСтруктура.name = "password" Тогда
			Пароль = СвойствоСтруктура.value;
		КонецЕсли;
	КонецЦикла;		
	
	ИзменитьПарольПользователя(ДанныеСессии.Пользователь, Пароль);
	
	// Возвращаем результат
	//
	
	Возврат ОтветКлиентуJSON(, Новый Структура("ОперацияЗавершена", Истина));	
	
КонецФункции

Функция ПользователиОнлайнPOST(ЗапросHTTP)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(ЗапросHTTP, ДанныеСессии, КодОшибки, Ложь);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;	
	
	// Получаем пользователей онлайн
	//
	
	МассивИдентификаторовПользователей = ОбщегоНазначенияСУ.JSONВДанные(СокрЛП(ЗапросHTTP.ПолучитьТелоКакСтроку()));
	
	МассивПользователей = Новый Массив;
	
	СправочникПользователи = Справочники.Пользователи;
	
	Для каждого ИдентификаторовПользователя Из МассивИдентификаторовПользователей Цикл
		
		Пользователь = СправочникПользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторовПользователя));
		
		Если МассивПользователей.Найти(Пользователь) = Неопределено Тогда
			МассивПользователей.Добавить(Пользователь);
		КонецЕсли;
	
	КонецЦикла;
	
	МассивАктивныхПользователей = РегистрыСведений.СессииВебКабинетаСУ.АктивныеПользователи(МассивПользователей);
	
	Возврат ОтветКлиентуJSON(,МассивАктивныхПользователей);
	
КонецФункции

Функция ПолучитьТокенPOST(ЗапросHTTP)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("
		|{
  		|	""auth-token"": """"
		|}
		|");	
	Ответ.Заголовки.Вставить("Content-Type", "application/json");	
	Возврат Ответ;
КонецФункции

Функция ЗагрузитьПользователейPOST(ЗапросHTTP)
	
	УстановитьПривилегированныйРежим(Истина);
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	// Получаем параметры запроса
	
	КлючЗапроса = СокрЛП(Строка(ЗапросHTTP.ПараметрыЗапроса.Получить("key")));
	
	Если НЕ ЗначениеЗаполнено(КлючЗапроса) Тогда
		Ответ = Новый HTTPСервисОтвет(400);
		Возврат Ответ;								
	КонецЕсли;		
	
	ДатаПредыдущегоЗапроса = ЗапросHTTP.ПараметрыЗапроса.Получить("previousRequestDate");
	
	Попытка
		ДатаПредыдущегоЗапроса = XMLЗначение(Тип("Дата"), ДатаПредыдущегоЗапроса);
	Исключение
		ДатаПредыдущегоЗапроса = Дата("00010101");
	КонецПопытки;
	
	// Проверяем ключ
	
	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA1);
	Хеширование.Добавить(КлючЗапроса);		
	ХэшКлюча = Base64Строка(Хеширование.ХешСумма);
	ХэшКлючаВБазе = Константы.ХэшКлючаЗагрузкиПользователейСУО.Получить();
	
	Если ХэшКлючаВБазе <> ХэшКлюча Тогда
		Ответ = Новый HTTPСервисОтвет(403);
		Возврат Ответ;												
	КонецЕсли;
	
	// Возвращаем ответ, если это запрос для тестирования
	
	ВариантЗапроса = СокрЛП(Строка(ЗапросHTTP.ПараметрыЗапроса.Получить("mode")));
	Если ВариантЗапроса = "test" Тогда
		Ответ = Новый HTTPСервисОтвет(200);
		Возврат Ответ;		
	КонецЕсли;
	
	УправлениеОбучениемСУО.ЗагрузитьПользователей(ЗапросHTTP.ПолучитьТелоКакСтроку());
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
	//----------------------------------//
	
	//--# КОНСТРУКТОР КУРСОВ ДОБАВИТЬ #--//
	
	//Ответ = Новый HTTPСервисОтвет(405);
	//Возврат Ответ;
	
	//----------------------------------//
	
	
КонецФункции

Функция ВыгрузитьПользователейPOST(ЗапросHTTP)
	
	УстановитьПривилегированныйРежим(Истина);
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	// Получаем параметры запроса
	
	КлючЗапроса = СокрЛП(Строка(ЗапросHTTP.ПараметрыЗапроса.Получить("key")));
	
	Если НЕ ЗначениеЗаполнено(КлючЗапроса) Тогда
		Ответ = Новый HTTPСервисОтвет(400);
		Возврат Ответ;								
	КонецЕсли;		
	
	ДатаПредыдущегоЗапроса = ЗапросHTTP.ПараметрыЗапроса.Получить("previousRequestDate");
	
	Попытка
		ДатаПредыдущегоЗапроса = XMLЗначение(Тип("Дата"), ДатаПредыдущегоЗапроса);
	Исключение
		ДатаПредыдущегоЗапроса = Дата("00010101");
	КонецПопытки;
	
	// Проверяем ключ
	
	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA1);
	Хеширование.Добавить(КлючЗапроса);		
	ХэшКлюча = Base64Строка(Хеширование.ХешСумма);
	ХэшКлючаВБазе = Константы.ХэшКлючаЗагрузкиПользователейСУО.Получить();
	
	Если ХэшКлючаВБазе <> ХэшКлюча Тогда
		Ответ = Новый HTTPСервисОтвет(403);
		Возврат Ответ;												
	КонецЕсли;
	
	// Возвращаем ответ, если это запрос для тестирования
	
	ВариантЗапроса = СокрЛП(Строка(ЗапросHTTP.ПараметрыЗапроса.Получить("mode")));
	Если ВариантЗапроса = "test" Тогда
		Ответ = Новый HTTPСервисОтвет(200);
		Возврат Ответ;		
	КонецЕсли;

	// Получаем таблицу с данными из тела запроса
	
	ТелоХранилище = XMLЗначение(Тип("ХранилищеЗначения"), ЗапросHTTP.ПолучитьТелоКакСтроку());	
	СтруктураДанных = ТелоХранилище.Получить();
	
	Если ТипЗнч(СтруктураДанных) <> Тип("Структура")
		ИЛИ НЕ СтруктураДанных.Свойство("Пользователи") Тогда
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки(НСтр("ru = 'Неверный формат структуры данных'"));
		Возврат Ответ;														
	КонецЕсли;		
	
	// Возвращаем данные
		
	ТаблицаСсылочныхЗначений = УправлениеОбучениемСУО.ПустаяТаблицаСсылочныхЗначений();
	
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "Ссылка";
	НоваяСтрока.Тип = "Справочник.Пользователи";
	
	УправлениеОбучениемСУО.ПодготовитьТаблицуКЗагрузке(СтруктураДанных.Пользователи, ТаблицаСсылочныхЗначений);
	
	МассивПользователей = Новый Массив;
	
	Для каждого Строка Из СтруктураДанных.Пользователи Цикл
		МассивПользователей.Добавить(Строка.Ссылка);
	КонецЦикла;	
	
	ДанныеВозврата = Новый Структура("Пользователи, КонтактныеДанные, ДополнительныеРеквизиты");
	
	Если МассивПользователей.Количество() = 0 Тогда
		Возврат ОтветКлиентуJSON(,ДанныеВозврата);
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка,
		|	Пользователи.Наименование,
		|	Пользователи.Код,
		|	Пользователи.ПометкаУдаления
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка В(&МассивПользователей)";
	
	Запрос.УстановитьПараметр("МассивПользователей", МассивПользователей);
	
	ТаблицаДанныхПользователей = Запрос.Выполнить().Выгрузить();
				
	ТаблицаКонтактныхДанных = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивПользователей);
	ТаблицаКонтактныхДанных.Колонки.Найти("Объект").Имя = "Ссылка";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПользователиДополнительныеРеквизиты.Свойство,
		|	ПользователиДополнительныеРеквизиты.Значение,
		|	ПользователиДополнительныеРеквизиты.ТекстоваяСтрока,
		|	ПользователиДополнительныеРеквизиты.Ссылка,
		|	ПользователиДополнительныеРеквизиты.Свойство.ТипЗначения КАК ТипЗначения,
		|	ПользователиДополнительныеРеквизиты.Свойство.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
		|	ПользователиДополнительныеРеквизиты.Свойство.Представление КАК Представление,
		|	ПользователиДополнительныеРеквизиты.Свойство.Заголовок КАК Заголовок,
		|	ПользователиДополнительныеРеквизиты.Значение.Наименование КАК НаименованиеЗначения
		|ИЗ
		|	Справочник.Пользователи.ДополнительныеРеквизиты КАК ПользователиДополнительныеРеквизиты
		|ГДЕ
		|	ПользователиДополнительныеРеквизиты.Ссылка В(&МассивПользователей)";
	
	Запрос.УстановитьПараметр("МассивПользователей", МассивПользователей);
	
	ТаблицаДополнительныхРеквизитов = Запрос.Выполнить().Выгрузить();

	
	ДанныеВозврата.Пользователи = ТаблицаДанныхПользователей;
	ДанныеВозврата.КонтактныеДанные = ТаблицаКонтактныхДанных;
	ДанныеВозврата.ДополнительныеРеквизиты = ТаблицаДополнительныхРеквизитов;
	
	ДанныеJSON = ОбщегоНазначенияСУ.ДанныеВJSON(ДанныеВозврата);	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(ДанныеJSON);
	Возврат Ответ;
	
	//----------------------------------//
	
	//--# КОНСТРУКТОР КУРСОВ ДОБАВИТЬ #--//
	
	//Ответ = Новый HTTPСервисОтвет(405);
	//Возврат Ответ;
	
	//----------------------------------//

	
КонецФункции

// СЕССИИ
//

Функция СоздатьСессиюPOST(ЗапросHTTP)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем данные запроса
	
	Попытка
		СтруктураДанных = ОбщегоНазначенияСУ.JSONВДанные(ЗапросHTTP.ПолучитьТелоКакСтроку());
		ТипАутентификации = ЗапросHTTP.ПараметрыURL.Получить("ТипАутентификации");
	Исключение
	КонецПопытки;
	
	Попытка
		Выполнить(Строка("ЛицензированиеВебКабинетаСУ.Провер"+"итьРегистрацион"+"ныеНомера();"));
	Исключение
		Возврат ОтветКлиентуJSON("errorDoubleAuthorization");
	КонецПопытки;
	
	Возврат СоздатьСессиюПользователя(ТипАутентификации, СтруктураДанных);
	
КонецФункции

Функция ЗакрытьСессиюPOST(ЗапросHTTP)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(ЗапросHTTP, ДанныеСессии, КодОшибки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;	
	
	// Получаем тело запроса

	ТелоЗапросаСтрока = СокрЛП(ЗапросHTTP.ПолучитьТелоКакСтроку());
	
	Если ЗначениеЗаполнено(ТелоЗапросаСтрока) Тогда
		
		Попытка
			ТелоЗапросаСтруктура = ОбщегоНазначенияСУ.JSONВДанные(ТелоЗапросаСтрока);
		Исключение
			ТелоЗапросаСтруктура = Новый Структура;
		КонецПопытки;
		
		ИмяСобытия = "END";	
		
		ИдентификаторВкладки = Неопределено;
		ТелоЗапросаСтруктура.Свойство("tabUUID", ИдентификаторВкладки);
		
		Если ЗначениеЗаполнено(ИдентификаторВкладки) Тогда
			Попытка
				ИдентификаторВкладки = Новый УникальныйИдентификатор(ИдентификаторВкладки);
			Исключение
				Возврат ОтветКлиентуJSON("errorData");
			КонецПопытки;
		КонецЕсли;
		
		ЗаписатьСтатистику(ДанныеСессии, ИдентификаторВкладки, ИмяСобытия);
		
	КонецЕсли;		
	
	// Отмечаем сессию, как завершенную
	
	РегистрыСведений.СессииВебКабинетаСУ.ЗакрытьСессию(ДанныеСессии.Идентификатор);
	
	// Возвращаем идентификатор закрытой сессии
	
	Возврат ОтветКлиентуJSON(,ДанныеСессии.Идентификатор);
	
КонецФункции

Функция УстановитьДатуАктивностиСессииPOST(ЗапросHTTP)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(ЗапросHTTP, ДанныеСессии, КодОшибки);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;	
	
	// Получаем тело запроса
	
	ТелоЗапросаСтрока = СокрЛП(ЗапросHTTP.ПолучитьТелоКакСтроку());
	
	Попытка
		ТелоЗапросаСтруктура = ОбщегоНазначенияСУ.JSONВДанные(ТелоЗапросаСтрока);
	Исключение
		ТелоЗапросаСтруктура = Новый Структура;
	КонецПопытки;
			
	ИмяСобытия = Неопределено;	
	ТелоЗапросаСтруктура.Свойство("event", ИмяСобытия);
	
	Если НЕ ЗначениеЗаполнено(ИмяСобытия) Тогда
		ИмяСобытия = "ONLINE";
	КонецЕсли;

	ИдентификаторВкладки = Неопределено;
	ТелоЗапросаСтруктура.Свойство("tabUUID", ИдентификаторВкладки);
	
	Если ЗначениеЗаполнено(ИдентификаторВкладки) Тогда
		Попытка
			ИдентификаторВкладки = Новый УникальныйИдентификатор(ИдентификаторВкладки);
		Исключение
			Возврат ОтветКлиентуJSON("errorData");
		КонецПопытки;
	КонецЕсли;
	
	// Запоминаем событие
	
	ЗаписатьСтатистику(ДанныеСессии, ИдентификаторВкладки, ИмяСобытия);	
	
	// Устанавливаем дату активности
	
	Если ИмяСобытия = "START" ИЛИ ИмяСобытия = "ONLINE" Тогда
		РегистрыСведений.СессииВебКабинетаСУ.ОбновитьДатуАктивности(ДанныеСессии.Идентификатор);
	КонецЕсли;
	
	// Возвращаем идентификатор закрытой сессии
	
	Возврат ОтветКлиентуJSON(, Новый Структура);
	
КонецФункции

Процедура ЗаписатьСтатистику(ДанныеСессии, ИдентификаторВкладки, ИмяСобытия)
	
	Если ЗначениеЗаполнено(ИдентификаторВкладки) Тогда
		
		Если ИмяСобытия = "START" Тогда
			Документы.ИспользованиеВебКабинетаСУ.НачатьИспользование(
				ДанныеСессии.Пользователь, ДанныеСессии.Идентификатор, ИдентификаторВкладки);
		КонецЕсли;
		
		Если ИмяСобытия = "ONLINE" Тогда
			Документы.ИспользованиеВебКабинетаСУ.ЗаписатьДатуПоследнейАктивности(
				ДанныеСессии.Пользователь, ДанныеСессии.Идентификатор, ИдентификаторВкладки);
		КонецЕсли;
		
		Если ИмяСобытия = "END" Тогда
			Документы.ИспользованиеВебКабинетаСУ.ЗавершитьИспользование(
				ДанныеСессии.Пользователь, ДанныеСессии.Идентификатор, ИдентификаторВкладки);
		КонецЕсли;
		
	КонецЕсли;

	
КонецПроцедуры

// OpenID
//

Функция ОбработатьОтветПровайдераOpenIDANY(ЗапросHTTP)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем переменные запроса
	
	Куки = ЗапросHTTP.Заголовки.Получить("Cookie");
	ИмяПользователя = ЗапросHTTP.ПараметрыЗапроса.Получить("openid.auth.user");
	ИдентификаторПроверки = ЗапросHTTP.ПараметрыЗапроса.Получить("openid.auth.uid");
	
	КодПубликации = ЗапросHTTP.ПараметрыURL.Получить("КодПубликации");
	ВерсияВебКабинетаНаКлиенте = ЗапросHTTP.ПараметрыURL.Получить("ВерсияAPI");
	ИмяСобытия = ЗапросHTTP.ПараметрыURL.Получить("ИмяСобытия");
		
	
	Если КодПубликации = Неопределено И ЗначениеЗаполнено(Куки) Тогда
		
		// Ищем код публикации
		
		КукиМассив = ОбщегоНазначенияСУКлиентСервер.РасщепитьСтроку(Куки, ";");
		
		Для каждого ЗначениеКуки Из КукиМассив Цикл
		
			ЗначениеКукиМассив = ОбщегоНазначенияСУКлиентСервер.РасщепитьСтроку(ЗначениеКуки, "=");
			
			Если ЗначениеКукиМассив.Количество() <> 2 Тогда
				Продолжить;
			КонецЕсли;
			
			Если СокрЛП(ЗначениеКукиМассив[0]) = "publication" Тогда
				КодПубликации = СокрЛП(ЗначениеКукиМассив[1]);
				Прервать;
			КонецЕсли;
		
		КонецЦикла;			
		
		// Ищем версию веб-кабинета на клиенте
		
		Если ЗначениеЗаполнено(КодПубликации) Тогда
		
			Для каждого ЗначениеКуки Из КукиМассив Цикл
			
				ЗначениеКукиМассив = ОбщегоНазначенияСУКлиентСервер.РасщепитьСтроку(ЗначениеКуки, "=");
				
				Если ЗначениеКукиМассив.Количество() <> 2 Тогда
					Продолжить;
				КонецЕсли;
				
				Если СокрЛП(ЗначениеКукиМассив[0]) = КодПубликации + "_" + "version" Тогда
					ВерсияВебКабинетаНаКлиенте = СокрЛП(ЗначениеКукиМассив[1]);
				КонецЕсли;
				
				Если СокрЛП(ЗначениеКукиМассив[0]) = КодПубликации + "_" + "event" Тогда
					ИмяСобытия = СокрЛП(ЗначениеКукиМассив[1]);
				КонецЕсли;
				
				
			КонецЦикла;	
			
		КонецЕсли;	
		
	КонецЕсли;
	
	// Создаем сессию
	
	СтруктураДанных = Новый Структура(
		"clientID, publication, version, login, event",
		ИдентификаторПроверки, КодПубликации, ВерсияВебКабинетаНаКлиенте, ИмяПользователя, ИмяСобытия);
	
	Если ИмяСобытия = "lookup" ИЛИ ИмяСобытия = "authentication" Тогда
	
		ОтветJSON = СоздатьСессиюПользователя("openid", СтруктураДанных);
		
	Иначе // check
		
		ОтветJSON = ПроверитьЗапросOpenID(СтруктураДанных);
		
		Если ОтветJSON = Неопределено Тогда
			ОтветJSON = ОтветКлиентуJSON(,Новый Структура("result, event", Истина, ИмяСобытия));
		КонецЕсли;		
		
	КонецЕсли;
	
	// Возвращаем результат
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПубликацииВебКабинетаСУ.Редакция
		|ИЗ
		|	Справочник.ПубликацииВебКабинетаСУ КАК ПубликацииВебКабинетаСУ
		|ГДЕ
		|	ПубликацииВебКабинетаСУ.Код = &КодПубликации";
	
	Запрос.УстановитьПараметр("КодПубликации", КодПубликации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		РедакцияПубликации = ВебКабинетСУ.Редакция();
	Иначе		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		РедакцияПубликации = ВыборкаДетальныеЗаписи.Редакция;
	КонецЕсли;
	
	Если РедакцияПубликации = Перечисления.РедакцииВебКабинетаСУ.Редакция20 Тогда
	
		ОтветСервераСтрока = "
		|<!DOCTYPE html>
		|<html>
		|	<head></head>
		|	<body onload=""parent.oAPI.openID.processResponse(document.getElementById('sessionData').textContent, '"+ИмяСобытия+"')"">
		|		<pre id=""sessionData"">%1</pre>
		|	</body>
		|</html>";
		
	Иначе
		
		ОтветСервераСтрока = "
		|<!DOCTYPE html>
		|<html>
		|	<head></head>
		|	<body onload=""parent.postMessage(document.getElementById('sessionData').textContent, '*')"">
		|		<pre id=""sessionData"">%1|%2</pre>
		|	</body>
		|</html>";
		
	КонецЕсли;
		
	ОтветСервераСтрока = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОтветСервераСтрока, ОтветJSON.ПолучитьТелоКакСтроку(), ИмяСобытия);
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/html");
	Ответ.УстановитьТелоИзСтроки(ОтветСервераСтрока);
	Возврат Ответ;
	
КонецФункции

// ОБЩИЕ
//

Функция ОтветКлиентуJSON(КодОшибки = "", Данные = NULL)
	
	ТекстСообщенияСтруктура = Новый Структура("error, data", КодОшибки, Данные);
	
	ТекстСообщения = ОбщегоНазначенияСУ.ДанныеВJSON(ТекстСообщенияСтруктура);

	Если ЗначениеЗаполнено(КодОшибки) Тогда
		Ответ = Новый HTTPСервисОтвет(400);
	Иначе
		Ответ = Новый HTTPСервисОтвет(200);
	КонецЕсли;
		
	Ответ.УстановитьТелоИзСтроки(ТекстСообщения);
	
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	ДобавитьЗаголовкиМежсайтовогоЗапроса(Ответ);
	
	Возврат Ответ;
	
КонецФункции

Функция ОтветКлиентуTEXT(КодОшибки = "", Данные = NULL)
	
	// В настоящее время используется один вариант,
	// С данными в виде текста, без ошибок
	
	ТекстСообщения = Строка(Данные); 
	
	Если ЗначениеЗаполнено(КодОшибки) Тогда
		Ответ = Новый HTTPСервисОтвет(400);
	Иначе
		Ответ = Новый HTTPСервисОтвет(200);
	КонецЕсли;
		
	Ответ.УстановитьТелоИзСтроки(ТекстСообщения);
	
	Ответ.Заголовки.Вставить("Content-Type", "text/plain");
	ДобавитьЗаголовкиМежсайтовогоЗапроса(Ответ);
	
	Возврат Ответ;
	
КонецФункции

Функция Перевод(Слово, Тип)
	
	//////////////////////////////////////////////
	// Создаем словарь
	
	Словарь = Новый ТаблицаЗначений;
	Словарь.Колонки.Добавить("EN");
	Словарь.Колонки.Добавить("RU");
	
	// Пользователи
	
	// Присутствуют разные варианты перевода
	// одно термина, для совместимости с разными
	// версиями и интеграциями.
	
	Если Тип = "Пользователи" Тогда
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "surname";
		НоваяСтрока.RU = "Фамилия";		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "LastName";
		НоваяСтрока.RU = "Фамилия";
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "LName";
		НоваяСтрока.RU = "Фамилия";
		
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "name";
		НоваяСтрока.RU = "Имя";		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "FirstName";
		НоваяСтрока.RU = "Имя";
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "FName";
		НоваяСтрока.RU = "Имя";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "patronymic";
		НоваяСтрока.RU = "Отчество";		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Patronymic";
		НоваяСтрока.RU = "Отчество";
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "SName";
		НоваяСтрока.RU = "Отчество";
		
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "mail";
		НоваяСтрока.RU = "ЭлектроннаяПочта";
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Email";
		НоваяСтрока.RU = "ЭлектроннаяПочта";		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "email";
		НоваяСтрока.RU = "ЭлектроннаяПочта";
		
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "password";
		НоваяСтрока.RU = "Пароль";
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Password";
		НоваяСтрока.RU = "Пароль";		
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "login";
		НоваяСтрока.RU = "Логин";				
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Login";
		НоваяСтрока.RU = "Логин";		
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "course";
		НоваяСтрока.RU = "Курс";		
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "id";
		НоваяСтрока.RU = "Идентификатор";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "code";
		НоваяСтрока.RU = "Код";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "publication";
		НоваяСтрока.RU = "Публикация";		
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "pinCode";
		НоваяСтрока.RU = "ПинКод";		
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "pinCodeOption";
		НоваяСтрока.RU = "ОпцияПинКода";		
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "additionalInformation";
		НоваяСтрока.RU = "ДополнительныеСведения";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "timeLimitation";
		НоваяСтрока.RU = "ОграничениеПоВремени";

		
	КонецЕсли;
	
	//////////////////////////////////////////////
	// Ищем термин
	
	СтрокаПеревода = Словарь.Найти(Слово, "EN");
	
	Если СтрокаПеревода = Неопределено Тогда
		Возврат Слово;
	Иначе
		Возврат СтрокаПеревода.RU;
	КонецЕсли;
	
КонецФункции

Функция СоздатьСессиюПользователя(ТипАутентификации, СтруктураДанных)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем основные проверки
	
	Если СтруктураДанных = Неопределено
		ИЛИ ТипАутентификации = Неопределено 
		ИЛИ НЕ СтруктураДанных.Свойство("version")
		ИЛИ НЕ СтруктураДанных.Свойство("clientID")
		ИЛИ НЕ ЗначениеЗаполнено(СтруктураДанных.clientID) Тогда
		
		Возврат ОтветКлиентуJSON("errorAuthorization");
		
	КонецЕсли;

	ВерсияКабинета = ВебКабинетСУ.ВерсияAPI();
	
	Если СтруктураДанных.version <> ВерсияКабинета Тогда
		Возврат ОтветКлиентуJSON("differentVersions");
	КонецЕсли;		
	
	НачатьТранзакцию();
	
	// Выполняем действия в зависимости от типа аутентификации
	
	Если ТипАутентификации = "standard" Тогда
		
		// Делаем проверки
		
		Если НЕ СтруктураДанных.Свойство("login")
			ИЛИ НЕ ЗначениеЗаполнено(СтруктураДанных.login) Тогда
			
			ОтменитьТранзакцию();
			Возврат ОтветКлиентуJSON("errorData");
			
		КонецЕсли;	
		
		// Ищем данные пользователя
		
		ДанныеПользователя = РегистрыСведений.ПользователиВебКабинетаСУ.ДанныеПользователя(СтруктураДанных.login);
		
		Если ДанныеПользователя = Неопределено Тогда
			ОтменитьТранзакцию();
			Возврат ОтветКлиентуJSON("noUser");
		КонецЕсли;		
		
		ДанныеПользователя.Права = ДанныеПользователя.Права.Получить();
		
		// Определяем корректность ключа
		
		Хеширование = Новый ХешированиеДанных(ХешФункция.SHA1);
		Хеширование.Добавить(СтруктураДанных.version + ДанныеПользователя.СохраняемоеЗначениеПароля + СтруктураДанных.clientID);
		
		КлючАвторизации = Base64Строка(Хеширование.ХешСумма);
		
		Если КлючАвторизации <> СтруктураДанных.key Тогда
			ОтменитьТранзакцию();
			Возврат ОтветКлиентуJSON("errorAuthorization");
		КонецЕсли;		
		
		// Активируем пин-код
		
		Если СтруктураДанных.Свойство("pinCode") И ЗначениеЗаполнено(СтруктураДанных.pinCode) Тогда
		
			//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
			
			ДанныеПинКода = РегистрыСведений.ВыданныеПинКодыСУО.КодДоступенДляАктивации(
				СтруктураДанных.pinCode,
				?(СтруктураДанных.Свойство("pinCodeOption"), СтруктураДанных.pinCodeOption, Неопределено)
			);
			
			Если ДанныеПинКода.ТребуетсяОпция Тогда
				
				// Наборы свойств соответствуют дополнительным свойствам настроек пользователя, например.				
				
				ДополнительныеСведения = Новый Массив();
				ДополнительныеСведения.Добавить(Справочники.СерииПинКодовСУО.СтруктураОпцийДляВебКабинета(ДанныеПинКода.Серия));
				
				Возврат ОтветКлиентуJSON(, Новый Структура("additionalInformation", ДополнительныеСведения));
				
			КонецЕсли;
			
			Если НЕ ДанныеПинКода.ДоступенДляАктивации Тогда
				Возврат ОтветКлиентуJSON(ДанныеПинКода.КодОшибки);
			КонецЕсли;
			
			РегистрыСведений.ВыданныеПинКодыСУО.АктивироватьКод(ДанныеПинКода.Серия, ДанныеПинКода.Код, ДанныеПользователя.Пользователь,, ДанныеПинКода.Опция, Истина);
			
			//----------------------------------//
			
			//--# КОНСТРУКТОР КУРСОВ ДОБАВИТЬ #--//

			// Возврат ОтветКлиентуJSON("noFunctionality");
			
			//----------------------------------//				
			
		КонецЕсли;

		
	КонецЕсли;
	
	Если ТипАутентификации = "cas" Тогда
		
		// Делаем проверки
		
		Если НЕ СтруктураДанных.Свойство("publication")
			ИЛИ НЕ ЗначениеЗаполнено(СтруктураДанных.publication) Тогда
			
			ОтменитьТранзакцию();
			Возврат ОтветКлиентуJSON("errorData");
			
		КонецЕсли;		
		
		// Получаем настройки публикации
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПубликацииВебКабинетаСУ.АдресСервераCAS,
			|	ПубликацииВебКабинетаСУ.ИмяСервисаCAS
			|ИЗ
			|	Справочник.ПубликацииВебКабинетаСУ КАК ПубликацииВебКабинетаСУ
			|ГДЕ
			|	ПубликацииВебКабинетаСУ.Код = &Публикация";
		
		Запрос.УстановитьПараметр("Публикация", СтруктураДанных.publication);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			ОтменитьТранзакцию();
			Возврат ОтветКлиентуJSON("errorData");
		КонецЕсли;
		
		НастройкиПубликации = РезультатЗапроса.Выбрать();		
		НастройкиПубликации.Следующий();
		
		// Получаем данные о пользователе с CAS сервера
		
		СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(
			НастройкиПубликации.АдресСервераCAS + "/serviceValidate?" +
			"service=" + НастройкиПубликации.ИмяСервисаCAS + "&" +
			"ticket=" + СтруктураДанных.clientID
		);		
		
		Если НРег(СтруктураURI.Схема) = "https" Тогда
			HTTPСоединение = Новый HTTPСоединение(СтруктураURI.Хост, СтруктураURI.Порт,,,, 10, Новый ЗащищенноеСоединениеOpenSSL()); 
		Иначе
			HTTPСоединение = Новый HTTPСоединение(СтруктураURI.Хост, СтруктураURI.Порт,,,, 10);
		КонецЕсли;
			
		HTTPЗапрос = Новый HTTPЗапрос(СтруктураURI.ПутьНаСервере);
		
		Попытка
			ОтветСервера = HTTPСоединение.Получить(HTTPЗапрос);
		Исключение
			ОтменитьТранзакцию();
			Возврат ОтветКлиентуJSON("errorHTTPConnect");  // Запрос не дошел до HTTP-Сервера
		КонецПопытки;
		
		Если ОтветСервера.КодСостояния = 200 Тогда
			
			ОтветСервераСтрока = ОтветСервера.ПолучитьТелоКакСтроку();
			
			ЧтениеXML = Новый ЧтениеXML;
			ЧтениеXML.УстановитьСтроку(ОтветСервераСтрока);
			
			СообщениеXDTOТип = ФабрикаXDTO.Тип("http://www.yale.edu/tp/cas", "serviceResponse");
			
			СообщениеXDTO = ФабрикаXDTO.Создать(СообщениеXDTOТип);
			
			СообщениеXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML); // Получаем модель XDTO сообщения
			
			СвойстваСообщенияXDTO = СообщениеXDTO.Свойства();
			
			Если ЕстьСвойствоXDTO(СвойстваСообщенияXDTO, "authenticationFailure")
				ИЛИ НЕ ЕстьСвойствоXDTO(СвойстваСообщенияXDTO, "authenticationSuccess") Тогда
				
				ОтменитьТранзакцию();
				Возврат ОтветКлиентуJSON("errorAuthorization");
				
			КонецЕсли;
			
		Иначе
			
			ОтменитьТранзакцию();
			Возврат ОтветКлиентуJSON("errorHTTPConnect");
			
		КонецЕсли;
		
		// Создаем нового пользователя или обновляем данные существующего
		
		АтрибутыПользователя = СообщениеXDTO.authenticationSuccess.attributes;
		СписокАтрибутовПользователя = СообщениеXDTO.authenticationSuccess.attributes.Свойства();
		
		Если НЕ ЗначениеЗаполнено(АтрибутыПользователя.uin) Тогда
			ОтменитьТранзакцию();
			Возврат ОтветКлиентуJSON("errorData");
		КонецЕсли;
		
		ИмяПользователя = АтрибутыПользователя.uin;
		ПолноеИмяПользователя = "";
		
		Если ЕстьСвойствоXDTO(СписокАтрибутовПользователя, "last_name") Тогда
			ПолноеИмяПользователя = ПолноеИмяПользователя + АтрибутыПользователя.last_name + " ";
		КонецЕсли;
		
		Если ЕстьСвойствоXDTO(СписокАтрибутовПользователя, "first_name") Тогда
			ПолноеИмяПользователя = ПолноеИмяПользователя + АтрибутыПользователя.first_name + " ";
		КонецЕсли;
		
		Если ЕстьСвойствоXDTO(СписокАтрибутовПользователя, "middle_name") Тогда
			ПолноеИмяПользователя = ПолноеИмяПользователя + АтрибутыПользователя.middle_name + " ";
		КонецЕсли;
		
		ПолноеИмяПользователя = СокрЛП(ПолноеИмяПользователя);
		
		Если НЕ ЗначениеЗаполнено(ПолноеИмяПользователя) Тогда
			ПолноеИмяПользователя = ИмяПользователя;
		КонецЕсли;
		
		ЭлектроннаяПочтаПользователя = "";
		
		Если ЕстьСвойствоXDTO(СписокАтрибутовПользователя, "email") Тогда
			ЭлектроннаяПочтаПользователя = АтрибутыПользователя.email;
		КонецЕсли;
		
		Пользователь = Пользователи.НайтиПоИмени(ИмяПользователя);
		
		Если Пользователь = Справочники.Пользователи.ПустаяСсылка() Тогда
			ОтменитьТранзакцию();
			Возврат ОтветКлиентуJSON("errorRegisterUser"); // Есть пользователь ИБ, но его нет в справочнике Пользователи
		КонецЕсли;		
		
		Если Пользователь = Неопределено Тогда
			Пользователь = ЗаписатьНовогоПользователя(Пользователь, ИмяПользователя, "", ПолноеИмяПользователя, ЭлектроннаяПочтаПользователя);
		КонецЕсли;
		
		// Формируем структуру с данными пользователя
		
		ПраваПользователя = ВебКабинетСУ.ПраваПользователя(Пользователь);
		
		ДанныеПользователя = Новый Структура("Пользователь, СохраняемоеЗначениеПароля, Права, Имя", Пользователь, "", ПраваПользователя, ИмяПользователя);

	КонецЕсли;		
	
	Если ТипАутентификации = "openid" Тогда		
		
		ОшибкаЗапросаOpenID = ПроверитьЗапросOpenID(СтруктураДанных);
		
		Если ОшибкаЗапросаOpenID <> Неопределено Тогда
			ОтменитьТранзакцию();
			Возврат ОшибкаЗапросаOpenID; 
		КонецЕсли;
		
		Пользователь = Пользователи.НайтиПоИмени(СтруктураДанных.login);
		
		Если Пользователь = Справочники.Пользователи.ПустаяСсылка() Тогда
			ОтменитьТранзакцию();
			Возврат ОтветКлиентуJSON("errorRegisterUser"); // Есть пользователь ИБ, но его нет в справочнике Пользователи			
		КонецЕсли;		
		
		Если Пользователь = Неопределено Тогда
			Пользователь = ЗаписатьНовогоПользователя(Пользователь, СтруктураДанных.login, "", СтруктураДанных.login, "");
		КонецЕсли;
		
		// Формируем структуру с данными пользователя
		
		ПраваПользователя = ВебКабинетСУ.ПраваПользователя(Пользователь);
		
		ДанныеПользователя = Новый Структура("Пользователь, СохраняемоеЗначениеПароля, Права, Имя", Пользователь, "", ПраваПользователя, СтруктураДанных.login);
		
	КонецЕсли;
	
	// Ищем старую сессию с такими же параметрами
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СессииВебКабинетаСУ.Идентификатор
		|ИЗ
		|	РегистрСведений.СессииВебКабинетаСУ КАК СессииВебКабинетаСУ
		|ГДЕ
		|	СессииВебКабинетаСУ.ИдентификаторКлиента = &ИдентификаторКлиента
		|	И СессииВебКабинетаСУ.Пользователь = &Пользователь";

	Запрос.УстановитьПараметр("ИдентификаторКлиента", СтруктураДанных.clientID);
	Запрос.УстановитьПараметр("Пользователь", ДанныеПользователя.Пользователь);

	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда
		ОтменитьТранзакцию();
		Возврат ОтветКлиентуJSON("errorDoubleAuthorization");
	КонецЕсли;
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	// Проверяем возможность входа
	
	Если НЕ ОбучениеСУО.ПользователюРазрешенВход(ДанныеПользователя.Пользователь) Тогда
		ОтменитьТранзакцию();
		Возврат ОтветКлиентуJSON("errorDateAuthorization", РегистрыСведений.ВремяДоступаПользователейСУО.ДатыДоступа(ДанныеПользователя.Пользователь));
	КонецЕсли;
	
	//----------------------------------//
	
	// Создаем новую сессию
	
	ДанныеНовойСессии = РегистрыСведений.СессииВебКабинетаСУ.СоздатьСессию(ДанныеПользователя.Пользователь, СтруктураДанных.clientID, ДанныеПользователя.СохраняемоеЗначениеПароля, ДанныеПользователя.Права, ТипАутентификации);	
	Уведомление = "";
	ЭтоОбразовательнаяОрганизация = Ложь;
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	ЭтоОбразовательнаяОрганизация = ПолучитьФункциональнуюОпцию("ОбразовательнаяОрганизацияОО");
	
	// Получаем уведомление
	
	Если СтруктураДанных.Свойство("usePinCode")
		И СтруктураДанных.usePinCode Тогда
		
		Уведомление = РегистрыСведений.ВыданныеПинКодыСУО.ПолучитьТекстУведомленияИЗапомнить(ДанныеПользователя.Пользователь);
		
	КонецЕсли;
	
	//----------------------------------//
	
	// Возвращаем идентификатор новой сессии
	
	ЗафиксироватьТранзакцию();
	
	ИмяСобытия = "";
	СтруктураДанных.Свойство("event", ИмяСобытия);
	
	Возврат ОтветКлиентуJSON(,
		Новый Структура("
		|session,
		|user,
		|date,
		|permissions,
		|login,
		|typeSession,
		|notification,
		|eduOrganization,
		|clientID,
		|event",
		ДанныеНовойСессии.ИдентификаторНовойСессии,
		Строка(ДанныеПользователя.Пользователь.УникальныйИдентификатор()),
		ДанныеНовойСессии.ДатаНачалаСессии,
		ДанныеПользователя.Права,
		ДанныеПользователя.Имя,
		ТипАутентификации,
		Уведомление,
		ЭтоОбразовательнаяОрганизация,
		СтруктураДанных.clientID,
		ИмяСобытия)
	);
	
	
КонецФункции

Функция ПроверитьЗапросOpenID(СтруктураДанных)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки
	
	Если НЕ СтруктураДанных.Свойство("publication")
		ИЛИ НЕ ЗначениеЗаполнено(СтруктураДанных.publication) Тогда
		
		Возврат ОтветКлиентуJSON("errorData");
		
	КонецЕсли;			
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПубликацииВебКабинета.АдресПровайдераOpenID КАК АдресПровайдера
		|ИЗ
		|	Справочник.ПубликацииВебКабинетаСУ КАК ПубликацииВебКабинета
		|ГДЕ
		|	ПубликацииВебКабинета.Код = &КодПубликации
		|	И ПубликацииВебКабинета.ДоступнаАутентификацияOpenID = ИСТИНА";
	
	Запрос.УстановитьПараметр("КодПубликации", СтруктураДанных.publication);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	НастройкиПубликации = РезультатЗапроса.Выбрать();		
	НастройкиПубликации.Следующий();	
	
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(
		НастройкиПубликации.АдресПровайдера + "?cmd=check"
	);			
	
	Если НРег(СтруктураURI.Схема) = "https" Тогда
		HTTPСоединение = Новый HTTPСоединение(СтруктураURI.Хост, СтруктураURI.Порт,,,, 10, Новый ЗащищенноеСоединениеOpenSSL()); 
	Иначе
		Возврат ОтветКлиентуJSON("errorHTTPConnect"); // Для OpenID только SSL
	КонецЕсли;
		
	HTTPЗапрос = Новый HTTPЗапрос(СтруктураURI.ПутьНаСервере);
	
	ТелоЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("openid.auth.user=%1&openid.auth.uid=%2", СтруктураДанных.login, СтруктураДанных.clientID);
	
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);	
	
	Попытка
		ОтветСервера = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		Возврат ОтветКлиентуJSON("errorHTTPConnect");  // Запрос не дошел до HTTP-Сервера
	КонецПопытки;
	
	Если ОтветСервера.КодСостояния <> 200 Тогда
		Возврат ОтветКлиентуJSON("errorAuthorization");
	КонецЕсли;
		
	ОтветСервераСтрока = СокрЛП(ОтветСервера.ПолучитьТелоКакСтроку());
	
	Если ОтветСервераСтрока <> "is_valid:true" Тогда			
		Возврат ОтветКлиентуJSON("errorAuthorization");			
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ЗаписатьНовогоПользователя(Пользователь = Неопределено, Логин, Пароль, ПолноеИмя, ЭлектроннаяПочта, АутентификацияВебКабинета = Неопределено, Знач Комментарий = "", КонтактнаяИнформация = Неопределено, ДополнительныеРеквизиты = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Попытка
		
		// Необходимость транзакции обусловлена тем,
		// что пользователь записывается перед сохранением
		// некоторых данных. Если при сохранении доп. данных
		// произойдет ошибка, то откатится вся транзакция
		// и пользователь не запишется.
		
		Если Пользователь = Неопределено Тогда
			ПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
		Иначе
			ПользовательОбъект = Пользователь.ПолучитьОбъект();
		КонецЕсли;	
			
		ПользовательОбъект.Наименование = ПолноеИмя;
		ПользовательОбъект.Комментарий  = Комментарий;
		
		ОписаниеПользователяИБ = Новый Структура;
		ОписаниеПользователяИБ.Вставить("Действие", "Записать");
		ОписаниеПользователяИБ.Вставить("ВходВПрограммуРазрешен", Ложь);
		ОписаниеПользователяИБ.Вставить("Пароль", Пароль);
		ОписаниеПользователяИБ.Вставить("Имя", Логин);
		ОписаниеПользователяИБ.Вставить("ПолноеИмя", ПолноеИмя);
		
		//--# КОНСТРУКТОР КУРСОВ ДОБАВИТЬ #--//
		
		//МассивРолей = Новый Массив;
		//МассивРолей.Добавить("УченикКК"); 
		//
		//ОписаниеПользователяИБ.Вставить("Роли", МассивРолей);
		
		//----------------------------------//	
		
		ПользовательОбъект.ДополнительныеСвойства.Вставить(
			"ОписаниеПользователяИБ", ОписаниеПользователяИБ);
			
		Если АутентификацияВебКабинета <> Неопределено Тогда
			ПользовательОбъект.ДополнительныеСвойства.Вставить("АутентификацияВебКабинета", АутентификацияВебКабинета);
		КонецЕсли;
		
		ДанныеЗаполненияКИ = УправлениеКонтактнойИнформацией.НоваяКонтактнаяИнформация(Ложь);	
		
		Если КонтактнаяИнформация <> Неопределено Тогда
				
			Для каждого Строка Из КонтактнаяИнформация Цикл				
				СтрокаЗаполнения = ДанныеЗаполненияКИ.Добавить();
				СтрокаЗаполнения.Вид = Строка.ВидКонтактнойИнформации;
				СтрокаЗаполнения.Представление = СокрЛП(Строка.Значение);							
			КонецЦикла;									
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭлектроннаяПочта)
			И ДанныеЗаполненияКИ.Найти(Справочники.ВидыКонтактнойИнформации.EmailПользователя, "Вид") = Неопределено Тогда
			
			СтрокаЗаполнения = ДанныеЗаполненияКИ.Добавить();
			СтрокаЗаполнения.Вид = Справочники.ВидыКонтактнойИнформации.EmailПользователя;
			СтрокаЗаполнения.Представление = СокрЛП(ЭлектроннаяПочта);

		КонецЕсли;
		
		Если ДанныеЗаполненияКИ.Количество() > 0 Тогда
			УправлениеКонтактнойИнформацией.УстановитьКонтактнуюИнформациюОбъекта(ПользовательОбъект, ДанныеЗаполненияКИ, Истина);	
		КонецЕсли;
		
		ПользовательОбъект.Записать();
		
		//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//

		Если ДополнительныеРеквизиты <> Неопределено Тогда
			
			ДанныеДополнительныхРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ДополнительныеРеквизиты.ВыгрузитьКолонку("Реквизит"), "ЭтоДополнительноеСведение, ТипЗначения");
			
			Для каждого ЭлементСоответствия Из ДанныеДополнительныхРеквизитов Цикл
				
				ЗначениеРеквизита = ДополнительныеРеквизиты.Найти(ЭлементСоответствия.Ключ, "Реквизит").Значение;
				
				ОписаниеТиповЗначенияРеквизита = ЭлементСоответствия.Значение.ТипЗначения;
				
				Если ОписаниеТиповЗначенияРеквизита.СодержитТип(Тип("СправочникСсылка.ЗначенияСвойствОбъектов")) Тогда
					
					Попытка
						ЗначениеРеквизита = Справочники.ЗначенияСвойствОбъектов.ПолучитьСсылку(Новый УникальныйИдентификатор(ЗначениеРеквизита));
					Исключение
						ЗначениеРеквизита = Неопределено;
					КонецПопытки;				
					
				ИначеЕсли ОписаниеТиповЗначенияРеквизита.СодержитТип(Тип("СправочникСсылка.ЗначенияСвойствОбъектовИерархия")) Тогда
					
					Попытка
						ЗначениеРеквизита = Справочники.ЗначенияСвойствОбъектовИерархия.ПолучитьСсылку(Новый УникальныйИдентификатор(ЗначениеРеквизита));
					Исключение
						ЗначениеРеквизита = Неопределено;
					КонецПопытки;				
					
				ИначеЕсли ОписаниеТиповЗначенияРеквизита.СодержитТип(Тип("Булево")) Тогда
					
					ЗначениеРеквизита = ОбщегоНазначенияСУКлиентСервер.СтрокаВБулево(ЗначениеРеквизита);
					
				ИначеЕсли ОписаниеТиповЗначенияРеквизита.СодержитТип(Тип("Дата")) Тогда
					
					ЗначениеРеквизита = ОбщегоНазначенияСУКлиентСервер.СтрокаISO8601ВДату(ЗначениеРеквизита);				
					
				Иначе
					
					ЗначениеРеквизита = ОписаниеТиповЗначенияРеквизита.ПривестиЗначение(ЗначениеРеквизита);
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
				
					Если ЭлементСоответствия.Значение.ЭтоДополнительноеСведение Тогда
						
						МенеджерЗаписи = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
						
						МенеджерЗаписи.Объект = ПользовательОбъект.Ссылка;
						МенеджерЗаписи.Свойство = ЭлементСоответствия.Ключ;
						МенеджерЗаписи.Значение = ЗначениеРеквизита;
						
						МенеджерЗаписи.Записать(Истина);				
						
					Иначе
						
						НоваяСтрокаДР = ПользовательОбъект.ДополнительныеРеквизиты.Добавить();
						
						НоваяСтрокаДР.Свойство = ЭлементСоответствия.Ключ;
						НоваяСтрокаДР.Значение = ЗначениеРеквизита;
						
					КонецЕсли;			
					
				КонецЕсли;
					
			КонецЦикла;
			
			ПользовательОбъект.Записать();
			
		КонецЕсли;
		
			
		//----------------------------------//	
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//

	МассивПараметровФЗ = Новый Массив;
	МассивПараметровФЗ.Добавить(ПользовательОбъект.Ссылка);
	МассивПараметровФЗ.Добавить(Истина);
	
	ФоновыеЗадания.Выполнить("ВебКабинетСУО.ОбновитьДанныеПользователяВебКабинета", МассивПараметровФЗ);	
		
	//----------------------------------//	
	
	Возврат ПользовательОбъект.Ссылка;	
	
КонецФункции

Процедура ИзменитьПарольПользователя(Пользователь, Пароль)	
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПользовательОбъект = Пользователь.ПолучитьОбъект();	
	
	ОписаниеПользователяИБ = Новый Структура;
	ОписаниеПользователяИБ.Вставить("Пароль", Пароль);
	ОписаниеПользователяИБ.Вставить("Действие", "Записать");
	
	ПользовательОбъект.ДополнительныеСвойства.Вставить(
		"ОписаниеПользователяИБ", ОписаниеПользователяИБ);	
	
	ПользовательОбъект.ДополнительныеСвойства.Вставить("АутентификацияВебКабинета", Истина);
	
	ПользовательОбъект.Записать();	
	
КонецПроцедуры

Функция ЕстьСвойствоXDTO(СписокСвойствXDTO, ИмяСвойства)
	Возврат ?(СписокСвойствXDTO.Получить(ИмяСвойства) = Неопределено, Ложь, Истина)	
КонецФункции

Функция РазрешитьМежсайтовыеЗапросыOPTIONS(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	ДобавитьЗаголовкиМежсайтовогоЗапроса(Ответ, Истина);
	Возврат Ответ;
	
КонецФункции

Процедура ДобавитьЗаголовкиМежсайтовогоЗапроса(Ответ, ПроверитьРазрешение = Ложь)
	Если НЕ ПроверитьРазрешение ИЛИ Константы.РазрешитьЗапросыКСервисамСДругихДоменовСУ.Получить() = Истина Тогда
		Ответ.Заголовки.Вставить("Access-Control-Allow-Origin", "*");
	    Ответ.Заголовки.Вставить("Access-Control-Allow-Methods", "GET, PUT, POST, DELETE, HEAD, OPTIONS");
	    Ответ.Заголовки.Вставить("Access-Control-Allow-Credentials", "true");
	    Ответ.Заголовки.Вставить("Access-Control-Allow-Headers", "X-Requested-With, origin, content-type, accept");
	КонецЕсли;
КонецПроцедуры








