#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Функция ПолучитьВидОбъектаЗапроса(ОбъектЗапроса) Экспорт
	
	Если ТипЗнч(ОбъектЗапроса) = Тип("СправочникСсылка.КаталогПрограммОбученияСУО") Тогда
		Возврат "Программа обучения";
	КонецЕсли;
	
	Если ТипЗнч(ОбъектЗапроса) = Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда
		ВидМероприятия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектЗапроса, "Вид");
		Возврат Строка(ВидМероприятия);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

#КонецЕсли
