#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	// {{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Движения.ЗапросыНаОбучениеСУО.Записывать = Истина;
	// регистр ЗапросыНаОбучениеСУО 
	Движение = Движения.ЗапросыНаОбучениеСУО.Добавить();
	Движение.Период = Дата;
	Движение.ОбъектЗапроса = ОбъектЗапроса;
	Движение.Пользователь = Пользователь;
	Движение.ЗапросРассмотрен = ЗапросРассмотрен;
	Движение.ДатаПодачи = ДатаПодачи;

	// }}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти

#КонецЕсли

