#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
// Веб-кабинет
//

Процедура ОбновитьДанныеВебКабинета(Раздел, ДополнительныеДанные=Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВсеПользователиРаздела = ПользователиРаздела(Раздел);
	
	Для каждого Пользователь Из ВсеПользователиРаздела Цикл
		
		Параметры = Новый Массив;
		Параметры.Добавить(Пользователь);
		Параметры.Добавить(Неопределено);
		
		ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных(
				"РегистрСведений.БиблиотекаПользователейСУО",
				"ВебКабинетСУ.ОбновитьДанныеОбъекта", Параметры, Строка(Пользователь.УникальныйИдентификатор()));
	
	КонецЦикла;
	
КонецПроцедуры

Функция ПользователиРаздела(Раздел) Экспорт
		
	УстановитьПривилегированныйРежим(Истина);
	
	Библиотека = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Раздел, "Владелец");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	БиблиотекаПользователейСУО.Пользователь
		|ИЗ
		|	РегистрСведений.БиблиотекаПользователейСУО КАК БиблиотекаПользователейСУО
		|ГДЕ
		|	БиблиотекаПользователейСУО.Библиотека = &Библиотека";
	
	Запрос.УстановитьПараметр("Библиотека", Библиотека);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
	
КонецФункции

Процедура ЗаполнитьДеревоМеток(ДеревоМеток, Библиотека, Пользователь) Экспорт
	
	// Получаем данные о метках

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СправочникСтруктураБиблиотекиПользователейСУО.Ссылка КАК Ссылка,
		|	СправочникСтруктураБиблиотекиПользователейСУО.Наименование,
		|	ВЫБОР
		|		КОГДА ИСТИНА
		|			ТОГДА 0
		|	КОНЕЦ КАК Картинка,
		|	СправочникСтруктураБиблиотекиПользователейСУО.РеквизитДопУпорядочивания КАК Порядок,
		|	СправочникСтруктураБиблиотекиПользователейСУО.Видимость.(
		|		Ссылка,
		|		НомерСтроки,
		|		Пользователь
		|	) КАК Видимость,
		|	СправочникСтруктураБиблиотекиПользователейСУО.Скрыть
		|ИЗ
		|	Справочник.СтруктураБиблиотекиПользователейСУО КАК СправочникСтруктураБиблиотекиПользователейСУО
		|ГДЕ
		|	СправочникСтруктураБиблиотекиПользователейСУО.ПометкаУдаления = ЛОЖЬ
		|	И СправочникСтруктураБиблиотекиПользователейСУО.Владелец = &ТекущаяБиблиотека
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок ИЕРАРХИЯ";

	Запрос.УстановитьПараметр("ТекущаяБиблиотека", Библиотека);
		
	Результат = Запрос.Выполнить();
	
	ДеревоМетокВыгрузка = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);

	КореньДерева = ДеревоМеток.Строки.Добавить();		
	КореньДереваСтруктура = Новый Структура("Ссылка, Наименование, Картинка, Порядок", Справочники.СтруктураБиблиотекиПользователейСУО.ПустаяСсылка(), НСтр("ru = 'Корень'"), -1, 0);
		
	ЗаполнитьЗначенияСвойств(КореньДерева, КореньДереваСтруктура);
	
	ДобавитьМеткиВДерево(КореньДерева.Строки, ДеревоМетокВыгрузка.Строки, Пользователь);	
	
КонецПроцедуры

Процедура ДобавитьМеткиВДерево(СтрокиДерева, ДобавляемыеСтрокиДерева, Пользователь)
	
	Для каждого Строка Из ДобавляемыеСтрокиДерева Цикл
		
		Если Строка.Видимость.Количество() > 0
			И Строка.Видимость.Найти(Пользователь, "Пользователь") = Неопределено Тогда
			
			Продолжить; // Нет прав
			
		КонецЕсли;
		
		Если Строка.Скрыть Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрока = СтрокиДерева.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		ДобавитьМеткиВДерево(НоваяСтрока.Строки, Строка.Строки, Пользователь); // Рекурсия
	
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли