#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		
		// Удаляем все записи из регистра БиблиотекаПользователейМеткиРесурсовСУО,
		// где используется данная метка.
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	БиблиотекаПользователейМеткиРесурсовСУО.Пользователь,
		|	БиблиотекаПользователейМеткиРесурсовСУО.Ресурс,
		|	БиблиотекаПользователейМеткиРесурсовСУО.Фрагмент
		|ИЗ
		|	РегистрСведений.БиблиотекаПользователейМеткиРесурсовСУО КАК БиблиотекаПользователейМеткиРесурсовСУО
		|ГДЕ
		|	БиблиотекаПользователейМеткиРесурсовСУО.Метка = &Метка";
		
		Запрос.УстановитьПараметр("Метка", Ссылка);
		
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.БиблиотекаПользователейМеткиРесурсовСУО.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Пользователь.Установить(ВыборкаДетальныеЗаписи.Пользователь);
			НаборЗаписей.Отбор.Ресурс.Установить(ВыборкаДетальныеЗаписи.Ресурс);
			НаборЗаписей.Отбор.Фрагмент.Установить(ВыборкаДетальныеЗаписи.Фрагмент);
			
			НаборЗаписей.Записать();
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ВебКабинетСУ.Используется() Тогда
		
		ДополнительныеСвойства.Вставить("РаспределитьОбновлениеВебКабинетаПоПользователям", Истина);
		ДополнительныеСвойства.Вставить("ИмяОбъектаМетаданныхОбновленияВебКабинета", "РегистрСведений.БиблиотекаПользователейСУО");
		
		ДополнительныеСвойства.Вставить("ПользователиДоЗаписи",
			Новый Массив);
			
		ДополнительныеСвойства.Вставить("ПользователиПослеЗаписи",
			Справочники.СтруктураБиблиотекиПользователейСУО.ПользователиРаздела(Ссылка));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
	
	
#КонецЕсли
