#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ЗначениеВЧисло(Значение) Экспорт
	
	Если Значение = Перечисления.ВариантыОтображенияВремениИзученияЭлектронногоРесурсаСУО.НеПоказывать Тогда
		Возврат 1;
	КонецЕсли;
	
	Если Значение = Перечисления.ВариантыОтображенияВремениИзученияЭлектронногоРесурсаСУО.ПоказыватьВАстрономическихЧасах Тогда
		Возврат 2;
	КонецЕсли;
	
	Если Значение = Перечисления.ВариантыОтображенияВремениИзученияЭлектронногоРесурсаСУО.ПоказыватьВУчебныхЧасах Тогда
		Возврат 3;
	КонецЕсли;
		
	Возврат 1;
	
КонецФункции

Функция ЧислоВЗначение(ЗначениеЧисло) Экспорт
	
	Если ЗначениеЧисло = 1 Тогда
		Возврат Перечисления.ВариантыОтображенияВремениИзученияЭлектронногоРесурсаСУО.НеПоказывать;
	КонецЕсли;
	
	Если ЗначениеЧисло = 2 Тогда
		Возврат Перечисления.ВариантыОтображенияВремениИзученияЭлектронногоРесурсаСУО.ПоказыватьВАстрономическихЧасах;
	КонецЕсли;
	
	Если ЗначениеЧисло = 3 Тогда
		Возврат Перечисления.ВариантыОтображенияВремениИзученияЭлектронногоРесурсаСУО.ПоказыватьВУчебныхЧасах;
	КонецЕсли;	
	
	Возврат Перечисления.ВариантыОтображенияВремениИзученияЭлектронногоРесурсаСУО.ПустаяСсылка();	
	
КонецФункции

#КонецЕсли
