
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Организации") Тогда
		ИмяОтбора = "Организация";
	КонецЕсли;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ПодразделенияОрганизацииСУО") Тогда
		ИмяОтбора = "ПодразделениеОрганизации";
	КонецЕсли;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ПодразделенияПредприятияСУО") Тогда
		ИмяОтбора = "ПодразделениеПредприятия";
	КонецЕсли;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ДолжностиСУО") Тогда
		ИмяОтбора = "Должность";
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура(ИмяОтбора, ПараметрКоманды);
	
	ОткрытьФорму("РегистрСведений.СотрудникиСУО.Форма.ФормаСпискаСотрудников", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
