#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

Процедура ОрганизаторыПользователя(Пользователь, Организаторы) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОрганизаторыСУО.Ссылка КАК Организатор
		|ИЗ
		|	Справочник.ОрганизаторыСУО КАК ОрганизаторыСУО
		|ГДЕ
		|	ОрганизаторыСУО.ПометкаУдаления = ЛОЖЬ
		|	И ОрганизаторыСУО.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Организаторы.Найти(ВыборкаДетальныеЗаписи.Организатор) = Неопределено Тогда
			Организаторы.Добавить(ВыборкаДетальныеЗаписи.Организатор);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЭлементИмеетОрганизаторов(СсылкаНаЭлемент) Экспорт
	
	Если СсылкаНаЭлемент = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МетаданныеЭлемента = СсылкаНаЭлемент.Метаданные();
	
	Если МетаданныеЭлемента.ТабличныеЧасти.Найти("Организаторы") = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Процедура ОрганизаторыЭлемента(СсылкаНаЭлемент, Организаторы) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭлементИмеетОрганизаторов(СсылкаНаЭлемент) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОрганизаторыЭлемента.Организатор
		|ИЗ
		|	%1.Организаторы КАК ОрганизаторыЭлемента
		|ГДЕ
		|	ОрганизаторыЭлемента.Ссылка = &СсылкаНаЭлемент";		
		
	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Запрос.Текст, ОбщегоНазначения.ИмяТаблицыПоСсылке(СсылкаНаЭлемент));	
		
	Запрос.УстановитьПараметр("СсылкаНаЭлемент", СсылкаНаЭлемент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Организатор)
			И Организаторы.Найти(ВыборкаДетальныеЗаписи.Организатор) = Неопределено Тогда
			
			Организаторы.Добавить(ВыборкаДетальныеЗаписи.Организатор);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьОрганизаторы(ТабличнаяЧасть, Организаторы) Экспорт
	
	Для каждого Организатор Из Организаторы Цикл
	
		Если ТипЗнч(Организатор) = Тип("СправочникСсылка.ОрганизаторыСУО")
			И ЗначениеЗаполнено(Организатор)
			И ТабличнаяЧасть.Найти(Организатор, "Организатор") = Неопределено Тогда
			
			НоваяСтрока = ТабличнаяЧасть.Добавить();			
			НоваяСтрока.Организатор = Организатор;
			
		КонецЕсли;		
	
	КонецЦикла;		
	
КонецПроцедуры


// Веб-кабинет

Процедура ОбновитьДанныеВебКабинета(Организатор, ДополнительныеДанные=Неопределено) Экспорт
	


	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеОрганизатора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организатор, "Ссылка, ПометкаУдаления, ДляВсех, Пользователь, Наименование, Описание");
	
	Зависимости = Новый Массив;
	
	РегистрыСведений.ДанныеВебКабинетаСУО_ОН.УдалитьДанные(Организатор, Перечисления.ТипыДанныхВебКабинетаСУО.Организатор);	
	РегистрыСведений.ДанныеВебКабинетаСУО_ПН.УдалитьДанные(Организатор, Перечисления.ТипыДанныхВебКабинетаСУО.Организатор);		
	РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.УдалитьДанные(Организатор, "Справочник.ОрганизаторыСУО");
	
	Если НЕ ДанныеОрганизатора.ПометкаУдаления Тогда
		
		ОрганизаторJSON = ОрганизаторJSON(ДанныеОрганизатора, Зависимости);
		
		Если ДанныеОрганизатора.ДляВсех Тогда
			
			РегистрыСведений.ДанныеВебКабинетаСУО_ОН.ДобавитьДанные(Перечисления.ТипыДанныхВебКабинетаСУО.Организатор, Организатор, ОрганизаторJSON, Перечисления.ФорматыВебДанныхСУ.json);
			
		Иначе
	
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ОрганизаторыСУОВидимость.Пользователь
				|ИЗ
				|	Справочник.ОрганизаторыСУО.Видимость КАК ОрганизаторыСУОВидимость
				|ГДЕ
				|	ОрганизаторыСУОВидимость.Ссылка = &Организатор";
			
			Запрос.УстановитьПараметр("Организатор", Организатор);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВидимостьОрганизатора = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Пользователь");
			
			Для каждого Пользователь Из ВидимостьОрганизатора Цикл
				РегистрыСведений.ДанныеВебКабинетаСУО_ПН.ДобавитьДанные(Пользователь, Перечисления.ТипыДанныхВебКабинетаСУО.Организатор, Организатор, ОрганизаторJSON, Перечисления.ФорматыВебДанныхСУ.json);
			КонецЦикла;			
			
		КонецЕсли;
		
		// Зависимости
		
		РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.ДобавитьДанные(Организатор, "Справочник.ОрганизаторыСУО", Зависимости);
		
	КонецЕсли;
	
	
	
КонецПроцедуры

Функция ОрганизаторJSON(ДанныеОрганизатора, Зависимости=Неопределено) 
	
	ОписаниеОрганизатора = Новый Структура("
	|Наименование,
	|Идентификатор,
	|Пользователь,
	|Описание",
	ДанныеОрганизатора.Наименование,
	Строка(ДанныеОрганизатора.Ссылка.УникальныйИдентификатор()),
	Строка(ДанныеОрганизатора.Пользователь.УникальныйИдентификатор()),
	ДанныеОрганизатора.Описание);
	
	Если Зависимости <> Неопределено Тогда
		Зависимости.Добавить(ДанныеОрганизатора.Пользователь);
	КонецЕсли;	
	
	Возврат ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеОрганизатора);
	
КонецФункции

#КонецЕсли
