#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)	
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	ДатаИзменения = ТекущаяДата();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)	
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	// Не требуется
	
	// ВАЖНО. Нельзя использовать события
	// ПриЗаписи организатора для обновления
	// его документов. Таких документов может быть
	// очень много и работа программы может сильно
	// замедлится.		
		
КонецПроцедуры

#КонецОбласти


