
#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Курс(Команда)
	Закрыть();
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("Тип, Родитель", ПредопределенноеЗначение("Перечисление.ТипыЭлектронныхРесурсовСУЗ.ЭлектронныйКурс"), РодительЭлектронногоРесурса()));
	ОткрытьФорму("Справочник.СводыЗнанийСУЗ.Форма.ФормаЭлемента", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура Тест(Команда)
	Закрыть();
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("Тип, Родитель", ПредопределенноеЗначение("Перечисление.ТипыЭлектронныхРесурсовСУЗ.Тест"), РодительЭлектронногоРесурса()));
	ОткрытьФорму("Справочник.СводыЗнанийСУЗ.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Функция РодительЭлектронногоРесурса()
	
	РодительЭР = Неопределено;
	Если ТипЗнч(ВладелецФормы) = Тип("ТаблицаФормы") Тогда
		РодительЭР = ОбщегоНазначенияСУКлиент.ВыделеннаяГруппаТаблицы(ВладелецФормы);
	КонецЕсли;
	Возврат РодительЭР;
	
КонецФункции

#КонецОбласти


