

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Пользователь) Тогда
		Пользователь = Параметры.Пользователь;
	Иначе
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Подчиненные.Параметры.УстановитьЗначениеПараметра("Пользователь", Пользователь);
	Подчиненные.Параметры.УстановитьЗначениеПараметра("ПустойУникальныйИдентификатор", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	ЕстьПравоУчастияВОбсуждениях = УправлениеДоступом.ЕстьРоль("ЛичныйКабинетУниверсальныйСервисОбщенияСУО");
	
	Если ЕстьПравоУчастияВОбсуждениях Тогда
		
		Элементы.НаписатьПодчиненному.Видимость = Истина;
		
	Иначе
		
		Элементы.НаписатьПодчиненному.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура НаписатьПодчиненному(Команда)
	
	ТекущиеДанные = Элементы.Подчиненные.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПараметрыФормы = Новый Структура("Контекст", Пользователь);
	ОткрытьФорму("Документ.СообщениеСУО.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ <Наименование>


