#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	

#Область ПрограммныйИнтерфейс

// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Заполняет табличную часть ЗначенияПеременных
// на основании шаблона рассылки и основания
//
Процедура ЗаполнитьПеременные() Экспорт
	
	ЗначенияПеременных.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Шаблон) ИЛИ ТипЗнч(Шаблон) <> Тип("СправочникСсылка.ШаблоныСообщенийСУО") Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаПеременных = Справочники.ШаблоныСообщенийСУО.Переменные(Шаблон);	
	
	Для каждого Строка Из ТаблицаПеременных Цикл
		
		НоваяСтрокаТЧ = ЗначенияПеременных.Добавить();
		НоваяСтрокаТЧ.Переменная = Строка.Переменная;
		
		Основания = Новый Массив();
		Основания.Добавить(Основание);
		Основания.Добавить(ОснованиеАвтоматическойРассылки);
		
		Если ТипЗнч(Основание) = Тип("СправочникСсылка.ОтборыПользователейСУО")
			И ТипЗнч(ОснованиеАвтоматическойРассылки) = Тип("СправочникСсылка.Пользователи") Тогда
			
			// Если рассылка сформировалась через отбор пользователей,
			// то пытаемся однозначно определить сценарий обучения и прохождения обучения
			// того пользователя, для которого формируется рассылка. Если это возможно,
			// то добавляем их в массив основание. Это позволит заполнить переменные,
			// связанные с обучением при формировании сообщения по шаблону.
			
			ПрохождениеОбучения = Неопределено;
			ОтборПользователей = Основание;
			Учащийся = ОснованиеАвтоматическойРассылки;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ОтборыПользователейСУООбучение.СценарийОбучения КАК ОбучениеВОтборе
				|ИЗ
				|	Справочник.ОтборыПользователейСУО.Обучение КАК ОтборыПользователейСУООбучение
				|ГДЕ
				|	ОтборыПользователейСУООбучение.Ссылка = &ОтборПользователей";
			
			Запрос.УстановитьПараметр("ОтборПользователей", ОтборПользователей);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда			
				
				ВыборкаДетальныеЗаписи.Следующий();
				ОбучениеВОтборе = ВыборкаДетальныеЗаписи.ОбучениеВОтборе;
				
				Основания.Добавить(ОбучениеВОтборе);
				
				Если ТипЗнч(ОбучениеВОтборе) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
					
					СценарийОбучения = Документы.ПроведениеОбученияСУО.СценарийОбучения(ОбучениеВОтборе);
					ПрохождениеОбучения = Документы.ПроведениеОбученияСУО.ПрохождениеОбучения(ОбучениеВОтборе, СценарийОбучения, Учащийся);
					
				ИначеЕсли ТипЗнч(ОбучениеВОтборе) = Тип("СправочникСсылка.ВидыМероприятийСУО") Тогда
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ ПЕРВЫЕ 1
						|	УчастникиОбученияСУО.Регистратор КАК ПрохождениеОбучения,
						|	УчастникиОбученияСУО.ПроведениеОбучения
						|ИЗ
						|	РегистрСведений.УчастникиОбученияСУО КАК УчастникиОбученияСУО
						|ГДЕ
						|	УчастникиОбученияСУО.Вид = &ВидОбучения
						|	И УчастникиОбученияСУО.Пользователь = &Пользователь
						|
						|УПОРЯДОЧИТЬ ПО
						|	УчастникиОбученияСУО.ДатаНачалаПрохождения УБЫВ";
					
					Запрос.УстановитьПараметр("Пользователь", Учащийся);
					Запрос.УстановитьПараметр("ВидОбучения", ОбучениеВОтборе);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда					
						ВыборкаДетальныеЗаписи.Следующий();
						ПрохождениеОбучения = ВыборкаДетальныеЗаписи.ПрохождениеОбучения; 
						Основания.Добавить(ВыборкаДетальныеЗаписи.ПроведениеОбучения);
					КонецЕсли;					
					
				Иначе
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ ПЕРВЫЕ 1
						|	УчастникиОбученияСУО.Регистратор КАК ПрохождениеОбучения,
						|	УчастникиОбученияСУО.ПроведениеОбучения
						|ИЗ
						|	РегистрСведений.УчастникиОбученияСУО КАК УчастникиОбученияСУО
						|ГДЕ
						|	УчастникиОбученияСУО.Сценарий = &Сценарий
						|	И УчастникиОбученияСУО.Пользователь = &Пользователь
						|
						|УПОРЯДОЧИТЬ ПО
						|	УчастникиОбученияСУО.ДатаНачалаПрохождения УБЫВ";
					
					Запрос.УстановитьПараметр("Пользователь", Учащийся);
					Запрос.УстановитьПараметр("Сценарий", ОбучениеВОтборе);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда					
						ВыборкаДетальныеЗаписи.Следующий();
						ПрохождениеОбучения = ВыборкаДетальныеЗаписи.ПрохождениеОбучения; 
						Основания.Добавить(ВыборкаДетальныеЗаписи.ПроведениеОбучения);
					КонецЕсли;

				КонецЕсли;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
				Основания.Добавить(ПрохождениеОбучения);
			КонецЕсли;
			
		КонецЕсли;
		
		Для каждого ТекущееОснование Из Основания Цикл
		
			Если НЕ ЗначениеЗаполнено(ТекущееОснование) Тогда
				Продолжить;
			КонецЕсли;
				
			ТипОснования = ТипЗнч(ТекущееОснование);
			
			Если ТипЗнч(Строка.Переменная) = Тип("ПланВидовХарактеристикСсылка.ПеременныеШаблоновСообщенийСУО") Тогда
			
				Если Строка.Переменная.ТипЗначения.СодержитТип(ТипОснования) Тогда
					НоваяСтрокаТЧ.Значение = ТекущееОснование;
				КонецЕсли;
				
				Если (ТипОснования = Тип("ДокументСсылка.ПроведениеОбученияСУО"))
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("СправочникСсылка.КаталогМероприятийСУО"))
					И ЗначениеЗаполнено(ТекущееОснование.Мероприятие) Тогда
				
					НоваяСтрокаТЧ.Значение = ТекущееОснование.Мероприятие;
					
				КонецЕсли;
				
				Если (ТипОснования = Тип("ДокументСсылка.ПроведениеОбученияСУО"))
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("СправочникСсылка.СводыЗнанийСУЗ"))
					И ЗначениеЗаполнено(ТекущееОснование.ЭлектронныйРесурс) Тогда
				
					НоваяСтрокаТЧ.Значение = ТекущееОснование.ЭлектронныйРесурс;
					
				КонецЕсли;
				
				Если ТипОснования = Тип("ДокументСсылка.ПрохождениеОбученияСУО") 
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("СправочникСсылка.КаталогМероприятийСУО"))
					И ЗначениеЗаполнено(ТекущееОснование.Сценарий)
					И ТипЗнч(ТекущееОснование.Сценарий) = Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда
					
					НоваяСтрокаТЧ.Значение = ТекущееОснование.Сценарий;
					
				КонецЕсли;
				
				Если ТипОснования = Тип("ДокументСсылка.ПрохождениеОбученияСУО") 
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("СправочникСсылка.СводыЗнанийСУЗ"))
					И ЗначениеЗаполнено(ТекущееОснование.Сценарий)
					И ТипЗнч(ТекущееОснование.Сценарий) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
					
					НоваяСтрокаТЧ.Значение = ТекущееОснование.Сценарий;
					
				КонецЕсли;
				
				Если ТипОснования = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО")
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("СправочникСсылка.КаталогПрограммОбученияСУО")) Тогда
				
					НоваяСтрокаТЧ.Значение = ТекущееОснование.ПрограммаОбучения;
					
				КонецЕсли;
				
				Если ТипОснования = Тип("ДокументСсылка.ПроведениеОбученияСУО")
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО")) Тогда
				
					НоваяСтрокаТЧ.Значение = ТекущееОснование.ПроведениеПрограммыОбучения;
					
				КонецЕсли;
				
				Если ТипОснования = Тип("ДокументСсылка.ПопыткаВыполненияЗаданияСУО")
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("ДокументСсылка.ПроведениеОбученияСУО")) Тогда
					
					НоваяСтрокаТЧ.Значение = ТекущееОснование.ПроведениеОбучения;
					
				КонецЕсли;
				
				Если ТипОснования = Тип("ДокументСсылка.ПопыткаВыполненияЗаданияСУО")
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("СправочникСсылка.КаталогМероприятийСУО")) Тогда
					
					СценарийОбучения = Документы.ПрохождениеОбученияСУО.СценарийОбучения(ТекущееОснование.ПрохождениеОбучения);
					Если ТипЗнч(СценарийОбучения) = Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда
						НоваяСтрокаТЧ.Значение = СценарийОбучения;
					КонецЕсли;
					
				КонецЕсли;				

				Если ТипОснования = Тип("ДокументСсылка.ПрохождениеОбученияСУО")
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("СправочникСсылка.КаталогМероприятийСУО")) Тогда
					
					СценарийОбучения = Документы.ПрохождениеОбученияСУО.СценарийОбучения(ТекущееОснование);
					Если ТипЗнч(СценарийОбучения) = Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда
						НоваяСтрокаТЧ.Значение = СценарийОбучения;
					КонецЕсли;
					
				КонецЕсли;				
				
				Если ТипОснования = Тип("ДокументСсылка.ПрохождениеОбученияСУО")
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("ДокументСсылка.ПроведениеОбученияСУО")) Тогда
					
					НоваяСтрокаТЧ.Значение = ТекущееОснование.ПроведениеОбучения;
					
				КонецЕсли;				
				
				Если (ТипОснования = Тип("ДокументСсылка.ПроведениеОбученияСУО"))
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("СправочникСсылка.АудиторииСУО"))
					И ЗначениеЗаполнено(ТекущееОснование.Аудитория) Тогда
				
					НоваяСтрокаТЧ.Значение = ТекущееОснование.Аудитория;
					
				КонецЕсли;
				
				Если (ТипОснования = Тип("ДокументСсылка.ПрохождениеОбученияСУО") ИЛИ ТипОснования = Тип("ДокументСсылка.ПрохождениеПрограммыОбученияСУО"))
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Пользователи")) Тогда
				
					НоваяСтрокаТЧ.Значение = ТекущееОснование.Пользователь;
					
				КонецЕсли;
				
				Если ТипОснования = Тип("ДокументСсылка.ПроведениеПреподавателемОбученияСУО")
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Пользователи")) Тогда
				
					НоваяСтрокаТЧ.Значение = ТекущееОснование.Пользователь;
					
				КонецЕсли;
								
				Если ТипОснования = Тип("ДокументСсылка.ВосстановлениеПароляСУ")
					И Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.АдресДляПерехода Тогда
				
					НоваяСтрокаТЧ.Значение = ТекущееОснование.АдресСтраницыВосстановления + "#/changePassword/" + Строка(ТекущееОснование.УникальныйИдентификатор()) + "/" + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущееОснование, "КодВосстановления"));
					
				КонецЕсли;
				
				Если ТипОснования = Тип("ДокументСсылка.ВосстановлениеПароляСУ")
					И Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КодПодтверждения Тогда
				
					НоваяСтрокаТЧ.Значение = ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(ТекущееОснование.КодВосстановления);
					
				КонецЕсли;
				
				Если ТипОснования = Тип("ДокументСсылка.ВосстановлениеПароляСУ")
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Пользователи")) Тогда
				
					НоваяСтрокаТЧ.Значение = ТекущееОснование.Пользователь;
					
				КонецЕсли;
				
				Если Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ЛогинПользователя Тогда
					
					Пользователь = ПользовательОснования(ТекущееОснование);
					
					Если ЗначениеЗаполнено(Пользователь) Тогда
					
						ПрочитанныеСвойства = Неопределено;
						ИдентификаторПользователяИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ИдентификаторПользователяИБ");
						
						Если Пользователи.ПрочитатьПользователяИБ(ИдентификаторПользователяИБ, ПрочитанныеСвойства) Тогда				
							НоваяСтрокаТЧ.Значение = ПрочитанныеСвойства.Имя;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;				
				
				Если Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаДоступаПользователяКБазе
					ИЛИ Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияДоступаПользователяКБазе Тогда

					Пользователь = ПользовательОснования(ТекущееОснование);
					
					Если ЗначениеЗаполнено(Пользователь) Тогда
						
						ДатыДоступа = РегистрыСведений.ВремяДоступаПользователейСУО.ДатыДоступа(Пользователь);
						
						Если ДатыДоступа <> Неопределено Тогда
						
							Если Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаДоступаПользователяКБазе Тогда
								НоваяСтрокаТЧ.Значение = ДатыДоступа.ДатаНачалаДоступа;
								НоваяСтрокаТЧ.Значение = ОбщегоНазначенияСУКлиентСервер.ДатаВСтроку(НоваяСтрокаТЧ.Значение, Ложь, Ложь, Истина);
							Иначе
								НоваяСтрокаТЧ.Значение = ДатыДоступа.ДатаОкончанияДоступа;
								НоваяСтрокаТЧ.Значение = ОбщегоНазначенияСУКлиентСервер.ДатаВСтроку(НоваяСтрокаТЧ.Значение, Ложь, Истина, Истина);
							КонецЕсли;
							
						КонецЕсли;
							
					КонецЕсли;
					
				КонецЕсли;
				
				Если Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа Тогда
					
					Пользователь = ПользовательОснования(ТекущееОснование);
					
					Если ЗначениеЗаполнено(Пользователь) Тогда

						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	УчебныеГруппыСУОСостав.Ссылка.Наименование КАК НаименованиеГруппы
							|ИЗ
							|	Справочник.УчебныеГруппыСУО.Состав КАК УчебныеГруппыСУОСостав
							|ГДЕ
							|	УчебныеГруппыСУОСостав.Пользователь = &Пользователь
							|
							|ОБЪЕДИНИТЬ ВСЕ
							|
							|ВЫБРАТЬ РАЗЛИЧНЫЕ
							|	СтудентыООСрезПоследних.УчебнаяГруппа.Наименование
							|ИЗ
							|	РегистрСведений.СтудентыОО.СрезПоследних(, ) КАК СтудентыООСрезПоследних
							|ГДЕ
							|	СтудентыООСрезПоследних.Пользователь = &Пользователь";
						
						Запрос.УстановитьПараметр("Пользователь", Пользователь);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
							НоваяСтрокаТЧ.Значение = "";
							Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
								НоваяСтрокаТЧ.Значение = НоваяСтрокаТЧ.Значение + ВыборкаДетальныеЗаписи.НаименованиеГруппы + " ";								
							КонецЦикла;
						КонецЕсли;
						
					КонецЕсли;

					
				КонецЕсли;
				
			КонецЕсли;
				
			Если ТипЗнч(Строка.Переменная) = Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения")
				ИЛИ ТипЗнч(Строка.Переменная) = Тип("СправочникСсылка.ВидыКонтактнойИнформации") Тогда
				
				Пользователь = ПользовательОснования(ТекущееОснование);
				
				Если ЗначениеЗаполнено(Пользователь) Тогда
					
					ТаблицаЗначенийДопПеременных = УправлениеОбучениемСУО.ТаблицаЗначенийДополнительныхПеременных(ТаблицаПеременных, Пользователь);
					
					СтрокаТЗДП = ТаблицаЗначенийДопПеременных.Найти(Строка.Переменная, "Переменная");
					НоваяСтрокаТЧ.Значение = СтрокаТЗДП.Значение;
					
				КонецЕсли;				
				
			КонецЕсли;			
		
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Создает новое сообщение рассылки.
//
Функция ЗаписатьНовоеСообщение(Пользователь, ДополнительныеАдресаМассив) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НовоеСообщениеОбъект = Документы.СообщениеСУО.СоздатьДокумент();
	НовоеСообщениеОбъект.Дата                   = ТекущаяДата();
	НовоеСообщениеОбъект.Пользователь           = Автор;
	НовоеСообщениеОбъект.ТолькоЭлектроннаяПочта = ТолькоЭлектроннаяПочта;
	
	НоваяТемаОбъект = Справочники.ТемыСообщенийСУО.СоздатьЭлемент();
	
	Если БезШаблона Тогда			
		НовоеСообщениеОбъект.Шаблон = Ссылка; // Шаблон будет заполнен после записи в базу рассылки,
		                                      // Если запись сообщения выполняется перед записью											  
		НоваяТемаОбъект.Наименование = Заголовок;		
	Иначе				
		НовоеСообщениеОбъект.Шаблон  = Шаблон;		
		НоваяТемаОбъект.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовоеСообщениеОбъект.Шаблон, "Заголовок");		
	КонецЕсли;	
	
	НоваяТемаОбъект.Автор        = Автор;
	НоваяТемаОбъект.Кому         = Перечисления.АдресатыСообщенийСУО.Пользователю;
	НоваяТемаОбъект.Контекст     = Пользователь;
	
	НоваяТемаОбъект.Записать();
	
	НовоеСообщениеОбъект.Тема = НоваяТемаОбъект.Ссылка;	
	НовоеСообщениеОбъект.ПервоеСообщениеВТеме = Истина;	
	НовоеСообщениеОбъект.Рассылка = Ссылка;	
		
	Для каждого ДополнительныйАдрес Из ДополнительныеАдресаМассив Цикл	
		НоваяСтрока = НовоеСообщениеОбъект.ДополнительныеАдреса.Добавить();
	    НоваяСтрока.АдресЭлектроннойПочты = ДополнительныйАдрес; 
	КонецЦикла;
	
	НовоеСообщениеОбъект.Записать();
	
	Возврат НовоеСообщениеОбъект.Ссылка;
	
КонецФункции

Процедура ПриКопировании(ОбъектКопирования)
	ИдентификаторОбъектаКопирования = ОбъектКопирования.Ссылка.УникальныйИдентификатор();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Основание = ДанныеЗаполнения;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ШаблоныСообщенийСУО") Тогда
		
		Шаблон = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаПеременные Из ДанныеЗаполнения.Переменные Цикл
			НоваяСтрока = ЗначенияПеременных.Добавить();
			НоваяСтрока.Переменная = ТекСтрокаПеременные.Переменная;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.УчебныеГруппыСУО") Тогда

		Для Каждого ТекСтрокаСостав Из ДанныеЗаполнения.Состав Цикл
			НоваяСтрока = Адресаты.Добавить();
			НоваяСтрока.Пользователь = ТекСтрокаСостав.Пользователь;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		
		ТаблицаУчастников = Документы.ПроведениеОбученияСУО.УчастникиОбучения(ДанныеЗаполнения);
		
		Для Каждого Строка Из ТаблицаУчастников Цикл
			НоваяСтрока = Адресаты.Добавить();
			НоваяСтрока.Пользователь = Строка.Пользователь;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО") Тогда
		
		ТаблицаУчастников = Документы.ПроведениеПрограммыОбученияСУО.Участники(ДанныеЗаполнения);
		
		Для Каждого Строка Из ТаблицаУчастников Цикл
			НоваяСтрока = Адресаты.Добавить();
			НоваяСтрока.Пользователь = Строка.Пользователь;
		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если БезШаблона Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Шаблон");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Автор) Тогда
		Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если Адресаты.Количество() > 0 Тогда
		Действующая = Истина;
	Иначе
		Действующая = Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для каждого Строка Из Адресаты Цикл
		
		Если ЗначениеЗаполнено(Строка.Сообщение) Тогда
			
			Если НЕ ПометкаУдаления Тогда
				
				// Если сообщение пользователя существует и помечено на удаление, то
				// удаляем пометку на удаление.
				
				ПометкаУдаленияСообщения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Сообщение, "ПометкаУдаления");
				
				Если ПометкаУдаленияСообщения Тогда
					СообщениеОбъект = Строка.Сообщение.ПолучитьОбъект(); 
					СообщениеОбъект.ПометкаУдаления = Ложь;
					СообщениеОбъект.Записать();
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			ДополнительныеАдресаМассив = Новый Массив;
			СтрокиДополнительныеАдресаПользователя = ДополнительныеАдреса.НайтиСтроки(Новый Структура("Пользователь", Строка.Пользователь));
			Для каждого СтрокаДА Из СтрокиДополнительныеАдресаПользователя Цикл
				ДополнительныеАдресаМассив.Добавить(СтрокаДА.АдресЭлектроннойПочты);
			КонецЦикла;
			НовоеСообщение   = ЗаписатьНовоеСообщение(Строка.Пользователь, ДополнительныеАдресаМассив); 
			Строка.Сообщение = НовоеСообщение; // Запоминаем сообщение пользователю
			
		КонецЕсли;
		
	КонецЦикла;	
	
	// Заполняем организаторов
	
	МассивКандидатовВОрганизаторы = Новый Массив;
	Справочники.ОрганизаторыСУО.ОрганизаторыПользователя(Автор, МассивКандидатовВОрганизаторы);
	Справочники.ОрганизаторыСУО.ОрганизаторыЭлемента(Основание, МассивКандидатовВОрганизаторы);	
	Справочники.ОрганизаторыСУО.ОрганизаторыЭлемента(ОснованиеАвтоматическойРассылки, МассивКандидатовВОрганизаторы);		
	Справочники.ОрганизаторыСУО.ЗаполнитьТабличнуюЧастьОрганизаторы(Организаторы, МассивКандидатовВОрганизаторы); 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);		
	
	// Заполняем реквизит Рассылка и Шаблон у сообщений.
	// Он может быть заполнен уже после записи рассылки в базу данных для новых объектов.
	
	Для каждого СтрокаТЧ Из Адресаты Цикл
	
		НовоеСообщениеОбъект = СтрокаТЧ.Сообщение.ПолучитьОбъект();
		
		НовоеСообщениеОбъект.Рассылка = Ссылка;
		
		Если БезШаблона Тогда
			НовоеСообщениеОбъект.Шаблон = Ссылка;
		КонецЕсли;
		
		НовоеСообщениеОбъект.Записать();
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РассылкаСообщенийСУОАдресаты.Сообщение КАК Ссылка
		|ИЗ
		|	Документ.РассылкаСообщенийСУО.Адресаты КАК РассылкаСообщенийСУОАдресаты
		|ГДЕ
		|	РассылкаСообщенийСУОАдресаты.Сообщение.Проведен = ЛОЖЬ
		|	И РассылкаСообщенийСУОАдресаты.Сообщение.ПометкаУдаления = ЛОЖЬ
		|	И РассылкаСообщенийСУОАдресаты.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	ОбщегоНазначенияСУ.ПерепровестиВыборкуДокументов(ВыборкаДетальныеЗаписи, РежимЗаписиДокумента.Проведение, ДополнительныеСвойства);
		
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ПользовательОснования(ТекущееОснование)
	
	Пользователь = Неопределено;
	ТипОснования = ТипЗнч(ТекущееОснование);
	
	Если ТипОснования = Тип("СправочникСсылка.Пользователи") Тогда
		Пользователь = ТекущееОснование;
	КонецЕсли;

	Если ТипОснования = Тип("ДокументСсылка.ВосстановлениеПароляСУ")
		ИЛИ ТипОснования = Тип("ДокументСсылка.ПрохождениеОбученияСУО")
	    ИЛИ ТипОснования = Тип("ДокументСсылка.ПрохождениеПрограммыОбученияСУО")
		ИЛИ ТипОснования = Тип("ДокументСсылка.ПроведениеПреподавателемОбученияСУО") Тогда
		
		Пользователь = ТекущееОснование.Пользователь;

	КонецЕсли;
	
	Возврат Пользователь;
	
КонецФункции

#КонецОбласти


#КонецЕсли

