
&НаСервере
Функция ПолучитьПараметрыФормы(ПараметрКоманды)
	
	ПараметрыФормы = Новый Структура();
	
	ПараметрыФормы.Вставить("Контекст", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрКоманды, "ПроведениеОбучения"));
	
	РодительскоеПрохождение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрКоманды, "РодительскоеПрохождение");
	
	// Дополнительный контекст позволяет расширить список отбора тем.
	// В этом случае будут показаны сообщения, которые связаны с мероприятием в целом,
	// То есть отправлены данному участнику и всем другим участникам.
	
	Если ЗначениеЗаполнено(РодительскоеПрохождение) Тогда
		// Функционально нет возможности отправить сообщение участнику подчиненного мероприятия.
		// Поэтому принудительно указываем контекст общего мероприятия, если это мероприятие подчиненное.
		ПараметрыФормы.Вставить("ДополнительныйКонтекст", РодительскоеПрохождение);		
	Иначе
		ПараметрыФормы.Вставить("ДополнительныйКонтекст", ПараметрКоманды);
	КонецЕсли;	
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = ПолучитьПараметрыФормы(ПараметрКоманды);	
	ОткрытьФорму("ОбщаяФорма.ОбщениеСУО", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры