#Область ОписаниеПеременных

&НаКлиенте
Перем ФормаВладелец; // Форма, из которой открыта эта форма

#КонецОбласти


#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Устанавливаем переменные
	
	Если Параметры.ДополнительныеПараметры.Свойство("Подборка") Тогда
		Подборка = Параметры.ДополнительныеПараметры.Подборка;
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////
	
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Объект);
	
	ТаблицаДоступностиДанныхПоставщика = РазработкаСУЗ.ПолучитьТаблицуДоступностиДанныхПоставщика();
	
	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.Текст;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.ВерныйКомментарий;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.ОшибочныйКомментарий;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	РазработкаСУЗ.УстановитьДоступностьДанныхОтПоставщика(ЭтотОбъект, ТаблицаДоступностиДанныхПоставщика);
	
	//////////////////////////////////////////////////////////////////

	ДоступныеТипы = Новый Массив();
	ДоступныеТипы.Добавить(Тип("СправочникСсылка.РесурсыСУЗ"));
	
	Элементы.Ресурс.ОграничениеТипа = Новый ОписаниеТипов(ДоступныеТипы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Заполняем реквизиты, хранящиеся в регистре ДанныеВопросыСУЗ
	
	ФормаВладелец = ОбщегоНазначенияСУКлиент.НайтиВладельцаУправляемойФормы(ВладелецФормы);
	
	Если ФормаВладелец <> Неопределено
		И ФормаВладелец.ИмяФормы = "Справочник.ВопросыСУЗ.Форма.ФормаЭлемента" Тогда
		
		Для каждого Строка Из ФормаВладелец.ДанныеВариантовОтветов Цикл
		
			Если Строка.ВариантОтвета = Объект.Ссылка Тогда
				Текст                = Строка.Текст;
				ВерныйКомментарий    = Строка.ВерныйКомментарий;
				ОшибочныйКомментарий = Строка.ОшибочныйКомментарий;
			КонецЕсли;
		
		КонецЦикла;
		
		УстановитьДоступностьЭлементовФормыНаКлиенте();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Текст) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите текст варианта ответа'"),,"Текст",,Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если НЕ Объект.Ссылка.Пустая()
		И ФормаВладелец.ИмяФормы = "Справочник.ВопросыСУЗ.Форма.ФормаЭлемента" Тогда
		
		СтрокаВарианта = Неопределено;
		
		Для каждого Строка Из ФормаВладелец.ДанныеВариантовОтветов Цикл
			Если Строка.ВариантОтвета = Объект.Ссылка Тогда
				СтрокаВарианта = Строка;
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокаВарианта = Неопределено Тогда
			СтрокаВарианта = ФормаВладелец.ДанныеВариантовОтветов.Добавить();
		КонецЕсли;
			
		СтрокаВарианта.Текст                = Текст;
		СтрокаВарианта.ВерныйКомментарий    = ВерныйКомментарий;
		СтрокаВарианта.ОшибочныйКомментарий = ОшибочныйКомментарий;
		СтрокаВарианта.ВариантОтвета        = Объект.Ссылка;

		ФормаВладелец.ВывестиТекстыВариантов();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Сохраняем в базе
		
	СтруктураДанныхВариантов = Новый Структура;
	СтруктураДанныхВариантов.Вставить("ТекстовыеДанные", Текст);
	СтруктураДанныхВариантов.Вставить("ВерныйКомментарий", ВерныйКомментарий);
	СтруктураДанныхВариантов.Вставить("ОшибочныйКомментарий", ОшибочныйКомментарий);
	
	РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ТекущийОбъект.Владелец, СтруктураДанныхВариантов, ТекущийОбъект.Ссылка, "ВсеРеквизиты");	
 
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура РесурсСоздание(Элемент, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаСозданияРесурса(ЭтотОбъект, Элемент, СтандартнаяОбработка, Подборка); 
КонецПроцедуры

&НаКлиенте
Процедура РесурсОткрытие(Элемент, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаОткрытияРесурса(Элемент, СтандартнаяОбработка, Объект.Ресурс); 
КонецПроцедуры

&НаКлиенте
Процедура РесурсОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаВыбораРесурса(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура РесурсДляВерногоКомментарияСоздание(Элемент, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаСозданияРесурса(ЭтотОбъект, Элемент, СтандартнаяОбработка, Подборка);
КонецПроцедуры

&НаКлиенте
Процедура РесурсДляВерногоКомментарияОткрытие(Элемент, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаОткрытияРесурса(Элемент, СтандартнаяОбработка, Объект.РесурсДляВерногоКомментария);
КонецПроцедуры

&НаКлиенте
Процедура РесурсДляВерногоКомментарияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаВыбораРесурса(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура РесурсДляОшибочногоКомментарияОткрытие(Элемент, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаОткрытияРесурса(Элемент, СтандартнаяОбработка, Объект.РесурсДляОшибочногоКомментария);
КонецПроцедуры

&НаКлиенте
Процедура РесурсДляОшибочногоКомментарияСоздание(Элемент, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаСозданияРесурса(ЭтотОбъект, Элемент, СтандартнаяОбработка, Подборка);
КонецПроцедуры

&НаКлиенте
Процедура РесурсДляОшибочногоКомментарияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаВыбораРесурса(ВыбранноеЗначение);
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормыНаКлиенте()
	
	// ВернаяГруппаФасетов (видимость)
	
	Если ФормаВладелец.Объект.ФасетныйВопрос Тогда
		Элементы.ВернаяГруппаФасетов.Видимость = Истина;
	Иначе
		Элементы.ВернаяГруппаФасетов.Видимость = Ложь;
	КонецЕсли;
	
	// Категория (видимость)
	
	Если ФормаВладелец.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.Таблица") Тогда
		Элементы.Категория.Видимость = Истина;
	Иначе
		Элементы.Категория.Видимость = Ложь;
	КонецЕсли;
	
	// Ресурс
	
	Если ФормаВладелец.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.ПоШаблону") Тогда
		Элементы.Ресурс.Доступность = Ложь;
	Иначе
		Элементы.Ресурс.Доступность = Истина;
	КонецЕсли;	
	
	// Наименование
	
	Если ФормаВладелец.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.ПоШаблону") Тогда
		Элементы.Наименование.Доступность = Ложь;
	Иначе
		Элементы.Наименование.Доступность = Истина;
	КонецЕсли;	
	
	// Верный (доступность)

	Если ФормаВладелец.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.Таблица")
		ИЛИ ФормаВладелец.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.Последовательность")
		ИЛИ ФормаВладелец.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.Соответствие") Тогда
		Элементы.Верный.Доступность = Ложь;
	Иначе
		Элементы.Верный.Доступность = Истина;
	КонецЕсли;
	
	// Комментарии (доступность)
	
	Если ФормаВладелец.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.Последовательность")
		ИЛИ ФормаВладелец.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.ПоШаблону")
		ИЛИ ФормаВладелец.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.ОдинИзМногихПсихологический")
		ИЛИ ФормаВладелец.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.МногиеИзМногихПсихологический") Тогда
		Элементы.Комментарии.Видимость = Ложь;
	Иначе
		Элементы.Комментарии.Видимость = Истина;
	КонецЕсли;
	
	// Балл и опция Верный (видимость)
	
	Если ФормаВладелец.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.ОдинИзМногихПсихологический")
		ИЛИ ФормаВладелец.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.МногиеИзМногихПсихологический") Тогда
		Элементы.Верный.Видимость = Ложь;
		Элементы.ГруппаБаллПриПсихологическомТестировании.Видимость = Истина;
	Иначе
		Элементы.Верный.Видимость = Истина;
		Элементы.ГруппаБаллПриПсихологическомТестировании.Видимость = Ложь;
	КонецЕсли;
	
	
КонецПроцедуры


#КонецОбласти

