// Данные регистр используется для отложенного зачисления на обучение
// Используется в веб-кабинете при зачислении после регистрации
// и при зачислении на обучение с автозачислением.

// Добавляет пользователя в регистр
//
Процедура ДобавитьЗачисление(Пользователь, ПроведениеОбучения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.НовыеЗачисленияНаОбучениеСУО.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Отбор.ПроведениеОбучения.Установить(ПроведениеОбучения);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Пользователь = Пользователь;
	НоваяЗапись.ПроведениеОбучения = ПроведениеОбучения;
	НоваяЗапись.ДатаИзменения = ТекущаяДатаСеанса();
	
	НаборЗаписей.Записать();	
	
КонецПроцедуры

Процедура ДобавитьЗачисления(ПроведениеОбучения, Пользователи) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.НовыеЗачисленияНаОбучениеСУО.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ПроведениеОбучения.Установить(ПроведениеОбучения);
	
	Для каждого Пользователь Из Пользователи Цикл
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Пользователь = Пользователь;
		НоваяЗапись.ПроведениеОбучения = ПроведениеОбучения;
		НоваяЗапись.ДатаИзменения = ТекущаяДатаСеанса();		
	
	КонецЦикла;	
	
	НаборЗаписей.Записать(Истина);	
	
КонецПроцедуры