


#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИспользоватьСотрудников = ПолучитьФункциональнуюОпцию("ИспользоватьСотрудниковСУО");
	ИспользоватьТолькоПользователей = ПолучитьФункциональнуюОпцию("ИспользоватьТолькоПользователейСУ");
	Если ИспользоватьСотрудников ИЛИ ИспользоватьТолькоПользователей Тогда
		Элементы.СтраницаУчебныеГруппы.Видимость = Истина;
	Иначе
		Элементы.СтраницаУчебныеГруппы.Видимость = Ложь;
	КонецЕсли;
	Элементы.СтраницаВремя.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьОграниченияВремениДоступаКПрограммеСУО");
	УстановитьДоступностьЭлементовАутентификации();
	УстановитьОтборДинамическихСписков();
	ОпределитьОписаниеУстановлено(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьОтборДинамическихСписков();
	ОпределитьОписаниеУстановлено(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ОпределитьОписаниеУстановлено(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура УстановитьНастройкиАутентификацииПриИзменении(Элемент)
	УстановитьДоступностьЭлементовАутентификации();
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеПриИзменении(Элемент)
	ОпределитьОписаниеУстановлено(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура УведомлениеПриИзменении(Элемент)
	ОпределитьОписаниеУстановлено(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыВариантыДляВыбора

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ВариантыДляВыбора

&НаКлиенте
Процедура ВариантыДляВыбораПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗагрузитьАдресатовРассылкиИзФайла(Команда)
	
	ПараметрыЗагрузки = ЗагрузкаДанныхИзФайлаКлиент.ПараметрыЗагрузкиДанных();
	
    ПараметрыЗагрузки.ПолноеИмяТабличнойЧасти = "СерииПинКодовСУО.Рассылка";
    ПараметрыЗагрузки.Заголовок = НСтр("ru = 'Загрузить адресатов рассылки'");
	ПараметрыЗагрузки.ИмяМакетаСШаблоном = "ЗагрузкаИзФайла";
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьАдресатовРассылкиИзФайлаЗавершение", ЭтотОбъект); 
    ЗагрузкаДанныхИзФайлаКлиент.ПоказатьФормуЗагрузки(ПараметрыЗагрузки, Оповещение);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРассылку(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Перед выполнением операции запишите элемент';"));
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ШаблонРассылки) Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Укажите шаблон сообщения';"));
		Возврат;		
	КонецЕсли;
	
	ВсеСообщенияОтправлены = Истина;
	
	Для каждого Строка Из Объект.Рассылка Цикл
		
		Если Строка.Отправлено
			ИЛИ НЕ ЗначениеЗаполнено(Строка.ЭлектронныйАдрес) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Текст = НСтр("ru = 'Выполняется отправка письма на адрес %1'");
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, Строка.ЭлектронныйАдрес);
		
		Состояние(Текст);
		
		РезультатОтправки = ОтправитьСообщениеНаЭлектроннуюПочту(Объект.Ссылка, Объект.ШаблонРассылки, Строка.ЭлектронныйАдрес, Строка.Имя); // Обращение к серверу
			
		// Примечание: обращение к серверу в цикле сделано намеренно,
		// Для минимизации ошибок при массовой рассылке.
		
		Если РезультатОтправки.Отправлено Тогда		
			Строка.Отправлено = РезультатОтправки.Отправлено;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОтправки.ТекстОшибки);	
			ВсеСообщенияОтправлены = Ложь;
		КонецЕсли;
	
	КонецЦикла;
	
	Записать();	
	
	Если ВсеСообщенияОтправлены Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Все сообщения успешно отправлены'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаблокироватьПинКод(Команда)
	Если НЕ МожноИзменятьПинКоды() Тогда
		Возврат;
	КонецЕсли;
	ЗаблокироватьПинКодыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьПинКодКакВыданный(Команда)
	Если НЕ МожноИзменятьПинКоды() Тогда
		Возврат;
	КонецЕсли;	
	ОтметитьПинКодыКакВыданныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПинКоды(Команда)
	
	Если НЕ МожноИзменятьПинКоды() Тогда
		Возврат;
	КонецЕсли;	
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	
	КЧ = Новый КвалификаторыЧисла(12,0, ДопустимыйЗнак.Неотрицательный);
	ОписаниеТипов = Новый ОписаниеТипов(Массив, КЧ);
	
	Оповещение =  Новый ОписаниеОповещения("ПослеВводаКоличестваПинКодовДляФормирования", ЭтотОбъект);
		
	ПоказатьВводЗначения(Оповещение, 100, НСтр("ru = 'Количество пин-кодов для создания'"), ОписаниеТипов);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьОтборДинамическихСписков()
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(ВариантыДляВыбора, Объект.Ссылка, "Владелец");
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(ПинКоды, Объект.Ссылка, "Серия");
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовАутентификации()
	Элементы.АутентификацияСтандартная.Доступность = Объект.УстановитьНастройкиАутентификации;
	Элементы.АутентификацияВебКабинета.Доступность = Объект.УстановитьНастройкиАутентификации;
	Элементы.АутентификацияOpenID.Доступность = Объект.УстановитьНастройкиАутентификации;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтправитьСообщениеНаЭлектроннуюПочту(Серия, Шаблон, ЭлектронныйАдрес, ИмяАдресата)
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатОтправки = Новый Структура("Отправлено, ТекстОшибки", Истина, "");
	ПараметрыПисьма   = Новый Структура;
	
	ДанныеШаблона = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Шаблон, "Заголовок, ФорматированныйДокумент");
	
	// Указываем получателей

	МассивПолучателей = Новый Массив();
	МассивПолучателей.Добавить(Новый Структура("Адрес, Представление", ЭлектронныйАдрес, ИмяАдресата));
	
	ПараметрыПисьма.Вставить("Кому", МассивПолучателей);
	
	// Указываем тему
	
	ПараметрыПисьма.Вставить("Тема", ДанныеШаблона.Заголовок);
	
	// Формируем тело
	
	ФайлыДляУдаления = Новый Массив();
	ФорматированныйДокумент = ДанныеШаблона.ФорматированныйДокумент.Получить();
	
	ТекстHTML = "";
	Вложения  = Неопределено;	
	
	ФорматированныйДокумент.ПолучитьHTML(ТекстHTML, Вложения);
	
	ФайлыДляУдаления = Новый Массив();
	
	Документы.СообщениеСУО.ЗаменитьПутиККартинкамДляЭлектроннойПочты(ТекстHTML, Вложения, ФайлыДляУдаления);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныСообщенийСУОПеременные.Переменная,
		|	ШаблоныСообщенийСУОПеременные.Переменная.Код КАК Код
		|ИЗ
		|	Справочник.ШаблоныСообщенийСУО.Переменные КАК ШаблоныСообщенийСУОПеременные
		|ГДЕ
		|	ШаблоныСообщенийСУОПеременные.Ссылка = &ШаблонСообщения";
	
	Запрос.УстановитьПараметр("ШаблонСообщения", Шаблон);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЗначенияПеременных = РезультатЗапроса.Выгрузить();
	
	ЗначенияПеременных.Колонки.Добавить("Значение");
	
	Для каждого Строка Из ЗначенияПеременных Цикл		
		
		Если Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПинКод Тогда			
			Строка.Значение = РегистрыСведений.ВыданныеПинКодыСУО.ВыдатьКод(Серия,,ЭлектронныйАдрес);
		КонецЕсли;
		
		Если Строка.Переменная.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Пользователи"))
			ИЛИ Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ЛогинПользователя Тогда
			
			Строка.Значение = ИмяАдресата;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого Строка Из ЗначенияПеременных Цикл
		ТекстHTML = СтрЗаменить(ТекстHTML, "{{"+Строка.Код+"}}", Строка.Значение);
	КонецЦикла;	
	
	ПараметрыПисьма.Вставить("Тело", ТекстHTML);
	ПараметрыПисьма.Вставить("ТипТекста", Перечисления.ТипыТекстовЭлектронныхПисем.HTMLСКартинками);
	ПараметрыПисьма.Вставить("Вложения", Вложения);	
	
	// Отправляем письмо
	
	СистемнаяУчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	Попытка
		
		РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыПисьма);
		
	Исключение
		
		ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка - %1: %2.'"), ЭлектронныйАдрес, ОписаниеОшибки);

		РезультатОтправки.ТекстОшибки = Текст;
		РезультатОтправки.Отправлено  = Ложь;
		
		Возврат РезультатОтправки;
		
	КонецПопытки;
	
	// Удаляем файлы
	
	Для каждого ПутьКФайлуДляУдаления Из ФайлыДляУдаления Цикл
	
		ФайлДляУдаленияОбъект = Новый Файл(ПутьКФайлуДляУдаления);
		
		УдалитьФайлы(ФайлДляУдаленияОбъект.Путь);
	
	КонецЦикла;
	
	Возврат РезультатОтправки;	
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьАдресатовРассылкиИзФайлаЗавершение(АдресЗагруженныхДанных, ДополнительныеПараметры) Экспорт
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
        Возврат;
    КонецЕсли;
	
	ЗагрузитьАдресатовРассылкиИзФайлаНаСервере(АдресЗагруженныхДанных);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьАдресатовРассылкиИзФайлаНаСервере(АдресЗагруженныхДанных)
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	
	АдресатыДобавлены = Ложь;
	
	Для каждого СтрокаТаблицы Из ЗагруженныеДанные Цикл 
		
        Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ЭлектронныйАдрес) Тогда 
            Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Имя) Тогда
			СтрокаТаблицы.Имя = СтрокаТаблицы.ЭлектронныйАдрес;
		КонецЕсли;
		
		НайденныеАдресаты = Объект.Рассылка.НайтиСтроки(Новый Структура("ЭлектронныйАдрес", СтрокаТаблицы.ЭлектронныйАдрес));
		
		Если НайденныеАдресаты <> Неопределено И НайденныеАдресаты.Количество() > 0 Тогда
			Продолжить; // Уже есть адресат
		КонецЕсли;
		
        НоваяСтрокаАдресат = Объект.Рассылка.Добавить();
		
        НоваяСтрокаАдресат.ЭлектронныйАдрес = СтрокаТаблицы.ЭлектронныйАдрес;
		НоваяСтрокаАдресат.Имя = СтрокаТаблицы.Имя;
        АдресатыДобавлены = Истина;
		
    КонецЦикла;
	
	Если АдресатыДобавлены Тогда
        Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОпределитьОписаниеУстановлено(Форма)
	Если ЗначениеЗаполнено(Форма.Объект.Уведомление) ИЛИ ЗначениеЗаполнено(Форма.Объект.Описание) Тогда
		Форма.ОписаниеУстановлено = НСтр("ru = 'Задано'")
	Иначе
		Форма.ОписаниеУстановлено = "";
	КонецЕсли;	
Конецпроцедуры

// Пин-коды

&НаКлиенте
Функция МожноИзменятьПинКоды()
	Отказ = Ложь;
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
	Возврат НЕ Отказ;
КонецФункции

&НаКлиенте
Процедура ПослеВводаКоличестваПинКодовДляФормирования(КоличествоКодов, Параметры) Экспорт
    Если КоличествоКодов <> Неопределено Тогда
		СформироватьПинКодыНаСервере(КоличествоКодов);
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьПинКодыНаСервере(КоличествоКодов)
	
	РегистрыСведений.ВыданныеПинКодыСУО.СоздатьКодыСерии(Объект.Ссылка, КоличествоКодов);
	Элементы.ПинКоды.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьПинКодыКакВыданныеНаСервере()
	
	ВыделенныеСтроки = Элементы.ПинКоды.ВыделенныеСтроки;
	
	Если ТипЗнч(ВыделенныеСтроки) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Для каждого Строка Из ВыделенныеСтроки Цикл
			РегистрыСведений.ВыданныеПинКодыСУО.УстановитьСнятьОтметкуВыдан(Строка.Серия, Строка.Код);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;	
	
	Элементы.ПинКоды.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ЗаблокироватьПинКодыНаСервере()

	ВыделенныеСтроки = Элементы.ПинКоды.ВыделенныеСтроки;
	
	Если ТипЗнч(ВыделенныеСтроки) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	
	НачатьТранзакцию();
	
	Попытка
		
		Для каждого Строка Из ВыделенныеСтроки Цикл
			РегистрыСведений.ВыданныеПинКодыСУО.УстановтьСнятьОтметкуЗаблокирован(Строка.Серия, Строка.Код);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;	
	
	Элементы.ПинКоды.Обновить();	
	
КонецПроцедуры




#КонецОбласти
