#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ЭтоСотрудник(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СотрудникиСУО.Пользователь
		|ИЗ
		|	РегистрСведений.СотрудникиСУО КАК СотрудникиСУО
		|ГДЕ
		|	СотрудникиСУО.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция СуществуетСотрудникПринятыйПослеДаты(Пользователь, ДатаПриема) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СотрудникиСУО.Пользователь
		|ИЗ
		|	РегистрСведений.СотрудникиСУО КАК СотрудникиСУО
		|ГДЕ
		|	СотрудникиСУО.Пользователь = &Пользователь
		|	И СотрудникиСУО.Период > &ДатаПриема";
	
	Запрос.УстановитьПараметр("ДатаПриема", ДатаПриема);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли
