

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервереБезКонтекста
Функция ВебСсылкаТеста(ЭлектронныйРесурс, ЭлементСодержания, ПрохождениеОбучения, Задание, Пользователь) 
	Возврат ЭлектронныеРесурсыСУЗ.ВебСсылкаПубликации(ЭлектронныйРесурс, ЭлементСодержания, ПрохождениеОбучения, Задание, Пользователь);
КонецФункции

&НаКлиенте
Процедура ОткрытьТест()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если НЕ ОбщегоНазначенияСУКлиент.ТекущиеДанныеТаблицыДоступны(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Регистратор) = Тип("ДокументСсылка.ПопыткаВыполненияПодборкиВопросовСУЗ") Тогда
	
		Если НЕ ТекущиеДанные.Свойство("Тест") Тогда
			Возврат;
		КонецЕсли;
		
		НомерДокумента = ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(ТекущиеДанные.НомерДокумента);
		ИдентификаторПодборки = ТекущиеДанные.Тест.УникальныйИдентификатор();
		
		Если НЕ ЗначениеЗаполнено(НомерДокумента) Тогда
			Возврат;
		КонецЕсли;
		
		АдресОбъекта = "?id="+ИдентификаторПодборки+"&numDocument="+НомерДокумента+"&numGroup=1&object=collection&window=this";
		
		ОбъектыСУЗКлиент.ОткрытьОбозреватель(ТекущиеДанные.ЭлектронныйРесурс, АдресОбъекта, Истина, ТекущиеДанные.ЭлементСодержания, ТекущиеДанные.ПрохождениеОбучения, ТекущиеДанные.Задание);
	
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Регистратор) = Тип("ДокументСсылка.СессияЭлектронногоРесурсаСУЗ") Тогда
		
		ПерейтиПоНавигационнойСсылке(ВебСсылкаТеста(ТекущиеДанные.ЭлектронныйРесурс, ТекущиеДанные.ЭлементСодержания, ТекущиеДанные.ПрохождениеОбучения, ТекущиеДанные.Задание, ТекущиеДанные.Пользователь));
			
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСписка()
	
	Если НЕ ЗначениеЗаполнено(ОтборПроверенных)
		ИЛИ ОтборПроверенных = "Все" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Проверен",,,,Ложь);
	КонецЕсли;
	
	Если ОтборПроверенных = "Проверенные" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Проверен", Истина,,,Истина);
	КонецЕсли;
	
	Если ОтборПроверенных = "ТребующиеПроверки" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Проверен", Ложь,,,Истина);
	КонецЕсли;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОтборПроверенных = "ТребующиеПроверки";
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Пользователь", Пользователи.ТекущийПользователь(), ВидСравненияКомпоновкиДанных.НеРавно,, Истина);
	
	УстановитьОтборСписка();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура ПроверитьТест(Команда)
	ОткрытьТест();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ Список

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьТест();
КонецПроцедуры


&НаКлиенте
Процедура ОтборПроверенныхПриИзменении(Элемент)
	УстановитьОтборСписка();
КонецПроцедуры



