Функция СмещениеСтандартногоВремениБазы() Экспорт
	Возврат СмещениеСтандартногоВремени();	
КонецФункции

Функция ТекстОНеобходимостиНастроитьОбщийКаталог() Экспорт
	
	Возврат НСтр("ru = 'Настройте общий каталог в форме Администрирование -> Общие настройки -> Настройки веб-сервера'");
	
КонецФункции

Функция ИмяЗначенияПеречисления(ЗначениеПеречисления) Экспорт

	Возврат ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ЗначениеПеречисления); 
	
КонецФункции

Функция ИдентификаторРегламентногоЗадания(ИмяРегламентногоЗадания) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СписокРЗ = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Новый Структура("Ключ", ИмяРегламентногоЗадания));
	
	Если СписокРЗ.Количество() <> 1 Тогда
		Возврат Неопределено;
	Иначе
		Возврат СписокРЗ[0].УникальныйИдентификатор;
	КонецЕсли;	
	
КонецФункции
