

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
Процедура ОбновитьСписокПользователей()
	ЗаполнитьСписокПользователей();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбновлениеСпискаПользователей()
	
	Если Объект.ИнтервалОбновления = 0 Тогда
		ОтключитьОбработчикОжидания("ОбновитьСписокПользователей");	
		Возврат;
	КонецЕсли;
		
	ПодключитьОбработчикОжидания("ОбновитьСписокПользователей", Объект.ИнтервалОбновления*60);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПользователей()
	
	УстановитьПривилегированныйРежим(Истина);
	
	АктивныеПользователи.Очистить();
	
	СеансыИнформационнойБазы = ПолучитьСеансыИнформационнойБазы();
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Для Каждого СеансИБ Из СеансыИнформационнойБазы Цикл
		
		Если СеансИБ.Пользователь = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если СеансИБ.ИмяПриложения = "Designer" Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеПользователя = НайтиСсылкуПоИдентификаторуПользователя(СеансИБ.Пользователь.УникальныйИдентификатор);
		
		Если ДанныеПользователя = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДанныеПользователя.Пользователь = ТекущийПользователь Тогда
			Продолжить;
		КОнецЕсли;
		
		Если АктивныеПользователи.НайтиСтроки(Новый Структура("Пользователь", ДанныеПользователя.Пользователь)).Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = АктивныеПользователи.Добавить();
		
		НоваяСтрока.Имя	         = ДанныеПользователя.Имя;
		НоваяСтрока.Пользователь = ДанныеПользователя.Пользователь;
		НоваяСтрока.Картинка     = 0;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НайтиСсылкуПоИдентификаторуПользователя(Идентификатор)
	
	Запрос = Новый Запрос;
	
	ШаблонТекстаЗапроса = "ВЫБРАТЬ
					|	Ссылка, Наименование
					|ИЗ
					|	%1
					|ГДЕ
					|	ИдентификаторПользователяИБ = &Идентификатор";
					
	ТекстЗапросаПоПользователям = 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ШаблонТекстаЗапроса,
					"Справочник.Пользователи");
	
	ТекстЗапросаПоВнешниемПользователям = 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ШаблонТекстаЗапроса,
					"Справочник.ВнешниеПользователи");
					
	Запрос.Текст = ТекстЗапросаПоПользователям;
	Запрос.Параметры.Вставить("Идентификатор", Идентификатор);
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Новый Структура("Пользователь, Имя", Выборка.Ссылка, Выборка.Наименование);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапросаПоВнешниемПользователям;
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Новый Структура("Пользователь, Имя", Выборка.Ссылка, Выборка.Наименование);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьПравоУчастияВОбсуждениях = УправлениеДоступом.ЕстьРоль("ЛичныйКабинетУниверсальныйСервисОбщенияСУО");
	
	Элементы.ФормаНаписать.Видимость = ЕстьПравоУчастияВОбсуждениях;
	
	ЗаполнитьСписокПользователей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОбновлениеСпискаПользователей();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьСписокПользователей();
КонецПроцедуры

&НаКлиенте
Процедура Написать(Команда)
	
	ТекущиеДанные = Элементы.АктивныеПользователи.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено ИЛИ НЕ ТекущиеДанные.Свойство("Пользователь") Тогда
		Возврат;
	КонецЕсли;

	ПараметрыФормы = Новый Структура("Контекст", ТекущиеДанные.Пользователь);
	ОткрытьФорму("Документ.СообщениеСУО.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура Настроить(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НастроитьПродолжение", ЭтотОбъект);		
	
	ПоказатьВводЗначения(ОписаниеОповещения, Объект.ИнтервалОбновления, НСтр("ru = 'Интервал обновления в минутах'"));  
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПродолжение(Значение, ДополнительныеПараметры) Экспорт
	
	Объект.ИнтервалОбновления = Значение;
	
	УстановитьОбновлениеСпискаПользователей();
		
КонецПроцедуры	

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ИнтервалОбновленияПриИзменении(Элемент)
	УстановитьОбновлениеСпискаПользователей();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ АктивныеПользователи

&НаКлиенте
Процедура АктивныеПользователиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено ИЛИ НЕ ТекущиеДанные.Свойство("Пользователь") Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(,ТекущиеДанные.Пользователь);
	
КонецПроцедуры

