Функция ВыбранныеВарианты(СессииВыполненияТеста, Вопросы) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыбранныеВариантыОтветовВопросовСУЗ.Регистратор КАК ОтветНаВопрос,
		|	ВыбранныеВариантыОтветовВопросовСУЗ.СессияВыполненияТеста,
		|	ВыбранныеВариантыОтветовВопросовСУЗ.Вопрос КАК Вопрос,
		|	ВыбранныеВариантыОтветовВопросовСУЗ.ВариантОтвета,
		|	ВыбранныеВариантыОтветовВопросовСУЗ.Выбран,
		|	ВыбранныеВариантыОтветовВопросовСУЗ.ВерныйВыбран,
		|	ВыбранныеВариантыОтветовВопросовСУЗ.ВерныйНеВыбран,
		|	ВыбранныеВариантыОтветовВопросовСУЗ.ОшибочныйВыбран,
		|	ВыбранныеВариантыОтветовВопросовСУЗ.ОшибочныйНеВыбран,
		|	ВыбранныеВариантыОтветовВопросовСУЗ.Номер КАК Номер,
		|	ДанныеВопросыСУЗ.ТекстовыеДанные КАК ТекстВарианта,
		|	ВыбранныеВариантыОтветовВопросовСУЗ.ВариантОтвета.Верный КАК Верный
		|ИЗ
		|	РегистрСведений.ВыбранныеВариантыОтветовВопросовСУЗ КАК ВыбранныеВариантыОтветовВопросовСУЗ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеВопросыСУЗ КАК ДанныеВопросыСУЗ
		|		ПО ВыбранныеВариантыОтветовВопросовСУЗ.Вопрос = ДанныеВопросыСУЗ.СсылкаНаОбъектСУЗ
		|			И ВыбранныеВариантыОтветовВопросовСУЗ.Вопрос.Поставщик = ДанныеВопросыСУЗ.Поставщик
		|			И ВыбранныеВариантыОтветовВопросовСУЗ.Вопрос.Версия = ДанныеВопросыСУЗ.Версия
		|			И ВыбранныеВариантыОтветовВопросовСУЗ.ВариантОтвета = ДанныеВопросыСУЗ.КодДанных
		|ГДЕ
		|	ВыбранныеВариантыОтветовВопросовСУЗ.СессияВыполненияТеста В(&СессииВыполненияТеста)
		|	И ВыбранныеВариантыОтветовВопросовСУЗ.Вопрос В(&Вопросы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Вопрос,
		|	Номер";
	
	Запрос.УстановитьПараметр("Вопросы", Вопросы);
	Запрос.УстановитьПараметр("СессииВыполненияТеста", СессииВыполненияТеста);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции
