#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("Рубрикатор");
	Поля.Добавить("ЭлементРубрикатора");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Данные.Наименование) Тогда
	
		СтандартнаяОбработка = Ложь;
		
		Представление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные.Рубрикатор, "Наименование");
		
		Если ЗначениеЗаполнено(Данные.ЭлементРубрикатора) Тогда
			Представление = Строка(Представление) + " (" + Строка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные.ЭлементРубрикатора, "Наименование")) + ")";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
