
&НаКлиенте
Перем ИмяКомандыДляВыполнения;

&НаКлиенте
Перем ВыполнитьКомандуПередЗакрытием;

&НаКлиенте
Перем ВыполнитьКомандуПриЗакрытием;


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗначенияЗаполнения = Неопределено;
	ЭлектронныйРесурс  = Неопределено;
		
	Параметры.Свойство("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	Если ЗначенияЗаполнения <> Неопределено Тогда
		ЗначенияЗаполнения.Свойство("Владелец", ЭлектронныйРесурс);	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если ВыполнитьКомандуПередЗакрытием Тогда
		ВыполнитьКомандуПриЗакрытием = Истина;
	Иначе
		ВыполнитьКомандуПриЗакрытием = Ложь;
	КонецЕсли;
	
	ВыполнитьКомандуПередЗакрытием = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Если ВыполнитьКомандуПриЗакрытием И ЗначениеЗаполнено(ИмяКомандыДляВыполнения) Тогда
		
		ПараметрыФормы = Новый Структура("ЭлектронныйРесурс", ЭлектронныйРесурс);
		
		Если ИмяКомандыДляВыполнения = "СоздатьТеорию" Тогда
			ОткрытьФорму("Справочник.ПодборкиСУЗ.Форма.ФормаТеории", ПараметрыФормы, ВладелецФормы);
		КонецЕсли;
		
		Если ИмяКомандыДляВыполнения = "СоздатьТест" Тогда
			ОткрытьФорму("Справочник.ПодборкиСУЗ.Форма.ФормаТеста", ПараметрыФормы, ВладелецФормы);
		КонецЕсли;
		
		Если ИмяКомандыДляВыполнения = "СоздатьГлоссарий" Тогда
			ОткрытьФорму("Справочник.ГлоссарииСУЗ.ФормаОбъекта", ПараметрыФормы, ВладелецФормы);
		КонецЕсли;
		
		Если ИмяКомандыДляВыполнения = "СоздатьФайл" Тогда
			ПараметрыФормы.Вставить("ОткрытьФормуФайла", Истина);
			ОткрытьФорму("Справочник.РесурсыСУЗ.ФормаОбъекта", ПараметрыФормы, ВладелецФормы);
		КонецЕсли;
		
		Если ИмяКомандыДляВыполнения = "СоздатьСтраницу" Тогда
			ОткрытьФорму("Справочник.СтраницыСУЗ.ФормаОбъекта", ПараметрыФормы, ВладелецФормы);
		КонецЕсли;
		
		Если ИмяКомандыДляВыполнения = "СоздатьЭлемент" Тогда
			ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("Владелец", ЭлектронныйРесурс));
			ПараметрыФормы.Вставить("СоздатьПустойЭлемент", Истина);
			ОткрытьФорму("Справочник.СодержаниеСУЗ.ФормаОбъекта", ПараметрыФормы, ВладелецФормы);
		КонецЕсли;
		
		
		Если ИмяКомандыДляВыполнения = "ДобавитьТеорию" Тогда
			ПараметрыФормы.Вставить("Отбор", Новый Структура("ЭтоТест", Ложь));
			ОткрытьФорму("Справочник.ПодборкиСУЗ.ФормаВыбора", ПараметрыФормы, ВладелецФормы);
		КонецЕсли;
		
		Если ИмяКомандыДляВыполнения = "ДобавитьТест" Тогда
			ПараметрыФормы.Вставить("Отбор", Новый Структура("ЭтоТест", Истина));
			ОткрытьФорму("Справочник.ПодборкиСУЗ.ФормаВыбора", ПараметрыФормы, ВладелецФормы);
		КонецЕсли;
		
		Если ИмяКомандыДляВыполнения = "ДобавитьГлоссарий" Тогда
			ОткрытьФорму("Справочник.ГлоссарииСУЗ.ФормаВыбора", ПараметрыФормы, ВладелецФормы);
		КонецЕсли;
		
		Если ИмяКомандыДляВыполнения = "ДобавитьФайл" Тогда
			ОткрытьФорму("Справочник.РесурсыСУЗ.ФормаВыбора", ПараметрыФормы, ВладелецФормы);
		КонецЕсли;
		
		Если ИмяКомандыДляВыполнения = "ДобавитьСтраницу" Тогда
			ОткрытьФорму("Справочник.СтраницыСУЗ.ФормаВыбора", ПараметрыФормы, ВладелецФормы);
		КонецЕсли;
		
		
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура СоздатьГлоссарий(Команда)
	ВыполнитьКомандуПередЗакрытием = Истина;
	ИмяКомандыДляВыполнения = Команда.Имя;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТеорию(Команда)
	ВыполнитьКомандуПередЗакрытием = Истина;
	ИмяКомандыДляВыполнения = Команда.Имя;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТест(Команда)
	ВыполнитьКомандуПередЗакрытием = Истина;
	ИмяКомандыДляВыполнения = Команда.Имя;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьФайл(Команда)
	ВыполнитьКомандуПередЗакрытием = Истина;
	ИмяКомандыДляВыполнения = Команда.Имя;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСтраницу(Команда)
	ВыполнитьКомандуПередЗакрытием = Истина;
	ИмяКомандыДляВыполнения = Команда.Имя;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЭлемент(Команда)
	ВыполнитьКомандуПередЗакрытием = Истина;
	ИмяКомандыДляВыполнения = Команда.Имя;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГлоссарий(Команда)
	ВыполнитьКомандуПередЗакрытием = Истина;
	ИмяКомандыДляВыполнения = Команда.Имя;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтраницу(Команда)
	ВыполнитьКомандуПередЗакрытием = Истина;
	ИмяКомандыДляВыполнения = Команда.Имя;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТеорию(Команда)
	ВыполнитьКомандуПередЗакрытием = Истина;
	ИмяКомандыДляВыполнения = Команда.Имя;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТест(Команда)
	ВыполнитьКомандуПередЗакрытием = Истина;
	ИмяКомандыДляВыполнения = Команда.Имя;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	ВыполнитьКомандуПередЗакрытием = Истина;
	ИмяКомандыДляВыполнения = Команда.Имя;
	Закрыть();
КонецПроцедуры

ВыполнитьКомандуПередЗакрытием = Ложь;
ВыполнитьКомандуПриЗакрытием = Ложь;