
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗначенияРеквизитов();
	
	Если ЗначениеЗаполнено(Параметры.Заголовок) Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	Если Значениезаполнено(Параметры.Подсказка) Тогда
		Элементы.ДекорацияПодсказка.Заголовок = Параметры.Подсказка;
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ПриИзмененииРеквизитовФиксированногоПериода();
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалаПриИзменении(Элемент)
	ПриИзмененииРеквизитовФиксированногоПериода();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	ПриИзмененииРеквизитовФиксированногоПериода();
КонецПроцедуры

&НаКлиенте
Процедура ВремяОкончанияПриИзменении(Элемент)
	ПриИзмененииРеквизитовФиксированногоПериода();
КонецПроцедуры

&НаКлиенте
Процедура СкрытьВремяПриИзменении(Элемент)
	ПриИзмененииРеквизитовФиксированногоПериода();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Установить(Команда)
	
	Отказ = Ложь;
	
	Если Параметры.ФиксированныеДаты Тогда
		
		Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) И ДатаНачала >= ДатаОкончания Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Дата начала должна быть меньше даты окончания'"),,,,Отказ);					
		КонецЕсли;
		
		Если СкрытьВремя И ДеньНачала = ДеньОкончания Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Совпадают даты обучения с... и по... Снимите флажок ""Скрыть время"" и задайте время'"),,,,Отказ);		
		КонецЕсли;
		
		СтруктураИнтервала = Новый Структура();
		СтруктураИнтервала.Вставить("ДатаНачала", ДатаНачала);
		СтруктураИнтервала.Вставить("ДатаОкончания", ДатаОкончания);
		СтруктураИнтервала.Вставить("СкрытьВремя", СкрытьВремя);		
		
	Иначе
	
		СтруктураИнтервала = Новый Структура();
		СтруктураИнтервала.Вставить("КоличествоЛет", КоличествоЛет);
		СтруктураИнтервала.Вставить("КоличествоМесяцев", КоличествоМесяцев);
		СтруктураИнтервала.Вставить("КоличествоДней", КоличествоДней);
		СтруктураИнтервала.Вставить("КоличествоЧасов", КоличествоЧасов);
		СтруктураИнтервала.Вставить("КоличествоМинут", КоличествоМинут);
		СтруктураИнтервала.Вставить("КоличествоСекунд", КоличествоСекунд);		
		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		Закрыть(СтруктураИнтервала);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Рекомендованное(Команда)
	УстановитьЗначенияРеквизитов(Истина);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервалДат(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период.ДатаНачала    = ДатаНачала;
	Диалог.Период.ДатаОкончания = ДеньОкончания;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьИнтервалПродолжение", ЭтотОбъект);
	
	Диалог.Показать(ОписаниеОповещения);	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервалПродолжение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНачала = НачалоДня(Период.ДатаНачала);
	ДатаОкончания = КонецДня(Период.ДатаОкончания);	
	
	ПриИзмененииДанныхФиксированногоПериода();			
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьФиксированныеДаты(Команда)
	ДатаНачала = Неопределено;
	ДатаОкончания = Неопределено;
	ПриИзмененииДанныхФиксированногоПериода();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьЗначенияРеквизитов(ВзятьРекомендованноеЗначение = Ложь)
	
	
	
	Если ВзятьРекомендованноеЗначение Тогда
		ИсточникНастроек = Параметры.РекомендованноеЗначение;
	Иначе
		ИсточникНастроек = Параметры.НачальноеЗначение;
	КонецЕсли;	
	
	Если Параметры.ФиксированныеДаты Тогда
		
		ДатаНачала = ИсточникНастроек.ДатаНачала;
		ДатаОкончания = ИсточникНастроек.ДатаОкончания;	
		СкрытьВремя = ИсточникНастроек.СкрытьВремя;
		
		ПриИзмененииДанныхФиксированногоПериода();
		
	Иначе		
		
		Если ТипЗнч(ИсточникНастроек) = Тип("Строка") Тогда
			НачальнаяСтруктураПериода = ОбъектыSCORM.ПолучитьСтруктуруВременногоИнтервалаSCORM(ИсточникНастроек);
		КонецЕсли;
		
		Если ТипЗнч(ИсточникНастроек) = Тип("Структура") Тогда
			НачальнаяСтруктураПериода = Параметры.НачальноеЗначение;
		КонецЕСли;
		
		Если ТипЗнч(ИсточникНастроек) = Тип("Число") Тогда
			ИнтервалSCORM             = ОбъектыSCORM.ПолучитьИзКоличестваСекундВременнойИнтервалSCORM(ИсточникНастроек);
			НачальнаяСтруктураПериода = ОбъектыSCORM.ПолучитьСтруктуруВременногоИнтервалаSCORM(ИнтервалSCORM);
		КонецЕсли;
		
		КоличествоЛет     = НачальнаяСтруктураПериода.КоличествоЛет;
		КоличествоМесяцев = НачальнаяСтруктураПериода.КоличествоМесяцев;
		КоличествоДней    = НачальнаяСтруктураПериода.КоличествоДней;
		КоличествоЧасов   = НачальнаяСтруктураПериода.КоличествоЧасов;
		КоличествоМинут   = НачальнаяСтруктураПериода.КоличествоМинут;
		КоличествоСекунд  = НачальнаяСтруктураПериода.КоличествоСекунд;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииРеквизитовФиксированногоПериода()
		
	Если СкрытьВремя Тогда
		ВремяНачала = НачалоДня(Дата("00010101"));
		Если ЗначениеЗаполнено(НачалоДня(ДатаОкончания)) Тогда
			ВремяОкончания = КонецДня(Дата("00010101"));
		Иначе
			ВремяОкончания = НачалоДня(Дата("00010101"));
		КонецЕсли;
	Иначе
		ВремяНачала = НачалоМинуты(ВремяНачала);
		ВремяОкончания = НачалоМинуты(ВремяОкончания);
	КонецЕсли;		

	Если ЗначениеЗаполнено(НачалоДня(ДеньНачала)) Тогда
		ДатаНачала = НачалоДня(ДеньНачала) + ОбщегоНазначенияСУКлиентСервер.ВыделитьВремя(ВремяНачала);
	Иначе
		ДатаНачала = Дата("00010101");
	КонецЕсли;

	Если ЗначениеЗаполнено(НачалоДня(ДеньОкончания)) Тогда
		ДатаОкончания = НачалоДня(ДеньОкончания) + ОбщегоНазначенияСУКлиентСервер.ВыделитьВремя(ВремяОкончания);
	Иначе
		ДатаОкончания = Дата("00010101");
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормы();	
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииДанныхФиксированногоПериода()
	
	ВремяНачала = ДатаНачала;
	ДеньНачала = ДатаНачала;
	ДеньОкончания = ДатаОкончания;
	ВремяОкончания = ДатаОкончания;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Если Параметры.ФиксированныеДаты Тогда
		
		Элементы.ГруппаФиксированныеДаты.Видимость = Истина;
		Элементы.ГруппаОтносительныйПериод.Видимость = Ложь;
		
		Элементы.ВремяНачала.Видимость = НЕ СкрытьВремя;
		Элементы.ВремяОкончания.Видимость = НЕ СкрытьВремя;
		
	Иначе
		
		Элементы.ГруппаФиксированныеДаты.Видимость = Ложь;
		Элементы.ГруппаОтносительныйПериод.Видимость = Истина;
		
		Если Параметры.ТолькоВремя Тогда
			Элементы.КоличествоЛет.Видимость     = Ложь;
			Элементы.КоличествоМесяцев.Видимость = Ложь;
			Элементы.КоличествоДней.Видимость    = Ложь;
		КонецЕсли;		
		
	КонецЕсли;
	
	Если Параметры.РекомендованноеЗначение = Неопределено Тогда
		Элементы.ЗадатьРекомендованное.Видимость = Ложь;
	Иначе
		Элементы.ЗадатьРекомендованное.Видимость = Истина;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
