#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПричиныВозвратаСтруктура() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПричиныВозвратаЗаданияНаДоработкуСУО.Ссылка,
		|	ПричиныВозвратаЗаданияНаДоработкуСУО.Наименование
		|ИЗ
		|	Справочник.ПричиныВозвратаЗаданияНаДоработкуСУО КАК ПричиныВозвратаЗаданияНаДоработкуСУО
		|ГДЕ
		|	ПричиныВозвратаЗаданияНаДоработкуСУО.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивПричин = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивПричин.Добавить(Новый Структура("Наименование, Идентификатор", ВыборкаДетальныеЗаписи.Наименование, ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор()));
	КонецЦикла;
	
	Возврат МассивПричин;
	
КонецФункции

Функция ЕстьПричиныВозврата() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПричиныВозвратаЗаданияНаДоработкуСУО.Ссылка
		|ИЗ
		|	Справочник.ПричиныВозвратаЗаданияНаДоработкуСУО КАК ПричиныВозвратаЗаданияНаДоработкуСУО
		|ГДЕ
		|	ПричиныВозвратаЗаданияНаДоработкуСУО.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();	
	
КонецФункции

#КонецЕсли
