// Выполняет импорт данных
//
Функция ВыполнитьИмпорт(ТекстРезультата, АдресФайлаВоВременномХранилище) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Выгружаем загруженный файл во временный файл на сервере.
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
	ПутьКФайлуНаСервере = ПолучитьИмяВременногоФайла("xml"); // Переменная будет заполнена в реквизите формы.

	ДвоичныеДанные.Записать(ПутьКФайлуНаСервере);
	
	УниверсальнаяВыгрузкаДанных = Обработки.УниверсальныйОбменДаннымиXML.Создать();
	УниверсальнаяВыгрузкаДанных.ИмяФайлаОбмена                                       = ПутьКФайлуНаСервере;
	УниверсальнаяВыгрузкаДанных.ЗагружатьДанныеВРежимеОбмена                         = Истина;
	УниверсальнаяВыгрузкаДанных.ЗаписыватьВИнформационнуюБазуТолькоИзмененныеОбъекты = Истина;
	УниверсальнаяВыгрузкаДанных.ОптимизированнаяЗаписьОбъектов                       = Истина;
	УниверсальнаяВыгрузкаДанных.ЗаписыватьРегистрыНаборамиЗаписей                    = Истина;
	УниверсальнаяВыгрузкаДанных.РежимОбмена                                          = "Загрузка";
	
	НачатьТранзакцию();
	
	Попытка
		
		УниверсальнаяВыгрузкаДанных.ВыполнитьЗагрузку();
		
	Исключение
		
		ТекстРезультата = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ОтменитьТранзакцию();
	
		Возврат Ложь;
		
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	
	УправлениеОбучениемСУО.ОбновитьДанныеСотрудников(); // Для всех пользователей
	УправлениеОбучениемСУО.ЗаписатьДанныеОРуководителях();
	
	ТекстРезультата = НСтр("ru = 'Импорт завершен'");

	Возврат Истина;
	
КонецФункции

