#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ОСНОВНОЕ	
	
Функция Отменено(Знач ПрохождениеОбучения) Экспорт
	
	// Получаем необходимые данные
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТребуемыеДанные = Новый Структура;
	ТребуемыеДанные.Вставить("ПроведениеОбучения", "ПроведениеОбучения");
	ТребуемыеДанные.Вставить("ПроведениеОбученияПроведено", "ПроведениеОбучения.Проведен");
	ТребуемыеДанные.Вставить("Отменено", "Отменено");
	ТребуемыеДанные.Вставить("РодительскоеПрохождение", "РодительскоеПрохождение");
	ТребуемыеДанные.Вставить("ПрохождениеПрограммыОбучения", "ПрохождениеПрограммыОбучения");
	ТребуемыеДанные.Вставить("Пользователь", "Пользователь");
	ТребуемыеДанные.Вставить("ПроведениеПрограммыОбучения", "ПроведениеОбучения.ПроведениеПрограммыОбучения");
	ТребуемыеДанные.Вставить("ПроведениеПрограммыОбученияПроведено", "ПроведениеОбучения.ПроведениеПрограммыОбучения.Проведен");
	ТребуемыеДанные.Вставить("СтатусПроведенияОбучения", "ПроведениеОбучения.Статус");
	ТребуемыеДанные.Вставить("ПрохождениеПрограммыОбученияПроведено", "ПрохождениеПрограммыОбучения.Проведен");
	ТребуемыеДанные.Вставить("СтатусПрохожденияПрограммыОбучения", "ПрохождениеПрограммыОбучения.Статус");
	
	Если ТипЗнч(ПрохождениеОбучения) = Тип("ДокументСсылка.ПрохождениеОбученияСУО") Тогда
		ДанныеОПрохождении = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеОбучения, ТребуемыеДанные);
	Иначе
		ДанныеОПрохождении = Новый Структура();
		Для каждого ЭлементСтруктуры Из ТребуемыеДанные Цикл
			Если Найти(ЭлементСтруктуры.Значение, ".") > 0 Тогда
				МассивЗначений = ОбщегоНазначенияСУКлиентСервер.РасщепитьСтроку(ЭлементСтруктуры.Значение, ".");
				Если МассивЗначений.Количество() = 2 Тогда
					ПодчиненноеЗначение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
						ПрохождениеОбучения[МассивЗначений[0]], МассивЗначений[1]);					
				ИначеЕсли МассивЗначений.Количество() = 3 Тогда
					ПодчиненноеЗначение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
						ПрохождениеОбучения[МассивЗначений[0]], МассивЗначений[1]+"."+МассивЗначений[2]);						
				Иначе
					ВызватьИсключение НСтр("ru = 'Невозможно получить данные'");
				КонецЕсли;
				ДанныеОПрохождении.Вставить(ЭлементСтруктуры.Ключ, ПодчиненноеЗначение);
			Иначе
				ДанныеОПрохождении.Вставить(ЭлементСтруктуры.Ключ, ПрохождениеОбучения[ЭлементСтруктуры.Значение]); 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Отменено
	
	Если ДанныеОПрохождении.Отменено Тогда		
		Возврат Истина;		
	КонецЕсли;
	
	// Родительское прохождение
	
	Если ЗначениеЗаполнено(ДанныеОПрохождении.РодительскоеПрохождение) Тогда
		
		РодительскоеПрохождениеОтменено = Документы.ПрохождениеОбученияСУО.Отменено(
			ДанныеОПрохождении.РодительскоеПрохождение);
			
		Если РодительскоеПрохождениеОтменено Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	// Прохождение программы обучения
	
	Если ЗначениеЗаполнено(ДанныеОПрохождении.ПрохождениеПрограммыОбучения) Тогда
		Если НЕ ДанныеОПрохождении.ПрохождениеПрограммыОбученияПроведено Тогда
			Возврат Истина;
		КонецЕсли;
		Если ДанныеОПрохождении.СтатусПрохожденияПрограммыОбучения = Перечисления.СтатусыПроведенияОбъектовСУО.Отменено Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	// Проведение обучения
	
	Если ДанныеОПрохождении.СтатусПроведенияОбучения = Перечисления.СтатусыПроведенияОбъектовСУО.Отменено Тогда
		Возврат Истина
	КонецЕсли;
	
	Если НЕ ДанныеОПрохождении.ПроведениеОбученияПроведено Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Проведение программы обучения
	
	Если ЗначениеЗаполнено(ДанныеОПрохождении.ПроведениеПрограммыОбучения)
		И НЕ ДанныеОПрохождении.ПроведениеПрограммыОбученияПроведено Тогда
		Возврат Истина;
	КонецЕсли;
		
	Возврат Ложь;	
	
КонецФункции

// Определяет, является ли обучение актуальным.
// Актуальное обучение - это такое, которое видно в активных.
// Если оно актуально, это не значит, что в нем доступны все
// ресурсы.
// 
Функция Актуально(Знач ПрохождениеОбучения, СтатусПроцессаОбучения = Неопределено) Экспорт
		
	Если СтатусПроцессаОбучения = Неопределено Тогда	
		СтатусПроцессаОбучения = СтатусПроцессаОбучения(ПрохождениеОбучения);
	КонецЕсли;
	
	МассивАктуальныхСтатусов = СтатусыАктуально();
	
	Если МассивАктуальныхСтатусов.Найти(СтатусПроцессаОбучения) = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция СтатусыАктуально()
	
	Статусы = Новый Массив;
	Статусы.Добавить(Перечисления.СтатусыПроцессаОбученияСУО.Запланировано);
	Статусы.Добавить(Перечисления.СтатусыПроцессаОбученияСУО.Новое);
	Статусы.Добавить(Перечисления.СтатусыПроцессаОбученияСУО.Активно);
	Статусы.Добавить(Перечисления.СтатусыПроцессаОбученияСУО.Проверяется);
	Статусы.Добавить(Перечисления.СтатусыПроцессаОбученияСУО.ВозвращеноНаДоработку);	
	
	Возврат Статусы;	
	
КонецФункции

Функция ЕстьАктуальныеУчастники(Знач ПроведениеОбучения) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УчастникиОбученияСУО.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.УчастникиОбученияСУО КАК УчастникиОбученияСУО
		|ГДЕ
		|	УчастникиОбученияСУО.ПроведениеОбучения = &ПроведениеОбучения
		|	И УчастникиОбученияСУО.СтатусПроцессаОбучения В(&АктуальныеСтатусы)";
	
	Запрос.УстановитьПараметр("АктуальныеСтатусы", СтатусыАктуально());
	Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции
	
// Определяет, является ли обучение пройденным.
// Пройденное обучение - это такое обучение, которое
// реально проходилось. Например, Автомат или Не допуск
// не позволяют считать обучение пройденным.
//
Функция Пройдено(Знач СтатусПрохождения) Экспорт
	
	Если СтатусПрохождения = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил
		ИЛИ СтатусПрохождения = Перечисления.СтатусыПрохожденияОбъектовСУО.НеЗавершил Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ЗаданияДоступны(ПрохождениеОбучения, ПроведениеОбучения = Неопределено,  Сценарий = Неопределено, ВидОбучения = Неопределено, СтатусПроцессаОбучения = Неопределено, ВариантПродолжительности = Неопределено, ДатаНачалаПрохождения = Неопределено) Экспорт
	
	Если СтатусПроцессаОбучения = Неопределено Тогда	
		СтатусПроцессаОбучения = СтатусПроцессаОбучения(ПрохождениеОбучения);
	КонецЕсли;	
	
	Если СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.Запланировано
		ИЛИ СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.НеДопущен Тогда				
		Возврат Ложь; // Запланированное обучение всегда не доступно для прохождения
	КонецЕсли;	
	
	Если ПроведениеОбучения = Неопределено Тогда
		ПроведениеОбучения = ПроведениеОбучения(ПрохождениеОбучения);
	КонецЕсли;		
	
	Если Сценарий = Неопределено Тогда
		Сценарий = Документы.ПроведениеОбученияСУО.СценарийОбучения(ПроведениеОбучения);
	КонецЕсли;	
	
	Если ВидОбучения = Неопределено Тогда
		ВидОбучения = Документы.ПроведениеОбученияСУО.ВидОбучения(ПроведениеОбучения, Сценарий);
	КонецЕсли;
	
	Если ВидОбучения.ЗакрытьДоступКМатериаламПослеЗавершения Тогда
				
		Если СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.Окончено
			ИЛИ СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.НеОкончено
			ИЛИ СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.ОконченоБезПроверки
			ИЛИ СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.ОконченоАвтоматом Тогда			
			Возврат Ложь;				
		КонецЕсли;
		
		Если ВремяИстекло(ПрохождениеОбучения) Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВариантПродолжительности = Неопределено Тогда
		ВариантПродолжительности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроведениеОбучения, "ВариантПродолжительности");
	КонецЕсли;
	
	Если ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.СНачалаОбучения
		И СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.Новое Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ДатаНачалаПрохождения = Неопределено Тогда		
		ДатаНачалаПрохождения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПрохождениеОбучения, "ДатаНачалаПрохождения");		
	КонецЕсли;
	
	Если НЕ ВремяНачалаОбученияНастало(ДатаНачалаПрохождения) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПоследовательноеПрохождениеЗаданий(ПрохождениеОбучения, ПроведениеОбучения = Неопределено, Сценарий = Неопределено) Экспорт
	
	Если ПроведениеОбучения = Неопределено Тогда
		ПроведениеОбучения = ПроведениеОбучения(ПрохождениеОбучения);
	КонецЕсли;		
	
	Если Сценарий = Неопределено Тогда
		Сценарий = Документы.ПроведениеОбученияСУО.СценарийОбучения(ПроведениеОбучения);		
	КонецЕсли; 
	
	Если ТипЗнч(Сценарий) = Тип("СправочникСсылка.КаталогМероприятийСУО")
		ИЛИ ТипЗнч(Сценарий) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сценарий, "ПоследовательноеПрохождениеЗаданий");
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПодчиненныеМероприятияДоступны(ПрохождениеОбучения, ПроведениеОбучения = Неопределено,  Сценарий = Неопределено, ВидОбучения = Неопределено, СтатусПроцессаОбучения = Неопределено, ДатаНачалаПрохождения = Неопределено) Экспорт	
	
	Если ПроведениеОбучения = Неопределено Тогда
		ПроведениеОбучения = ПроведениеОбучения(ПрохождениеОбучения);
	КонецЕсли;		
	
	Если Сценарий = Неопределено Тогда
		Сценарий = Документы.ПроведениеОбученияСУО.СценарийОбучения(ПроведениеОбучения);
	КонецЕсли;	
	
	Если ВидОбучения = Неопределено Тогда
		ВидОбучения = Документы.ПроведениеОбученияСУО.ВидОбучения(ПроведениеОбучения, Сценарий);
	КонецЕсли;		
 	
	Если НЕ ВидОбучения.Общее Тогда
		Возврат Ложь; // Подчиненные есть только у общих
	КонецЕсли;
		
	Если СтатусПроцессаОбучения = Неопределено Тогда
		СтатусПроцессаОбучения = СтатусПроцессаОбучения(ПрохождениеОбучения);
	КонецЕсли;	
	
	// Подчиненные мероприятия общего обучения доступны в тех же случаях, что и задания.
	Возврат ЗаданияДоступны(ПрохождениеОбучения, ПроведениеОбучения, Сценарий, ВидОбучения, СтатусПроцессаОбучения,, ДатаНачалаПрохождения);
	
КонецФункции

Функция СтатусПроцессаОбучения(Знач ПрохождениеОбучения, Знач ПроведениеОбученияСтатус = Неопределено) Экспорт
	
	Если Документы.ПрохождениеОбученияСУО.Отменено(ПрохождениеОбучения) Тогда
		Возврат Перечисления.СтатусыПроцессаОбученияСУО.ПустаяСсылка(); // Нет статуса процесса обучения, так как обучения тоже нет
	КонецЕсли;
	
	Если ТипЗнч(ПрохождениеОбучения) = Тип("ДокументСсылка.ПрохождениеОбученияСУО") Тогда
		ДанныеПрохождения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеОбучения, "Статус, РодительскоеПрохождение, ПроверяетсяПреподавателем, ПроверенПреподавателем, ВозвращеноНаДоработку, Сценарий, ПроведениеОбучения, ЗавершеноВПроцентах");
	Иначе
		ДанныеПрохождения = ПрохождениеОбучения;
	КонецЕсли;	
	
	Если ДанныеПрохождения.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.НеДопущен Тогда			
		Возврат Перечисления.СтатусыПроцессаОбученияСУО.НеДопущен;			
	КонецЕсли;
	
	Если ДанныеПрохождения.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат Тогда
		Возврат Перечисления.СтатусыПроцессаОбученияСУО.ОконченоАвтоматом;	
	КонецЕсли;
	
	Если ПроведениеОбученияСтатус = Неопределено Тогда
		ПроведениеОбученияСтатус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеПрохождения.ПроведениеОбучения, "Статус");
	КонецЕсли;
	
	Если ПроведениеОбученияСтатус = Перечисления.СтатусыПроведенияОбъектовСУО.Запланировано Тогда		
		Возврат Перечисления.СтатусыПроцессаОбученияСУО.Запланировано;				
	КонецЕсли;	
	
	Если ПроведениеОбученияСтатус = Перечисления.СтатусыПроведенияОбъектовСУО.Завершено Тогда
		
		Если ДанныеПрохождения.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил Тогда
			Возврат Перечисления.СтатусыПроцессаОбученияСУО.Окончено;
		ИначеЕсли ДанныеПрохождения.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат Тогда
			Возврат Перечисления.СтатусыПроцессаОбученияСУО.ОконченоАвтоматом;
		Иначе
			Возврат Перечисления.СтатусыПроцессаОбученияСУО.НеОкончено;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПроведениеОбученияСтатус = Перечисления.СтатусыПроведенияОбъектовСУО.Активно Тогда

		Если ДанныеПрохождения.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Зачислен Тогда			
			Возврат Перечисления.СтатусыПроцессаОбученияСУО.Новое;			
		КонецЕсли;
		
		Если ДанныеПрохождения.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Проходит Тогда
			
			ВидОбучения = Документы.ПроведениеОбученияСУО.ВидОбучения(ДанныеПрохождения.ПроведениеОбучения, ДанныеПрохождения.Сценарий);
			
			Если ДанныеПрохождения.ПроверяетсяПреподавателем И НЕ ДанныеПрохождения.ПроверенПреподавателем И НЕ Справочники.ВидыМероприятийСУО.ЗаданияПроверяютсяВыборочно(ВидОбучения) Тогда
				Возврат Перечисления.СтатусыПроцессаОбученияСУО.Проверяется;
			Иначе				
				Если ДанныеПрохождения.ВозвращеноНаДоработку Тогда
					Возврат Перечисления.СтатусыПроцессаОбученияСУО.ВозвращеноНаДоработку;
				Иначе
					Возврат Перечисления.СтатусыПроцессаОбученияСУО.Активно;
				КонецЕсли;			
			КонецЕсли;
			
		КонецЕсли;
		
		Если ДанныеПрохождения.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил Тогда
			
			Если ДанныеПрохождения.ПроверяетсяПреподавателем И НЕ ДанныеПрохождения.ПроверенПреподавателем Тогда
				Возврат Перечисления.СтатусыПроцессаОбученияСУО.ОконченоБезПроверки;
			Иначе
				Возврат Перечисления.СтатусыПроцессаОбученияСУО.Окончено;								
			КонецЕсли;			
			
		КонецЕсли;
		
		Если ДанныеПрохождения.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат Тогда
			Возврат Перечисления.СтатусыПроцессаОбученияСУО.ОконченоАвтоматом;
		КонецЕсли;
		
		Если ДанныеПрохождения.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.НеЗавершил Тогда			
			Возврат Перечисления.СтатусыПроцессаОбученияСУО.НеОкончено;			
		КонецЕсли;			
			
	КонецЕсли;
	
	Возврат Перечисления.СтатусыПроцессаОбученияСУО.ПустаяСсылка();

КонецФункции

Функция Представление(Знач ПрохождениеОбучения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
		Возврат "<>";
	КонецЕсли;
	
	ТребуемыеДанные = Новый Структура("
	|Дата,
	|ДатаНачалаОбучения,
	|НаименованиеСценария,
	|НаименованиеПользователя",
	"Дата",		
	"ПроведениеОбучения.ДатаНачалаПроведения",
	"Сценарий.Наименование",
	"Пользователь.Наименование"
	);
	
	Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеОбучения, ТребуемыеДанные);
	
	ДатаОбучения = ?(ЗначениеЗаполнено(Данные.ДатаНачалаОбучения), Данные.ДатаНачалаОбучения, Данные.Дата);
	
	Возврат Строка(Данные.НаименованиеСценария) + " / " + Строка(Данные.НаименованиеПользователя) + ", " + Строка(Формат(ДатаОбучения, "ДЛФ=D")) + " /";
			
КонецФункции

Функция НаименованиеОбучения(ДанныеПрохождения) Экспорт
	
	Если ДанныеПрохождения.Свойство("РодительскоеПроведение")
		И ЗначениеЗаполнено(ДанныеПрохождения.РодительскоеПроведение) Тогда
		Возврат ДанныеПрохождения.НаименованиеСценария; // Подчиненное обучение преподавателя
	ИначеЕсли ДанныеПрохождения.Свойство("РодительскоеПрохождение") 
		И ЗначениеЗаполнено(ДанныеПрохождения.РодительскоеПрохождение) Тогда
		Возврат ДанныеПрохождения.НаименованиеСценария; // Подчиненное обучение обучающегося
	Иначе
		Возврат ?(ЗначениеЗаполнено(ДанныеПрохождения.НаименованиеПроведенияОбучения), ДанныеПрохождения.НаименованиеПроведенияОбучения, ДанныеПрохождения.НаименованиеСценария);
	КонецЕсли;		
	
КонецФункции

Функция ТипАктивности() Экспорт
	Возврат Перечисления.ТипыУчебныхАктивностейСУО.Обучение;
КонецФункции

Функция СценарийОбучения(Знач ПрохождениеОбучения) Экспорт
	
	Если ТипЗнч(ПрохождениеОбучения) = Тип("ДокументСсылка.ПрохождениеОбученияСУО") Тогда
		ПрохождениеОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеОбучения, "Сценарий, ПроведениеОбучения");
	Иначе
		ПрохождениеОбученияСвойства = ПрохождениеОбучения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПрохождениеОбученияСвойства.Сценарий) Тогда
		Возврат ПрохождениеОбученияСвойства.Сценарий;
	Иначе
		Возврат Документы.ПроведениеОбученияСУО.СценарийОбучения(ПрохождениеОбученияСвойства.ПроведениеОбучения);
	КонецЕсли;	
	
КонецФункции

Функция ПроведениеОбучения(Знач ПрохождениеОбучения) Экспорт
	
	Если ТипЗнч(ПрохождениеОбучения) = Тип("ДокументСсылка.ПрохождениеОбученияСУО") Тогда
		ПрохождениеОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеОбучения, "ПроведениеОбучения");
	Иначе
		ПрохождениеОбученияСвойства = ПрохождениеОбучения;
	КонецЕсли;
	
	Возврат ПрохождениеОбученияСвойства.ПроведениеОбучения;
	
КонецФункции

Функция ДоступноОбщение(Знач ПрохождениеОбучения) Экспорт
	
	Если Актуально(ПрохождениеОбучения) Тогда
		Возврат Документы.ПроведениеОбученияСУО.ДоступноОбщение(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПрохождениеОбучения, "ПроведениеОбучения"));
	Иначе
		Возврат Ложь;
	КонецЕсли;	
		
КонецФункции

Функция ЕстьАвтоРазделыФорума(Знач ПрохождениеОбучения) Экспорт
	
	Если ТипЗнч(ПрохождениеОбучения) = Тип("ДокументСсылка.ПрохождениеОбученияСУО") Тогда
		ПрохождениеОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеОбучения, "Пользователь, ПроведениеОбучения");
	Иначе
		ПрохождениеОбученияСвойства = ПрохождениеОбучения;
	КонецЕсли;
	
	Возврат РегистрыСведений.АвтоРазделыФорумаСУО.РазделыПользователя(ПрохождениеОбученияСвойства.Пользователь, ПрохождениеОбученияСвойства.ПроведениеОбучения, Истина); 
	
КонецФункции

Функция ДоступноПрикреплениеФайлов(Знач ПрохождениеОбучения, СтатусПроцессаОбучения = Неопределено, ПрохождениеАктуально = Неопределено) Экспорт
	
	Если СтатусПроцессаОбучения = Неопределено Тогда
		СтатусПроцессаОбучения = СтатусПроцессаОбучения(ПрохождениеОбучения);				
	КонецЕсли;	
	
	Если ПрохождениеАктуально = Неопределено Тогда
		ПрохождениеАктуально = Актуально(ПрохождениеОбучения, СтатусПроцессаОбучения);
	КонецЕсли;
	
	Если ПрохождениеАктуально Тогда		
		
		Если СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.Активно
			ИЛИ СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.ВозвращеноНаДоработку
			ИЛИ СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.Новое
			ИЛИ СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.Проверяется Тогда				
			
			ДанныеПрохожденияОбучения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеОбучения, "ПроведениеОбучения, Сценарий");
			Возврат Документы.ПроведениеОбученияСУО.ДоступноПрикреплениеФайлов(ДанныеПрохожденияОбучения.ПроведениеОбучения, ДанныеПрохожденияОбучения.Сценарий);
			
		Иначе
			
			Возврат Ложь;
			
		КонецЕсли;
		
	Иначе
		
		Возврат Ложь;		
		
	КонецЕсли;
			
КонецФункции

Функция ДоступноЗавершениеУчащимся(Знач ПрохождениеОбучения, Знач ПроведениеОбучения = Неопределено, Знач Сценарий = Неопределено, Знач ВидОбучения = Неопределено) Экспорт	
	
	Если Актуально(ПрохождениеОбучения) Тогда
		
		Если Сценарий = Неопределено Тогда
			Сценарий = СценарийОбучения(ПрохождениеОбучения);
		КонецЕсли;
		
		Если ПроведениеОбучения = Неопределено Тогда
			ПроведениеОбучения = ПроведениеОбучения(ПрохождениеОбучения);
		КонецЕсли;
		
		Возврат Документы.ПроведениеОбученияСУО.ДоступноЗавершениеУчащимся(ПроведениеОбучения, Сценарий, ВидОбучения);
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;		
	
КонецФункции

Функция КоличествоПрикрепленныхФайлов(Знач ПрохождениеОбучения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПрохождениеОбученияСУОПрисоединенныеФайлы.Ссылка) КАК Количество
		|ИЗ
		|	Справочник.ПрохождениеОбученияСУОПрисоединенныеФайлы КАК ПрохождениеОбученияСУОПрисоединенныеФайлы
		|ГДЕ
		|	ПрохождениеОбученияСУОПрисоединенныеФайлы.ВладелецФайла = &ПрохождениеОбучения
		|	И ПрохождениеОбученияСУОПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Количество;
	
КонецФункции	
	
Функция ОписаниеЕдинственногоЗаданияПрохождения(Знач ПрохождениеОбучения, ПроведениеОбучения = Неопределено, Сценарий = Неопределено) Экспорт
	
	Если ПроведениеОбучения = Неопределено Тогда
		ПроведениеОбучения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПрохождениеОбучения, "ПроведениеОбучения");
	КонецЕсли;
	
	Если Сценарий = Неопределено Тогда 
		Сценарий = СценарийОбучения(ПрохождениеОбучения);
	КонецЕсли;
	
	Возврат Документы.ПроведениеОбученияСУО.ОписаниеЕдинственногоЗаданияОбучения(ПроведениеОбучения, Сценарий);		
	
КонецФункции

Функция СвойстваЗаданияПрохождения(Знач ПрохождениеОбучения, Задание) Экспорт
	
	ВсеЗадания = ЗаданияПрохождения(ПрохождениеОбучения, Задание);
	СтрокаЗадания = ВсеЗадания.Найти(Задание, "Задание");
	
	Если СтрокаЗадания = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НаборСвойств = Новый Структура;
	Для каждого КолонкаТЗ Из ВсеЗадания.Колонки Цикл
		НаборСвойств.Вставить(КолонкаТЗ.Имя, СтрокаЗадания[КолонкаТЗ.Имя]);
	КонецЦикла;
	
	Возврат НаборСвойств;
	
КонецФункции

Функция ЗаданияПрохождения(Знач ПрохождениеОбучения, Знач Задание = Неопределено) Экспорт
	
	Если ТипЗнч(ПрохождениеОбучения) = Тип("ДокументСсылка.ПрохождениеОбученияСУО") Тогда
		ПрохождениеОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеОбучения, "Ссылка, Сценарий, ПроведениеОбучения, ДобавленоВремениВСекундах");
	Иначе
		ПрохождениеОбученияСвойства = ПрохождениеОбучения;
	КонецЕсли;
	
	МассивЗаданий = Новый Массив;
	МассивЭлектронныхРесурсов = Новый Массив;
	МассивЭлектронныхКурсов = Новый Массив;
	ТаблицаНаименований = Документы.ПроведениеОбученияСУО.ПустаяТаблицаНаименованийЗаданий();
	ВидОбучения = Документы.ПроведениеОбученияСУО.ВидОбучения(ПрохождениеОбученияСвойства.ПроведениеОбучения, ПрохождениеОбученияСвойства.Сценарий);  
	
	Если ТипЗнч(ПрохождениеОбученияСвойства.Сценарий) = Тип("ДокументСсылка.ПроведениеОбученияСУО")
		ИЛИ ТипЗнч(ПрохождениеОбученияСвойства.Сценарий) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
		Документы.ПроведениеОбученияСУО.ЗаполнитьМассивЗаданийИЭлектронныхРесурсов(ПрохождениеОбученияСвойства.ПроведениеОбучения, МассивЗаданий, МассивЭлектронныхРесурсов, МассивЭлектронныхКурсов, ТаблицаНаименований, ВидОбучения, Задание);
	КонецЕсли;
	
	ШкалаОценкиПроведения = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданияСУО.Ссылка КАК Задание,
		|	ЗаданияСУО.Описание КАК Описание,
		|	ЗаданияСУО.ЗначимостьОценки КАК Значимость,
		|	ЗаданияСУО.НаОсновеЭлектронногоРесурса КАК НаОсновеЭлектронногоРесурса,
		|	ЗаданияСУО.ЭлектронныйРесурс КАК ЭлектронныйРесурс,
		|	ЗаданияСУО.Фрагмент КАК Фрагмент,
		|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.Регистратор КАК ПопыткаВыполнения,
		|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.Баллы КАК Баллы,
		|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ШкалаОценки КАК ШкалаОценки,
		|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ЗавершеноВПроцентах КАК ЗавершеноВПроцентах,
		|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ПопыткаЗавершена КАК Завершено,
		|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ПроверяетсяПреподавателем КАК ПроверяетсяПреподавателем,
		|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ПроверенПреподавателем КАК ПроверенПреподавателем,
		|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.Вариант КАК Вариант,
		|	ЗаданияСУО.Наименование КАК Наименование,
		|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.КомментарийПреподавателя КАК КомментарийПреподавателя,
		|	ЗаданияСУО.ПреподавательВыставляетОценку КАК ПреподавательВыставляетОценку,
		|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ВозвращеноНаДоработку КАК ВозвращеноНаДоработку,
		|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ЗатраченоВремениВСекундах КАК ЗатраченоВремениВСекундах,
		|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.НеЖдатьПроверки КАК НеЖдатьПроверки,
		|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ДатаОтправкиНаПроверку КАК ДатаОтправкиНаПроверку,
		|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ДатаВозвратаНаДоработку КАК ДатаВозвратаНаДоработку,
		|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ВыставляетсяОценка КАК ВыставляетсяОценка
		|ИЗ
		|	Справочник.ЗаданияСУО КАК ЗаданияСУО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПопыткиПрохожденияЗаданийСУО.СрезПоследних(, ПрохождениеОбучения = &ПрохождениеОбучения) КАК ПопыткиПрохожденияЗаданийСУОСрезПоследних
		|		ПО (ПопыткиПрохожденияЗаданийСУОСрезПоследних.Задание = ЗаданияСУО.Ссылка)
		|ГДЕ
		|	(&ОтборПоСценарию
		|			ИЛИ ЗаданияСУО.Ссылка В (&МассивЗаданий))
		|	И ЗаданияСУО.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаданияСУО.РеквизитДопУпорядочивания";

	Если ТипЗнч(ПрохождениеОбученияСвойства.Сценарий) = Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоСценарию", "ЗаданияСУО.Владелец = &Мероприятие");
		Запрос.УстановитьПараметр("Мероприятие", ПрохождениеОбученияСвойства.Сценарий);	
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоСценарию", "ЛОЖЬ");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивЗаданий", МассивЗаданий);
	Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбученияСвойства.Ссылка);

	Результат = Запрос.Выполнить();

	ТаблицаЗаданий = Результат.Выгрузить();
	
	Документы.ПроведениеОбученияСУО.ПривестиТипыТаблицыЗаданий(ТаблицаЗаданий);
	
	ТаблицаЗаданий.Колонки.Добавить("Номер");
	ТаблицаЗаданий.Колонки.Добавить("ПроходнойБалл", Новый ОписаниеТипов("Число"));
	ТаблицаЗаданий.Колонки.Добавить("ДатаНачалаДоступаКЗаданию", Новый ОписаниеТипов("Дата"));
	ТаблицаЗаданий.Колонки.Добавить("ДатаОкончанияДоступаКЗаданию", Новый ОписаниеТипов("Дата"));
	ТаблицаЗаданий.Колонки.Добавить("СкрытьВремяДоступаКЗаданию", Новый ОписаниеТипов("Булево"));
	
	НомерЗадания = 1;
	Для каждого СтрокаТЗ Из ТаблицаЗаданий Цикл
		СтрокаТЗ.Номер = НомерЗадания;
		СтрокаТЗ.ДатаНачалаДоступаКЗаданию = Дата("00010101");
		СтрокаТЗ.ДатаОкончанияДоступаКЗаданию = Дата("00010101");
		СтрокаТЗ.СкрытьВремяДоступаКЗаданию = Ложь;		
		
		СтрокаТН = ТаблицаНаименований.Найти(СтрокаТЗ.Задание, "Задание");		
		Если СтрокаТН <> Неопределено Тогда
			СтрокаТЗ.Номер = СтрокаТН.Номер;
			СтрокаТЗ.ПроходнойБалл = СтрокаТН.ПроходнойБалл;
			СтрокаТЗ.Значимость = СтрокаТН.Значимость;
			СтрокаТЗ.ДатаНачалаДоступаКЗаданию = Документы.ПопыткаВыполненияЗаданияСУО.ДатаДоступаКЗаданию(СтрокаТН.ДатаНачалаДоступаКЗаданию, ПрохождениеОбученияСвойства.ДобавленоВремениВСекундах);
			СтрокаТЗ.ДатаОкончанияДоступаКЗаданию = Документы.ПопыткаВыполненияЗаданияСУО.ДатаДоступаКЗаданию(СтрокаТН.ДатаОкончанияДоступаКЗаданию, ПрохождениеОбученияСвойства.ДобавленоВремениВСекундах);;
			СтрокаТЗ.СкрытьВремяДоступаКЗаданию = СтрокаТН.СкрытьВремяДоступаКЗаданию;
			Если ЗначениеЗаполнено(СтрокаТН.Наименование) Тогда
				СтрокаТЗ.Наименование = СтрокаТН.Наименование;
			КонецЕсли;
			СтрокаТЗ.НеЖдатьПроверки = СтрокаТН.НеЖдатьПроверки;
		КонецЕсли;
		
		Если ВидОбучения.ВыставляетсяОценка Тогда
			Если НЕ ЗначениеЗаполнено(СтрокаТЗ.ПопыткаВыполнения) Тогда			
				Если СтрокаТН = Неопределено Тогда
					СтрокаТЗ.ВыставляетсяОценка = Истина;					
				Иначе
					СтрокаТЗ.ВыставляетсяОценка = СтрокаТН.ВыставляетсяОценка;
				КонецЕсли;
			КонецЕсли;
		Иначе
			СтрокаТЗ.ВыставляетсяОценка = Ложь;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЗ.ПопыткаВыполнения)
			И Документы.ПопыткаВыполненияЗаданияСУО.ВремяИстекло(СтрокаТЗ) Тогда
			
			СтрокаТЗ.ПопыткаВыполнения = Неопределено;
			СтрокаТЗ.Баллы = 0;
			СтрокаТЗ.ЗавершеноВПроцентах = 0;
			СтрокаТЗ.Завершено = Ложь;
			СтрокаТЗ.ПроверяетсяПреподавателем = Ложь;
			СтрокаТЗ.ПроверенПреподавателем = Ложь;
			СтрокаТЗ.Вариант = Неопределено;
			СтрокаТЗ.КомментарийПреподавателя = "";
			СтрокаТЗ.ВозвращеноНаДоработку = Ложь;			
			СтрокаТЗ.ЗатраченоВремениВСекундах = 0;
			СтрокаТЗ.НеЖдатьПроверки = Ложь;
			СтрокаТЗ.ДатаОтправкиНаПроверку = Дата("00010101");
			СтрокаТЗ.ДатаВозвратаНаДоработку = Дата("00010101");	
			
		КонецЕсли;		
		Если НЕ ЗначениеЗаполнено(СтрокаТЗ.ШкалаОценки) Тогда
			Если ШкалаОценкиПроведения = Неопределено Тогда
				ШкалаОценкиПроведения = Документы.ПроведениеОбученияСУО.ШкалаОценки(ПрохождениеОбученияСвойства.ПроведениеОбучения);
			КонецЕсли;
			СтрокаТЗ.ШкалаОценки = ШкалаОценкиПроведения;
		КонецЕсли;
		НомерЗадания = НомерЗадания + 1;
	КонецЦикла;	
	
	Если МассивЭлектронныхРесурсов.Количество() > 0 ИЛИ МассивЭлектронныхКурсов.Количество() > 0 Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.Регистратор КАК ПопыткаВыполнения,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.Баллы КАК Баллы,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ШкалаОценки КАК ШкалаОценки,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ЗавершеноВПроцентах КАК ЗавершеноВПроцентах,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ПопыткаЗавершена КАК Завершено,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ПроверяетсяПреподавателем КАК ПроверяетсяПреподавателем,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ПроверенПреподавателем КАК ПроверенПреподавателем,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.Вариант КАК Вариант,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.КомментарийПреподавателя КАК КомментарийПреподавателя,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ВозвращеноНаДоработку КАК ВозвращеноНаДоработку,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.Задание КАК ЭлектронныйРесурс,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.Задание.Наименование КАК Наименование,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ЗатраченоВремениВСекундах КАК ЗатраченоВремениВСекундах,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.НеЖдатьПроверки КАК НеЖдатьПроверки,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ДатаОтправкиНаПроверку КАК ДатаОтправкиНаПроверку,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ДатаВозвратаНаДоработку КАК ДатаВозвратаНаДоработку,
			|	ПопыткиПрохожденияЗаданийСУОСрезПоследних.ВыставляетсяОценка КАК ВыставляетсяОценка
			|ИЗ
			|	РегистрСведений.ПопыткиПрохожденияЗаданийСУО.СрезПоследних(
			|			,
			|			ПрохождениеОбучения = &ПрохождениеОбучения
			|				И Задание В (&МассивЭлектронныхРесурсов)) КАК ПопыткиПрохожденияЗаданийСУОСрезПоследних";
		
		Запрос.УстановитьПараметр("МассивЭлектронныхРесурсов", МассивЭлектронныхРесурсов);
		Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбученияСвойства.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ТаблицаПопытокПрохожденияЭРЗадания = РезультатЗапроса.Выгрузить();
		
		Для каждого ЭлектронныйРесурс Из МассивЭлектронныхРесурсов Цикл
			
			НоваяСтрока = ТаблицаЗаданий.Добавить();
		    НоваяСтрока.Задание = ЭлектронныйРесурс;
			НоваяСтрока.Значимость = 1;
			НоваяСтрока.НаОсновеЭлектронногоРесурса = Истина;
			НоваяСтрока.ЭлектронныйРесурс = ЭлектронныйРесурс;
			НоваяСтрока.ПреподавательВыставляетОценку = Ложь;
			НоваяСтрока.ДатаНачалаДоступаКЗаданию = Дата("00010101");
			НоваяСтрока.ДатаОкончанияДоступаКЗаданию = Дата("00010101");
			НоваяСтрока.СкрытьВремяДоступаКЗаданию = Ложь;			
			НоваяСтрока.ВыставляетсяОценка = ВидОбучения.ВыставляетсяОценка;
			
			СтрокаТН = ТаблицаНаименований.Найти(ЭлектронныйРесурс, "Задание");
			Если СтрокаТН <> Неопределено Тогда
				НоваяСтрока.Номер = СтрокаТН.Номер;
				НоваяСтрока.ПроходнойБалл = СтрокаТН.ПроходнойБалл;
				НоваяСтрока.Значимость = СтрокаТН.Значимость;
				НоваяСтрока.ДатаНачалаДоступаКЗаданию = Документы.ПопыткаВыполненияЗаданияСУО.ДатаДоступаКЗаданию(СтрокаТН.ДатаНачалаДоступаКЗаданию, ПрохождениеОбученияСвойства.ДобавленоВремениВСекундах);
				НоваяСтрока.ДатаОкончанияДоступаКЗаданию = Документы.ПопыткаВыполненияЗаданияСУО.ДатаДоступаКЗаданию(СтрокаТН.ДатаОкончанияДоступаКЗаданию, ПрохождениеОбученияСвойства.ДобавленоВремениВСекундах);
				НоваяСтрока.СкрытьВремяДоступаКЗаданию = СтрокаТН.СкрытьВремяДоступаКЗаданию;				
				Если ЗначениеЗаполнено(СтрокаТН.Наименование) Тогда
					НоваяСтрока.Наименование = СтрокаТН.Наименование;				
				Иначе
					НоваяСтрока.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлектронныйРесурс, "Наименование");
				КонецЕсли;
				Если ВидОбучения.ВыставляетсяОценка Тогда
					НоваяСтрока.ВыставляетсяОценка = СтрокаТН.ВыставляетсяОценка;
				КонецЕсли;
				НоваяСтрока.НеЖдатьПроверки = СтрокаТН.НеЖдатьПроверки;
			КонецЕсли;
			
			ДанныеПрохожденияЗадания = ТаблицаПопытокПрохожденияЭРЗадания.Найти(ЭлектронныйРесурс, "ЭлектронныйРесурс");
			
			Если ДанныеПрохожденияЗадания <> Неопределено Тогда								
				НоваяСтрока.ПопыткаВыполнения = ДанныеПрохожденияЗадания.ПопыткаВыполнения;
				НоваяСтрока.Баллы = ДанныеПрохожденияЗадания.Баллы;
				НоваяСтрока.ШкалаОценки = ДанныеПрохожденияЗадания.ШкалаОценки;
				НоваяСтрока.ЗавершеноВПроцентах = ДанныеПрохожденияЗадания.ЗавершеноВПроцентах;
				НоваяСтрока.Завершено = ДанныеПрохожденияЗадания.Завершено;
				НоваяСтрока.ПроверяетсяПреподавателем = ДанныеПрохожденияЗадания.ПроверяетсяПреподавателем;
				НоваяСтрока.ПроверенПреподавателем = ДанныеПрохожденияЗадания.ПроверенПреподавателем;
				НоваяСтрока.Вариант = ДанныеПрохожденияЗадания.Вариант;
				НоваяСтрока.КомментарийПреподавателя = ДанныеПрохожденияЗадания.КомментарийПреподавателя;
				НоваяСтрока.ВозвращеноНаДоработку = ДанныеПрохожденияЗадания.ВозвращеноНаДоработку;			
				НоваяСтрока.ЗатраченоВремениВСекундах = ДанныеПрохожденияЗадания.ЗатраченоВремениВСекундах;
				НоваяСтрока.НеЖдатьПроверки = ДанныеПрохожденияЗадания.НеЖдатьПроверки;
				НоваяСтрока.ДатаОтправкиНаПроверку = ДанныеПрохожденияЗадания.ДатаОтправкиНаПроверку;
				НоваяСтрока.ДатаВозвратаНаДоработку = ДанныеПрохожденияЗадания.ДатаВозвратаНаДоработку;
				Если ВидОбучения.ВыставляетсяОценка Тогда
					НоваяСтрока.ВыставляетсяОценка = ДанныеПрохожденияЗадания.ВыставляетсяОценка;
				КонецЕсли;
			КонецЕсли;	
			
			Если ДанныеПрохожденияЗадания = Неопределено
				И Документы.ПопыткаВыполненияЗаданияСУО.ВремяИстекло(НоваяСтрока) Тогда
				
				НоваяСтрока.ПопыткаВыполнения = Неопределено;
				НоваяСтрока.Баллы = 0;
				НоваяСтрока.ЗавершеноВПроцентах = 0;
				НоваяСтрока.Завершено = Ложь;
				НоваяСтрока.ПроверяетсяПреподавателем = Ложь;
				НоваяСтрока.ПроверенПреподавателем = Ложь;				
				НоваяСтрока.Вариант = Неопределено;
				НоваяСтрока.КомментарийПреподавателя = "";
				НоваяСтрока.ВозвращеноНаДоработку = Ложь;			
				НоваяСтрока.ЗатраченоВремениВСекундах = 0;
				НоваяСтрока.НеЖдатьПроверки = Ложь;
				НоваяСтрока.ДатаОтправкиНаПроверку = Дата("00010101");
				НоваяСтрока.ДатаВозвратаНаДоработку = Дата("00010101");	
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.ШкалаОценки) Тогда
				Если ШкалаОценкиПроведения = Неопределено Тогда
					ШкалаОценкиПроведения = Документы.ПроведениеОбученияСУО.ШкалаОценки(ПрохождениеОбученияСвойства.ПроведениеОбучения);
				КонецЕсли;
				НоваяСтрока.ШкалаОценки = ШкалаОценкиПроведения;
			КонецЕсли;
			
		КонецЦикла;
		
			
		Для каждого ЭлектронныйКурс Из МассивЭлектронныхКурсов Цикл
			
			НоваяСтрока = ТаблицаЗаданий.Добавить();
		    НоваяСтрока.Задание = ЭлектронныйКурс;
			НоваяСтрока.Значимость = 1;
			НоваяСтрока.НаОсновеЭлектронногоРесурса = Ложь;
			НоваяСтрока.ЭлектронныйРесурс = ЭлектронныйКурс;
			НоваяСтрока.ПреподавательВыставляетОценку = Ложь;
			НоваяСтрока.ДатаНачалаДоступаКЗаданию = Дата("00010101");
			НоваяСтрока.ДатаОкончанияДоступаКЗаданию = Дата("00010101");
			НоваяСтрока.СкрытьВремяДоступаКЗаданию = Ложь;			
			НоваяСтрока.ВыставляетсяОценка = ВидОбучения.ВыставляетсяОценка;
			
			СтрокаТН = ТаблицаНаименований.Найти(ЭлектронныйКурс, "Задание");
			Если СтрокаТН <> Неопределено Тогда
				НоваяСтрока.Номер = СтрокаТН.Номер;
				НоваяСтрока.ПроходнойБалл = СтрокаТН.ПроходнойБалл;
				НоваяСтрока.Значимость = СтрокаТН.Значимость;
				НоваяСтрока.ДатаНачалаДоступаКЗаданию = Документы.ПопыткаВыполненияЗаданияСУО.ДатаДоступаКЗаданию(СтрокаТН.ДатаНачалаДоступаКЗаданию, ПрохождениеОбученияСвойства.ДобавленоВремениВСекундах);
				НоваяСтрока.ДатаОкончанияДоступаКЗаданию = Документы.ПопыткаВыполненияЗаданияСУО.ДатаДоступаКЗаданию(СтрокаТН.ДатаОкончанияДоступаКЗаданию, ПрохождениеОбученияСвойства.ДобавленоВремениВСекундах);
				НоваяСтрока.СкрытьВремяДоступаКЗаданию = СтрокаТН.СкрытьВремяДоступаКЗаданию;					
				Если ЗначениеЗаполнено(СтрокаТН.Наименование) Тогда
					НоваяСтрока.Наименование = СтрокаТН.Наименование;				
				Иначе
					НоваяСтрока.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлектронныйКурс, "Наименование");
				КонецЕсли;
				Если ВидОбучения.ВыставляетсяОценка Тогда
					НоваяСтрока.ВыставляетсяОценка = СтрокаТН.ВыставляетсяОценка;
				КонецЕсли;
				НоваяСтрока.НеЖдатьПроверки = СтрокаТН.НеЖдатьПроверки;
			КонецЕсли;
			
			ДанныеПрохожденияЗадания = ТаблицаПопытокПрохожденияЭРЗадания.Найти(ЭлектронныйКурс, "ЭлектронныйРесурс");
			
			Если ДанныеПрохожденияЗадания <> Неопределено Тогда
								
				НоваяСтрока.ПопыткаВыполнения = ДанныеПрохожденияЗадания.ПопыткаВыполнения;
				НоваяСтрока.Баллы = ДанныеПрохожденияЗадания.Баллы;
				НоваяСтрока.ШкалаОценки = ДанныеПрохожденияЗадания.ШкалаОценки;
				НоваяСтрока.ЗавершеноВПроцентах = ДанныеПрохожденияЗадания.ЗавершеноВПроцентах;
				НоваяСтрока.Завершено = ДанныеПрохожденияЗадания.Завершено;
				НоваяСтрока.ПроверяетсяПреподавателем = ДанныеПрохожденияЗадания.ПроверяетсяПреподавателем;
				НоваяСтрока.ПроверенПреподавателем = ДанныеПрохожденияЗадания.ПроверенПреподавателем;
				НоваяСтрока.Вариант = ДанныеПрохожденияЗадания.Вариант;
				НоваяСтрока.КомментарийПреподавателя = ДанныеПрохожденияЗадания.КомментарийПреподавателя;
				НоваяСтрока.ВозвращеноНаДоработку = ДанныеПрохожденияЗадания.ВозвращеноНаДоработку;			
				НоваяСтрока.ЗатраченоВремениВСекундах = ДанныеПрохожденияЗадания.ЗатраченоВремениВСекундах;
				НоваяСтрока.НеЖдатьПроверки = ДанныеПрохожденияЗадания.НеЖдатьПроверки;
				Если ВидОбучения.ВыставляетсяОценка Тогда
					НоваяСтрока.ВыставляетсяОценка = ДанныеПрохожденияЗадания.ВыставляетсяОценка;
				КонецЕсли;
			КонецЕсли;
			
			Если ДанныеПрохожденияЗадания = Неопределено
				И Документы.ПопыткаВыполненияЗаданияСУО.ВремяИстекло(НоваяСтрока) Тогда
				
				НоваяСтрока.ПопыткаВыполнения = Неопределено;
				НоваяСтрока.Баллы = 0;
				НоваяСтрока.ЗавершеноВПроцентах = 0;
				НоваяСтрока.Завершено = Ложь;
				НоваяСтрока.ПроверяетсяПреподавателем = Ложь;
				НоваяСтрока.ПроверенПреподавателем = Ложь;
				НоваяСтрока.Вариант = Неопределено;
				НоваяСтрока.КомментарийПреподавателя = "";
				НоваяСтрока.ВозвращеноНаДоработку = Ложь;			
				НоваяСтрока.ЗатраченоВремениВСекундах = 0;
				НоваяСтрока.НеЖдатьПроверки = Ложь;
				НоваяСтрока.ДатаОтправкиНаПроверку = Дата("00010101");
				НоваяСтрока.ДатаВозвратаНаДоработку = Дата("00010101");	
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.ШкалаОценки) Тогда
				Если ШкалаОценкиПроведения = Неопределено Тогда
					ШкалаОценкиПроведения = Документы.ПроведениеОбученияСУО.ШкалаОценки(ПрохождениеОбученияСвойства.ПроведениеОбучения);
				КонецЕсли;
				НоваяСтрока.ШкалаОценки = ШкалаОценкиПроведения;
			КонецЕсли;
			
		КонецЦикла;		
		
	КонецЕсли;	
		
	ТаблицаЗаданий.Сортировать("Номер");
	
	Возврат ТаблицаЗаданий;
	
КонецФункции

Функция ДоступенСписокПреподавателей(Знач ПрохождениеОбучения, Знач ВидОбучения = Неопределено, Знач СкрытьПреподавателей = Неопределено) Экспорт
	
	Если НЕ Актуально(ПрохождениеОбучения) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ВидОбучения = Неопределено ИЛИ СкрытьПреподавателей = Неопределено Тогда
		
		ДанныеПрохожденияОбучения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеОбучения, Новый Структура("ПроведениеОбучения, Сценарий, СкрытьПреподавателей", "ПроведениеОбучения", "Сценарий", "ПроведениеОбучения.СкрытьПреподавателей"));
		
		СкрытьПреподавателей = ДанныеПрохожденияОбучения.СкрытьПреподавателей; 
		ВидОбучения = Документы.ПроведениеОбученияСУО.ВидОбучения(ДанныеПрохожденияОбучения.ПроведениеОбучения, ДанныеПрохожденияОбучения.Сценарий);
		
	КонецЕсли;
	
	Если СкрытьПреподавателей Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Возврат ВидОбучения.ТребуетсяПреподаватель;
	
КонецФункции

Функция ДоступныйСписокПреподавателей(Знач ПрохождениеОбучения) Экспорт
	
	Если НЕ Актуально(ПрохождениеОбучения) ИЛИ НЕ ДоступенСписокПреподавателей(ПрохождениеОбучения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеПрохождения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеОбучения, "Сценарий, ПроведениеОбучения");
	
	Возврат Документы.ПроведениеОбученияСУО.Преподаватели(ДанныеПрохождения.ПроведениеОбучения, ДанныеПрохождения.Сценарий, Истина);
	
КонецФункции

Функция РодительскоеОбучение(Знач ПрохождениеОбучения) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПрохождениеОбучения, "РодительскоеПрохождение");
КонецФункции

Функция ДанныеОПрохожденииПодчиненныхМероприятий(ПрохождениеОбучения, Пользователь = Неопределено, ПроведениеОбучения = Неопределено, СхемаПроведения = Неопределено, ВидОбучения = Неопределено) Экспорт
	
	// Получаем недостающие переменные
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПрохождениеОбучения, "Пользователь");
	КонецЕсли;
	
	Если ПроведениеОбучения = Неопределено Тогда
		ПроведениеОбучения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПрохождениеОбучения, "ПроведениеОбучения");
	КонецЕсли;
	
	Если СхемаПроведения = Неопределено Тогда
		СхемаПроведения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроведениеОбучения, "СхемаПроведения");
	КонецЕсли;
	
	Если ВидОбучения = Неопределено Тогда
		ВидОбучения = Документы.ПроведениеОбученияСУО.ВидОбучения(ПроведениеОбучения, ПрохождениеОбучения.Сценарий);
	КонецЕсли;
	
	// Получаем необходимые данные
	
	ТаблицаПодчиненныхМероприятий = Документы.ПроведениеОбученияСУО.ПодчиненныеМероприятия(ПроведениеОбучения,,СхемаПроведения);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	УчастникиОбученияСУО.Баллы КАК Баллы,
	               |	УчастникиОбученияСУО.Регистратор КАК Прохождение,
	               |	УчастникиОбученияСУО.Статус КАК Статус,
	               |	УчастникиОбученияСУО.Сценарий КАК Сценарий,
	               |	УчастникиОбученияСУО.ПроверяетсяПреподавателем КАК ПроверяетсяПреподавателем,
	               |	УчастникиОбученияСУО.ПроверенПреподавателем КАК ПроверенПреподавателем,
	               |	УчастникиОбученияСУО.ВозвращеноНаДоработку КАК ВозвращеноНаДоработку,
	               |	УчастникиОбученияСУО.ВыставляетсяОценка КАК ВыставляетсяОценка
	               |ИЗ
	               |	РегистрСведений.УчастникиОбученияСУО КАК УчастникиОбученияСУО
	               |ГДЕ
	               |	УчастникиОбученияСУО.Пользователь = &Пользователь
	               |	И УчастникиОбученияСУО.ПроведениеОбучения = &ПроведениеОбучения
	               |	И УчастникиОбученияСУО.Регистратор <> &ПрохождениеОбщегоОбучения";
	
				   
	Запрос.УстановитьПараметр("ПрохождениеОбщегоОбучения", ПрохождениеОбучения);			   
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);

	Результат = Запрос.Выполнить();
	
	ТаблицаПрохожденийПодчиненныхМероприятий = Результат.Выгрузить();	
	
	// Считаем переменные, которые надо вернуть
	
	ДанныеОПрохождении = Новый Структура("
		|Баллы,
		|ТекущиеБаллы,
		|ЗавершеноВПроцентах,
		|ПроверяетсяПреподавателем,
		|ПроверенПреподавателем,
		|ВозвращеноНаДоработку,
		|КоличествоЗавершенных,
		|ВыставляетсяОценка", 
		0,
		0,
		0,
		Ложь,
		Истина,
		Ложь,
		0,
		Ложь);
	
	Для каждого СтрокаТПМ Из ТаблицаПрохожденийПодчиненныхМероприятий Цикл
		
		Если СтрокаТПМ.ПроверяетсяПреподавателем Тогда
			ДанныеОПрохождении.ПроверяетсяПреподавателем = Истина;
		КонецЕсли;
		
		Если СтрокаТПМ.ПроверяетсяПреподавателем И НЕ СтрокаТПМ.ПроверенПреподавателем Тогда
			ДанныеОПрохождении.ПроверенПреподавателем = Ложь;
		КонецЕсли;						
		
		Если СтрокаТПМ.ВозвращеноНаДоработку Тогда
			ДанныеОПрохождении.ВозвращеноНаДоработку = Истина;
		КонецЕсли;
		
		Если СтрокаТПМ.ВыставляетсяОценка Тогда
			ДанныеОПрохождении.ВыставляетсяОценка = Истина;
		КонецЕсли;		
		
	КонецЦикла;						
	
	// Определяем процент завершенных
	
	// Важно. При учете завершенных мероприятий НЕ учитываем, что некоторые могут
	// еще быть на проверке. Мероприятие завершено - это значит, что пользователь
	// завершил его выполнение, а то, что оно требует проверки не влияет на этот статус.
	
	ВсегоМероприятий           = 0;
	ЗавершеноМероприятий       = 0;
	ПроходитсяМероприятий      = 0;
	НеЗавершеноМероприятий     = 0;
	ЗачисленоНаМероприятия     = 0;
	
	Для каждого СтрокаТПМ Из ТаблицаПодчиненныхМероприятий Цикл
		
		// Примечание: подчиненные мероприятия у которых значимость равна нулю не учитываем.
		
		Если СтрокаТПМ.Значимость = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ВсегоМероприятий = ВсегоМероприятий + 1;
		
		Строка2 = ТаблицаПрохожденийПодчиненныхМероприятий.Найти(СтрокаТПМ.Мероприятие, "Сценарий");
		
		Если Строка2 <> Неопределено Тогда  // Прохождение найдено			
			
			Если Строка2.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил
				ИЛИ Строка2.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат Тогда				
				ЗавершеноМероприятий = ЗавершеноМероприятий + 1;				
			КонецЕсли;
			
			Если Строка2.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Проходит Тогда
				ПроходитсяМероприятий = ПроходитсяМероприятий + 1;
			КонецЕсли;
			
			Если Строка2.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.НеЗавершил Тогда
				НеЗавершеноМероприятий = НеЗавершеноМероприятий + 1;
			КонецЕсли;
			
			Если Строка2.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Зачислен Тогда
				ЗачисленоНаМероприятия = ЗачисленоНаМероприятия + 1;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеОПрохождении.КоличествоЗавершенных = ЗавершеноМероприятий;
	
	Если ВсегоМероприятий  > 0 Тогда
		ДанныеОПрохождении.ЗавершеноВПроцентах = Окр((ЗавершеноМероприятий / ВсегоМероприятий)*100);
	Иначе
		ДанныеОПрохождении.ЗавершеноВПроцентах = 100;
	КонецЕсли;
	
	// Считаем баллы
	
	НабранноеКоличествоБаллов = 0;
	МаксимумБаллов            = 0;
	МаксимумТекущихБаллов     = 0;
							
	Для каждого СтрокаТПМ Из ТаблицаПодчиненныхМероприятий Цикл
	
		МаксимумБаллов = МаксимумБаллов + 100*СтрокаТПМ.Значимость; 
		
		Строка2 = ТаблицаПрохожденийПодчиненныхМероприятий.Найти(СтрокаТПМ.Мероприятие, "Сценарий");
		
		Если Строка2 <> Неопределено Тогда
			НабранноеКоличествоБаллов = НабранноеКоличествоБаллов + Строка2.Баллы*СтрокаТПМ.Значимость;
			МаксимумТекущихБаллов = МаксимумТекущихБаллов + 100*СтрокаТПМ.Значимость; 
		КонецЕсли;
		
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(СхемаПроведения) 
		И ДанныеОПрохождении.ЗавершеноВПроцентах = 100
		И МаксимумБаллов > 0
		И (НЕ ДанныеОПрохождении.ПроверяетсяПреподавателем 
			ИЛИ ДанныеОПрохождении.ПроверенПреподавателем 
			ИЛИ НЕ Справочники.ВидыМероприятийСУО.ЗаданияПроверяютсяВыборочно(ВидОбучения)) Тогда	
					
		ДанныеОПрохождении.Баллы = Окр((НабранноеКоличествоБаллов / МаксимумБаллов)*100);		
		
	Иначе
		
		ДанныеОПрохождении.Баллы = 0;
		
	КонецЕсли;
	
	Если МаксимумТекущихБаллов > 0 Тогда
		ДанныеОПрохождении.ТекущиеБаллы = Окр((НабранноеКоличествоБаллов / МаксимумТекущихБаллов)*100);		
	Иначе
		ДанныеОПрохождении.ТекущиеБаллы = 0;
	КонецЕсли;
	
	Возврат ДанныеОПрохождении;
	
КонецФункции

Функция ПодчиненныеПрохождения(ПрохождениеОбучения) Экспорт
	
	ПрохожденияОбучения = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрохождениеОбученияСУО.Ссылка
		|ИЗ
		|	Документ.ПрохождениеОбученияСУО КАК ПрохождениеОбученияСУО
		|ГДЕ
		|	ПрохождениеОбученияСУО.РодительскоеПрохождение = &РодительскоеПрохождение
		|	И ПрохождениеОбученияСУО.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("РодительскоеПрохождение", ПрохождениеОбучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПрохожденияОбучения.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат ПрохожденияОбучения;
	
КонецФункции

Функция КоличествоНовыхОбучений(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПрохожденияОбученияСУО.Регистратор) КАК КоличествоОбучений
		|ИЗ
		|	РегистрСведений.ПрохожденияОбученияСУО КАК ПрохожденияОбученияСУО
		|ГДЕ
		|	ПрохожденияОбученияСУО.Пользователь = &Пользователь
		|	И ПрохожденияОбученияСУО.СтатусПроцессаОбучения = &СтатусПроцессаОбучения";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("СтатусПроцессаОбучения", Перечисления.СтатусыПроцессаОбученияСУО.Новое);
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.КоличествоОбучений;
	
КонецФункции

Функция РегистраторыЗаданийНаПроверкуПрохожденияОбучения(ПрохождениеОбучения)
	
	// В результат включены документы со статусом Отменено
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПопыткаВыполненияЗаданияСУО.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПопыткаВыполненияЗаданияСУО КАК ПопыткаВыполненияЗаданияСУО
		|ГДЕ
		|	ПопыткаВыполненияЗаданияСУО.ПрохождениеОбучения = &ПрохождениеОбучения
		|	И ПопыткаВыполненияЗаданияСУО.Задание ССЫЛКА Справочник.ЗаданияСУО
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПопыткаВыполненияПодборкиВопросовСУЗ.Ссылка
		|ИЗ
		|	Документ.ПопыткаВыполненияПодборкиВопросовСУЗ КАК ПопыткаВыполненияПодборкиВопросовСУЗ
		|ГДЕ
		|	ПопыткаВыполненияПодборкиВопросовСУЗ.ПрохождениеОбучения = &ПрохождениеОбучения
		|	И ПопыткаВыполненияПодборкиВопросовСУЗ.ПроверяетсяПреподавателем = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СессияЭлектронногоРесурсаСУЗ.Ссылка
		|ИЗ
		|	Документ.СессияЭлектронногоРесурсаСУЗ КАК СессияЭлектронногоРесурсаСУЗ
		|ГДЕ
		|	СессияЭлектронногоРесурсаСУЗ.ПрохождениеОбучения = &ПрохождениеОбучения
		|	И СессияЭлектронногоРесурсаСУЗ.ТипСессии = &ТипСессии";
	
	Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбучения);
	Запрос.УстановитьПараметр("ТипСессии", Перечисления.ТипыСессийЭлектронныхРесурсовСУЗ.quiz);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ДатаНачалаОтсчетаПродолжительности(ДанныеПрохожденияОбучения) Экспорт
	
	// Требуемые свойства для ДанныеПрохожденияОбучения:
	// - ВариантПродолжительности
	// - ДатаЗачисления
	// - ДатаНачалаПрохождения
	
	Если ДанныеПрохожденияОбучения.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.СЗачисления Тогда
		Возврат ДанныеПрохожденияОбучения.ДатаЗачисления;
	КонецЕсли;
	
	Если ДанныеПрохожденияОбучения.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.СНачалаОбучения Тогда
		Возврат ДанныеПрохожденияОбучения.ДатаНачалаПрохождения;
	КонецЕсли;
	
	Если ДанныеПрохожденияОбучения.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.Фиксированная Тогда
		Возврат ДанныеПрохожденияОбучения.ДатаНачалаПрохождения; // Равна дате начала проведения обучения	
	КонецЕсли;
	
	Возврат Дата("00010101");
	
КонецФункции

Функция ВремяНачалаОбученияНастало(ДатаНачалаПрохождения) Экспорт
	
	// Так как ДатаНачалаПрохождения показывает либо личную дату начала,
	// которая не может быть больше текущей, то можно ее брать, либо
	// дату начала обучения и если она больше текущей, то дата начала 
	// еще не настала.
	
	Если ЗначениеЗаполнено(ДатаНачалаПрохождения)
		И ДатаНачалаПрохождения > ТекущаяДатаСеанса() Тогда		
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ВремяИстекло(Знач ПрохождениеОбучения) Экспорт
	
	// Требуемые свойства для ДанныеПрохожденияОбучения:
	// - ДатаКонтроля
	// - ДатаОкончанияПроведения
	// - ДатаНачалаПрохождения
	// - ВариантПродолжительности
	// - ДатаЗачисления
	// - ПродолжительностьВСекундах
	
	Если ТипЗнч(ПрохождениеОбучения) = Тип("ДокументСсылка.ПрохождениеОбученияСУО") Тогда
		
		ТребуемыеДанныеПрохожденияОбучения = Новый Структура(
			"ДатаКонтроля,
			|ДатаОкончанияПроведения,
			|ДатаНачалаПрохождения,
			|ВариантПродолжительности,
			|ДатаЗачисления,
			|ПродолжительностьВСекундах",		
			"ПроведениеОбучения.ДатаКонтроля",
			"ПроведениеОбучения.ДатаОкончанияПроведения",
			"ДатаНачалаПрохождения",
			"ПроведениеОбучения.ВариантПродолжительности",
			"Дата",
			"ПродолжительностьВСекундах");
	
		ДанныеПрохожденияОбучения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ПрохождениеОбучения, ТребуемыеДанныеПрохожденияОбучения);		
	
	Иначе
		
		ДанныеПрохожденияОбучения = ПрохождениеОбучения;
		
	КонецЕсли;
	
	ВремяИстекло = Ложь;
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Если ЗначениеЗаполнено(ДанныеПрохожденияОбучения.ПродолжительностьВСекундах) Тогда		
										
		ДатаНачалаОтсчета = ДатаНачалаОтсчетаПродолжительности(ДанныеПрохожденияОбучения);
	
		Если ЗначениеЗаполнено(ДатаНачалаОтсчета)
			И ТекущаяДата > ДатаНачалаОтсчета + ДанныеПрохожденияОбучения.ПродолжительностьВСекундах Тогда
			
			ВремяИстекло = Истина;
			
		КонецЕсли;	
			
	Иначе	
		
		Если ЗначениеЗаполнено(ДанныеПрохожденияОбучения.ДатаКонтроля)
			И ДанныеПрохожденияОбучения.ДатаКонтроля < ТекущаяДата Тогда
			
			ВремяИстекло = Истина; // Проверяем не наступила ли дата контроля
			
		КонецЕсли;		
		
		Если ЗначениеЗаполнено(ДанныеПрохожденияОбучения.ДатаОкончанияПроведения)
			И ДанныеПрохожденияОбучения.ДатаОкончанияПроведения < ТекущаяДата Тогда
			
			ВремяИстекло = Истина; // Проверяем не наступила ли дата окончания проведения
			
		КонецЕсли;
		
	КонецЕсли;

	Возврат ВремяИстекло;
	
КонецФункции

Функция ОсталосьВремениЧисло(Актуально, СтатусПроцессаОбучения, ВариантПродолжительности, ПродолжительностьВСекундах, ДатаНачалаОтсчетаПродолжительности, ДатаОкончанияПроведения) Экспорт
	
	// Получаем сколько осталось в секундах
	// Такой же алгоритм есть в функции durationLeft веб-кабинета
	// и в списке Участники формы документа ПроведениеОбученияСУО.
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ОсталосьВремениВСекундах = Неопределено;
	
	Если НЕ Актуально Тогда
		Возврат 0;
	КонецЕсли;
	
	Если СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.Запланировано Тогда
		Возврат 0;
	КонецЕсли;
	
	Если СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.Новое
		И ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.СНачалаОбучения Тогда
		
		Возврат 0;
		
	КонецЕсли;
	
	Если ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.Фиксированная
		И ЗначениеЗаполнено(ДатаОкончанияПроведения) Тогда
		
		Если ТекущаяДата >  ДатаОкончанияПроведения Тогда
			Возврат -1;
		КонецЕсли;
		
	КонецЕсли;		
	
	Если ВариантПродолжительности <> Перечисления.ПродолжительностьОбученияСУО.СНачалаОбучения
		И ВариантПродолжительности <> Перечисления.ПродолжительностьОбученияСУО.СЗачисления Тогда
		
		Возврат 0;
		
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ПродолжительностьВСекундах)
		ИЛИ НЕ ЗначениеЗаполнено(ДатаНачалаОтсчетаПродолжительности) Тогда
		
		Возврат 0;
		
	КонецЕсли;
	
	ДатаОкончанияОбучения = ДатаНачалаОтсчетаПродолжительности + ПродолжительностьВСекундах;
	
	Если ДатаНачалаОтсчетаПродолжительности > ТекущаяДата Тогда
		Возврат 0;
	КонецЕсли;
	
	Если ТекущаяДата > ДатаОкончанияОбучения Тогда
		Возврат -1;
	КонецЕсли;
	
	Возврат ДатаОкончанияОбучения - ТекущаяДата;
	
КонецФункции

Функция ОсталосьВремениСтрока(Актуально, СтатусПроцессаОбучения, ВариантПродолжительности, ПродолжительностьВСекундах, ДатаНачалаОтсчетаПродолжительности, ДатаОкончанияПроведения) Экспорт
	
	ОсталосьВремениВСекундах = ОсталосьВремениЧисло(Актуально, СтатусПроцессаОбучения, ВариантПродолжительности, ПродолжительностьВСекундах, ДатаНачалаОтсчетаПродолжительности, ДатаОкончанияПроведения);
				
	Если НЕ ЗначениеЗаполнено(ОсталосьВремениВСекундах) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ОсталосьВремениВСекундах = -1 Тогда
		Возврат НСтр("ru = 'Время истекло'");
	КонецЕсли;
			
	ОсталосьВремениСтрока = ОбъектыSCORM.ПолучитьПолнуюСтрокуИзКоличестваСекунд(ОсталосьВремениВСекундах,,Истина);

	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Осталось %1'"), ОсталосьВремениСтрока);					
	
КонецФункции

Процедура ДобавитьВремя(ПрохождениеОбучения, ДобавленоВремениВСекундах) Экспорт
	
	ПрохождениеОбученияОбъект = ПрохождениеОбучения.ПолучитьОбъект();	
	
	Если ПрохождениеОбученияОбъект.Отменено Тогда
		ВызватьИсключение НСтр("ru = 'Невозможно добавить время отмененному участнику'");
	КонецЕсли;
	
	Попытка 
		ПрохождениеОбученияОбъект.Заблокировать();
	Исключение
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось заблокировать объект %1'"),
			Строка(ПрохождениеОбученияОбъект));
	КонецПопытки;

	ПрохождениеОбученияОбъект.ДобавленоВремениВСекундах = ДобавленоВремениВСекундах;
	ПрохождениеОбученияОбъект.ДобавленоВремениСтрока = ОбъектыSCORM.ПолучитьПолнуюСтрокуИзКоличестваСекунд(ДобавленоВремениВСекундах);
	
	ПрохождениеОбученияОбъект.ДополнительныеСвойства.Вставить("ОбновлятьПодчиненныеДокументы", Ложь);
	ПрохождениеОбученияОбъект.Записать(РежимЗаписиДокумента.Проведение);
	ПрохождениеОбученияОбъект.Разблокировать();
	
КонецПроцедуры

Функция ДоступенБлокОцениванияКачестваОбучения(СтатусПроцессаОбучения, КачествоОбученияОцениваетсяУчастниками) Экспорт
	
	Если НЕ КачествоОбученияОцениваетсяУчастниками Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.Окончено
		ИЛИ СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.ОконченоБезПроверки Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ОценкаЗаОбучение(Знач ПрохождениеОбучения) Экспорт
	
	ДанныеПрохожденияОбучения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеОбучения, "ПроведениеОбучения, Баллы");
	ШкалаОценки = Документы.ПроведениеОбученияСУО.ШкалаОценки(ДанныеПрохожденияОбучения.ПроведениеОбучения);
	ДанныеОценки = Справочники.ШкалыОценокСУО.ОценкаИзБаллов(ДанныеПрохожденияОбучения.Баллы, ШкалаОценки, Истина);
	
	Возврат ДанныеОценки;
	
КонецФункции

Функция ВыставляетсяОценка(Знач ПрохождениеОбучения, Знач ВидОбучения, Знач ЭлектронныйРесурс, Знач Задания, Знач Статус) Экспорт	
	
	Если НЕ ВидОбучения.Электронное Тогда
		Возврат ВидОбучения.ВыставляетсяОценка;
	КонецЕсли;
	
	Если НЕ ВидОбучения.ВыставляетсяОценка Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
	
		Если Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат Тогда
			Возврат Истина;
		КонецЕсли;
		
		Если Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил Тогда
			
			ПопыткиВыполненияЗаданий = Документы.ПопыткаВыполненияЗаданияСУО.ПопыткиВыполненияЗаданий(ПрохождениеОбучения);
			
			Если ПопыткиВыполненияЗаданий.Найти(Истина, "ВыставляетсяОценка") <> Неопределено Тогда
				Возврат Истина;
			КонецЕсли;
			
			Возврат Ложь;
			
		КонецЕсли;	
		
	КонецЕсли;
		
	Возврат Документы.ПроведениеОбученияСУО.ВыставляетсяОценка(ВидОбучения, ЭлектронныйРесурс, Задания); 	
	
КонецФункции		



// ВЕБ-КАБИНЕТ

Процедура ОбновитьДанныеВебКабинета(ПрохождениеОбучения, ДополнительныеДанные = Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем переменные
	
	ТребуемыеДанные = Новый Структура("
	|Ссылка,
	|Проведен,
	|Пользователь,
	|НаименованиеПользователя,
	|ДатаНачалаПрохождения,
	|Сценарий,
	|Статус,
	|ПроведениеОбучения,
	|РодительскоеПрохождение,
	|ВыставляетсяОценка",
	"Ссылка",
	"Проведен",
	"Пользователь",
	"Пользователь.Наименование",
	"ДатаНачалаПрохождения",
	"Сценарий",
	"Статус",
	"ПроведениеОбучения",
	"РодительскоеПрохождение",
	"ВыставляетсяОценка");
	
	ДанныеПрохожденияОбучения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеОбучения, ТребуемыеДанные);
	ВидОбучения = Документы.ПроведениеОбученияСУО.ВидОбучения(ДанныеПрохожденияОбучения.ПроведениеОбучения, ДанныеПрохожденияОбучения.Сценарий); 
	Электронное = Документы.ПроведениеОбученияСУО.ЭтоЭлектронноеОбучение(ДанныеПрохожденияОбучения.ПроведениеОбучения, ВидОбучения,ДанныеПрохожденияОбучения.Сценарий); 
	ЭлектронноДистанционное = Документы.ПроведениеОбученияСУО.ЭлектронноДистанционноеОбучение(ДанныеПрохожденияОбучения.ПроведениеОбучения, ВидОбучения, ДанныеПрохожденияОбучения.Сценарий);
	
	// Удаляем старые данные
	
	РегистрыСведений.ДанныеВебКабинетаСУО_ПН.УдалитьДанные(ПрохождениеОбучения);
	РегистрыСведений.ДанныеВебКабинетаСУО_ПП.УдалитьДанные(ПрохождениеОбучения);	
	РегистрыСведений.ДанныеВебКабинетаСУО_ОН.УдалитьДанные(ПрохождениеОбучения, Перечисления.ТипыДанныхВебКабинетаСУО.УчастникОбучения);
	РегистрыСведений.ДанныеВебКабинетаСУО_ПН.УдалитьДанные(ДанныеПрохожденияОбучения.ПроведениеОбучения, Перечисления.ТипыДанныхВебКабинетаСУО.РазделФорума, ДанныеПрохожденияОбучения.Пользователь);
	РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.УдалитьОтбор(ПрохождениеОбучения);
	РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.УдалитьДанные(ПрохождениеОбучения, "Документ.ПрохождениеОбученияСУО");
	
	ВозможныеРегистраторыЗаданий = РегистраторыЗаданийНаПроверкуПрохожденияОбучения(ПрохождениеОбучения);
		
	Для каждого ВозможныйРегистратор Из ВозможныеРегистраторыЗаданий Цикл
		РегистрыСведений.ДанныеВебКабинетаСУО_ПН.УдалитьДанные(ВозможныйРегистратор, Перечисления.ТипыДанныхВебКабинетаСУО.ПроверкаЗаданияОписание);
		РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.УдалитьОтбор(ВозможныйРегистратор);
	КонецЦикла;
		
	ТаблицаФайловОбъекта = ОбучениеСУО.ПрикрепленныеФайлыКОбъектуОбучения(ПрохождениеОбучения, Ложь);	
	Для каждого Строка Из ТаблицаФайловОбъекта Цикл
		РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.УдалитьОтбор(Строка.Ссылка);
		РегистрыСведений.ДанныеВебКабинетаСУО_ОН.УдалитьДанные(Строка.Ссылка, Перечисления.ТипыДанныхВебКабинетаСУО.ФайлУчащегося);
		РегистрыСведений.ДанныеВебКабинетаСУО_ПП.УдалитьДанные(Строка.Ссылка);	
	КонецЦикла;
	
	// Добавляем новые данные
	
	Зависимости = Новый Массив;
	
	РегистрыСведений.БиблиотекаПользователейСУО.ОбновитьДанныеВебКабинета(ДанныеПрохожденияОбучения.Пользователь); // Библиотека пользователя		
	
	Если ДанныеПрохожденияОбучения.Проведен И НЕ Отменено(ПрохождениеОбучения) Тогда
		
		// Прикрепленные файлы
		
		ФайлыОбъекта = Новый Массив;
		
		Для каждого Строка Из ТаблицаФайловОбъекта Цикл
			Если НЕ Строка.ПометкаУдаления Тогда
				ФайлыОбъекта.Добавить(Строка.Ссылка);
			КонецЕсли;		
		КонецЦикла;
		
		Для каждого Файл Из ФайлыОбъекта Цикл
			
			Зависимости.Добавить(Файл);
			
			// Описание файла учащегося (общее)
			
			ОписаниеФайлаУчащегося = ФайлУчащегосяJSON(ДанныеПрохожденияОбучения, Файл);
			РегистрыСведений.ДанныеВебКабинетаСУО_ОН.ДобавитьДанные(Перечисления.ТипыДанныхВебКабинетаСУО.ФайлУчащегося, Файл, ОписаниеФайлаУчащегося, Перечисления.ФорматыВебДанныхСУ.json); 
			
			// Данные о проверке файла преподавателем
			
			РегистрыСведений.ФайлыПроверенныеПреподавателямиСУО.ОбновитьДанныеВебКабинета(Файл);
						
			// Отбор файлов по преподавателям
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ФайлыНаПроверкуПреподавателюСУО.Преподаватель КАК Преподаватель
				|ИЗ
				|	РегистрСведений.ФайлыНаПроверкуПреподавателюСУО КАК ФайлыНаПроверкуПреподавателюСУО
				|ГДЕ
				|	ФайлыНаПроверкуПреподавателюСУО.Файл = &Файл";
			
			Запрос.УстановитьПараметр("Файл", Файл);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.ДобавитьОтбор(Файл, ВыборкаДетальныеЗаписи.Преподаватель);
			КонецЦикла;
			
			// Отбор по проведению обучения
			
			РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.ДобавитьОтбор(Файл, ДанныеПрохожденияОбучения.ПроведениеОбучения);
			
			// Отбор по сценарию
			
			РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.ДобавитьОтбор(Файл, ДанныеПрохожденияОбучения.Сценарий);
			
			// Отбор по пользователю
			
			РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.ДобавитьОтбор(Файл, ДанныеПрохожденияОбучения.Пользователь);
			
		КонецЦикла;
		
		// Результаты тестирования
		
		ЕстьРезультатыТестирования = Ложь;
		
		Если ВидОбучения.ПоказыватьРезультатыТестирования Тогда
		
			ВыборкаТестирований = Неопределено;
			
			ТаблицаПрисоединенныхЭлектронныхКурсов = Документы.ПроведениеОбученияСУО.ПрикрепленныеЭлектронныеРесурсы(ДанныеПрохожденияОбучения.ПроведениеОбучения, ДанныеПрохожденияОбучения.Сценарий, Истина);
			ПрисоединенныеЭлектронныеКурсы = ТаблицаПрисоединенныхЭлектронныхКурсов.ВыгрузитьКолонку("ЭлектронныйРесурс");

			Если Электронное ИЛИ ПрисоединенныеЭлектронныеКурсы.Количество() > 0 Тогда			
				ВыборкаТестирований = РегистрыСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПопыткиПрохожденияТестов(ДанныеПрохожденияОбучения.Пользователь, ?(Электронное, ПрохождениеОбучения, Неопределено), ПрисоединенныеЭлектронныеКурсы);
			КонецЕсли;		
			
			Если ВыборкаТестирований <> Неопределено И ВыборкаТестирований.Количество() > 0 Тогда
				
				ЕстьРезультатыТестирования = Истина;
				
				// Получаем массив сессий тестирований
				
				МассивСессийТестирования = Новый Массив;
				
				Пока ВыборкаТестирований.Следующий() Цикл
					МассивСессийТестирования.Добавить(ВыборкаТестирований.СессияВыполненияТеста);
				КонецЦикла;
				
				ВыборкаТестирований.Сбросить();
				
				// Получаем ответы на вопрос
				
				ОписаниеРезультатовТестирования = Новый Массив;
				
				ВыборкаОтветовНаВопросы = РегистрыСведений.ВопросыТестированийСУЗ.ВопросыТестирований(МассивСессийТестирования);
				
				// Получаем варианты ответов на вопросы
				
				МассивПростыхВопросов = Новый Массив;
				
				Пока ВыборкаОтветовНаВопросы.Следующий() Цикл
					
					Если ВыборкаОтветовНаВопросы.ТипВопроса = Перечисления.ТипыВопросовСУЗ.ОдинИзМногих
						ИЛИ ВыборкаОтветовНаВопросы.ТипВопроса = Перечисления.ТипыВопросовСУЗ.МногиеИзМногих
						ИЛИ ВыборкаОтветовНаВопросы.ТипВопроса = Перечисления.ТипыВопросовСУЗ.ПоШаблону
						ИЛИ ВыборкаОтветовНаВопросы.ТипВопроса = Перечисления.ТипыВопросовСУЗ.Последовательность Тогда
						
						МассивПростыхВопросов.Добавить(ВыборкаОтветовНаВопросы.Вопрос);
						
					КонецЕсли;
					
				КонецЦикла;
				
				ВыборкаОтветовНаВопросы.Сбросить();
				
				ВыборкаВариантовОтветов = РегистрыСведений.ВыбранныеВариантыОтветовВопросовСУЗ.ВыбранныеВарианты(МассивСессийТестирования, МассивПростыхВопросов);				
				
				// Формируем информацию о тестировании
				
				Пока ВыборкаТестирований.Следующий() Цикл	
					
					ОписаниеТестирования = Новый Структура();
					ОписаниеТестирования.Вставить("Дата", ВыборкаТестирований.Дата);
					ОписаниеТестирования.Вставить("Результат", ВыборкаТестирований.Результат);
					ОписаниеТестирования.Вставить("ВыставляетсяОценка", ВыборкаТестирований.ВыставляетсяОценка);
					ОписаниеТестирования.Вставить("ПроверяетсяПреподавателем", ВыборкаТестирований.ПроверяетсяПреподавателем);
					ОписаниеТестирования.Вставить("ПроверенПреподавателем", ВыборкаТестирований.ПроверенПреподавателем);
					ОписаниеТестирования.Вставить("ДатаНачалаПрохождения", ВыборкаТестирований.ДатаНачалаПрохождения);
					ОписаниеТестирования.Вставить("ДатаОкончанияПрохождения", ВыборкаТестирований.ДатаОкончанияПрохождения);
					ОписаниеТестирования.Вставить("ОтветыНаВопросы", Новый Массив());					
					ОписаниеТестирования.Вставить("ЭлектронныйРесурс", Новый Структура("Наименование, Идентификатор", ВыборкаТестирований.НаименованиеЭлементаСодержания, ВыборкаТестирований.ЭлектронныйРесурс));
					ОписаниеТестирования.Вставить("ЭлементСодержания", Новый Структура("Наименование, Идентификатор", ВыборкаТестирований.НаименованиеЭлементаСодержания, ВыборкаТестирований.ЭлементСодержания));					
					ОписаниеТестирования.Вставить("Оценка", "");
					
					Если ДанныеПрохожденияОбучения.ВыставляетсяОценка Тогда
						
						ШкалаОценки = Документы.ПроведениеОбученияСУО.ШкалаОценки(ДанныеПрохожденияОбучения.ПроведениеОбучения);
						
						ВыставленнаяОценка = УправлениеОбучениемСУОПовтИсп.ОценкаИзБаллов(ВыборкаТестирований.Результат, ШкалаОценки);
						
						Если ЗначениеЗаполнено(ВыставленнаяОценка) Тогда
							ОписаниеТестирования.Вставить("Оценка", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыставленнаяОценка, "Наименование"));
						КонецЕсли;
										
					КонецЕсли;					
					
					Зависимости.Добавить(ВыборкаТестирований.ЭлектронныйРесурс);

					ВыборкаОтветовНаВопросы.Сбросить();					
					
					Пока ВыборкаОтветовНаВопросы.НайтиСледующий(ВыборкаТестирований.СессияВыполненияТеста, "СессияВыполненияТеста") Цикл
						
						ОписаниеОтветаНаВопрос = Новый Структура;
						
						ОписаниеОтветаНаВопрос.Вставить("Вопрос", Новый Структура("
								|Наименование,
								|Идентификатор,
								|Задание",
								ВыборкаОтветовНаВопросы.НаименованиеВопроса,
								ВыборкаОтветовНаВопросы.Вопрос,
								Справочники.ВопросыСУЗ.ТекстЗаданияВопроса(ВыборкаОтветовНаВопросы.Вопрос)));						
						
						ОписаниеОтветаНаВопрос.Вставить("Вес", ВыборкаОтветовНаВопросы.Вес);
						ОписаниеОтветаНаВопрос.Вставить("Дата", ВыборкаОтветовНаВопросы.Дата);
						ОписаниеОтветаНаВопрос.Вставить("Психологический", ВыборкаОтветовНаВопросы.ПсихологическийВопрос);
						ОписаниеОтветаНаВопрос.Вставить("Результат", ВыборкаОтветовНаВопросы.Результат);
						ОписаниеОтветаНаВопрос.Вставить("ПроверяетсяПреподавателем", ВыборкаОтветовНаВопросы.ПроверяетсяПреподавателем);
						ОписаниеОтветаНаВопрос.Вставить("ПроверенПреподавателем", ВыборкаОтветовНаВопросы.ПроверенПреподавателем);
						ОписаниеОтветаНаВопрос.Вставить("Преподаватель", Новый Структура("Идентификатор", ВыборкаОтветовНаВопросы.ПроверившийПреподаватель));
						ОписаниеОтветаНаВопрос.Вставить("РазвернутыйОтветПользователя", ВыборкаОтветовНаВопросы.РазвернутыйОтветПользователя);
						ОписаниеОтветаНаВопрос.Вставить("КомментарийПреподавателя", ВыборкаОтветовНаВопросы.КомментарийПреподавателя);
						ОписаниеОтветаНаВопрос.Вставить("ИспользованаПодсказка", ВыборкаОтветовНаВопросы.ИспользованаПодсказка);
						ОписаниеОтветаНаВопрос.Вставить("КоличествоПоказов", ВыборкаОтветовНаВопросы.КоличествоПоказов);
						
						ОписаниеОтветаНаВопрос.Вставить("Варианты", Новый Массив());
						
						ВыборкаВариантовОтветов.Сбросить();
						
						Пока ВыборкаВариантовОтветов.НайтиСледующий(Новый Структура("СессияВыполненияТеста, Вопрос", ВыборкаТестирований.СессияВыполненияТеста, ВыборкаОтветовНаВопросы.Вопрос)) Цикл
							
							ОписаниеВариантаОтвета = Новый Структура;
							ОписаниеВариантаОтвета.Вставить("Текст", ВыборкаВариантовОтветов.ТекстВарианта);
							ОписаниеВариантаОтвета.Вставить("Номер", ВыборкаВариантовОтветов.Номер);
							ОписаниеВариантаОтвета.Вставить("Выбран", ВыборкаВариантовОтветов.Выбран);
							ОписаниеВариантаОтвета.Вставить("ОшибочныйНеВыбран", ВыборкаВариантовОтветов.ОшибочныйНеВыбран);
							ОписаниеВариантаОтвета.Вставить("ОшибочныйВыбран", ВыборкаВариантовОтветов.ОшибочныйВыбран);
							ОписаниеВариантаОтвета.Вставить("ВерныйНеВыбран", ВыборкаВариантовОтветов.ВерныйНеВыбран);
							ОписаниеВариантаОтвета.Вставить("ВерныйВыбран", ВыборкаВариантовОтветов.ВерныйВыбран);
							ОписаниеВариантаОтвета.Вставить("ВариантОтвета", ВыборкаВариантовОтветов.ВариантОтвета);
							ОписаниеВариантаОтвета.Вставить("Верный", ВыборкаВариантовОтветов.Верный);
							
							ОписаниеОтветаНаВопрос.Варианты.Добавить(ОписаниеВариантаОтвета);
							
						КонецЦикла;
						
						ОписаниеТестирования.ОтветыНаВопросы.Добавить(ОписаниеОтветаНаВопрос);
						
					КонецЦикла;
					
					ОписаниеРезультатовТестирования.Добавить(ОписаниеТестирования);
					
				КонецЦикла;
				
				ОписаниеРезультатовТестированияJSON = ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеРезультатовТестирования);
				
				РегистрыСведений.ДанныеВебКабинетаСУО_ПН.ДобавитьДанные(ДанныеПрохожденияОбучения.Пользователь, Перечисления.ТипыДанныхВебКабинетаСУО.РезультатыТестирования, ПрохождениеОбучения, ОписаниеРезультатовТестированияJSON, Перечисления.ФорматыВебДанныхСУ.json);
				
			КонецЕсли;			
			
		КонецЕсли;
			
		// Учебная активность
		
		УчебнаяАктивностьСтруктура = УчебнаяАктивностьСтруктура(ПрохождениеОбучения);
		СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.ЧислоВЗначение(УчебнаяАктивностьСтруктура.СтатусОбучения);
		ПрохождениеАктуально = Актуально(ПрохождениеОбучения, СтатусПроцессаОбучения);
		ДанныеУчебнойАктивности = ОбщегоНазначенияСУ.ДанныеВJSON(УчебнаяАктивностьСтруктура);
		
		ДатаНачалаПроведенияОбучения = Документы.ПроведениеОбученияСУО.ДатаНачалаПроведения(ДанныеПрохожденияОбучения.ПроведениеОбучения, ДанныеПрохожденияОбучения.Сценарий);
		
		Если НЕ ЗначениеЗаполнено(ДатаНачалаПроведенияОбучения) Тогда
			РегистрыСведений.ДанныеВебКабинетаСУО_ПН.ДобавитьДанные(ДанныеПрохожденияОбучения.Пользователь, Перечисления.ТипыДанныхВебКабинетаСУО.УчебнаяАктивность, ПрохождениеОбучения, ДанныеУчебнойАктивности, Перечисления.ФорматыВебДанныхСУ.json); 
		Иначе			
			РегистрыСведений.ДанныеВебКабинетаСУО_ПП.ДобавитьДанные(ДатаНачалаПроведенияОбучения, ДанныеПрохожденияОбучения.Пользователь, Перечисления.ТипыДанныхВебКабинетаСУО.УчебнаяАктивность, ПрохождениеОбучения, ДанныеУчебнойАктивности, Перечисления.ФорматыВебДанныхСУ.json);
		КонецЕсли;
		
		// Описание учебной активности
		
		ДанныеПрохожденияДляПолногоОписания = Неопределено; // Будет заполнено ниже и пригодится далее
		ОписаниеУчебнойАктивности = УчебнаяАктивностьОписаниеXML(ПрохождениеОбучения,, ДанныеПрохожденияДляПолногоОписания, ТаблицаФайловОбъекта, Зависимости, ЕстьРезультатыТестирования);
		
		РегистрыСведений.ДанныеВебКабинетаСУО_ПН.ДобавитьДанные(ДанныеПрохожденияОбучения.Пользователь, Перечисления.ТипыДанныхВебКабинетаСУО.УчебнаяАктивностьОписание, ПрохождениеОбучения, ОписаниеУчебнойАктивности, Перечисления.ФорматыВебДанныхСУ.xml);
		
		// Отборы учебной активности
		
		РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.ДобавитьОтбор(ПрохождениеОбучения, ДанныеПрохожденияОбучения.ПроведениеОбучения);
		
		РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.ДобавитьОтбор(ПрохождениеОбучения, ДанныеПрохожденияОбучения.Сценарий);
		
		Если ПрохождениеАктуально ИЛИ (ЗначениеЗаполнено(ДанныеПрохожденияОбучения.РодительскоеПрохождение) И Актуально(ДанныеПрохожденияОбучения.РодительскоеПрохождение)) Тогда
			РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.ДобавитьОтбор(ПрохождениеОбучения, Перечисления.ОтборыДанныхВебКабинетаСУО.Активные);
		Иначе
			РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.ДобавитьОтбор(ПрохождениеОбучения, Перечисления.ОтборыДанныхВебКабинетаСУО.Завершенные);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеПрохожденияОбучения.РодительскоеПрохождение) Тогда
			РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.ДобавитьОтбор(ПрохождениеОбучения, ДанныеПрохожденияОбучения.РодительскоеПрохождение);
		КонецЕсли;
		
		// Участник обучения
		
		УчастникОбучения = УчастникОбученияJSON(ПрохождениеОбучения);
		
		РегистрыСведений.ДанныеВебКабинетаСУО_ОН.ДобавитьДанные(Перечисления.ТипыДанныхВебКабинетаСУО.УчастникОбучения, ПрохождениеОбучения, УчастникОбучения, Перечисления.ФорматыВебДанныхСУ.json);
		
		// Тесты и задания на проверку преподавателю
				
		ТаблицаПреподавателей = Неопределено;
		
		Если СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.Активно
			ИЛИ СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.Проверяется
			ИЛИ СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.ВозвращеноНаДоработку
			ИЛИ СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.ОконченоБезПроверки Тогда
		
			ТестыНаПроверку = РегистрыСведений.ТестыНаПроверкуСУЗ.ТестыНаПроверкуПрохожденияОбучения(ДанныеПрохожденияОбучения.Пользователь, ПрохождениеОбучения);
			
			Если ТестыНаПроверку.Количество() > 0 Тогда
				
				Если ТаблицаПреподавателей = Неопределено Тогда
					ТаблицаПреподавателей = Документы.ПроведениеОбученияСУО.Преподаватели(ДанныеПрохожденияОбучения.ПроведениеОбучения, ДанныеПрохожденияОбучения.Сценарий, Ложь);
				КонецЕсли;
				
				ОписаниеПользователяСтруктура = ВебКабинетСУО.ПользовательСтруктура(ДанныеПрохожденияОбучения.Пользователь, ДанныеПрохожденияОбучения.НаименованиеПользователя);
				
				Для каждого СтрокаТП Из ТаблицаПреподавателей Цикл
					
					Если СтрокаТП.Проведено Тогда
						Продолжить;
					КонецЕсли;
					
					Для каждого СтрокаТНП Из ТестыНаПроверку Цикл					
						
						ОписаниеТестаНаПроверку = Документы.ПопыткаВыполненияЗаданияСУО.НоваяПустаяСтруктураПопыткиВыполненияЗадания();
													
						ОписаниеТестаНаПроверку.Вставить("ПопыткаВыполненияЗадания", Строка(СтрокаТНП.Регистратор.УникальныйИдентификатор()));
						ОписаниеТестаНаПроверку.Вставить("ЭлектронныйРесурс", СтрокаТНП.ЭлектронныйРесурс);
						ОписаниеТестаНаПроверку.Вставить("ЭлементСодержания", СтрокаТНП.ЭлементСодержания);
						ОписаниеТестаНаПроверку.Вставить("ПрохождениеОбучения", СтрокаТНП.ПрохождениеОбучения);
						ОписаниеТестаНаПроверку.Вставить("Задание", СтрокаТНП.Задание);
						ОписаниеТестаНаПроверку.Вставить("Наименование", СтрокаТНП.НаименованиеЗадания);
						ОписаниеТестаНаПроверку.Вставить("НаОсновеЭлектронногоРесурса", Истина);
						ОписаниеТестаНаПроверку.Вставить("Пользователь", ОписаниеПользователяСтруктура);
						ОписаниеТестаНаПроверку.Вставить("ПроведениеОбучения", СтрокаТНП.ПроведениеОбучения);						
						
						Если ЗначениеЗаполнено(ДанныеПрохожденияДляПолногоОписания.РодительскоеПрохождение) Тогда
							ОписаниеТестаНаПроверку.Вставить("НаименованиеРодительскогоСценария", ДанныеПрохожденияДляПолногоОписания.НаименованиеРодительскогоПрохождения);
						Иначе
							ОписаниеТестаНаПроверку.Вставить("НаименованиеРодительскогоСценария", "");
						КонецЕсли;
						ОписаниеТестаНаПроверку.Вставить("НаименованиеСценария", НаименованиеОбучения(ДанныеПрохожденияДляПолногоОписания));
						ОписаниеТестаНаПроверку.Вставить("ДатаОтправкиНаПроверку", СтрокаТНП.Дата);
						
						ОписаниеТестаНаПроверкуJSON = ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеТестаНаПроверку);
						РегистрыСведений.ДанныеВебКабинетаСУО_ПН.ДобавитьДанные(СтрокаТП.Преподаватель, Перечисления.ТипыДанныхВебКабинетаСУО.ПроверкаЗаданияОписание, СтрокаТНП.Регистратор, ОписаниеТестаНаПроверкуJSON, Перечисления.ФорматыВебДанныхСУ.json);
						
						РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.ДобавитьОтбор(СтрокаТНП.Регистратор, ДанныеПрохожденияОбучения.ПроведениеОбучения);
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЕсли;
			
			ЗаданияНаПроверку = Документы.ПопыткаВыполненияЗаданияСУО.ЗаданияНаПроверку(ПрохождениеОбучения);
			
			Если ЗаданияНаПроверку.Количество() > 0 Тогда
				
				Если ТаблицаПреподавателей = Неопределено Тогда
					ТаблицаПреподавателей = Документы.ПроведениеОбученияСУО.Преподаватели(ДанныеПрохожденияОбучения.ПроведениеОбучения, ДанныеПрохожденияОбучения.Сценарий, Ложь);
				КонецЕсли;			
				
				Для каждого СтрокаТЗП Из ЗаданияНаПроверку Цикл
					
					Для каждого СтрокаТП Из ТаблицаПреподавателей Цикл
						
						Если СтрокаТП.Проведено Тогда
							Продолжить;
						КонецЕсли;
						
						ОписаниеПопыткиВыполненияЗаданияСтруктура = Документы.ПопыткаВыполненияЗаданияСУО.ОписаниеПопыткиВыполненияЗаданияСтруктура(СтрокаТЗП.Ссылка);
						ОписаниеПопыткиВыполненияЗаданияJSON = ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеПопыткиВыполненияЗаданияСтруктура);
						РегистрыСведений.ДанныеВебКабинетаСУО_ПН.ДобавитьДанные(
							СтрокаТП.Преподаватель,
							Перечисления.ТипыДанныхВебКабинетаСУО.ПроверкаЗаданияОписание,
							СтрокаТЗП.Ссылка,
							ОписаниеПопыткиВыполненияЗаданияJSON,
							Перечисления.ФорматыВебДанныхСУ.json);
						
						РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.ДобавитьОтбор(СтрокаТЗП.Ссылка, ДанныеПрохожденияОбучения.ПроведениеОбучения);
							
					КонецЦикла;
				
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
			
		// Авто-раздел форума
			
		ТаблицаПользовательскихРазделов = РегистрыСведений.АвтоРазделыФорумаСУО.РазделыПользователя(ДанныеПрохожденияОбучения.Пользователь, ДанныеПрохожденияОбучения.ПроведениеОбучения);

		ОписаниеРазделаJSON = Справочники.РазделыФорумаСУО.РазделJSON(ДанныеПрохожденияОбучения.ПроведениеОбучения);

		Для каждого Строка Из ТаблицаПользовательскихРазделов Цикл
			// Таблица не может содержать более одной строки
			РегистрыСведений.ДанныеВебКабинетаСУО_ПН.ДобавитьДанные(Строка.Пользователь, Перечисления.ТипыДанныхВебКабинетаСУО.РазделФорума, ДанныеПрохожденияОбучения.ПроведениеОбучения, ОписаниеРазделаJSON, Перечисления.ФорматыВебДанныхСУ.json);
		КонецЦикла;		
		
		// Зависимости
		
		Зависимости.Добавить(ДанныеПрохожденияОбучения.Пользователь);
		
		Если ТипЗнч(ДанныеПрохожденияОбучения.Сценарий) <> Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
			Зависимости.Добавить(ДанныеПрохожденияОбучения.Сценарий);
		КонецЕсли;
		
		Если ПолучитьФункциональнуюОпцию("ОбразовательнаяОрганизацияОО") Тогда
			
			УчебнаяГруппаПользователей = Справочники.УчебныеГруппыОО.УчебнаяГруппаПользователя(ДанныеПрохожденияОбучения.Пользователь);
			
			Если УчебнаяГруппаПользователей <> Неопределено Тогда
				Зависимости.Добавить(УчебнаяГруппаПользователей.УчебнаяГруппа);
			КонецЕсли;
			
		КонецЕсли;
		
		Зависимости.Добавить(ВидОбучения);
		
		Если ПрохождениеАктуально Тогда			
			РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.ДобавитьДанные(ПрохождениеОбучения, "Документ.ПрохождениеОбученияСУО", Зависимости);			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

Функция УчебнаяАктивностьПустаяСтруктура() Экспорт
	
	Возврат Новый Структура("
	|Тип,
	|Идентификатор,
	|Наименование,
	|ДатаНачала,
	|ДатаОкончания,
	|ЭлектронноДистанционное,
	|СтатусОбучения,
	|Актуально,
	|ЕдинственноеЗадание,
	|КомментарийДляУчастника,
	|Цвет,
	|СкрытьВремяПроведения,
	|РодительскаяАктивность,
	|ПодчиненныеАктивности,
	|Сценарий,
	|ЗавершаетУчащийся,
	|ПрохождениеОбучения,
	|ДатаОткрытияЗаписи,
	|ДатаЗакрытияЗаписи,
	|НомерМероприятия,
	|ПорядковыйНомер,
	|Картинка,
	|ДатаПоследнейАктивности,
	|ДатаНачалаПрохождения,
	|ДатаОкончанияПрохождения,
	|Баллы,
	|ЗавершеноВПроцентах,
	|Оценка,
	|ДатаНачалаОтсчетаПродолжительности,
	|ПродолжительностьВСекундах,
	|ВариантПродолжительности,
	|СредняяОценкаКачестваОбучения,
	|КоличествоОценокКачестваОбучения,
	|ПроведениеОбучения,
	|Дисциплина,
	|ПрограммаОбучения,
	|ВидОбучения");
	
КонецФункции

Функция УчебнаяАктивностьСтруктура(ПрохождениеОбучения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем данные
	//
	
	ТребуемыеДанные = Новый Структура("
		|Ссылка,
		|Сценарий,
		|Статус,
		|ПроведениеОбучения,
		|СтатусПроведенияОбучения,
		|ДатаНачалаДоступа,
		|ДатаКонтроля,	
		|КомментарийДляУчастника,
		|ДатаНачалаПрохождения,
		|ДатаОкончанияПрохождения,  
		|НаОсновеЭлектронногоРесурса,
		|НаОсновеМероприятия,
		|НаименованиеСценария,
		|ЦветАктивногоМероприятияНаКалендареУчащегося,
		|ЦветЗапланированногоМероприятияНаКалендареУчащегося,
		|ЦветЗавершенногоМероприятияНаКалендареУчащегося,
		|ЦветОтмененногоМероприятияНаКалендареУчащегося,
		|СкрытьВремяПроведения,
		|РодительскоеПрохождение,
		|СхемаПроведения,
		|ВозвращеноНаДоработку,
		|НаименованиеПроведенияОбучения,
		|НомерМероприятия,
		|ПорядковыйНомер,
		|ФайлКартинки,
		|РасширениеКартинки,
		|ДатаПоследнейАктивности,
		|Баллы,
		|ЗавершеноВПроцентах,
		|ВариантПродолжительности,
		|ДатаЗачисления,
		|ПродолжительностьВСекундах,
		|КачествоОбученияОцениваетсяУчастниками,
		|ПоказыватьОценкиИКомментарииВсемУчастникам,
		|ВыставляетсяОценка,		
		|Дисциплина,
		|НаименованиеДисциплины,
		|ПроведениеПрограммыОбучения,
		|НаименованиеПрограммыОбучения,
		|НаименованиеПрограммыОбученияДляУчастника,
		|ВыставленаОценка",
		"Ссылка",
		"Сценарий",
		"Статус",
		"ПроведениеОбучения",
		"ПроведениеОбучения.Статус",
		"ПроведениеОбучения.ДатаНачалаДоступа",
		"ПроведениеОбучения.ДатаКонтроля",
		"ПроведениеОбучения.КомментарийДляУчастника",
		"ДатаНачалаПрохождения",
		"ДатаОкончанияПрохождения",
		"ПроведениеОбучения.НаОсновеЭлектронногоРесурса",
		"ПроведениеОбучения.НаОсновеМероприятия",
		"Сценарий.Наименование",
		"ПроведениеОбучения.ЦветАктивногоМероприятияНаКалендареУчащегося",
		"ПроведениеОбучения.ЦветЗапланированногоМероприятияНаКалендареУчащегося",
		"ПроведениеОбучения.ЦветЗавершенногоМероприятияНаКалендареУчащегося",
		"ПроведениеОбучения.ЦветОтмененногоМероприятияНаКалендареУчащегося",
		"ПроведениеОбучения.СкрытьВремяПроведения",
		"РодительскоеПрохождение",
		"ПроведениеОбучения.СхемаПроведения",
		"ВозвращеноНаДоработку",
		"ПроведениеОбучения.Наименование",
		"Сценарий.РеквизитДопУпорядочивания",
		"ПроведениеОбучения.ПорядковыйНомер",
		"ПроведениеОбучения.ФайлКартинки",
		"ПроведениеОбучения.ФайлКартинки.Расширение",
		"ДатаПоследнейАктивности",
		"Баллы",
		"ЗавершеноВПроцентах",
		"ПроведениеОбучения.ВариантПродолжительности",
		"Дата",
		"ПродолжительностьВСекундах",
		"ПроведениеОбучения.КачествоОбученияОцениваетсяУчастниками",
		"ПроведениеОбучения.ПоказыватьОценкиИКомментарииВсемУчастникам",
		"ВыставляетсяОценка",
		"ПроведениеОбучения.Дисциплина",
		"ПроведениеОбучения.Дисциплина.Наименование",
		"ПроведениеОбучения.ПроведениеПрограммыОбучения",
		"ПроведениеОбучения.ПроведениеПрограммыОбучения.Наименование",
		"ПроведениеОбучения.ПроведениеПрограммыОбучения.НаименованиеДляУчастника",
		"ВыставленаОценка"
	);
		
	ДанныеПрохожденияОбучения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеОбучения, ТребуемыеДанные);	
	ЭлектронноДистанционное = Документы.ПроведениеОбученияСУО.ЭлектронноДистанционноеОбучение(ДанныеПрохожденияОбучения.ПроведениеОбучения,,ДанныеПрохожденияОбучения.Сценарий);	
	ВидОбучения = Документы.ПроведениеОбученияСУО.ВидОбучения(ДанныеПрохожденияОбучения.ПроведениеОбучения, ДанныеПрохожденияОбучения.Сценарий);	
	ПрохождениеАктуально = Актуально(ПрохождениеОбучения);	
	СтатусПроцессаОбучения = СтатусПроцессаОбучения(ПрохождениеОбучения);	
	ЗаданияДоступны  = ЗаданияДоступны(ПрохождениеОбучения, ДанныеПрохожденияОбучения.ПроведениеОбучения, ДанныеПрохожденияОбучения.Сценарий, ВидОбучения, СтатусПроцессаОбучения, ДанныеПрохожденияОбучения.ВариантПродолжительности, ДанныеПрохожденияОбучения.ДатаНачалаПрохождения);
	Общее = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидОбучения, "Общее");
	ШкалаОценки = Документы.ПроведениеОбученияСУО.ШкалаОценки(ДанныеПрохожденияОбучения.ПроведениеОбучения);
	
	// Заполняем свойства
	//
	
	СтруктураДанных = УчебнаяАктивностьПустаяСтруктура();
	
	// Основные свойства	
	
	СтруктураДанных.Идентификатор = Строка(ПрохождениеОбучения.УникальныйИдентификатор());
	СтруктураДанных.Тип = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ТипАктивности());
	СтруктураДанных.Наименование = НаименованиеОбучения(ДанныеПрохожденияОбучения);
	СтруктураДанных.СтатусОбучения = Перечисления.СтатусыПроцессаОбученияСУО.ЗначениеВЧисло(СтатусПроцессаОбучения);
	СтруктураДанных.Актуально = ПрохождениеАктуально;
	СтруктураДанных.ЭлектронноДистанционное = ЭлектронноДистанционное;
	СтруктураДанных.СкрытьВремяПроведения = ДанныеПрохожденияОбучения.СкрытьВремяПроведения;
	СтруктураДанных.Сценарий = ДанныеПрохожденияОбучения.Сценарий;
	СтруктураДанных.ЗавершаетУчащийся = ДоступноЗавершениеУчащимся(ПрохождениеОбучения, ДанныеПрохожденияОбучения.ПроведениеОбучения, ДанныеПрохожденияОбучения.Сценарий, ВидОбучения);
	СтруктураДанных.ПорядковыйНомер = ДанныеПрохожденияОбучения.ПорядковыйНомер;
	СтруктураДанных.ДатаПоследнейАктивности = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ДанныеПрохожденияОбучения.ДатаПоследнейАктивности);
	СтруктураДанных.ДатаНачалаПрохождения = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ДанныеПрохожденияОбучения.ДатаНачалаПрохождения);
	СтруктураДанных.ДатаОкончанияПрохождения = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ДанныеПрохожденияОбучения.ДатаОкончанияПрохождения);
	СтруктураДанных.Баллы = ДанныеПрохожденияОбучения.Баллы;
	СтруктураДанных.ЗавершеноВПроцентах = ДанныеПрохожденияОбучения.ЗавершеноВПроцентах;
	СтруктураДанных.ПроведениеОбучения = ДанныеПрохожденияОбучения.ПроведениеОбучения;
	
	Если ЗначениеЗаполнено(ДанныеПрохожденияОбучения.Дисциплина) Тогда		
		СтруктураДанных.Дисциплина = Новый Структура("Идентификатор, Наименование");
		СтруктураДанных.Дисциплина.Идентификатор = Строка(ДанныеПрохожденияОбучения.Дисциплина.УникальныйИдентификатор());
		СтруктураДанных.Дисциплина.Наименование = ДанныеПрохожденияОбучения.НаименованиеДисциплины;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеПрохожденияОбучения.ПроведениеПрограммыОбучения) Тогда
		СтруктураДанных.ПрограммаОбучения = Новый Структура("Идентификатор, Наименование");
		СтруктураДанных.ПрограммаОбучения.Идентификатор =  Строка(ДанныеПрохожденияОбучения.ПроведениеПрограммыОбучения.УникальныйИдентификатор());
		Если ЗначениеЗаполнено(ДанныеПрохожденияОбучения.НаименованиеПрограммыОбученияДляУчастника) Тогда
			СтруктураДанных.ПрограммаОбучения.Наименование = ДанныеПрохожденияОбучения.НаименованиеПрограммыОбученияДляУчастника;
		Иначе
			СтруктураДанных.ПрограммаОбучения.Наименование = ДанныеПрохожденияОбучения.НаименованиеПрограммыОбучения
		КонецЕсли;
	КонецЕсли;
	
	СтруктураДанных.ВидОбучения = Новый Структура("Идентификатор, Наименование");
	СтруктураДанных.ВидОбучения.Идентификатор = Строка(ВидОбучения.УникальныйИдентификатор());
	СтруктураДанных.ВидОбучения.Наименование = Строка(ВидОбучения.Наименование);
	
	// Оценка
	
	СтруктураДанных.Оценка = Неопределено;
	
	Если ДанныеПрохожденияОбучения.ВыставляетсяОценка
		И ДанныеПрохожденияОбучения.ВыставленаОценка Тогда
	
		ДанныеОценки = Справочники.ШкалыОценокСУО.ОценкаИзБаллов(ДанныеПрохожденияОбучения.Баллы, ШкалаОценки, Истина);
		
		Если ТипЗнч(ДанныеОценки) = Тип("Структура") Тогда
			СтруктураДанных.Оценка = Новый Структура("Идентификатор, Наименование",
				Строка(ДанныеОценки.Ссылка.УникальныйИдентификатор()), ДанныеОценки.Наименование);
		КонецЕсли;
			
	КонецЕсли;
		
	// Картинка обучения
	
	СтруктураДанных.Картинка = "";
	Если ЗначениеЗаполнено(ДанныеПрохожденияОбучения.ФайлКартинки) Тогда
		СтруктураДанных.Картинка = Документы.ПроведениеОбученияСУО.АдресФайлаКартинки(
			ДанныеПрохожденияОбучения.ПроведениеОбучения, ДанныеПрохожденияОбучения.РасширениеКартинки); 
	КонецЕсли;
		
	// Номер сценария
	
	Если ЗначениеЗаполнено(ДанныеПрохожденияОбучения.РодительскоеПрохождение) Тогда
		СтруктураДанных.НомерМероприятия = ДанныеПрохожденияОбучения.НомерМероприятия;
	КонецЕсли;
	
	// Родительская активность
	
	СтруктураДанных.РодительскаяАктивность = ДанныеПрохожденияОбучения.РодительскоеПрохождение;
	
	// Цвет
	
	СтруктураДанных.Цвет = Документы.ПроведениеОбученияСУО.ЦветНаКалендаре(ДанныеПрохожденияОбучения.ПроведениеОбучения, ВидОбучения, Перечисления.ТипыУчебныхАктивностейСУО.Обучение);
	
	// Комментарии
	
	СтруктураДанных.КомментарийДляУчастника = ДанныеПрохожденияОбучения.КомментарийДляУчастника;
	
	// Электронное задание
	
	Если ЗаданияДоступны Тогда
		СтруктураДанных.ЕдинственноеЗадание = Документы.ПрохождениеОбученияСУО.ОписаниеЕдинственногоЗаданияПрохождения(ПрохождениеОбучения, ДанныеПрохожденияОбучения.ПроведениеОбучения, ДанныеПрохожденияОбучения.Сценарий);
	КонецЕсли;
	
	// Дата начала и окончания
	
	СтруктураДанных.ДатаНачала = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ДанныеПрохожденияОбучения.ДатаНачалаПрохождения);
	СтруктураДанных.ДатаОкончания = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ДанныеПрохожденияОбучения.ДатаОкончанияПрохождения);
	
	// Продолжительность
	
	СтруктураДанных.ДатаНачалаОтсчетаПродолжительности = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(
		ДатаНачалаОтсчетаПродолжительности(ДанныеПрохожденияОбучения));
	
	СтруктураДанных.ПродолжительностьВСекундах = ДанныеПрохожденияОбучения.ПродолжительностьВСекундах;
	
	СтруктураДанных.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.ЗначениеВЧисло(
		ДанныеПрохожденияОбучения.ВариантПродолжительности);
		
	// Качество обучения
	
	СтруктураДанных.СредняяОценкаКачестваОбучения = 0;
	СтруктураДанных.КоличествоОценокКачестваОбучения = 0;
					
	Если ДанныеПрохожденияОбучения.КачествоОбученияОцениваетсяУчастниками
		И ДанныеПрохожденияОбучения.ПоказыватьОценкиИКомментарииВсемУчастникам Тогда
		
		ОписаниеОценокКачества = УправлениеОбучениемСУОПовтИсп.ОценкаКачестваПроведенияОбучения(
			ДанныеПрохожденияОбучения.ПроведениеОбучения);
			
		СтруктураДанных.СредняяОценкаКачестваОбучения = ОписаниеОценокКачества.СредняяОценка;
		СтруктураДанных.КоличествоОценокКачестваОбучения = ОписаниеОценокКачества.КоличествоОценок;
			
	КонецЕсли;
			
	// Подчиненные мероприятия (для общих)
	
	Если Общее Тогда		
		СтруктураДанных.ПодчиненныеАктивности = Документы.ПроведениеОбученияСУО.ПодчиненныеМероприятия(ДанныеПрохожденияОбучения.ПроведениеОбучения,,ДанныеПрохожденияОбучения.СхемаПроведения);		
	КонецЕсли;
	
	// Завершаем
	//
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция УчебнаяАктивностьОписаниеXML(ПрохождениеОбучения, ИдентификаторФормы = Неопределено, ДанныеПрохождения = Неопределено, ПрикрепленныеФайлы = Неопределено, Зависимости = Неопределено, ЕстьРезультатыТестирования = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем переменные
	//
	
	Если ДанныеПрохождения = Неопределено Тогда
		
		ТребуемыеДанные = Новый Структура("
		|Ссылка,
		|Дата,		
		|Пользователь,
		|НаименованиеПользователя,
		|НаОсновеЭлектронногоРесурса,
		|НаОсновеМероприятия,
		|Сценарий,
		|НаименованиеСценария,		
		|Баллы,
		|ПроведениеОбучения,
		|КомментарийЗапланированногоМероприятияДляУчастника,
		|КомментарийАктивногоМероприятияДляУчастника,
		|КомментарийЗавершенногоМероприятияДляУчастника,
		|КомментарийОтмененногоМероприятияДляУчастника,
		|Аудитория,
		|НаименованиеАудитории,
		|НаименованиеТерритории,		
		|СтатусПроведенияОбучения,
		|ДатаКонтроля,
		|КомментарийСценарияДляУчастника,
		|КомментарийДляУчастника,
		|СкрытьПреподавателей,
		|Пользователь,
		|РодительскоеПрохождение,
		|СтатусПрохожденияОбучения,
		|ДатаОкончанияПрохождения,
		|ДатаНачалаПрохождения,
		|КомментарийПреподавателя,
		|АдресВИнтернете,
		|СкрытьВремяПроведения,
		|ПроверяетсяПреподавателем,
		|ПроверенПреподавателем,
		|ВозвращеноНаДоработку,
		|НаименованиеРодительскогоПрохождения,
		|НаименованиеПроведенияОбучения,
		|ФайлКартинки,
		|РасширениеКартинки,
		|ЗавершеноВПроцентах,
		|ВариантПродолжительности,
		|ДатаЗачисления,
		|ПродолжительностьВСекундах,
		|ОценкаКачестваОбучения,
		|КомментарийКачестваОбучения,
		|ОписаниеБлокаОценкиКачестваОбучения,
		|ЗаголовокБлокаОценкиКачестваОбучения,
		|КачествоОбученияОцениваетсяУчастниками,
		|ПоказыватьОценкиИКомментарииВсемУчастникам,
		|ДобавленоВремениВСекундах,
		|ТекущиеБаллы,
		|ВыставляетсяОценка,
		|ВыставленаОценка",
		"Ссылка",
		"Дата",		
		"Пользователь",
		"Пользователь.Наименование",
		"ПроведениеОбучения.НаОсновеЭлектронногоРесурса",
		"ПроведениеОбучения.НаОсновеМероприятия",
		"Сценарий",
		"Сценарий.Наименование",
		"Баллы",
		"ПроведениеОбучения",
		"ПроведениеОбучения.КомментарийЗапланированногоМероприятияДляУчастника",
		"ПроведениеОбучения.КомментарийАктивногоМероприятияДляУчастника",
		"ПроведениеОбучения.КомментарийЗавершенногоМероприятияДляУчастника",
		"ПроведениеОбучения.КомментарийОтмененногоМероприятияДляУчастника",
		"ПроведениеОбучения.Аудитория",
		"ПроведениеОбучения.Аудитория.Наименование",
		"ПроведениеОбучения.Аудитория.Владелец.Наименование",		
		"ПроведениеОбучения.Статус",
		"ПроведениеОбучения.ДатаКонтроля",
		"Сценарий.КомментарийДляУчастника",
		"ПроведениеОбучения.КомментарийДляУчастника",
		"ПроведениеОбучения.СкрытьПреподавателей",
		"Пользователь",
		"РодительскоеПрохождение",
		"Статус",
		"ДатаОкончанияПрохождения",
		"ДатаНачалаПрохождения",
		"КомментарийПреподавателя",
		"ПроведениеОбучения.АдресВИнтернете",
		"ПроведениеОбучения.СкрытьВремяПроведения",
		"ПроверяетсяПреподавателем",
		"ПроверенПреподавателем",
		"ВозвращеноНаДоработку",
		"РодительскоеПрохождение.Сценарий.Наименование",
		"ПроведениеОбучения.Наименование",
		"ПроведениеОбучения.ФайлКартинки",
		"ПроведениеОбучения.ФайлКартинки.Расширение",
		"ЗавершеноВПроцентах",
		"ПроведениеОбучения.ВариантПродолжительности",
		"Дата",
		"ПродолжительностьВСекундах",
		"ОценкаКачестваОбучения",
		"КомментарийКачестваОбучения",
		"ПроведениеОбучения.ОписаниеБлокаОценкиКачестваОбучения",
		"ПроведениеОбучения.ЗаголовокБлокаОценкиКачестваОбучения",
		"ПроведениеОбучения.КачествоОбученияОцениваетсяУчастниками",
		"ПроведениеОбучения.ПоказыватьОценкиИКомментарииВсемУчастникам",
		"ДобавленоВремениВСекундах",
		"ТекущиеБаллы",
		"ВыставляетсяОценка",
		"ВыставленаОценка");
		
		ДанныеПрохождения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеОбучения, ТребуемыеДанные);
		
	КонецЕсли;
		
	СтатусОбучения        = СтатусПроцессаОбучения(ПрохождениеОбучения);
	ВидОбучения           = Документы.ПроведениеОбученияСУО.ВидОбучения(ДанныеПрохождения.ПроведениеОбучения, ДанныеПрохождения.Сценарий);
	ДоступноОбщение       = ДоступноОбщение(ПрохождениеОбучения);
	ЕстьАвтоРазделыФорума = ЕстьАвтоРазделыФорума(ПрохождениеОбучения);
	ПрохождениеАктуально  = Актуально(ПрохождениеОбучения, СтатусОбучения);
	ШкалаОценки           = Документы.ПроведениеОбученияСУО.ШкалаОценки(ДанныеПрохождения.ПроведениеОбучения);		
	ЗаданияДоступны       = ЗаданияДоступны(ПрохождениеОбучения, ДанныеПрохождения.ПроведениеОбучения, ДанныеПрохождения.Сценарий, ВидОбучения, СтатусОбучения, ДанныеПрохождения.ВариантПродолжительности, ДанныеПрохождения.ДатаНачалаПрохождения);
	
	ПодчиненныеМероприятияДоступны = ПодчиненныеМероприятияДоступны(ПрохождениеОбучения, ДанныеПрохождения.ПроведениеОбучения, ДанныеПрохождения.Сценарий, ВидОбучения, СтатусОбучения, ДанныеПрохождения.ДатаНачалаПрохождения);
	
	// Формируем пакет XDTO.
	//
	
	ПрохождениеXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/UserActivity", "ПрохождениеОбучения");
	ПрохождениеXDTO    = ФабрикаXDTO.Создать(ПрохождениеXDTOТип);
	
	// Основные свойства
		
	ПрохождениеXDTO.Наименование = НаименованиеОбучения(ДанныеПрохождения);
	ПрохождениеXDTO.ПрохождениеОбучения = ПрохождениеОбучения;	
	ПрохождениеXDTO.ПроведениеОбучения = ДанныеПрохождения.ПроведениеОбучения; 
	ПрохождениеXDTO.СтатусОбучения = Перечисления.СтатусыПроцессаОбученияСУО.ЗначениеВЧисло(СтатусОбучения);	
	ПрохождениеXDTO.СтатусПрохождения = Перечисления.СтатусыПрохожденияОбъектовСУО.ЗначениеВЧисло(ДанныеПрохождения.СтатусПрохожденияОбучения);
	ПрохождениеXDTO.ДоступенСписокУчастников = ДоступноОбщение;
	ПрохождениеXDTO.ДоступенСписокПреподавателей = ДоступенСписокПреподавателей(ПрохождениеОбучения, ВидОбучения, ДанныеПрохождения.СкрытьПреподавателей);
	ПрохождениеXDTO.ДоступенРазделФорума = (ДоступноОбщение И ЕстьАвтоРазделыФорума);
	ПрохождениеXDTO.Актуально = ПрохождениеАктуально;
	ПрохождениеXDTO.АдресВИнтернете = ДанныеПрохождения.АдресВИнтернете;
	ПрохождениеXDTO.СкрытьВремяПроведения = ДанныеПрохождения.СкрытьВремяПроведения;
	ПрохождениеXDTO.ЭлектронноеОбучение = Документы.ПроведениеОбученияСУО.ЭтоЭлектронноеОбучение(ДанныеПрохождения.ПроведениеОбучения, ВидОбучения, ДанныеПрохождения.Сценарий);
	ПрохождениеXDTO.ВыставляетсяОценка = ВидОбучения.ВыставляетсяОценка; // Берем из вида, чтобы отличать ситуации, когда оценка нужна, но ее нет
	ПрохождениеXDTO.ШкалаОценок = Справочники.ШкалыОценокСУО.ШкалаОценокXDTO(ШкалаОценки);
	ПрохождениеXDTO.ПоказыватьБаллы = Справочники.ШкалыОценокСУО.ПоказыватьБаллыВместеСОценкой(ШкалаОценки);
	ПрохождениеXDTO.Сценарий = УправлениеОбучениемСУО.СценарийОбученияXDTO(ДанныеПрохождения.Сценарий, ДанныеПрохождения.НаименованиеСценария);
	ПрохождениеXDTO.ЗавершаетУчащийся = ДоступноЗавершениеУчащимся(ПрохождениеОбучения, ДанныеПрохождения.ПроведениеОбучения, ДанныеПрохождения.Сценарий, ВидОбучения);
	ПрохождениеXDTO.ЗаданияПроверяютсяВыборочно = Справочники.ВидыМероприятийСУО.ЗаданияПроверяютсяВыборочно(ВидОбучения);
	ПрохождениеXDTO.ПоказыватьПодробныеСведенияОЗадании = ВидОбучения.ПоказыватьПодробныеСведенияОЗадании;
	ПрохождениеXDTO.ВариантОтображенияВремени = Перечисления.ВариантыОтображенияВремениИзученияЭлектронногоРесурсаСУО.ЗначениеВЧисло(ВидОбучения.ВремяИзученияЭлектронныхКурсов);
	ПрохождениеXDTO.ЗавершеноВПроцентах = ДанныеПрохождения.ЗавершеноВПроцентах;
	ПрохождениеXDTO.ВозвращеноНаДоработку = ДанныеПрохождения.ВозвращеноНаДоработку;
	
	ПрохождениеXDTO.ДоступноОцениваниеКачестваОбучения = ДоступенБлокОцениванияКачестваОбучения(СтатусОбучения, ДанныеПрохождения.КачествоОбученияОцениваетсяУчастниками);
	ПрохождениеXDTO.ОценкаКачестваОбучения = ДанныеПрохождения.ОценкаКачестваОбучения;
	ПрохождениеXDTO.КомментарийКачестваОбучения = ДанныеПрохождения.КомментарийКачестваОбучения;
	ПрохождениеXDTO.ОписаниеБлокаОценкиКачестваОбучения = ДанныеПрохождения.ОписаниеБлокаОценкиКачестваОбучения;
	ПрохождениеXDTO.ЗаголовокБлокаОценкиКачестваОбучения = ДанныеПрохождения.ЗаголовокБлокаОценкиКачестваОбучения;
	ПрохождениеXDTO.ПоказыватьОценкиИКомментарииВсехУчастников = ДанныеПрохождения.ПоказыватьОценкиИКомментарииВсемУчастникам;
	
	Если ЗначениеЗаполнено(ДанныеПрохождения.РодительскоеПрохождение) Тогда
		ПрохождениеXDTO.РодительскоеПрохождение = ДанныеПрохождения.РодительскоеПрохождение;
		ПрохождениеXDTO.НаименованиеРодительскогоПрохождения = ДанныеПрохождения.НаименованиеРодительскогоПрохождения;
	КонецЕсли;
	
	ПрохождениеXDTO.ПроверяетсяПреподавателем = ДанныеПрохождения.ПроверяетсяПреподавателем;
	ПрохождениеXDTO.ПроверенПреподавателем = ДанныеПрохождения.ПроверенПреподавателем;
	
	// Картинка обучения
	
	Если ЗначениеЗаполнено(ДанныеПрохождения.ФайлКартинки) Тогда
		ПрохождениеXDTO.Картинка = Документы.ПроведениеОбученияСУО.АдресФайлаКартинки(
			ДанныеПрохождения.ПроведениеОбучения, ДанныеПрохождения.РасширениеКартинки); 			
	КонецЕсли;	
	
	// Результаты тестирования	
				
	Если ВидОбучения.ПоказыватьРезультатыТестирования 
		И (НЕ ВидОбучения.ПоказыватьРезультатыТестированияПослеЗавершения
		ИЛИ (ВидОбучения.ПоказыватьРезультатыТестированияПослеЗавершения
		И (ДанныеПрохождения.СтатусПрохожденияОбучения = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил
		ИЛИ ДанныеПрохождения.СтатусПрохожденияОбучения = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат))) Тогда
		
		Если ЕстьРезультатыТестирования = Неопределено Тогда
			
			ТаблицаПрисоединенныхЭлектронныхКурсов = Документы.ПроведениеОбученияСУО.ПрикрепленныеЭлектронныеРесурсы(ДанныеПрохождения.ПроведениеОбучения, ДанныеПрохождения.Сценарий, Истина);
			ПрисоединенныеЭлектронныеКурсы = ТаблицаПрисоединенныхЭлектронныхКурсов.ВыгрузитьКолонку("ЭлектронныйРесурс");

			Если ПрохождениеXDTO.ЭлектронноеОбучение ИЛИ ПрисоединенныеЭлектронныеКурсы.Количество() > 0 Тогда			
				ВыборкаТестирований = РегистрыСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПопыткиПрохожденияТестов(ДанныеПрохождения.Пользователь, ПрохождениеОбучения, ПрисоединенныеЭлектронныеКурсы);
			КонецЕсли;		
			
			Если ВыборкаТестирований <> Неопределено И ВыборкаТестирований.Количество() > 0 Тогда
				ЕстьРезультатыТестирования = Истина;
			Иначе
				ЕстьРезультатыТестирования = Ложь;
			КонецЕсли;

		КонецЕсли;
		
		ПрохождениеXDTO.ПоказыватьРезультатыТестирования = ЕстьРезультатыТестирования;
		
		Если ПрохождениеXDTO.ПоказыватьРезультатыТестирования Тогда
			ПрохождениеXDTO.ПоказыватьОтветыВРезультатахТестирования = ВидОбучения.ПоказыватьОтветыВРезультатахТестирования;
			ПрохождениеXDTO.ПоказыватьОценкуВРезультатахТестирования = ВидОбучения.ПоказыватьОценкуВРезультатахТестирования;
		КонецЕсли;
		
	Иначе
		
		ПрохождениеXDTO.ПоказыватьРезультатыТестирования = Ложь;
		
	КонецЕсли;		
		
	// Даты
		
	ПрохождениеXDTO.ДатаНачалаПрохожденияЧисло = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ДанныеПрохождения.ДатаНачалаПрохождения);
	ПрохождениеXDTO.ДатаОкончанияПрохожденияЧисло = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ДанныеПрохождения.ДатаОкончанияПрохождения);
	ПрохождениеXDTO.ДатаКонтроляЧисло = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ДанныеПрохождения.ДатаОкончанияПрохождения); // Устарело (оставлено для совместимости с ВК 2.0)
	ПрохождениеXDTO.ДатаКонтроляСтрока = ОбщегоНазначенияСУКлиентСервер.ДатаВСтроку(ДанныеПрохождения.ДатаОкончанияПрохождения, ДанныеПрохождения.СкрытьВремяПроведения); // Устарело (оставлено для совместимости с ВК 2.0)
	ПрохождениеXDTO.ПериодСтрока = ОбщегоНазначенияСУКлиентСервер.ПериодВСтроку(ДанныеПрохождения.ДатаНачалаПрохождения, ДанныеПрохождения.ДатаОкончанияПрохождения, ДанныеПрохождения.СкрытьВремяПроведения);
					
	ПрохождениеXDTO.ДатаНачалаОтсчетаПродолжительности = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(
		ДатаНачалаОтсчетаПродолжительности(ДанныеПрохождения));
	
	ПрохождениеXDTO.ПродолжительностьВСекундах = ДанныеПрохождения.ПродолжительностьВСекундах;
	
	ПрохождениеXDTO.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.ЗначениеВЧисло(
		ДанныеПрохождения.ВариантПродолжительности);
		
	ПрохождениеXDTO.ПродолжительностьСтрока = ОбъектыSCORM.ПолучитьПолнуюСтрокуИзКоличестваСекунд(ДанныеПрохождения.ПродолжительностьВСекундах);
	ПрохождениеXDTO.ОсталосьВремениСтрока = ОсталосьВремениСтрока(
		ПрохождениеАктуально,
		СтатусОбучения,
		ДанныеПрохождения.ВариантПродолжительности,
		ДанныеПрохождения.ПродолжительностьВСекундах,
		ДатаНачалаОтсчетаПродолжительности(ДанныеПрохождения),
		ДанныеПрохождения.ДатаОкончанияПрохождения);
	
	// Прикрепленные файлы
	
	ПрохождениеXDTO.РазрешеноПрикреплятьФайлы = ДоступноПрикреплениеФайлов(ПрохождениеОбучения, СтатусОбучения, ПрохождениеАктуально);
	
	Если ПрикрепленныеФайлы = Неопределено Тогда
		ПрикрепленныеФайлы = ОбучениеСУО.ПрикрепленныеФайлыКОбъектуОбучения(ПрохождениеОбучения);
	КонецЕсли;

	Если ПрикрепленныеФайлы.Количество() > 0 Тогда
	
		// Формируем список файлов

		СписокФайловXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/3/EduFiles", "Файлы");
		СписокФайловXDTO    = ФабрикаXDTO.Создать(СписокФайловXDTOТип);

		ФайлXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/3/EduFiles", "Файл");
		
		Для каждого СтрокаПФ Из ПрикрепленныеФайлы Цикл
		
			ФайлXDTO = ФабрикаXDTO.Создать(ФайлXDTOТип);
			ФайлXDTO.Наименование  = СтрокаПФ.Наименование;
		    ФайлXDTO.Идентификатор = СтрокаПФ.Ссылка.УникальныйИдентификатор();
			ФайлXDTO.Расширение  = СтрокаПФ.Расширение;
			ФайлXDTO.Размер  = СтрокаПФ.Размер;
			
			СписокФайловXDTO.Файл.Добавить(ФайлXDTO);
			
		КонецЦикла;
		
		ПрохождениеXDTO.ФайлыПользователя = СписокФайловXDTO;
		
	КонецЕсли;
	
	// Комментарии
	
	ПрохождениеXDTO.КомментарийУчастникуОтМенеджера = ДанныеПрохождения.КомментарийДляУчастника;
	
	Если ЗначениеЗаполнено(ДанныеПрохождения.КомментарийСценарияДляУчастника)
		И ПрохождениеXDTO.КомментарийУчастникуОтМенеджера <> ДанныеПрохождения.КомментарийСценарияДляУчастника Тогда
		
		Если ЗначениеЗаполнено(ПрохождениеXDTO.КомментарийУчастникуОтМенеджера) Тогда
			ПрохождениеXDTO.КомментарийУчастникуОтМенеджера = ПрохождениеXDTO.КомментарийУчастникуОтМенеджера + Символы.ПС;
		КонецЕсли;
		
		ПрохождениеXDTO.КомментарийУчастникуОтМенеджера = ПрохождениеXDTO.КомментарийУчастникуОтМенеджера + ДанныеПрохождения.КомментарийСценарияДляУчастника;
		
	КонецЕсли;
	
	ПрохождениеXDTO.КомментарийУчастникуОтПреподавателя = ДанныеПрохождения.КомментарийПреподавателя;	
	
	КонтекстныйКомментарийИмяРеквизита = "";
	
	Если ДанныеПрохождения.СтатусПроведенияОбучения = Перечисления.СтатусыПроведенияОбъектовСУО.Запланировано Тогда
		КонтекстныйКомментарийИмяРеквизита = "КомментарийЗапланированногоМероприятияДляУчастника";	
	КонецЕсли;
	
	Если ДанныеПрохождения.СтатусПроведенияОбучения = Перечисления.СтатусыПроведенияОбъектовСУО.Активно Тогда
		КонтекстныйКомментарийИмяРеквизита = "КомментарийАктивногоМероприятияДляУчастника";	
	КонецЕсли;
	
	Если ДанныеПрохождения.СтатусПроведенияОбучения = Перечисления.СтатусыПроведенияОбъектовСУО.Завершено Тогда
		КонтекстныйКомментарийИмяРеквизита = "КомментарийЗавершенногоМероприятияДляУчастника";	
	КонецЕсли;
	
	Если ДанныеПрохождения.СтатусПроведенияОбучения = Перечисления.СтатусыПроведенияОбъектовСУО.Отменено Тогда
		КонтекстныйКомментарийИмяРеквизита = "КомментарийОтмененногоМероприятияДляУчастника";	
	КонецЕсли;
	
	КонтекстныйКомментарийФорматированныйДокумент = ДанныеПрохождения[КонтекстныйКомментарийИмяРеквизита].Получить();
	
	Если ЗначениеЗаполнено(ИдентификаторФормы) Тогда
		
		КонтекстныйКомментарийHTML = СокрЛП(ОбщегоНазначенияСУ.ПредставлениеФорматированныйДокументДляПоляHTML(КонтекстныйКомментарийФорматированныйДокумент, ИдентификаторФормы));
		
	Иначе
		
		КонтекстныйКомментарийСтруктура = ОбщегоНазначенияСУ.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(КонтекстныйКомментарийФорматированныйДокумент, Строка(ДанныеПрохождения.ПроведениеОбучения.УникальныйИдентификатор()), КонтекстныйКомментарийИмяРеквизита, Истина);
		
		КонтекстныйКомментарийHTML = СокрЛП(КонтекстныйКомментарийСтруктура.ПредставлениеHTML);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КонтекстныйКомментарийHTML) Тогда
		ПрохождениеXDTO.КомментарийУчастникуОтМенеджераКонтекстный = КонтекстныйКомментарийHTML;
	КонецЕсли;	
	
	// Место проведения
	
	Если ЗначениеЗаполнено(ДанныеПрохождения.Аудитория) Тогда
		ПрохождениеXDTO.Аудитория  = ДанныеПрохождения.НаименованиеАудитории;
		ПрохождениеXDTO.Территория = ДанныеПрохождения.НаименованиеТерритории;
	КонецЕсли;
	
	// Результаты обучения
	
	ПрохождениеXDTO.Баллы = 0;
	
	Если ДанныеПрохождения.ВыставляетсяОценка
		И ДанныеПрохождения.ВыставленаОценка Тогда
		
		ПрохождениеXDTO.Баллы = ДанныеПрохождения.Баллы;
		
		ВыставленнаяОценка = УправлениеОбучениемСУОПовтИсп.ОценкаИзБаллов(ДанныеПрохождения.Баллы, ШкалаОценки);
		
		ОценкаXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/3/EduMarks", "Оценка");
		
		ОценкаXDTO = ФабрикаXDTO.Создать(ОценкаXDTOТип);
		ОценкаXDTO.Наименование  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыставленнаяОценка, "Наименование");
		ОценкаXDTO.Идентификатор = ВыставленнаяОценка.УникальныйИдентификатор();
		
		ПрохождениеXDTO.Оценка = ОценкаXDTO;
	
	КонецЕсли;
	
	ПрохождениеXDTO.ТекущиеБаллы = 0;
	
	Если ДанныеПрохождения.ВыставляетсяОценка 
		И ВидОбучения.ПоказыватьТекущуюОценку
		И ЗначениеЗаполнено(ДанныеПрохождения.ТекущиеБаллы)
		И ПрохождениеXDTO.Баллы = 0 Тогда
		
		ПрохождениеXDTO.ТекущиеБаллы = ДанныеПрохождения.ТекущиеБаллы;
		
		ТекущаяОценка = УправлениеОбучениемСУОПовтИсп.ОценкаИзБаллов(ДанныеПрохождения.ТекущиеБаллы, ШкалаОценки);
		
		ОценкаXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/3/EduMarks", "Оценка");
		
		ТекущаяОценкаXDTO = ФабрикаXDTO.Создать(ОценкаXDTOТип);
		ТекущаяОценкаXDTO.Наименование  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяОценка, "Наименование");
		ТекущаяОценкаXDTO.Идентификатор = ТекущаяОценка.УникальныйИдентификатор();
		
		ПрохождениеXDTO.ТекущаяОценка = ТекущаяОценкаXDTO;		
							
	КонецЕсли;
		
	// Ресурсы
	
	ПрохождениеXDTO.Ресурсы = РесурсыОбученияXDTO(ДанныеПрохождения, Истина, СтатусОбучения, Зависимости); // Книги, файлы и Электронные ресурсы, добавляемые ниже
	
	// Задания	
	
	ПрохождениеXDTO.ЗаданияДоступны = ЗаданияДоступны;
	ПрохождениеXDTO.ПоследовательноеПрохождениеЗаданий = ПоследовательноеПрохождениеЗаданий(ПрохождениеОбучения, ДанныеПрохождения.ПроведениеОбучения, ДанныеПрохождения.Сценарий);
	
	ЕдинственноеЗадание = ОписаниеЕдинственногоЗаданияПрохождения(ПрохождениеОбучения, ДанныеПрохождения.ПроведениеОбучения, ДанныеПрохождения.Сценарий);
	
	Если ЕдинственноеЗадание <> Неопределено Тогда			
		
		Если ЕдинственноеЗадание.НаОсновеЭлектронногоРесурса Тогда
			
			ДанныеПрохожденияЗадания = ЭлектронныеРесурсыСУЗ.ДанныеОПрохожденииЭлектронногоРесурса(
				ЕдинственноеЗадание.ЭлектронныйРесурс,
				ЕдинственноеЗадание.Фрагмент,
				ДанныеПрохождения.Пользователь,
				ПрохождениеОбучения,
				ЕдинственноеЗадание.Задание,
				,
				ВидОбучения);
				
			ЕдинственноеЗадание.Вставить("ЗавершеноВПроцентах", ДанныеПрохожденияЗадания.ЗавершеноВПроцентах);
				
		КонецЕсли;
						
		ЕдинственноеЗаданиеОписаниеXDTO = ОписаниеЗаданияXDTO(ЕдинственноеЗадание);
		
		Если ЗаданияДоступны Тогда
			ПрохождениеXDTO.ЕдинственноеЗадание = ЕдинственноеЗаданиеОписаниеXDTO;			
		Иначе
			ПрохождениеXDTO.ОписаниеЕдинственногоЗадания = ЕдинственноеЗаданиеОписаниеXDTO;
		КонецЕсли;
		
	КонецЕсли;		
		
	ТаблицаЗаданий = ЗаданияПрохождения(ДанныеПрохождения);
	
	ЗаданияXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/UserActivity", "Задания");
	ЗаданияXDTO    = ФабрикаXDTO.Создать(ЗаданияXDTOТип);	
	
	Для каждого СтрокаТЗ Из ТаблицаЗаданий Цикл
	
		Если Зависимости <> Неопределено тогда
			
			Зависимости.Добавить(СтрокаТЗ.Задание);
			
			Если ЗначениеЗаполнено(СтрокаТЗ.ЭлектронныйРесурс) Тогда
				Зависимости.Добавить(СтрокаТЗ.ЭлектронныйРесурс);
			КонецЕсли;		
			
		КонецЕсли;		
		
		ЗаданияXDTO.Задание.Добавить(ОписаниеЗаданияXDTO(СтрокаТЗ));
		
	КонецЦикла;
	
	Если ЗаданияДоступны Тогда
		ПрохождениеXDTO.Задания = ЗаданияXDTO;
	Иначе
		ПрохождениеXDTO.ОписанияЗаданий = ЗаданияXDTO;
	КонецЕсли;
	
	// Подчиненные мероприятия
	
	ПрохождениеXDTO.ПодчиненныеМероприятияДоступны = ПодчиненныеМероприятияДоступны;	
	
	// Доп. реквизиты
	
	ДопРеквизиты = УправлениеСвойствами.ПолучитьСписокСвойств(ПрохождениеОбучения, Истина, Ложь);
	ПрохождениеXDTO.ЕстьДополнительныеРеквизиты = ?(ДопРеквизиты.Количество() > 0, Истина, Ложь); 
	
	// Сертификат
	
	Сертификат = Документы.СертификатСУО.НайтиСертификат(ПрохождениеОбучения, Истина);
	
	Если ЗначениеЗаполнено(Сертификат) Тогда
		ПрохождениеXDTO.Сертификат = Сертификат;	
	КонецЕсли;
	
	// Пользователь
	
	ПользовательXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/User","Пользователь");
	
	ПользовательXDTO = ФабрикаXDTO.Создать(ПользовательXDTOТип);
	
	ПользовательXDTO.Ссылка    = ДанныеПрохождения.Пользователь;
	ПользовательXDTO.ПолноеИмя = ДанныеПрохождения.НаименованиеПользователя;
	
	Если РегистрыСведений.ФотографииПользователейСУО.ЕстьАватар(ДанныеПрохождения.Пользователь) Тогда
		ПользовательXDTO.Аватар = Строка(ДанныеПрохождения.Пользователь.УникальныйИдентификатор()) + "/" + РегистрыСведений.ФотографииПользователейСУО.ИмяФайлаАватара();
	КонецЕсли;

	Если ПолучитьФункциональнуюОпцию("ОбразовательнаяОрганизацияОО") Тогда
	
		УчебнаяГруппаПользователей = Справочники.УчебныеГруппыОО.УчебнаяГруппаПользователя(ДанныеПрохождения.Пользователь);
		
		Если УчебнаяГруппаПользователей <> Неопределено Тогда
			
			УчебнаяГруппаООXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/User","УчебнаяГруппаОО");
			
			УчебнаяГруппаООXDTO = ФабрикаXDTO.Создать(УчебнаяГруппаООXDTOТип);
			УчебнаяГруппаООXDTO.Наименование = УчебнаяГруппаПользователей.Наименование;
			УчебнаяГруппаООXDTO.Идентификатор = УчебнаяГруппаПользователей.УчебнаяГруппа.УникальныйИдентификатор();
			
			ПользовательXDTO.УчебнаяГруппаОО = УчебнаяГруппаООXDTO;
			
		КонецЕсли;		
		
	КонецЕсли;
	
	ПрохождениеXDTO.Пользователь = ПользовательXDTO;	
	
	// Незаполненные свойства участника
	
	Если ВидОбучения.ОбязательныеСвойстваУчастников.Количество() > 0 Тогда
		
		НезаполненныеСвойстваXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/UserActivity", "НезаполненныеСвойстваУчастника");
		НезаполненныеСвойстваXDTO    = ФабрикаXDTO.Создать(НезаполненныеСвойстваXDTOТип);	
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПользователиДополнительныеРеквизиты.Свойство КАК Свойство,
			|	ПользователиДополнительныеРеквизиты.Значение КАК Значение
			|ИЗ
			|	Справочник.Пользователи.ДополнительныеРеквизиты КАК ПользователиДополнительныеРеквизиты
			|ГДЕ
			|	ПользователиДополнительныеРеквизиты.Ссылка = &Пользователь
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПользователиКонтактнаяИнформация.Вид,
			|	ПользователиКонтактнаяИнформация.Представление
			|ИЗ
			|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
			|ГДЕ
			|	ПользователиКонтактнаяИнформация.Ссылка = &Пользователь";
		
		Запрос.УстановитьПараметр("Пользователь", ДанныеПрохождения.Пользователь);
		
		ТаблицаСвойств = Запрос.Выполнить().Выгрузить();
		
		Для каждого Строка Из ВидОбучения.ОбязательныеСвойстваУчастников Цикл
			
			СтрокаТС = ТаблицаСвойств.Найти(Строка.Свойство, "Свойство");
			
			Если СтрокаТС = Неопределено ИЛИ СтрокаТС.Значение = "" Тогда
				
				НезаполненноеСвойствоXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/UserActivity", "НезаполненноеСвойствоУчастника");
				НезаполненноеСвойствоXDTO    = ФабрикаXDTO.Создать(НезаполненноеСвойствоXDTOТип);
				
				НезаполненноеСвойствоXDTO.Идентификатор = Строка.Свойство.УникальныйИдентификатор();
				НезаполненноеСвойствоXDTO.Тип = Строка(ТипЗнч(Строка.Свойство));
				
				НезаполненныеСвойстваXDTO.Свойство.Добавить(НезаполненноеСвойствоXDTO);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ПрохождениеXDTO.НезаполненныеСвойстваУчастника = НезаполненныеСвойстваXDTO;			
		
	КонецЕсли;
	
	// Получаем XML
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ПрохождениеXDTO);
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

Функция УчастникОбученияJSON(ПрохождениеОбучения) Экспорт
	
	ТребуемыеДанные = Новый Структура("Пользователь, НаименованиеПользователя", "Пользователь", "Пользователь.Наименование");
	
	ДанныеПрохождения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеОбучения, ТребуемыеДанные);
	
	Возврат ОбщегоНазначенияСУ.ДанныеВJSON(ВебКабинетСУО.ПользовательСтруктура(ДанныеПрохождения.Пользователь, ДанныеПрохождения.НаименованиеПользователя));
	
КонецФункции

Функция ОписаниеЗаданияXDTO(СвойстваЗадания) Экспорт
	
	ЗаданиеXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/UserActivity", "Задание");
	ЗаданиеXDTO    = ФабрикаXDTO.Создать(ЗаданиеXDTOТип);
	ОценкаXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/3/EduMarks", "Оценка");
	
	// Примечание: используется функция ЕстьСвойствоВКоллекции, так как переменная
	// СвойстваЗадания может быть, как структурой, так и строкой таблицы.
	
	Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "ЭлектронныйРесурс", Истина)
		И ЗначениеЗаполнено(СвойстваЗадания.ЭлектронныйРесурс) Тогда
		ЗаданиеXDTO.ЭлектронныйРесурс = СвойстваЗадания.ЭлектронныйРесурс.УникальныйИдентификатор();
	КонецЕсли;
	
	Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "НаОсновеЭлектронногоРесурса", Истина) Тогда
		ЗаданиеXDTO.НаОсновеЭлектронногоРесурса = СвойстваЗадания.НаОсновеЭлектронногоРесурса;
	КонецЕсли;
	
	Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "Задание", Истина) 
		И ЗначениеЗаполнено(СвойстваЗадания.Задание) Тогда
		ЗаданиеXDTO.Задание = СвойстваЗадания.Задание.УникальныйИдентификатор();
	КонецЕсли;
	
	Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "Фрагмент", Истина) 
		И ЗначениеЗаполнено(СвойстваЗадания.Фрагмент) Тогда
		ЗаданиеXDTO.Фрагмент = СвойстваЗадания.Фрагмент.УникальныйИдентификатор();
	КонецЕсли;
	
		
	Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "НаОсновеЭлектронногоКурса", Истина) Тогда
		ЗаданиеXDTO.НаОсновеЭлектронногоКурса = СвойстваЗадания.НаОсновеЭлектронногоКурса;
	КонецЕсли;
	
	Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "ЗатраченоВремениВСекундах", Истина) Тогда
		ЗаданиеXDTO.ЗатраченоВремениВСекундах = СвойстваЗадания.ЗатраченоВремениВСекундах;
	КонецЕсли;
	
	Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "ЭлектронныйКурс", Истина) 
		И ЗначениеЗаполнено(СвойстваЗадания.ЭлектронныйКурс) Тогда
		ЗаданиеXDTO.ЭлектронныйКурс = СвойстваЗадания.ЭлектронныйКурс.УникальныйИдентификатор();
	КонецЕсли;	
	
	Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "ДатаНачалаДоступаКЗаданию", Истина) Тогда
		ЗаданиеXDTO.ДатаНачалаДоступаКЗаданию = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(СвойстваЗадания.ДатаНачалаДоступаКЗаданию);
	Иначе
		ЗаданиеXDTO.ДатаНачалаДоступаКЗаданию = 0;
	КонецЕсли;
	
	Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "ДатаОкончанияДоступаКЗаданию", Истина) Тогда
		ЗаданиеXDTO.ДатаОкончанияДоступаКЗаданию = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(СвойстваЗадания.ДатаОкончанияДоступаКЗаданию);
	Иначе
		ЗаданиеXDTO.ДатаОкончанияДоступаКЗаданию = 0;
	КонецЕсли;
	
	Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "СкрытьВремяДоступаКЗаданию", Истина) Тогда
		ЗаданиеXDTO.СкрытьВремяДоступаКЗаданию = СвойстваЗадания.СкрытьВремяДоступаКЗаданию;
	Иначе
		ЗаданиеXDTO.СкрытьВремяДоступаКЗаданию = Ложь;
	КонецЕсли;
	
	//
	
	Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "Завершено", Истина) Тогда
		ЗаданиеXDTO.Завершено = СвойстваЗадания.Завершено;
	Иначе
		ЗаданиеXDTO.Завершено = Ложь;
	КонецЕсли;
	
	Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "ПопыткаВыполнения", Ложь)
		И ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "Завершено", Истина)
		И ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "ПроверяетсяПреподавателем", Истина)
		И ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "ПроверенПреподавателем", Истина)
		И ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "Баллы", Истина)
		И ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "ПроходнойБалл", Истина)
		И ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "ДатаОкончанияДоступаКЗаданию", Истина) Тогда
		
		ЗаданиеXDTO.Выполнено = Документы.ПопыткаВыполненияЗаданияСУО.Выполнено(
			СвойстваЗадания.ПопыткаВыполнения,
			СвойстваЗадания.Завершено,
			СвойстваЗадания.ПроверяетсяПреподавателем,
			СвойстваЗадания.ПроверенПреподавателем,
			СвойстваЗадания.Баллы,
			СвойстваЗадания.ПроходнойБалл,
			СвойстваЗадания.ДатаОкончанияДоступаКЗаданию);	
			
	КонецЕсли;
		
	Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "ПопыткаВыполнения", Ложь)
		И ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "Завершено", Истина)
		И ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "ПроверяетсяПреподавателем", Истина)
		И ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "ПроверенПреподавателем", Истина)
		И ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "ДатаОкончанияДоступаКЗаданию", Истина)
		И ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "ВыставляетсяОценка", Истина) Тогда
		
		ЗаданиеXDTO.ПолученаОценка = Документы.ПопыткаВыполненияЗаданияСУО.ПолученаОценка(
			СвойстваЗадания.ПопыткаВыполнения,
			СвойстваЗадания.Завершено,
			СвойстваЗадания.ПроверяетсяПреподавателем,
			СвойстваЗадания.ПроверенПреподавателем,
			СвойстваЗадания.ДатаОкончанияДоступаКЗаданию,
			СвойстваЗадания.ВыставляетсяОценка);
			
		Если ЗаданиеXDTO.ПолученаОценка Тогда
			
			ТекущаяОценка = Неопределено;
			
			Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "Оценка", Истина) Тогда
				ТекущаяОценка = СвойстваЗадания.Оценка;
			КонецЕсли;
			
			Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "Баллы", Истина)
				И ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "ШкалаОценки", Истина) Тогда
				
				ЗаданиеXDTO.Баллы = СвойстваЗадания.Баллы;
				ТекущаяОценка = УправлениеОбучениемСУОПовтИсп.ОценкаИзБаллов(СвойстваЗадания.Баллы, СвойстваЗадания.ШкалаОценки);
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекущаяОценка) Тогда
				ОценкаXDTO = ФабрикаXDTO.Создать(ОценкаXDTOТип);
				ОценкаXDTO.Наименование  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяОценка, "Наименование");
				ОценкаXDTO.Идентификатор = ТекущаяОценка.УникальныйИдентификатор();
				ЗаданиеXDTO.Оценка = ОценкаXDTO;		
			КонецЕсли;
				
		КонецЕсли;			
			
		
			
	КонецЕсли;	
	
	Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "ЗавершеноВПроцентах", Истина) Тогда
		ЗаданиеXDTO.ЗавершеноВПроцентах = СвойстваЗадания.ЗавершеноВПроцентах;
	КонецЕсли;		
		
	//
	
	Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "Значимость", Истина) Тогда
		ЗаданиеXDTO.Значимость = СвойстваЗадания.Значимость;
	КонецЕсли;
	
	Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "НеЖдатьПроверки", Истина) Тогда
		ЗаданиеXDTO.НеЖдатьПроверки = СвойстваЗадания.НеЖдатьПроверки;
	КонецЕсли;
	
	Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "ПроходнойБалл", Истина)
		И ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "ШкалаОценки", Истина) Тогда
		ЗаданиеXDTO.ПроходнойБалл = СвойстваЗадания.ПроходнойБалл;
		ПроходнаяОценка = УправлениеОбучениемСУОПовтИсп.ОценкаИзБаллов(ЗаданиеXDTO.ПроходнойБалл, СвойстваЗадания.ШкалаОценки);
		Если ЗначениеЗаполнено(ПроходнаяОценка) Тогда		
			ПроходнаяОценкаXDTO = ФабрикаXDTO.Создать(ОценкаXDTOТип);
			ПроходнаяОценкаXDTO.Наименование  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроходнаяОценка, "Наименование");
			ПроходнаяОценкаXDTO.Идентификатор = ПроходнаяОценка.УникальныйИдентификатор();			
			ЗаданиеXDTO.ПроходнаяОценка = ПроходнаяОценкаXDTO;					
		КонецЕсли;
	КонецЕсли;	
	
	Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "Наименование", Истина) Тогда
		ЗаданиеXDTO.Наименование = СвойстваЗадания.Наименование;
	КонецЕсли;	
	
	Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "Описание", Истина) Тогда
		ЗаданиеXDTO.Описание = СвойстваЗадания.Описание;
	КонецЕсли;	
	
	Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "ПопыткаВыполнения", Истина) 
		И ЗначениеЗаполнено(СвойстваЗадания.ПопыткаВыполнения) Тогда
		ЗаданиеXDTO.ПопыткаВыполнения = СвойстваЗадания.ПопыткаВыполнения.УникальныйИдентификатор();
	КонецЕсли;
	
	Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "ПроверяетсяПреподавателем", Истина) Тогда
		ЗаданиеXDTO.ПроверяетсяПреподавателем = СвойстваЗадания.ПроверяетсяПреподавателем;
	КонецЕсли;	
	
	Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "ПроверенПреподавателем", Истина) Тогда
		ЗаданиеXDTO.ПроверенПреподавателем = СвойстваЗадания.ПроверенПреподавателем;
	КонецЕсли;	
	
	Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "КомментарийПреподавателя", Истина) Тогда
		ЗаданиеXDTO.КомментарийПреподавателя = СвойстваЗадания.КомментарийПреподавателя;
	КонецЕсли;			
	
	Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "ВозвращеноНаДоработку", Истина) Тогда
		ЗаданиеXDTO.ВозвращеноНаДоработку = СвойстваЗадания.ВозвращеноНаДоработку;
	КонецЕсли;		
	
	Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "ДатаОтправкиНаПроверку", Истина) Тогда
		ЗаданиеXDTO.ДатаОтправкиНаПроверку = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(СвойстваЗадания.ДатаОтправкиНаПроверку);
	КонецЕсли;
	
	Если ОбщегоНазначенияСУ.ЕстьСвойствоВКоллекции(СвойстваЗадания, "ДатаВозвратаНаДоработку", Истина) Тогда
		ЗаданиеXDTO.ДатаВозвратаНаДоработку = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(СвойстваЗадания.ДатаВозвратаНаДоработку);
	КонецЕсли;		
	
	Возврат ЗаданиеXDTO;
	
КонецФункции

Функция РесурсыОбученияXDTO(Данные, ЭтоУченик, СтатусПроцессаОбучения = Неопределено, Зависимости = Неопределено) Экспорт
	
	РесурсыXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/UserActivity", "Ресурсы");
	РесурсыXDTO    = ФабрикаXDTO.Создать(РесурсыXDTOТип);
	
	// Книги
	
	КнигиXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/Book", "Книги");
	КнигиXDTO    = ФабрикаXDTO.Создать(КнигиXDTOТип);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛитератураСУО.Ссылка,
		|	ЛитератураСУО.Наименование,
		|	ЛитератураСУО.АвторыКниги.(
		|		Ссылка,
		|		НомерСтроки,
		|		ФИО
		|	),
		|	ПроведениеОбученияСУОКниги.ПоказатьПослеПрохождения КАК ПоказатьПослеПрохождения,
		|	ПроведениеОбученияСУОКниги.СкрыватьОтУченика,
		|	ПроведениеОбученияСУОКниги.ПоказатьПриСтатусеЗапланировано КАК ПоказатьПриСтатусеЗапланировано,
		|	ПроведениеОбученияСУОКниги.ПоказатьПриСтатусеАктивно КАК ПоказатьПриСтатусеАктивно,
		|	ПроведениеОбученияСУОКниги.ПоказатьПриСтатусеЗавершено КАК ПоказатьПриСтатусеЗавершено
		|ИЗ
		|	Документ.ПроведениеОбученияСУО.Книги КАК ПроведениеОбученияСУОКниги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЛитератураСУО КАК ЛитератураСУО
		|		ПО ПроведениеОбученияСУОКниги.Книга = ЛитератураСУО.Ссылка
		|ГДЕ
		|	ПроведениеОбученияСУОКниги.Ссылка = &ПроведениеОбучения
		|";

	Запрос.УстановитьПараметр("ПроведениеОбучения", Данные.ПроведениеОбучения);
	
	Если ТипЗнч(Данные.Сценарий) = Тип("СправочникСсылка.КаталогМероприятийСУО")
		И ЗначениеЗаполнено(Данные.Сценарий) Тогда
		
		Запрос.Текст = Запрос.Текст + " 
		| ОБЪЕДИНИТЬ ВСЕ
		| ";
		
		Запрос.Текст = Запрос.Текст +
			"ВЫБРАТЬ
			|	ЛитератураСУО.Ссылка,
			|	ЛитератураСУО.Наименование,
			|	ЛитератураСУО.АвторыКниги.(
			|		Ссылка,
			|		НомерСтроки,
			|		ФИО
			|	),
			|	КаталогМероприятийСУОКниги.ПоказатьПослеПрохождения КАК ПоказатьПослеПрохождения,
			|	КаталогМероприятийСУОКниги.СкрыватьОтУченика,
			|	КаталогМероприятийСУОКниги.ПоказатьПриСтатусеЗапланировано КАК ПоказатьПриСтатусеЗапланировано,
			|	КаталогМероприятийСУОКниги.ПоказатьПриСтатусеАктивно КАК ПоказатьПриСтатусеАктивно,
			|	КаталогМероприятийСУОКниги.ПоказатьПриСтатусеЗавершено КАК ПоказатьПриСтатусеЗавершено
			|ИЗ
			|	Справочник.КаталогМероприятийСУО.Книги КАК КаталогМероприятийСУОКниги
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЛитератураСУО КАК ЛитератураСУО
			|		ПО КаталогМероприятийСУОКниги.Книга = ЛитератураСУО.Ссылка
			|ГДЕ
			|	КаталогМероприятийСУОКниги.Ссылка = &Мероприятие
			|";
		
		Запрос.УстановитьПараметр("Мероприятие", Данные.Сценарий);
		
	КонецЕсли;
	
	
	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		СписокРазмещенныхКниг = Новый Массив;
		
		КнигаXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/Book", "Книга");
		АвторXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/Book", "Автор");
		АвторыXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/Book", "Авторы");
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если СписокРазмещенныхКниг.Найти(ВыборкаДетальныеЗаписи.Ссылка) <> Неопределено Тогда
				Продолжить; // Уже размещали эту книгу ранее
			КонецЕсли;			
			
			Если Зависимости <> Неопределено тогда
				Зависимости.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
			КонецЕсли;
			
			Если ЭтоУченик Тогда
			
				Если ВыборкаДетальныеЗаписи.СкрыватьОтУченика Тогда
					Продолжить;
				КонецЕсли;			
				
				Если ВыборкаДетальныеЗаписи.ПоказатьПослеПрохождения
					И СтатусПроцессаОбучения <> Перечисления.СтатусыПроцессаОбученияСУО.Окончено
					И СтатусПроцессаОбучения <> Перечисления.СтатусыПроцессаОбученияСУО.ОконченоАвтоматом Тогда					
					Продолжить; // Не показываем, так как обучение еще не окончено					
				КонецЕсли;				
				
			КонецЕсли;
				
			Если НЕ Документы.ПроведениеОбученияСУО.МожноПоказатьРесурсПроведения(
					Данные.СтатусПроведенияОбучения,
					ВыборкаДетальныеЗаписи.ПоказатьПриСтатусеЗапланировано,
		            ВыборкаДетальныеЗаписи.ПоказатьПриСтатусеАктивно,
				    ВыборкаДетальныеЗаписи.ПоказатьПриСтатусеЗавершено) Тогда
				
				Продолжить; // Для этого статуса книгу не показываем
				
			КонецЕсли;
			
			КнигаXDTO = ФабрикаXDTO.Создать(КнигаXDTOТип);
			КнигаXDTO.Идентификатор = ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор();
			КнигаXDTO.Наименование = ВыборкаДетальныеЗаписи.Наименование;
			
			// Добавляем авторов книги
			
			АвторыXDTO = ФабрикаXDTO.Создать(АвторыXDTOТип);
			
			ВыборкаАвторов = ВыборкаДетальныеЗаписи.АвторыКниги.Выбрать(); 
			
			Пока ВыборкаАвторов.Следующий() Цикл
				АвторXDTO = ФабрикаXDTO.Создать(АвторXDTOТип);
				АвторXDTO.ФИО = ВыборкаАвторов.ФИО;
				АвторXDTO.Номер = ВыборкаАвторов.НомерСтроки;
				
				АвторыXDTO.Автор.Добавить(АвторXDTO);
				
			КонецЦикла;		
			
			КнигаXDTO.Авторы = АвторыXDTO;
			
			КнигиXDTO.Книга.Добавить(КнигаXDTO);
			
		КонецЦикла;
		
		РесурсыXDTO.Книги = КнигиXDTO;
		
	КонецЕсли;
	
	// Электронные ресурсы

	ЭлектронныеРесурсыXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/ElectronicResource", "ЭлектронныеРесурсы");
	ЭлектронныеРесурсыXDTO    = ФабрикаXDTO.Создать(ЭлектронныеРесурсыXDTOТип);	
		
	ВыборкаДетальныеЗаписи = Документы.ПроведениеОбученияСУО.ПрикрепленныеЭлектронныеРесурсы(Данные.ПроведениеОбучения, Данные.Сценарий);
	
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда

		ЭлектронныйРесурсXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/ElectronicResource", "ЭлектронныйРесурс");
		ФрагментXDTOТип          = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/ElectronicResource", "Фрагмент");
		
		СписокРазмещенныхЭР = Новый Массив;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если СписокРазмещенныхЭР.Найти(ВыборкаДетальныеЗаписи.ЭлектронныйРесурс) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;			
			
			Если Зависимости <> Неопределено тогда
				Зависимости.Добавить(ВыборкаДетальныеЗаписи.ЭлектронныйРесурс);
			КонецЕсли;
			
			
			Если ЭтоУченик Тогда
				
				Если ВыборкаДетальныеЗаписи.СкрыватьОтУченика Тогда
					Продолжить;
				КонецЕсли;			
				
				Если ВыборкаДетальныеЗаписи.ПоказатьПослеПрохождения
					И СтатусПроцессаОбучения <> Перечисления.СтатусыПроцессаОбученияСУО.Окончено
					И СтатусПроцессаОбучения <> Перечисления.СтатусыПроцессаОбученияСУО.ОконченоАвтоматом Тогда					
					Продолжить;					
				КонецЕсли;				
				
			КонецЕсли;
				
			Если НЕ Документы.ПроведениеОбученияСУО.МожноПоказатьРесурсПроведения(
					Данные.СтатусПроведенияОбучения,
					ВыборкаДетальныеЗаписи.ПоказатьПриСтатусеЗапланировано,
		            ВыборкаДетальныеЗаписи.ПоказатьПриСтатусеАктивно,
				    ВыборкаДетальныеЗаписи.ПоказатьПриСтатусеЗавершено) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ЭлектронныйРесурсXDTO = ФабрикаXDTO.Создать(ЭлектронныйРесурсXDTOТип);
			ЭлектронныйРесурсXDTO.Наименование  = ВыборкаДетальныеЗаписи.НаименованиеЭлектронногоРесурса; 
			ЭлектронныйРесурсXDTO.Идентификатор = ВыборкаДетальныеЗаписи.ЭлектронныйРесурс.УникальныйИдентификатор();
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Фрагмент) Тогда
				
				ФрагментXDTO = ФабрикаXDTO.Создать(ФрагментXDTOТип);
				ФрагментXDTO.Наименование  = ВыборкаДетальныеЗаписи.НаименованиеФрагмента; 
				ФрагментXDTO.Идентификатор = ВыборкаДетальныеЗаписи.Фрагмент.УникальныйИдентификатор();
				
				ЭлектронныйРесурсXDTO.Фрагмент = ФрагментXDTO;
				
			КонецЕсли;
			
			ЭлектронныеРесурсыXDTO.ЭлектронныйРесурс.Добавить(ЭлектронныйРесурсXDTO);
	
			СписокРазмещенныхЭР.Добавить(ВыборкаДетальныеЗаписи.ЭлектронныйРесурс);
	
		КонецЦикла;

		РесурсыXDTO.ЭлектронныеРесурсы = ЭлектронныеРесурсыXDTO;	
	
	КонецЕсли;
	
	// Файлы
	

	ФайлыXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/3/EduFiles", "Файлы");
	ФайлыXDTO    = ФабрикаXDTO.Создать(ФайлыXDTOТип);	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроведениеОбученияСУОФайлы.Файл,
		|	ПроведениеОбученияСУОФайлы.ПоказатьПослеПрохождения,
		|	ПроведениеОбученияСУОФайлы.Файл.Наименование КАК Представление,
		|	ПроведениеОбученияСУОФайлы.СкрыватьОтУченика,
		|	ПроведениеОбученияСУОФайлы.ПоказатьПриСтатусеЗапланировано,
		|	ПроведениеОбученияСУОФайлы.ПоказатьПриСтатусеАктивно,
		|	ПроведениеОбученияСУОФайлы.ПоказатьПриСтатусеЗавершено,
		|	ПроведениеОбученияСУОФайлы.Файл.Расширение КАК Расширение,
		|	ПроведениеОбученияСУОФайлы.Файл.Размер КАК Размер
		|ИЗ
		|	Документ.ПроведениеОбученияСУО.Файлы КАК ПроведениеОбученияСУОФайлы
		|ГДЕ
		|	ПроведениеОбученияСУОФайлы.Ссылка = &ПроведениеОбучения";
		
	Запрос.УстановитьПараметр("ПроведениеОбучения", Данные.ПроведениеОбучения);
		
	Если ТипЗнч(Данные.Сценарий) = Тип("СправочникСсылка.КаталогМероприятийСУО")
		И ЗначениеЗаполнено(Данные.Сценарий) Тогда		
		
		Запрос.Текст = Запрос.Текст + " 
		| ОБЪЕДИНИТЬ ВСЕ 
		|";
		
		Запрос.Текст = Запрос.Текст + 
			"ВЫБРАТЬ
			|	КаталогМероприятийСУОФайлы.Файл,
			|	КаталогМероприятийСУОФайлы.ПоказатьПослеПрохождения,
			|	КаталогМероприятийСУОФайлы.Файл.Наименование,
			|	КаталогМероприятийСУОФайлы.СкрыватьОтУченика,
			|	КаталогМероприятийСУОФайлы.ПоказатьПриСтатусеЗапланировано,
			|	КаталогМероприятийСУОФайлы.ПоказатьПриСтатусеАктивно,
			|	КаталогМероприятийСУОФайлы.ПоказатьПриСтатусеЗавершено,
			|	КаталогМероприятийСУОФайлы.Файл.Расширение,
			|	КаталогМероприятийСУОФайлы.Файл.Размер
			|ИЗ
			|	Справочник.КаталогМероприятийСУО.Файлы КАК КаталогМероприятийСУОФайлы
			|ГДЕ
			|	КаталогМероприятийСУОФайлы.Ссылка = &Мероприятие";

	
		Запрос.УстановитьПараметр("Мероприятие", Данные.Сценарий);
	
	КонецЕсли;
			
	Результат = Запрос.Выполнить();
		
	Если НЕ Результат.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		СписокРазмещенныхФайлов = Новый Массив;
		
		ФайлXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/3/EduFiles", "Файл");
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Файл) Тогда
				Продолжить;
			КонецЕсли;			
			
			Если Зависимости <> Неопределено тогда
				Зависимости.Добавить(ВыборкаДетальныеЗаписи.Файл);
			КонецЕсли;			
			
			Если СписокРазмещенныхФайлов.Найти(ВыборкаДетальныеЗаписи.Файл) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;			
			
			Если ЭтоУченик Тогда
			
				Если ВыборкаДетальныеЗаписи.СкрыватьОтУченика Тогда
					Продолжить;
				КонецЕсли;			
				
				Если ВыборкаДетальныеЗаписи.ПоказатьПослеПрохождения
					И СтатусПроцессаОбучения <> Перечисления.СтатусыПроцессаОбученияСУО.Окончено
					И СтатусПроцессаОбучения <> Перечисления.СтатусыПроцессаОбученияСУО.ОконченоАвтоматом Тогда					
					Продолжить;					
				КонецЕсли;				
				
			КонецЕсли;
				
			Если НЕ Документы.ПроведениеОбученияСУО.МожноПоказатьРесурсПроведения(
					Данные.СтатусПроведенияОбучения,
					ВыборкаДетальныеЗаписи.ПоказатьПриСтатусеЗапланировано,
		            ВыборкаДетальныеЗаписи.ПоказатьПриСтатусеАктивно,
				    ВыборкаДетальныеЗаписи.ПоказатьПриСтатусеЗавершено) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ФайлXDTO = ФабрикаXDTO.Создать(ФайлXDTOТип);
			ФайлXDTO.Наименование  = ВыборкаДетальныеЗаписи.Представление; 
			ФайлXDTO.Идентификатор = ВыборкаДетальныеЗаписи.Файл.УникальныйИдентификатор();
			ФайлXDTO.Расширение  = ВыборкаДетальныеЗаписи.Расширение;
			ФайлXDTO.Размер  = ВыборкаДетальныеЗаписи.Размер;			
			
			ФайлыXDTO.Файл.Добавить(ФайлXDTO);
			
			СписокРазмещенныхФайлов.Добавить(ВыборкаДетальныеЗаписи.Файл);
	
		КонецЦикла;

		РесурсыXDTO.Файлы = ФайлыXDTO;
		
	КонецЕсли;
	
	Возврат РесурсыXDTO;
	
КонецФункции

Функция ФайлУчащегосяJSON(Знач ДанныеПрохожденияОбучения, Знач Файл)
	
	ОписаниеФайла = Новый Структура;
	ОписаниеФайла.Вставить("Пользователь", Неопределено);
	ОписаниеФайла.Вставить("Файл", Новый Структура("Наименование, Идентификатор, ДатаЧисло, Автор, Расширение, Размер"));
	ОписаниеФайла.Вставить("ПрохождениеОбучения", Неопределено);
	
	ДанныеФайлаИменаРеквизитов = Новый Структура;
	ДанныеФайлаИменаРеквизитов.Вставить("Наименование", "Наименование");
	ДанныеФайлаИменаРеквизитов.Вставить("ДатаСоздания", "ДатаСоздания");
	ДанныеФайлаИменаРеквизитов.Вставить("Автор", "Автор");
	ДанныеФайлаИменаРеквизитов.Вставить("НаименованиеАвтора", "Автор.Наименование");
	ДанныеФайлаИменаРеквизитов.Вставить("Расширение", "Расширение");
	ДанныеФайлаИменаРеквизитов.Вставить("Размер", "Размер");

	ДанныеФайла = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Файл, ДанныеФайлаИменаРеквизитов);
		
	ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Файл, "Наименование, ДатаСоздания, Автор");
	
	ОписаниеФайла.ПрохождениеОбучения = ДанныеПрохожденияОбучения.Ссылка.УникальныйИдентификатор();
	ОписаниеФайла.Пользователь = ВебКабинетСУО.ПользовательСтруктура(ДанныеПрохожденияОбучения.Пользователь, ДанныеПрохожденияОбучения.НаименованиеПользователя);
	ОписаниеФайла.Файл.Наименование = ДанныеФайла.Наименование;
	ОписаниеФайла.Файл.Идентификатор = Файл.УникальныйИдентификатор();
	ОписаниеФайла.Файл.ДатаЧисло = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ДанныеФайла.ДатаСоздания);
	ОписаниеФайла.Файл.Автор = ВебКабинетСУО.ПользовательСтруктура(ДанныеФайла.Автор, ДанныеФайла.НаименованиеАвтора);	
	ОписаниеФайла.Файл.Расширение = ДанныеФайла.Расширение;
	ОписаниеФайла.Файл.Размер = ДанныеФайла.Размер;
	
	Возврат ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеФайла);
	
КонецФункции

// 1С-КАБИНЕТ

Функция УчебнаяАктивностьОписаниеHTML(ПрохождениеОбучения, ИдентификаторФормы = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеПрохождения = Неопределено;
	
	XMLДанные = УчебнаяАктивностьОписаниеXML(ПрохождениеОбучения, ИдентификаторФормы, ДанныеПрохождения);
	
	// Получаем представление HTML.
	
	Преобразование = Новый ПреобразованиеXSL;
	ШаблонXSL = ПолучитьОбщийМакет("ШаблонОписанияУчебнойАктивностиСУО").ПолучитьТекст();	
	
	Преобразование.ЗагрузитьИзСтроки(ШаблонXSL);
	Преобразование.ДобавитьПараметр("ПросматриваетВладелец", ОбщегоНазначенияСУКлиентСервер.БулевоВЧисло(Пользователи.ТекущийПользователь() = ДанныеПрохождения.Пользователь));
	
	ИтоговыйHTML = Преобразование.ПреобразоватьИзСтроки(XMLДанные);
	
	Возврат ИтоговыйHTML;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Ссылка");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = Представление(Данные.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
