
#Область ПрограммныйИнтерфейс

// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ВозможноПовторитьОтветНаВопрос(ДокументСессии, ДокументОтветаНаВопрос) Экспорт
	
	// Если вопрос не отвечен, то повторить ответ нельзя.
	Если НЕ ДокументОтветаНаВопрос.ВопросОтвечен Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Если нет сессии теста, то можно всегда повторить ответ.
	Если НЕ ЗначениеЗаполнено(ДокументСессии) Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Если тест закончен, то нельзя повторить
	Если ДокументСессии.ТестЗавершен Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Упражнения можно выполнять много раз.
	Если ДокументСессии.НазначениеТестирования =
		Перечисления.НазначенияТестированийСУЗ.Упражнение Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти
