
////////////////////////////////////////////////////////////////////////////////
// ОБЩЕЕ

Процедура УстановкаПараметровСеанса(ИмяПараметра, УстановленныеПараметры) Экспорт

	УстановитьПривилегированныйРежим(Истина);
		
	ПутьКОбщемуКаталогу = ОбъектыСУЗПовтИсп.ПутьКОбщемуКаталогу();
	
	Если ЗначениеЗаполнено(ПутьКОбщемуКаталогу) Тогда
		ПараметрыСеанса.ПутьКРабочемуКаталогуСУ = ПутьКОбщемуКаталогу;
	Иначе
		ПараметрыСеанса.ПутьКРабочемуКаталогуСУ = "";
	КонецЕсли;
		
	УстановленныеПараметры.Добавить("ПутьКРабочемуКаталогуСУ");
			
	АдресОбщегоКаталога = Константы.АдресОбщегоКаталогаСУ.Получить();
	
	Если ЗначениеЗаполнено(АдресОбщегоКаталога) Тогда
		ПараметрыСеанса.АдресРабочегоКаталогаСУ = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(АдресОбщегоКаталога);
	Иначе
		ПараметрыСеанса.АдресРабочегоКаталогаСУ = "";	
	КонецЕсли;
	
	УстановленныеПараметры.Добавить("АдресРабочегоКаталогаСУ");
		
КонецПроцедуры

// ПРЕДСТАВЛЕНИЕ

// Служит для получения данных для представления объекта.
// Функция может использоваться рекурсивно, вызываясь при создании
// структур данных вложенных объектов.
//
// Параметры:
//  ПараметрыСсылки     - Структура, содержит параметры необходимые для отображения объекта.
//  КонтекстВыполнения  - Структура с дополнительными параметрами.
//
// Возвращаемое значение:
//  Структура. Ключи структуры: "Представление", "Скрипт", "Стили" и др. 
//  Полный список элементов структуры представлен в функции "ПолучитьПредставлениеПустогоОбъекта".
//
Функция ПолучитьПредставление(Ссылка, ПараметрыСсылки, КонтекстВыполнения) Экспорт
	
	//////////////////////////////////////////////////////////////////////////////////
	// Получаем основные переменные
	                 
	Префикс                   = "СУЗ";
	ИмяОбъекта                = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "object");
	ВложенныйОбъект           = ?(КонтекстВыполнения.СписокШаблонов = Неопределено, Ложь, Истина);
	СтруктураДанных           = ОбъектыСУЗ.ПолучитьПредставлениеПустогоОбъекта();
	ТипОбъектаСУЗ             = ПолучитьТипОбъектаСУЗ(Ссылка);
	
	Если ЗначениеЗаполнено(КонтекстВыполнения.ЭлектронныйРесурс) Тогда
		ДанныеЭлектронногоРесурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КонтекстВыполнения.ЭлектронныйРесурс, "Глоссарий, ПоказыватьПервуюСсылкуНаТермин, ПоказыватьТерминВсплывающейПодсказкой");
	Иначе
		ДанныеЭлектронногоРесурса = Неопределено;
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////////////////////
	// Получаем представление объекта
	
	Если НЕ ВложенныйОбъект Тогда
		
		// Массив содержит ссылки на элементы справочника ШаблоныСУЗ,
		// Которые используются при формировании XML объекта.
		// Добавляются все шаблоны вложенных объектов и самого объекта.		
		КонтекстВыполнения.Вставить("СписокШаблонов", Новый Массив);
		
		// Массив содержит список всех ресурсов, которые необходимо
		// Выгрузить в кэш для отображения объекта. Используется
		// Для формирования кэша на клиенте или сервере.
		КонтекстВыполнения.Вставить("СписокРесурсов", Новый Массив);
		
		// Массив элементов справочника СсылкиОбъектовСУЗ, объекты
		// Которых нужно выгрузить при экспорте в автономный пакет.
		КонтекстВыполнения.Вставить("СписокСсылок", Новый Массив);
		
		// Массив подсказок из справочника РесурсыОбъектовСУЗ.
		КонтекстВыполнения.Вставить("СписокПодсказок", Новый Массив);
		
		// Массив ссылок на файлы предопределенного ресурса "Модули".
		КонтекстВыполнения.Вставить("СписокМодулей", Новый Массив);
		
	КонецЕсли;
	
	XMLДанные = "<?xml version=""1.0""?>";
	
	ИмяСправочника = Ссылка.Метаданные().Имя;
	XMLДанные      = XMLДанные + Справочники[ИмяСправочника].ПолучитьXMLПредставление(Ссылка, ПараметрыСсылки, КонтекстВыполнения);

	// Вставляем в структуру данных стили, только если требуется получить
	// Данные объекта верхнего уровня (объекта не вложенного в другой объект).
	Если НЕ ВложенныйОбъект Тогда
		
		// На основании списка вложенных шаблонов получаем текст необходимых стилей.
		CSSДанные = ОбъектыСУЗ.ПолучитьТекстСтилейОбъекта(КонтекстВыполнения.СписокШаблонов);
		СтруктураДанных.Вставить("Стили", CSSДанные);
	
	КонецЕсли;
								   
	Шаблон = ОбъектыСУЗ.ПолучитьСсылкуНаXSLШаблонОбъекта(Ссылка);
	СтруктураДанныхШаблона = ОбъектыСУЗ.ПолучитьИзКэшаТекстШаблона(Шаблон, Префикс);
	
	Преобразование = Новый ПреобразованиеXSL;
	Преобразование.ЗагрузитьИзСтроки(СтруктураДанныхШаблона.ШаблонПредставления);
	HTMLДанные = Преобразование.ПреобразоватьИзСтроки(XMLДанные);
	
	Если Прав(HTMLДанные, 1) = Символы.ПС Тогда
		HTMLДанные = Лев(HTMLДанные, СтрДлина(HTMLДанные) - 1); // Убираем лишний перевод строки в конце
	КонецЕсли;	
	
	Преобразование.ЗагрузитьИзСтроки(СтруктураДанныхШаблона.ШаблонСкрипта);
	JavaScriptДанные = Преобразование.ПреобразоватьИзСтроки(XMLДанные);
	
	СтруктураДанных.Вставить("Представление", HTMLДанные);
	СтруктураДанных.Вставить("Скрипт", JavaScriptДанные);
	
	//////////////////////////////////////////////////////////////////////////////////
	// Получаем дополнительные данные объекта
	
	// Заголовок
	
	Если ТипОбъектаСУЗ = Перечисления.ТипыОбъектовСУЗ.map Тогда
		
		ПредметКарты                         = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "targetMap");
		ИдентификаторПредметаКарты           = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "idTargetMap");
		УникальныйИдентификаторПредметаКарты = Новый УникальныйИдентификатор(ИдентификаторПредметаКарты);
		
		СсылкаНаПредметКарты = Справочники.КартыСУЗ.ПолучитьСсылкуНаПредметКарты(ПредметКарты, УникальныйИдентификаторПредметаКарты);
		
		СтруктураДанных.Вставить("Заголовок", "Карта " + СсылкаНаПредметКарты.Наименование);
		
	Иначе
		
		СтруктураДанных.Вставить("Заголовок", Ссылка.Наименование);
		
	КонецЕсли;
	
	// Ресурсы
	
	Если ДанныеЭлектронногоРесурса <> Неопределено И НЕ ВложенныйОбъект И ЗначениеЗаполнено(ДанныеЭлектронногоРесурса.Глоссарий) Тогда
		
		ДатаИзмененияГлоссария = Неопределено;
		
		Для каждого Строка Из КонтекстВыполнения.СписокРесурсов Цикл
		
			Если Строка.ПодключитьAPI Тогда
				
				Если ДатаИзмененияГлоссария = Неопределено Тогда
					ДатаИзмененияГлоссария = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЭлектронногоРесурса.Глоссарий, "ДатаИзменения");
				КонецЕсли;
				
				Если ДатаИзмененияГлоссария > Строка.ДатаИзменения Тогда
					Строка.ДатаИзменения = ДатаИзмененияГлоссария;	
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
	СтруктураДанных.Вставить("Ресурсы", КонтекстВыполнения.СписокРесурсов);
	
	// Ссылки
	
	СтруктураДанных.Вставить("СписокСсылок", КонтекстВыполнения.СписокСсылок);
	
	СтруктураДанных.Вставить("АдресОбъекта", КонтекстВыполнения.АдресОбъекта);
	
	// Параметры тестирования (необязательные свойства)
	
	Если КонтекстВыполнения.Свойство("СессияТестирования") Тогда
		СтруктураДанных.Вставить("СессияТестирования", КонтекстВыполнения.СессияТестирования);
	КонецЕсли;
	
	Если КонтекстВыполнения.Свойство("ВыполняетсяТестирование") Тогда
		СтруктураДанных.Вставить("ВыполняетсяТестирование", КонтекстВыполнения.ВыполняетсяТестирование);
	КонецЕсли;
	
	Если КонтекстВыполнения.Свойство("ВсеВопросыТестированияОтвечены") Тогда
		СтруктураДанных.Вставить("ВсеВопросыТестированияОтвечены", КонтекстВыполнения.ВсеВопросыТестированияОтвечены);
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////////////////////
	// Изменяем и дополняем представление, если необходимо
	
	ПодключитьМодульПодсказок = Ложь;
	
	Если ДанныеЭлектронногоРесурса <> Неопределено
		И ИмяСправочника = "СтраницыСУЗ"
		И ЗначениеЗаполнено(КонтекстВыполнения.ЭлементСодержания)
		И ЗначениеЗаполнено(ДанныеЭлектронногоРесурса.Глоссарий) Тогда
		
		// Делаем ссылки на термины глоссария
		
			
		ДанныеЭлементаСодержания = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КонтекстВыполнения.ЭлементСодержания, "СкрыватьСсылкиНаТерминыГлоссария, ЭтоГруппа");
		
		Если НЕ ДанныеЭлементаСодержания.ЭтоГруппа И НЕ ДанныеЭлементаСодержания.СкрыватьСсылкиНаТерминыГлоссария Тогда
			
			ТаблицаТерминов = ОбъектыСУЗПовтИсп.ТерминыГлоссария(ДанныеЭлектронногоРесурса.Глоссарий, ДанныеЭлектронногоРесурса.ПоказыватьТерминВсплывающейПодсказкой, КонтекстВыполнения.ДатаОткрытияОбозревателя);
			
			МассивОпределений = Новый Массив();
			
			Для каждого Термин Из ТаблицаТерминов Цикл
				СтруктураДанных.Представление = ЗаменитьТермин(СтруктураДанных.Представление, Термин, ДанныеЭлектронногоРесурса.ПоказыватьПервуюСсылкуНаТермин, ДанныеЭлектронногоРесурса.ПоказыватьТерминВсплывающейПодсказкой,, МассивОпределений);
			КонецЦикла;
			
			Если МассивОпределений.Количество() > 0 Тогда
				
				СтруктураДанных.Представление = СтруктураДанных.Представление + "<div style=""display:none;"">";
				
				Для каждого Элемент Из МассивОпределений Цикл
				
					СтруктураДанных.Представление = СтруктураДанных.Представление + Символы.ПС + "<div id=""text_tip_"+СтрЗаменить(Строка(Элемент.Термин.УникальныйИдентификатор()), "-", "")+""">" + Элемент.Определение + "</div>";
					
				КонецЦикла;
				
				СтруктураДанных.Представление = СтруктураДанных.Представление + "</div>";
				
				ПодключитьМодульПодсказок = Истина;
				
			КонецЕсли;				
			
		КонецЕсли;			

			
	КонецЕсли;	
	
	Если ИмяСправочника = "СтраницыСУЗ" Тогда
		
		// Делаем ссылки на подсказки
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РесурсыОбъектовСУЗ.Текст,
			|	РесурсыОбъектовСУЗ.Ссылка
			|ИЗ
			|	Справочник.РесурсыОбъектовСУЗ КАК РесурсыОбъектовСУЗ
			|ГДЕ
			|	РесурсыОбъектовСУЗ.ПометкаУдаления = ЛОЖЬ
			|	И РесурсыОбъектовСУЗ.Владелец = &Владелец
			|	И РесурсыОбъектовСУЗ.Подсказка = ИСТИНА";
		
		Запрос.УстановитьПараметр("Владелец", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				СтруктураДанных.Представление = СтруктураДанных.Представление + "<div style=""display:none;"">";
				СтруктураДанных.Представление = СтруктураДанных.Представление + Символы.ПС + "<div id=""text_tip_"+СтрЗаменить(Строка(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор()), "-", "")+""">" + ВыборкаДетальныеЗаписи.Текст + "</div>";
				СтруктураДанных.Представление = СтруктураДанных.Представление + "</div>";
				
				ПодключитьМодульПодсказок = Истина;

			КонецЦикла;
			
		КонецЕсли;
		
		
	КонецЕсли;
	
	// Подключаем модули

	Если ПодключитьМодульПодсказок Тогда
		ДобавитьМодульВМассив("qtip2", КонтекстВыполнения.СписокМодулей);
	КонецЕсли;
	
	// Подключаем дополнительные скрипты
	
	Если НЕ ВложенныйОбъект Тогда
		
		Для каждого Модуль Из КонтекстВыполнения.СписокМодулей Цикл
		
			ФайлыМодуля = ОбъектыСУЗПовтИсп.ФайлыМодуля(Модуль, КонтекстВыполнения.ДатаОткрытияОбозревателя);
			
			Если КонтекстВыполнения.ПараметрыЭкспорта = Неопределено Тогда
			
				Для каждого ФайлМодуля Из ФайлыМодуля Цикл
				
					Если ФайлМодуля.Расширение = "js" Тогда
						СтруктураДанных.Скрипт = "$('head').append( $('<script type=""text/javascript"" src="""+ФайлМодуля.ОтносительныйПуть+"""/>') );" + Символы.ПС + СтруктураДанных.Скрипт;
					КонецЕсли;
					
					Если ФайлМодуля.Расширение = "css" Тогда
						СтруктураДанных.Скрипт = "$('head').append( $('<link rel=""stylesheet"" type=""text/css"" href="""+ФайлМодуля.ОтносительныйПуть+""" />') );" + Символы.ПС + СтруктураДанных.Скрипт;
					КонецЕсли;
				
				КонецЦикла;
				
			Иначе
				
				Для каждого ФайлМодуля Из ФайлыМодуля Цикл
				
					Если ФайлМодуля.Расширение = "js" Тогда
						СтруктураДанных.Представление = СтруктураДанных.Представление + Символы.ПС + "<script type=""text/javascript"" src="""+ФайлМодуля.ОтносительныйПуть+"""/></script>";
					КонецЕсли;
					
					Если ФайлМодуля.Расширение = "css" Тогда
						СтруктураДанных.Представление = СтруктураДанных.Представление + Символы.ПС + "<link rel=""stylesheet"" type=""text/css"" href="""+ФайлМодуля.ОтносительныйПуть+""" />";
					КонецЕсли;				
					
				КонецЦикла;
					
			КонецЕсли;			
				
			Если Модуль.Наименование = "qtip2" Тогда
				ПодключитьМодульПодсказок = Истина;	
			КонецЕсли;
			
		КонецЦикла;
		
		Если ПодключитьМодульПодсказок Тогда
			СтруктураДанных.Скрипт = СтруктураДанных.Скрипт + Символы.ПС + "oClient.processTips();" + Символы.ПС;
		КонецЕсли;
		
		Если ПараметрыСсылки.Свойство("anchor") Тогда
			СтруктураДанных.Скрипт = СтруктураДанных.Скрипт + Символы.ПС + "$(document).ready(function(){oClient.scrollToBookmark('"+ПараметрыСсылки.anchor+"')});";
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат СтруктураДанных;
	
КонецФункции

// Служит для получения объекта СУЗ по его имени и идентификатору.
//
// Параметры:
//  ИмяОбъекта - Строка, содержащая имя объекта.
//  id - Строка, содержащая GUID объекта.
//
// Возвращаемое значение:
//  Ссылку на элемент справочника.
//  Неопределено, если объект не найден.
//
Функция ПолучитьСсылкуПоИдентификатору(ИмяОбъекта, id) Экспорт
	
	Если ПустаяСтрока(id) ИЛИ ПустаяСтрока(ИмяОбъекта) Тогда
		Возврат Неопределено;
	КонецЕсли;

    Попытка
    	ТипОбъекта = Перечисления["ТипыОбъектовСУЗ"][ИмяОбъекта];
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	ИмяСправочника = Строка(ТипОбъекта)+"СУЗ";
	
	Попытка
		УникальныйИдентификатор = Новый УникальныйИдентификатор(id);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Попытка 
		СправочникСсылка = Справочники[ИмяСправочника].ПолучитьСсылку(УникальныйИдентификатор);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат СправочникСсылка;
		
КонецФункции

// Функция позволяет заполнить структуру данных, которая описывает
// Контекст выполнения объекта СУЗ.
Функция ЗаполнитьКонтекстВыполненияОбъекта(ЭлектронныйРесурс = Неопределено,
	                                       ЭлементСодержания=Неопределено,
										   ТекущийПользователь=Неопределено,
										   ПрохождениеОбучения=Неопределено,
										   Задание=Неопределено,
										   Вариант=Неопределено,
										   ЗначенияНастроекЭР=Неопределено,
										   Симуляция=Ложь,
										   ПараметрыЭкспорта=Неопределено,
										   ДатаОткрытияОбозревателя=Неопределено,
										   АдресЗагруженногоОбъекта=Неопределено,
										   ПодключитьAPI=Ложь,
										   ЭтоВстроенныйWeKit = Неопределено) Экспорт
	
	
	Если ПрохождениеОбучения = Неопределено Тогда
		ПрохождениеОбучения = Метаданные.ОпределяемыеТипы.ПрохождениеЭлектронногоОбучения.Тип.ПривестиЗначение(ПрохождениеОбучения);
	КонецЕсли;		
	
	Если Задание = Неопределено Тогда
		Задание = Метаданные.ОпределяемыеТипы.ЗаданиеЭлектронногоОбучения.Тип.ПривестиЗначение(Задание);
	КонецЕсли;
	
	Если Вариант = Неопределено Тогда
		Вариант = Метаданные.ОпределяемыеТипы.ВариантЗаданияЭлектронногоОбучения.Тип.ПривестиЗначение(Вариант);
	КонецЕсли;
	
	Если ЭлектронныйРесурс = Неопределено И ТипЗнч(ЭлементСодержания) = Тип("СправочникСсылка.СодержаниеСУЗ") Тогда
		ЭлектронныйРесурс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементСодержания, "Владелец");
	КонецЕсли;
	
	КонтекстВыполнения = Новый Структура;
	
	КонтекстВыполнения.Вставить("ЭлектронныйРесурс", ЭлектронныйРесурс);
	КонтекстВыполнения.Вставить("ЭлементСодержания", ЭлементСодержания);
	КонтекстВыполнения.Вставить("ПрохождениеОбучения", ПрохождениеОбучения);
	КонтекстВыполнения.Вставить("Задание", Задание);
	КонтекстВыполнения.Вставить("Вариант", Вариант);
	КонтекстВыполнения.Вставить("ЗначенияНастроекЭР", ЗначенияНастроекЭР);
	КонтекстВыполнения.Вставить("Симуляция", Симуляция);
	КонтекстВыполнения.Вставить("ПараметрыЭкспорта", ПараметрыЭкспорта);
	КонтекстВыполнения.Вставить("ТекущийПользователь", ?(ЗначениеЗаполнено(ТекущийПользователь), ТекущийПользователь, Пользователи.ТекущийПользователь()));
	КонтекстВыполнения.Вставить("ДатаОткрытияОбозревателя", ДатаОткрытияОбозревателя);
	КонтекстВыполнения.Вставить("АдресЗагруженногоОбъекта", АдресЗагруженногоОбъекта);
	КонтекстВыполнения.Вставить("ПодключитьAPI", ПодключитьAPI);
	КонтекстВыполнения.Вставить("ЭтоВстроенныйWeKit", ЭтоВстроенныйWeKit);
	
	// Параметры, которые будут заполняться по мере сборки объекта:
	// Первоначально не определены.
	
	КонтекстВыполнения.Вставить("СписокШаблонов", Неопределено);
	КонтекстВыполнения.Вставить("СписокРесурсов", Неопределено);
	КонтекстВыполнения.Вставить("СписокСсылок", Неопределено);
	КонтекстВыполнения.Вставить("СписокПодсказок", Неопределено);
	КонтекстВыполнения.Вставить("СписокМодулей", Неопределено);
	
	// Симуляция
	
	КонтекстВыполнения.Вставить("АдресОбъекта", Неопределено);
	
	Возврат КонтекстВыполнения;
	
КонецФункции

// Функция возвращает представление пустого объекта СУЗ
// Требуется для того, чтобы гарантировать наличие всех указанных свойств
// у объекта СУЗ.
//
Функция ПолучитьПредставлениеПустогоОбъекта() Экспорт
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Представление", ""); // Строка. HTML-представление объекта.
	СтруктураДанных.Вставить("Скрипт", ""); // Строка. Скрипты объекта на JavaScript.
	СтруктураДанных.Вставить("Стили", ""); // Строка. Стили CSS объекта.
	СтруктураДанных.Вставить("Заголовок", ""); // Строка. 
	СтруктураДанных.Вставить("ПроцентЗавершенныхЭлементовОбучения", -1); // Число в диапазоне от 0 до 100. -1 - значение не определено.
	СтруктураДанных.Вставить("ПопыткаВыполненияСтатичногоОбъекта", Неопределено); // Ссылка на документ ПопыткаВыполненияСтатичногоОбъектаСУЗ.
	СтруктураДанных.Вставить("ТекущийЭлементСодержания", Неопределено); // Ссылка на элемент справочника СодержаниеСУЗ или Неопределено.
	СтруктураДанных.Вставить("СледующийЭлементСодержания", Неопределено);  // Ссылка на элемент справочника СодержаниеСУЗ или Неопределено.
	СтруктураДанных.Вставить("ПредыдущийЭлементСодержания", Неопределено);  // Ссылка на элемент справочника СодержаниеСУЗ или Неопределено.
	СтруктураДанных.Вставить("Пройден", Неопределено); // Булево или Неопределено.
	СтруктураДанных.Вставить("ВозможноДобавитьВИзбранное", Неопределено);  // Булево или Неопределено.
	СтруктураДанных.Вставить("ВыполняетсяТестирование", Неопределено);  // Булево или Неопределено.
	СтруктураДанных.Вставить("СессияТестирования", Неопределено); // Ссылка на документ ПопыткаВыполненияПодборкиВопросовСУЗ.
	СтруктураДанных.Вставить("ВсеВопросыТестированияОтвечены", Неопределено); // Булево или Неопределено.
	СтруктураДанных.Вставить("АдресОбъекта", Неопределено); // Строка или Неопределено. Используется при симуляции для автоматического перехода к следующим элементам.
	
	Ресурсы = Новый Массив();
	СтруктураДанных.Вставить("Ресурсы", Ресурсы); // Массив
	
	СписокСсылок = Новый Массив();
	СтруктураДанных.Вставить("СписокСсылок", СписокСсылок); // Массив. Хранит объекты на которые есть ссылки.
	
	Возврат СтруктураДанных;
	
КонецФункции

// Получает тип объекта
//
Функция ПолучитьТипОбъектаСУЗ(Ссылка) Экспорт

	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Перечисления.ТипыОбъектовСУЗ.ПустаяСсылка();
	КонецЕсли;
	
	ИмяСправочника = Ссылка.Метаданные().Имя;
	
	Возврат Справочники[ИмяСправочника].ТипОбъектаСУЗ();
	
КонецФункции

// Формирует ссылки на термины
//
Функция ЗаменитьТермин(Текст, Термин, ТолькоПервоеВхождение, ПоказыватьТерминВсплывающейПодсказкой, СтартоваяПозиция = 1, МассивОпределений, ЭтоВнешнийHTML=Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Термин.Наименование) Тогда
		Возврат Текст;
	КонецЕсли;
	
	Если Термин.СкрытьАвтоСсылки Тогда
		Возврат Текст;
	КонецЕсли;
	
	Если СтрДлина(Термин.Наименование) < 3 Тогда
		Возврат Текст;
	КонецЕсли;
	
	
	КопияТекстовогоПредставления = НРег(Текст);
	КопияТекстовогоПредставления = СтрЗаменить(КопияТекстовогоПредставления, Символы.ВК, " ");
	КопияТекстовогоПредставления = СтрЗаменить(КопияТекстовогоПредставления, Символы.ВТаб, " ");
	КопияТекстовогоПредставления = СтрЗаменить(КопияТекстовогоПредставления, Символы.НПП, " ");
	КопияТекстовогоПредставления = СтрЗаменить(КопияТекстовогоПредставления, Символы.ПС, " ");
	КопияТекстовогоПредставления = СтрЗаменить(КопияТекстовогоПредставления, Символы.ПФ, " ");
	КопияТекстовогоПредставления = СтрЗаменить(КопияТекстовогоПредставления, Символы.Таб, " ");		
	
	~ПродолжениеПоиска: 
	
	ПозицияТермина = Найти(Сред(КопияТекстовогоПредставления, СтартоваяПозиция), Термин.Наименование); 
	
	Если ПозицияТермина > 0 Тогда
		
		ПозицияТермина = ПозицияТермина + СтартоваяПозиция - 1; 
		
		СовпадениеНайдено = Истина;
		
		СимволПередТермином = Сред(КопияТекстовогоПредставления, ПозицияТермина-1, 1);
		СимволПослеТермина  = Сред(КопияТекстовогоПредставления, ПозицияТермина+СтрДлина(Термин.Наименование), 1);
		
		ПредставлениеЛеваяЧасть       = Лев(Текст, ПозицияТермина - 1);
		ПредставлениеЦентральнаяЧасть = Сред(Текст, ПозицияТермина, СтрДлина(Термин.Наименование));
		ПредставлениеПраваяЧасть      = Прав(Текст, СтрДлина(Текст)-СтрДлина(ПредставлениеЛеваяЧасть)-СтрДлина(Термин.Наименование));
		
		СсылкаЛеваяЧасть              = "";
		СсылкаПраваяЧасть             = "";		
				
		Если ОбщегоНазначенияСУ.ЭтоБуква(СимволПередТермином)
			ИЛИ ОбщегоНазначенияСУ.ЭтоБуква(СимволПослеТермина)
			ИЛИ ОбщегоНазначенияСУ.ЭтоЦифра(СимволПередТермином)
			ИЛИ ОбщегоНазначенияСУ.ЭтоЦифра(СимволПослеТермина)			
			ИЛИ СимволПередТермином = "<" // Это тег
			ИЛИ СимволПослеТермина = ">"
			ИЛИ СимволПослеТермина = "_"
			ИЛИ СимволПередТермином = "_"
			ИЛИ СимволПослеТермина = "-"
			ИЛИ СимволПередТермином = "-"
			ИЛИ СимволПередТермином = "="
			ИЛИ СимволПослеТермина = "="
			ИЛИ СимволПослеТермина = "&"
			ИЛИ СимволПередТермином = "&"
			ИЛИ СимволПослеТермина = "}"
			ИЛИ СимволПередТермином = "{"
			ИЛИ ЭтоЧастьТега(ПредставлениеЛеваяЧасть) Тогда
			
			// Это часть слова, поэтому ссылку не делаем.
			СовпадениеНайдено = Ложь;
			
		Иначе
			
			Если ЭтоВнешнийHTML Тогда				
				
				СсылкаЛеваяЧасть = "<a class=""term"" href=""javascript:oAPI_1C_V8_SUZ.goToLink('"+Термин.ТекстоваяСсылка+"')"" isTip=""true""  ";				
				
				Если ПоказыватьТерминВсплывающейПодсказкой Тогда					
					СсылкаЛеваяЧасть = СсылкаЛеваяЧасть + " title="" " + ОбщегоНазначенияСУКлиентСервер.HTMLСтрока(Термин.Определение) + " "" ";
				КонецЕсли;
				
				
			Иначе			
				
				СсылкаЛеваяЧасть  = "<a class=""term"" href="""+Термин.ТекстоваяСсылка+""" isTip=""true"" ";				
				
				Если ПоказыватьТерминВсплывающейПодсказкой Тогда					
					СсылкаЛеваяЧасть = СсылкаЛеваяЧасть + " id=""tip_"+СтрЗаменить(Строка(Термин.Термин.УникальныйИдентификатор()), "-", "")+ """";					
				КонецЕсли;
					
					
			КонецЕсли;
			
			Если ПоказыватьТерминВсплывающейПодсказкой Тогда
				
				УжеДобавленоОпределениеВМассив = Ложь;
				
				Для каждого ОпределениеВМассив Из МассивОпределений Цикл
				
					Если ОпределениеВМассив.Термин = Термин.Термин Тогда
						УжеДобавленоОпределениеВМассив = Истина;
					КонецЕсли;					
				
				КонецЦикла;
				
				Если НЕ УжеДобавленоОпределениеВМассив Тогда
					МассивОпределений.Добавить(Новый Структура("Термин, Определение", Термин.Термин, Термин.Определение));
				КонецЕсли;
				
			КонецЕсли;			
			
					
			СсылкаЛеваяЧасть = СсылкаЛеваяЧасть + ">";
			
			
			СсылкаПраваяЧасть = "</a>";
			
		КонецЕсли;
		
		Если СовпадениеНайдено Тогда
		
			Если НЕ ТолькоПервоеВхождение Тогда
				ПредставлениеПраваяЧасть = ЗаменитьТермин(ПредставлениеПраваяЧасть, Термин, Ложь, ПоказыватьТерминВсплывающейПодсказкой,, МассивОпределений, ЭтоВнешнийHTML); // Рекурсия
			КонецЕсли;
			
			Текст = ПредставлениеЛеваяЧасть + СсылкаЛеваяЧасть + ПредставлениеЦентральнаяЧасть + СсылкаПраваяЧасть + ПредставлениеПраваяЧасть; 
			
		Иначе
			
			СтартоваяПозиция = ПозицияТермина + СтрДлина(Термин.Наименование);
			
			Перейти ~ПродолжениеПоиска;
			
			//Текст = ЗаменитьТермин(Текст, Термин, ТолькоПервоеВхождение, ПоказыватьТерминВсплывающейПодсказкой, ПозицияТермина + СтрДлина(Термин.Наименование), МассивОпределений, ЭтоВнешнийHTML); // Рекурсия
			
		КонецЕсли;
		
			
	КонецЕсли;

	Возврат Текст;
	
КонецФункции

Функция ЭтоЧастьТега(ПредставлениеЛеваяЧасть)
	
	ЭтоЧастьТега = Ложь;

	НомерСимвола = СтрДлина(ПредставлениеЛеваяЧасть);

	Пока НомерСимвола > 0 Цикл

		ТекСимвол = Сред(ПредставлениеЛеваяЧасть, НомерСимвола, 1);
		
		Если ТекСимвол = ">" Тогда
			Прервать;
		КонецЕсли;
		
		Если ТекСимвол = "<" Тогда
			ЭтоЧастьТега = Истина;
			Прервать;
		КонецЕсли;
		
		НомерСимвола = НомерСимвола - 1;
		
	КонецЦикла;
	
	Возврат ЭтоЧастьТега;
	
КонецФункции

// ДАННЫЕ

// Возвращает данные объекта из регистра с данными.
//
Функция ПолучитьДанные(Знач Ссылка,
	                   Знач КодДанных=Неопределено,
					   Знач ПолучитьПоследнююВерсию=Ложь,
					   Знач ИмяРеквизита="ТекстовыеДанные",
					   Знач Поставщик=Неопределено,
					   Знач Версия=Неопределено,
					   Знач ТолькоПроверитьНаличие=Ложь) Экспорт
	
					   
	ИмяРегистраСДанными = ПолучитьИмяРегистраСДанными(Ссылка);
	
	Запрос = Новый Запрос();
	
	ТекстЗапроса = "ВЫБРАТЬ
	| ";
	
	Если ТипЗнч(ИмяРеквизита) = Тип("Массив") Тогда
		
		Если ИмяРегистраСДанными = "ДанныеФайлыСУЗ" И ИмяРеквизита.Найти("ДвоичныеДанные") <> Неопределено Тогда
			ВызватьИсключение НСтр("ru = 'Получение нескольких ресурсов для регистра ДанныеФайлыСУЗ не предусмотрено'");
		КонецЕсли;			
		
		Для каждого Реквизит Из ИмяРеквизита Цикл
			ТекстЗапроса = ТекстЗапроса + Символы.ПС + ИмяРегистраСДанными +"."+ Реквизит + ",";	
		КонецЦикла;
		
		ТекстЗапроса = Сред(ТекстЗапроса, 1, СтрДлина(ТекстЗапроса)-1); // Убираем последнюю запятую
		
	Иначе
		
		ТекстЗапроса = ТекстЗапроса + ИмяРегистраСДанными +"."+ ИмяРеквизита;
		
		Если ИмяРеквизита = "ДвоичныеДанные" Тогда
			ТекстЗапроса = ТекстЗапроса + "," + ИмяРегистраСДанными +".ПрисоединенныйФайл";
		КонецЕсли;		
		
	КонецЕсли;
	
	Если КодДанных = Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса + ",
		|"+ИмяРегистраСДанными+".КодДанных";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|ИЗ
	|	РегистрСведений."+ИмяРегистраСДанными+" КАК "+ИмяРегистраСДанными+"
	|ГДЕ
	|	"+ИмяРегистраСДанными+".СсылкаНаОбъектСУЗ = &СсылкаНаОбъектСУЗ
	|	И "+ИмяРегистраСДанными+".Версия = &Версия
	|	И "+ИмяРегистраСДанными+".Поставщик = &Поставщик
	|"; 
	
	Если КодДанных <> Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса + "	И "+ИмяРегистраСДанными+".КодДанных = &КодДанных";
		Запрос.УстановитьПараметр("КодДанных", КодДанных); 
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СсылкаНаОбъектСУЗ", Ссылка); 
	
	Запрос.Текст = ТекстЗапроса;
	
	// Примечание: для всех объектов, данные которых получаются при помощи данной
	// Функции каждый поставщик должен иметь полный набор всех необходимых
	// Для отображения данных.

	Если Поставщик <> Неопределено И Версия <> Неопределено Тогда
		
		// Если поставщик и версия переданы в функцию,
		// То они имеют самый высокий приоритет.
		
		Запрос.УстановитьПараметр("Поставщик", Поставщик); 
		Запрос.УстановитьПараметр("Версия", Версия); 
		
	Иначе
	
		Если ПолучитьПоследнююВерсию И Поставщик <> Неопределено Тогда
			
			// Ищем последнюю версию объекта переданного в функцию поставщика.
			ПоследняяВерсия = ПолучитьПоследнююВерсию(Ссылка, Поставщик);
			
			Запрос.УстановитьПараметр("Поставщик", ПоследняяВерсия.Поставщик); 
			Запрос.УстановитьПараметр("Версия", ПоследняяВерсия.Версия); 
			
		Иначе
			
			// Загружаем данные от поставщика, который указан в самом объекте СУЗ.
			Запрос.УстановитьПараметр("Поставщик", Ссылка.Поставщик); 
			Запрос.УстановитьПараметр("Версия", Ссылка.Версия); 
			
		КонецЕсли;
		
	КонецЕсли;
		
	Результат = Запрос.Выполнить().Выбрать();
	
	Если ТолькоПроверитьНаличие Тогда
		
		Возврат ?(Результат.Количество() > 0, Истина, Ложь);
		
	Иначе
	
		Если КодДанных <> Неопределено Тогда
			
			РезультатНайден = Результат.Следующий(); // Всегда один только результат, так как отбор по всем измерениям.
			
			Если ТипЗнч(ИмяРеквизита) = Тип("Массив") Тогда
				
				Возврат Результат;
				
			Иначе
				
				Если ИмяРеквизита = "ДвоичныеДанные" Тогда
					
					Если ИмяРегистраСДанными <> "ДанныеФайлыСУЗ" Тогда
						ВызватьИсключение НСтр("ru = 'Данный регистр не содержит двоичные данные'");
					КонецЕсли;
					
					Если НЕ РезультатНайден Тогда
						ВызватьИсключение НСтр("ru = 'Двоичные данные не найдены'");
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Результат.ПрисоединенныйФайл) Тогда
						Возврат ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(Результат.ПрисоединенныйФайл);
					Иначе
						Возврат Результат[ИмяРеквизита].Получить();
					КонецЕсли;												
					
				ИначеЕсли ИмяРеквизита = "ФорматированныйДокумент" Тогда
					
					Если РезультатНайден Тогда
						Возврат Результат[ИмяРеквизита].Получить();
					Иначе
						Возврат Неопределено;
					КонецЕсли;					
					
				Иначе
					
					Если РезультатНайден Тогда
						Возврат Результат[ИмяРеквизита];
					Иначе
						Возврат "";
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			Возврат Результат;
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецФункции

// Позволяет получить последний номер версии объекта и поставщика этой версии.
//
// Параметры:
//  ПоставщикСводаЗнаний - ссылка на элемент справочника "ПоставщикиСУЗ".
//  ПредпочитаемыйПоставщик - ссылка на элемент справочника "ПоставщикиСУЗ"
//
// Возвращаемое значение:
//  Структура со значениями "Версия" и "Поставщик".
//
Функция ПолучитьПоследнююВерсию(Знач Ссылка, Знач ПредпочитаемыйПоставщик=Неопределено) Экспорт
	
	ИмяРегистраСДанными = ПолучитьИмяРегистраСДанными(Ссылка);
	
	// Загружаем последние версии объекта от всех поставщиков
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ДанныеСУЗ.Версия КАК Версия,
	|	ДанныеСУЗ.Поставщик КАК Поставщик
	|ИЗ
	|	РегистрСведений."+ИмяРегистраСДанными+" КАК ДанныеСУЗ
	|ГДЕ
	|	ДанныеСУЗ.КодДанных = &КодДанных
	|	И ДанныеСУЗ.СсылкаНаОбъектСУЗ = &СсылкаНаОбъектСУЗ
	|ИТОГИ
	|	МАКСИМУМ(Версия)
	|ПО
	|	Поставщик";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("КодДанных", "Описание");
	Запрос.УстановитьПараметр("СсылкаНаОбъектСУЗ", Ссылка);
	
	// Получаем дерево. На первом уровне находятся записи с максимальным
	// Номером версии для каждого поставщика.
	Результат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ПоследняяВерсия = -1; // Пока не найдена версия.
	ПоставщикПоследнейВерсии = Неопределено;
	
	// 0. Первый приоритет имеет поставщик переданный непосредственно в функцию
	// Через параметр ПредпочитаемыйПоставщик.
	
	// Примечание: для проверки на заполненность переменной ПредпочитатьПоставщика
	// Нельзя использовать функцию ЗначениеЗаполнено, так как ПустаяСсылка на поставщика
	// Так же может быть "поставщиком". Аналогично ниже.
	Если ПредпочитаемыйПоставщик <> Неопределено Тогда
		
		ВерсияПоставщика = Результат.Строки.Найти(ПредпочитаемыйПоставщик, "Поставщик");
		
		Если ВерсияПоставщика <> Неопределено Тогда
			ПоследняяВерсия          = ВерсияПоставщика.Версия;
			ПоставщикПоследнейВерсии = ВерсияПоставщика.Поставщик;
		КонецЕсли;
		
	КонецЕсли;
	
	// 1. Затем ищем версию от поставщика установленного в настройках базы.
	// Но только, если стоит в настройках ПоказыватьПоследнююВерсию = Истина.
	
	Если ПоследняяВерсия = -1 Тогда
	
		ПоказыватьПоследнююВерсию = Константы.ПоказыватьПоследнююВерсиюСУЗ.Получить();
		
		Если ПоказыватьПоследнююВерсию Тогда
			
			ПредпочитаемыйПоставщик = Константы.ПредпочитатьПоставщикаСУЗ.Получить();
			
			ВерсияПоставщика = Результат.Строки.Найти(ПредпочитаемыйПоставщик, "Поставщик");
			
			Если ВерсияПоставщика <> Неопределено Тогда
				ПоследняяВерсия          = ВерсияПоставщика.Версия;
				ПоставщикПоследнейВерсии = ВерсияПоставщика.Поставщик;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// 2. Если нет ни одной версии, то возвращаем поставщика и номер версии
	// Последней сохраненной версии. Она есть всегда.
	
	Если ПоследняяВерсия = -1 Тогда // Еще не найдена версия
		ПоследняяВерсия          = Ссылка.Версия;
		ПоставщикПоследнейВерсии = Ссылка.Поставщик;
	КонецЕсли;
	
	СтруктураВерсии = Новый Структура();
	СтруктураВерсии.Вставить("Версия", ПоследняяВерсия);
	СтруктураВерсии.Вставить("Поставщик", ПоставщикПоследнейВерсии);
	
	Возврат СтруктураВерсии;
	
КонецФункции

// Возвращает имя регистра, где хранятся данные объекта СУЗ.
//
Функция ПолучитьИмяРегистраСДанными(Ссылка) Экспорт
	
	ИмяСправочника = Ссылка.Метаданные().Имя;
	ИмяСправочника = СтрЗаменить(ИмяСправочника, "Справочник.", "");

	Возврат "Данные" + ИмяСправочника;
	
КонецФункции

// Позволяет получить набор записей о версиях объекта СУЗ из регистра сведений, где
// хранятся его данные. Каждая запись регистра данных объекта, имеющая значение
// реквизита КодДанных - "Описание" говорит, что существует версия объекта с параметрами
// поставщик-версия как у этой записи.
//
Функция ПолучитьНаборВерсий(Ссылка, ИмяРегистраСДанными = Неопределено) Экспорт
	
	Если ИмяРегистраСДанными = Неопределено Тогда
		ИмяРегистраСДанными = ПолучитьИмяРегистраСДанными(Ссылка);
	КонецЕсли;
	
	НаборВерсий = РегистрыСведений[ИмяРегистраСДанными].СоздатьНаборЗаписей();
	НаборВерсий.Отбор.СсылкаНаОбъектСУЗ.Установить(Ссылка);
	НаборВерсий.Отбор.КодДанных.Установить("Описание");
	НаборВерсий.Прочитать();
	
	Возврат НаборВерсий;
	
КонецФункции

// Проверяет существует ли версии объекта, от поставщика, отличного
// от того, который передан в функцию.
//
Функция СуществуютВерсииДругихПоставщиков(Ссылка, Поставщик, ИмяРегистраСДанными = Неопределено) Экспорт
	
	Если ИмяРегистраСДанными = Неопределено Тогда
		ИмяРегистраСДанными = ПолучитьИмяРегистраСДанными(Ссылка);
	КонецЕсли;
	
	ИмяРеквизита = "Версия";
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	"+ИмяРегистраСДанными+"."+ИмяРеквизита+"
	|ИЗ
	|	РегистрСведений."+ИмяРегистраСДанными+" КАК "+ИмяРегистраСДанными+"
	|ГДЕ
	|	"+ИмяРегистраСДанными+".СсылкаНаОбъектСУЗ = &СсылкаНаОбъектСУЗ
	|	И "+ИмяРегистраСДанными+".КодДанных = &КодДанных
	|	И "+ИмяРегистраСДанными+".Поставщик <> &Поставщик"); 
	
	Запрос.УстановитьПараметр("СсылкаНаОбъектСУЗ", Ссылка); 
	Запрос.УстановитьПараметр("КодДанных", "Описание"); 
	Запрос.УстановитьПараметр("Поставщик", Поставщик); 
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

// Извлекает текст из данных объекта
//
Функция ПолучитьТекстовоеПредставлениеДанных(Знач Данные) Экспорт
	
	Если ТипЗнч(Данные) = Тип("ХранилищеЗначения") Тогда
		Данные = Данные.Получить();
	КонецЕсли;
	
	Если ТипЗнч(Данные) = Тип("Строка") Тогда
		
		ФорматированныйДокумент = Новый ФорматированныйДокумент;
		ФорматированныйДокумент.УстановитьHTML(Данные, Новый Структура());
		
	ИначеЕсли ТипЗнч(Данные) = Тип("ФорматированныйДокумент") Тогда
		
		ФорматированныйДокумент = Данные;
		
	Иначе
		
		Возврат "";
		
	КонецЕсли;
	
	Возврат ФорматированныйДокумент.ПолучитьТекст();
	
КонецФункции

// Получает пользовательскую настройку
//
Функция ПолучитьПользовательскуюНастройкуОбъекта(ИмяНастройки, Настройки, ЭлементСодержания) Экспорт
	
	Если Настройки = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Настройки.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ Настройки.Свойство(ИмяНастройки) Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ЭлементСодержания)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементСодержания, "ОтменятьПользовательскиеНастройки") Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат Настройки[ИмяНастройки];
	
КонецФункции

// Находит документ ПопыткаВыполненияПодборкиВопросовСУЗ по его номеру
//
Функция ДокументСессииТестирования(НомерДокумента, КонтекстВыполнения, ПолучатьОбъект = Истина) Экспорт
	
	Если НомерДокумента = -1 Тогда
		
		Возврат КонтекстВыполнения.ПараметрыЭкспорта.ДокументСессииОбъект;
		
	Иначе
		
		ДокументСессииТестированияСсылка = Документы.ПопыткаВыполненияПодборкиВопросовСУЗ.НайтиПоНомеру(НомерДокумента);
		
		Если ПолучатьОбъект Тогда
			
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.ПопыткаВыполненияПодборкиВопросовСУЗ");
			ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", ДокументСессииТестированияСсылка);
			ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
			БлокировкаДанных.Заблокировать();
			
			Возврат ДокументСессииТестированияСсылка.ПолучитьОбъект();
			
		Иначе
			
			Возврат ДокументСессииТестированияСсылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

// Возвращает пользователя, который проходит объект
//
Функция ТекущийПользователь(КонтекстВыполнения = Неопределено) Экспорт

	Если КонтекстВыполнения = Неопределено
		ИЛИ НЕ ЗначениеЗаполнено(КонтекстВыполнения.ТекущийПользователь) Тогда
		
		Возврат Пользователи.ТекущийПользователь();
		
	Иначе
		
		Возврат КонтекстВыполнения.ТекущийПользователь;
		
	КонецЕсли;
	
КонецФункции

Функция ЗаданиеПопытки(ПрохождениеОбучения, ЭлектронныйРесурс, Задание) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
		Возврат неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Задание) Тогда
		Возврат Задание;
	КонецЕсли;
	
	Возврат ЭлектронныйРесурс;
	
КонецФункции

// ДЕЙСТВИЯ

// Выполняет действие переданное в параметре ссылки "action".
// 
//
Функция ВыполнитьДействие(ПараметрыСсылки, КонтекстВыполнения) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		УстановитьПривилегированныйРежим(Истина);
		
		// 1. Определяем основные переменные
		
		ЭлементСодержания        = КонтекстВыполнения.ЭлементСодержания;
		ПрохождениеОбучения   = КонтекстВыполнения.ПрохождениеОбучения;
		Задание                  = КонтекстВыполнения.Задание;
		Вариант                  = КонтекстВыполнения.Вариант;
		СводЗнаний               = КонтекстВыполнения.ЭлектронныйРесурс;	
		Симуляция                = КонтекстВыполнения.Симуляция;
		ПараметрыЭкспорта        = КонтекстВыполнения.ПараметрыЭкспорта;
		ДействиеСсылки           = ПараметрыСсылки.action;
		РезультатДействия        = ПолучитьПустуюСтруктуруДействия();
		ПоставщикСводаЗнаний     = Справочники.СводыЗнанийСУЗ.Поставщик(СводЗнаний);
		ИдентификаторСводаЗнаний = Справочники.СводыЗнанийСУЗ.ИдентификаторКаталога(ЭлементСодержания);
		
		// 2. Выполняем действие
		
		////////////////////////////////////////////////////////////////////////////////
		// openObjectLink (Открывает ссылку из справочника СсылкиОбъектовСУЗ)
		
		Если ДействиеСсылки = "openObjectLink" Тогда
			
			id = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "id");
			УникальныйИдентификатор = Новый УникальныйИдентификатор(id);
			
			Попытка
				ЭлементСправочникаСсылки = Справочники.СсылкиОбъектовСУЗ.ПолучитьСсылку(УникальныйИдентификатор);
			Исключение
				ЭлементСправочникаСсылки = Справочники.СсылкиОбъектовСУЗ.ПустаяСсылка();
			КонецПопытки;
			
			Если ТипЗнч(ЭлементСправочникаСсылки.СсылкаНаОбъектСУЗ) = Тип("СправочникСсылка.ФайлыСУЗ")
				И ЭлементСправочникаСсылки.СсылкаНаОбъектСУЗ.ОткрыватьВнешнимПриложением Тогда
				
				Файл  = ЭлементСправочникаСсылки.СсылкаНаОбъектСУЗ; 
				Якорь = ЭлементСправочникаСсылки.Якорь;
				
				МассивРесурсов = Новый Массив();
				ВладелецФайла = Файл.Владелец;
				ДобавитьРесурсВМассивРесурсов(ВладелецФайла, МассивРесурсов);
				
				РезультатДействия.Ресурсы = МассивРесурсов;
				
				// Определяем путь к файлу
				
				ОтносительныйПутьКФайлу = Справочники.ФайлыСУЗ.ПолучитьОтносительныйПутьКФайлу(Файл);
				
				СсылкаНаФайл = Справочники.РесурсыСУЗ.АдресКаталогаРесурсов(ИдентификаторСводаЗнаний) + ОтносительныйПутьКФайлу;
				СсылкаНаФайл = ОбщегоНазначенияСУКлиентСервер.ПривестиСлэши(СсылкаНаФайл);
				
				Если НЕ ПустаяСтрока(Якорь) Тогда
					СсылкаНаФайл = СсылкаНаФайл + "#" + Якорь;
				КонецЕсли;
				
				РезультатДействия.АдресФайла = СсылкаНаФайл;
				
			Иначе
				
				Если ЗначениеЗаполнено(ЭлементСправочникаСсылки) Тогда
					
					Если ЗначениеЗаполнено(ЭлементСправочникаСсылки.СсылкаНаОбъектСУЗ) Тогда
						РезультатДействия.АдресОбъекта = Справочники.СсылкиОбъектовСУЗ.АдресЦели(ЭлементСправочникаСсылки);
					Иначе
						РезультатДействия.ВнешняяСсылка = Справочники.СсылкиОбъектовСУЗ.АдресЦели(ЭлементСправочникаСсылки);
					КонецЕсли;
					
				Иначе
					
					РезультатДействия.ТекстСообщения = НСтр("ru = 'Объект не найден'");
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		////////////////////////////////////////////////////////////////////////////////
		// openfile (открытие файла)
		
		Если ДействиеСсылки = "openfile" Тогда
			
			ИмяОбъектаСУЗ = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "object");
			id            = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "id");
			Якорь         = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "anchor");
			
			Файл = ПолучитьСсылкуПоИдентификатору(ИмяОбъектаСУЗ, id);
			
			СвойстваФайла = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Файл, "ТипФайла, Владелец, ОткрыватьОбработкуМодально, ОткрыватьОбработкуБезопасно");
			
			Если СвойстваФайла.ТипФайла = Перечисления.ТипыФайловСУЗ.DataProcessor Тогда
				
				// Создаем внешнюю обработку
				
				ДвоичныеДанные            = ОбъектыСУЗ.ПолучитьДанные(Файл, "ДвоичныеДанные", Истина, "ДвоичныеДанные", ПоставщикСводаЗнаний);
				АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
				ИмяВнешнейОбработки       = ВнешниеОбработки.Подключить(АдресВоВременномХранилище,, СвойстваФайла.ОткрыватьОбработкуБезопасно);
				ДанныеВнешнейОбработки    = Новый Структура("Имя, ОткрыватьОбработкуМодально", ИмяВнешнейОбработки, СвойстваФайла.ОткрыватьОбработкуМодально);
				
				РезультатДействия.ВнешняяОбработка = ДанныеВнешнейОбработки;
				
			Иначе
				
				СвойстваРесурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СвойстваФайла.Владелец, "ИдентичныйРесурс");
				
				МассивРесурсов = Новый Массив();
				
				ДобавитьРесурсВМассивРесурсов(СвойстваФайла.Владелец, МассивРесурсов);
				
				РезультатДействия.Ресурсы = МассивРесурсов;
				
				// Определяем путь к файлу
				
				ОтносительныйПутьКФайлу = Справочники.ФайлыСУЗ.ПолучитьОтносительныйПутьКФайлу(Файл);
				
				СсылкаНаФайл = Справочники.РесурсыСУЗ.АдресКаталогаРесурсов(ИдентификаторСводаЗнаний) + ОтносительныйПутьКФайлу;
				СсылкаНаФайл = ОбщегоНазначенияСУКлиентСервер.ПривестиСлэши(СсылкаНаФайл);
				
				Если НЕ ПустаяСтрока(Якорь) Тогда
					СсылкаНаФайл = СсылкаНаФайл + "#" + Якорь;
				КонецЕсли;
				
				РезультатДействия.АдресФайла = СсылкаНаФайл;
				
			КонецЕсли;
			
		КонецЕсли;
		
		
		////////////////////////////////////////////////////////////////////////////////
		// openKnowledgeBaseElementLink (Открывает ссылку из справочника СодержаниеСУЗ)
		
		Если ДействиеСсылки = "openKnowledgeBaseElementLink" Тогда
			
			id = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "id");
			УникальныйИдентификатор = Новый УникальныйИдентификатор(id);
			
			Попытка
				ЭлементСодержания = Справочники.СодержаниеСУЗ.ПолучитьСсылку(УникальныйИдентификатор);
			Исключение
				ЭлементСодержания = Справочники.СодержаниеСУЗ.ПустаяСсылка();
			КонецПопытки;
			
			Если ЗначениеЗаполнено(ЭлементСодержания) Тогда
				РезультатДействия.АдресОбъекта = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(ЭлементСодержания);
			Иначе
				РезультатДействия.ТекстСообщения = НСтр("ru = 'Объект не найден'");
			КонецЕсли;
			
		КонецЕсли;
		
		////////////////////////////////////////////////////////////////////////////////
		// openTip (Открывает подсказку)
		
		Если ДействиеСсылки = "openTip" Тогда
			
			id = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "id");
			УникальныйИдентификатор = Новый УникальныйИдентификатор(id);
			
			Попытка
				ЭлементСправочникаСсылки = Справочники.РесурсыОбъектовСУЗ.ПолучитьСсылку(УникальныйИдентификатор);
			Исключение
				ЭлементСправочникаСсылки = Справочники.СсылкиОбъектовСУЗ.ПустаяСсылка();
			КонецПопытки;
			
			РезультатДействия.ТекстСообщения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементСправочникаСсылки, "Текст");
			
		КонецЕсли;
		
		////////////////////////////////////////////////////////////////////////////////
		// newDocument (Открывается новая попытка выполнения подборки вопросов.
		// Документ ПопыткаВыполненияПодборкиВопросовСУЗ.
		
		Если ДействиеСсылки = "newDocument" Тогда
			
			ИмяОбъектаСУЗ = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "object");
			id            = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "id");
			
			Подборка = ПолучитьСсылкуПоИдентификатору(ИмяОбъектаСУЗ, id);
			
			// Создаем новый документ "ПопыткаВыполненияПодборкиВопросовСУЗ".
			
			ДокументСессии = Документы.ПопыткаВыполненияПодборкиВопросовСУЗ.СоздатьДокумент();
			
			ДокументСессии.Дата                      = ТекущаяДата();
			ДокументСессии.ДатаНачалаВыполненияТеста = ТекущаяДата();
			
			ДокументСессии.ПрохождениеОбучения    = ПрохождениеОбучения;
			ДокументСессии.Задание                   = Задание;
			ДокументСессии.Вариант                   = Вариант;
			
			Если ЗначениеЗаполнено(ЭлементСодержания) Тогда
				ДокументСессии.СводЗнаний                   = ЭлементСодержания.Владелец;
				ДокументСессии.ЭлементСодержанияСводаЗнаний = ЭлементСодержания;
			КонецЕсли;
			
			ДокументСессии.Подборка                     = Подборка;
			ДокументСессии.НазначениеТестирования       = Подборка.НазначениеТестирования;
			ДокументСессии.Пользователь                 = ОбъектыСУЗ.ТекущийПользователь(КонтекстВыполнения);
			
			ИдентификаторСложности = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "level");
			
			Если ЗначениеЗаполнено(ИдентификаторСложности)
				И ИдентификаторСложности <> "default" Тогда
				
				ИдентификаторСложности = Новый УникальныйИдентификатор(ИдентификаторСложности);
				ДокументСессии.Сложность = Справочники.СложностиТестовСУЗ.ПолучитьСсылку(ИдентификаторСложности);
				
			КонецЕсли;
			
			ИсточникНастроек = Новый Структура;
			
			Если ЗначениеЗаполнено(Вариант) Тогда
				НастройкаЗадания = Вариант;	
			Иначе
				НастройкаЗадания = Задание;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ПрохождениеОбучения)
				И ЗначениеЗаполнено(ПрохождениеОбучения) 
				И ЗначениеЗаполнено(Задание)
				И ТипЗнч(НастройкаЗадания) <> Тип("СправочникСсылка.СводыЗнанийСУЗ")
				И НЕ НастройкаЗадания.ИспользоватьСтандартныеНастройкиТеста Тогда
				
				Если ЗначениеЗаполнено(ДокументСессии.Сложность) Тогда
					
					ИсточникНастроек.Вставить("ВремяТеста", ДокументСессии.Сложность.ВремяТеста);
					ИсточникНастроек.Вставить("КоличествоГруппЭлементов", ДокументСессии.Сложность.КоличествоГруппЭлементов);
					
				Иначе
					
					ИсточникНастроек.Вставить("ВремяТеста", ОбъектыSCORM.ПолучитьДатуИзКоличестваСекунд(НастройкаЗадания.ПродолжительностьВСекундах));
					ИсточникНастроек.Вставить("КоличествоГруппЭлементов", НастройкаЗадания.КоличествоСтраницВопросов);
					
				КонецЕсли;
				
				ИсточникНастроек.Вставить("ПереходитьВпередАвтоматически", НастройкаЗадания.ПереходитьВпередАвтоматически);
				ИсточникНастроек.Вставить("ПоказыватьНавигацию", НастройкаЗадания.ПоказыватьНавигацию);
				ИсточникНастроек.Вставить("ПеремешиватьГруппыЭлементов", НастройкаЗадания.ПеремешиватьСтраницыВопросов);
				
			Иначе
				
				Если ЗначениеЗаполнено(ДокументСессии.Сложность) Тогда
					
					ИсточникНастроек.Вставить("ВремяТеста", ДокументСессии.Сложность.ВремяТеста);
					ИсточникНастроек.Вставить("КоличествоГруппЭлементов", ДокументСессии.Сложность.КоличествоГруппЭлементов);
					
				Иначе
					
					ИсточникНастроек.Вставить("ВремяТеста", Подборка.ВремяТеста);
					ИсточникНастроек.Вставить("КоличествоГруппЭлементов", Подборка.КоличествоГруппЭлементов);
					
				КонецЕсли;
				
				ИсточникНастроек.Вставить("ПереходитьВпередАвтоматически", Подборка.ПереходитьВпередАвтоматически);
				ИсточникНастроек.Вставить("ПоказыватьНавигацию", Подборка.ПоказыватьНавигацию);
				ИсточникНастроек.Вставить("ПеремешиватьГруппыЭлементов", Подборка.ПеремешиватьГруппыЭлементов);
				
			КонецЕсли;
			
			Если ПараметрыЭкспорта <> Неопределено Тогда
				
				ИсточникНастроек.Вставить("КоличествоГруппЭлементов", 0);
				ИсточникНастроек.Вставить("ПереходитьВпередАвтоматически", Ложь);
				ИсточникНастроек.Вставить("ПоказыватьНавигацию", Истина);
				ИсточникНастроек.Вставить("КоличествоГруппЭлементов", 0);
				ИсточникНастроек.Вставить("ПеремешиватьГруппыЭлементов", Ложь);
				
			КонецЕСли;
			
			// Данные реквизиты копируются в документ, так как влияют на прохождение.
			// Если в справочнике "ПодборкиСУЗ" они будут изменены в дальнейшем, то 
			// В документе останутся такими, как были на момент начала прохождения теста.
			ДокументСессии.ВремяТеста                    = ИсточникНастроек.ВремяТеста; 
			ДокументСессии.ПереходитьВпередАвтоматически = ИсточникНастроек.ПереходитьВпередАвтоматически;
			ДокументСессии.ПоказыватьНавигацию           = ИсточникНастроек.ПоказыватьНавигацию;
			
			// Примечание: Реквизит ПеремешиватьГруппыЭлементов переносить не нужно,
			// Так как группы перемешиваются один раз при создании документа.
			
			// Реквизит КоличествоГруппЭлементов вычисляется в дальнейшем по
			// Количеству записей в табличной части "ГруппыПодборки".
			
			Если Подборка.ВыбиратьЭлементыИзРубрикатора Тогда // Тест из рубрикатора
				
				ВопросыИзРубрикатора = Справочники.ПодборкиСУЗ.ВопросыИзРубрикатора(Подборка, Подборка.УчитыватьПредыдущиеПопытки, ИсточникНастроек.КоличествоГруппЭлементов, ПараметрыЭкспорта, КонтекстВыполнения);
				// Колонки таблицы: Ссылка, ВесВопроса, ТипВопроса
				
				// Удаляем повторяющиеся вопросы
				
				Сч = ВопросыИзРубрикатора.Количество();
				
				Пока Сч > 0 Цикл
					
					Строка = ВопросыИзРубрикатора.Получить(Сч - 1);
					
					Отбор = Новый Структура();
					Отбор.Вставить("Ссылка", Строка.Ссылка);
					
					ПовторяющиесяСтроки = ВопросыИзРубрикатора.НайтиСтроки(Отбор);
					
					Если ПовторяющиесяСтроки.Количество() > 1 Тогда
						ВопросыИзРубрикатора.Удалить(Сч - 1);
					КонецЕсли;
					
					Сч = Сч - 1;
					
				КонецЦикла;	
				
				// Определяем количество групп элементов подборки (страниц)
				// В дальнейшем будут выбрано только нужное количество групп
				// Элементов в соответствии с настройками теста.
				
				ИндексМассив = Новый Массив();
				ИндексМассив = ОбщегоНазначенияСУ.ИндексМассив(0, ВопросыИзРубрикатора.Количество(), ИсточникНастроек.ПеремешиватьГруппыЭлементов);
				
				Если ИсточникНастроек.КоличествоГруппЭлементов > 0
					И ИсточникНастроек.КоличествоГруппЭлементов < ВопросыИзРубрикатора.Количество() Тогда
					КоличествоВопросов = ИсточникНастроек.КоличествоГруппЭлементов;
				Иначе
					КоличествоВопросов = ИндексМассив.Количество();
				КонецЕсли;
				
				// Заполняем табличные части ГруппыПодборки и Вопросы документа ДокументСессии
				
				Для Н=0 По КоличествоВопросов-1 Цикл
					
					тСтрока        = ВопросыИзРубрикатора[ИндексМассив[Н]];
					СсылкаНаВопрос = тСтрока.Ссылка;
					
					// Примечание: в случае выбора вопросов из рубрикатора
					// В табличной части ГруппыПодборки содержатся ссылки на вопросы.
					
					НоваяДоступнаяГруппа = ДокументСессии.ГруппыПодборки.Добавить();
					НоваяДоступнаяГруппа.ГруппаПодборки = СсылкаНаВопрос;
					
					// Табличная часть Вопросы
					
					ВопросВДокументе = ДокументСессии.Вопросы.Добавить();
					ВопросВДокументе.ГруппаПодборки = СсылкаНаВопрос;
					ВопросВДокументе.Вопрос = СсылкаНаВопрос;
					ВопросВДокументе.ВесВопроса = тСтрока.ВесВопроса;
					ВопросВДокументе.ЭлементПодборкиИзРубрикатора = тСтрока.ЭлементПодборки;
					ВопросВДокументе.ПсихологическийВопрос = ?(СсылкаНаВопрос.ТипВопроса = Перечисления.ТипыВопросовСУЗ.ОдинИзМногихПсихологический
					ИЛИ СсылкаНаВопрос.ТипВопроса = Перечисления.ТипыВопросовСУЗ.МногиеИзМногихПсихологический, Истина, Ложь);
					
					
				КонецЦикла;
				
			Иначе // Статичный тест
				
				// Заполняем табличную часть "ГруппыПодборки".
				
				// Сначала получаем таблицу ГруппыПодборки,
				// На основе которой заполняем табличную часть ГруппыПодборки документа ДокументСессии.
				
				ГруппыПодборки = Справочники.ПодборкиСУЗ.ПолучитьГруппыЭлементовПодборки(Подборка, Подборка.УчитыватьПредыдущиеПопытки, ИсточникНастроек.КоличествоГруппЭлементов, КонтекстВыполнения);
				// Колонки таблицы: Ссылка, ЭтоГруппа, СсылкаНаОбъектСУЗ
				
				// Удаляем повторяющиеся вопросы для тех групп, которые связаны непосредственно с вопросом.
				
				Сч = ГруппыПодборки.Количество();
				
				Пока Сч > 0 Цикл
					
					Строка = ГруппыПодборки.Получить(Сч - 1);
					
					Отбор = Новый Структура();
					Отбор.Вставить("СсылкаНаОбъектСУЗ", Строка.СсылкаНаОбъектСУЗ);
					Отбор.Вставить("ЭтоГруппа", Ложь);
					
					ПовторяющиесяСтроки = ГруппыПодборки.НайтиСтроки(Отбор);
					
					Если ПовторяющиесяСтроки.Количество() > 1 Тогда
						ГруппыПодборки.Удалить(Сч - 1);
					КонецЕсли;
					
					Сч = Сч - 1;
					
				КонецЦикла;	
				
				// Определяем количество групп элементов подборки (страниц)
				// В дальнейшем будут выбрано только нужное количество групп
				// Элементов в соответствии с настройками теста.
				
				ИндексМассив = Новый Массив();
				ИндексМассив = ОбщегоНазначенияСУ.ИндексМассив(0, ГруппыПодборки.Количество(), ИсточникНастроек.ПеремешиватьГруппыЭлементов);
				
				Если ИсточникНастроек.КоличествоГруппЭлементов > 0
					И ИсточникНастроек.КоличествоГруппЭлементов < ГруппыПодборки.Количество() Тогда
					КоличествоГрупп = ИсточникНастроек.КоличествоГруппЭлементов;
				Иначе
					КоличествоГрупп = ИндексМассив.Количество();
				КонецЕсли;
				
				// Заполняем табличные части ГруппыПодборки и Вопросы документа ДокументСессии
				
				// Выбираем группы подборки первого уровня. Сохраняем их в табличной части ГруппыПодборки.
				// Затем из каждой группы будут выбраны вопросы, которые будут сохранены в табличной части Вопросы.
				
				Для Н=0 По КоличествоГрупп-1 Цикл
					НоваяДоступнаяГруппа = ДокументСессии.ГруппыПодборки.Добавить();
					НоваяДоступнаяГруппа.ГруппаПодборки = ГруппыПодборки.Получить(ИндексМассив[Н]).Ссылка;
				КонецЦикла;
				
				Если КоличествоГрупп <= ГруппыПодборки.Количество() Тогда
					ТаблицаДоступныхГрупп = ДокументСессии.ГруппыПодборки.Выгрузить();
				Иначе
					ТаблицаДоступныхГрупп = Неопределено;
				КонецЕсли;
				
				// Выбираем элементы подборки с вопросами теста, с учетом того,
				// Что вопросы должны быть из групп, выбранных перед этим.
				
				ЗапросВопросовПодборки = Новый Запрос();
				
				ЗапросВопросовПодборки.Текст = "ВЫБРАТЬ
				|	ЭлементыПодборкиСУЗ.Ссылка,
				|	ЭлементыПодборкиСУЗ.СсылкаНаОбъектСУЗ,
				|	ЭлементыПодборкиСУЗ.Родитель КАК Родитель,
				|	ЭлементыПодборкиСУЗ.Родитель.КоличествоВопросов КАК КоличествоВопросов,
				|	ЭлементыПодборкиСУЗ.Родитель.Родитель КАК РодительРодителя,
				|	ЭлементыПодборкиСУЗ.ВесВопроса,
				|	ВЫРАЗИТЬ(ЭлементыПодборкиСУЗ.СсылкаНаОбъектСУЗ КАК Справочник.ВопросыСУЗ).ТипВопроса КАК ТипВопроса
				|ИЗ
				|	Справочник.ЭлементыПодборкиСУЗ КАК ЭлементыПодборкиСУЗ
				|ГДЕ
				|	ЭлементыПодборкиСУЗ.Владелец = &Подборка
				|	И ЭлементыПодборкиСУЗ.ПометкаУдаления = ЛОЖЬ
				|	И ТИПЗНАЧЕНИЯ(ЭлементыПодборкиСУЗ.СсылкаНаОбъектСУЗ) = ТИП(Справочник.ВопросыСУЗ)";
				
				
				ЗапросВопросовПодборки.УстановитьПараметр("Подборка", Подборка); 
				
				ВсеВопросыПодборки = ЗапросВопросовПодборки.Выполнить().Выгрузить(); // Получаем все элементы подборки с вопросами
				
				// Удаляем вопросы, которые не попали в тест, то есть элемент подборки
				// Не входит в ТаблицаДоступныхГрупп и он не является родителем для элемента
				
				Сч = ВсеВопросыПодборки.Количество();
				
				Пока Сч > 0 Цикл
					
					Строка = ВсеВопросыПодборки.Получить(Сч - 1);
					
					ЭлементВходитВТест = Ложь;
					
					Если ТаблицаДоступныхГрупп.Найти(Строка.Ссылка, "ГруппаПодборки") <> Неопределено
						ИЛИ ТаблицаДоступныхГрупп.Найти(Строка.Родитель, "ГруппаПодборки") <> Неопределено
						ИЛИ ТаблицаДоступныхГрупп.Найти(Строка.РодительРодителя, "ГруппаПодборки") <> Неопределено Тогда
						
						ЭлементВходитВТест = Истина;
						
					КонецЕсли;
					
					Если НЕ ЭлементВходитВТест Тогда 
						ВсеВопросыПодборки.Удалить(Сч - 1);
					КонецЕсли;
					
					Сч = Сч - 1;
					
				КонецЦикла;	
				
				// Удаляем повторяющиеся вопросы.
				
				Сч = ВсеВопросыПодборки.Количество();
				
				Пока Сч > 0 Цикл
					
					Строка = ВсеВопросыПодборки.Получить(Сч - 1);
					
					Отбор = Новый Структура();
					Отбор.Вставить("СсылкаНаОбъектСУЗ", Строка.СсылкаНаОбъектСУЗ);
					
					ПовторяющиесяСтроки = ВсеВопросыПодборки.НайтиСтроки(Отбор);
					
					Если ПовторяющиесяСтроки.Количество() > 1 Тогда
						ВсеВопросыПодборки.Удалить(Сч - 1);
					КонецЕсли;
					
					Сч = Сч - 1;
					
				КонецЦикла;	
				
				// Удаляем открытые вопросы, если надо
				
				Если Подборка.ИсключитьОткрытыеВопросы Тогда
					
					Сч = ВсеВопросыПодборки.Количество();
					
					Пока Сч > 0 Цикл
						
						Строка = ВсеВопросыПодборки.Получить(Сч - 1);
						
						Если Строка.ТипВопроса = Перечисления.ТипыВопросовСУЗ.Открытый Тогда
							ВсеВопросыПодборки.Удалить(Сч - 1);
						КонецЕсли;
						
						Сч = Сч - 1;
						
					КонецЦикла;	
					
				КонецЕсли;
				
				// Удаляем группы без вопросов.
				// Такое может случиться, если были два одинаковых вопроса
				// В разных группах и при свертке один был удален, а группа осталась.
				
				// ВНИМАНИЕ! В этом случае тест может содержать меньше вопросов, чем
				// Указано в его настройках.
				
				Сч = ДокументСессии.ГруппыПодборки.Количество();
				
				Пока Сч > 0 Цикл
					
					Строка = ДокументСессии.ГруппыПодборки.Получить(Сч - 1);
					
					Если ВсеВопросыПодборки.Найти(Строка.ГруппаПодборки, "Ссылка") = Неопределено
						И ВсеВопросыПодборки.Найти(Строка.ГруппаПодборки, "Родитель") = Неопределено
						И ВсеВопросыПодборки.Найти(Строка.ГруппаПодборки, "РодительРодителя") = Неопределено Тогда
						
						ДокументСессии.ГруппыПодборки.Удалить(Сч - 1);
						
					КонецЕсли;
					
					Сч = Сч - 1;
					
				КонецЦикла;	
				
				// Заполняем табличную часть "Вопросы".
				
				// В этой таблице хранятся данные о том сколько уже для каждого родителя
				// В структуре элементов подборки размещено вопросов.
				ТаблицаОграниченияКоличестваВопросов = Новый ТаблицаЗначений();
				ТаблицаОграниченияКоличестваВопросов.Колонки.Добавить("Родитель");
				ТаблицаОграниченияКоличестваВопросов.Колонки.Добавить("КоличествоРазмещенныхВопросов");
				ТаблицаОграниченияКоличестваВопросов.Колонки.Добавить("ДопустимоеКоличествоВопросов");		
				
				КоличествоВопросов = ВсеВопросыПодборки.Количество();
				ИндексМассив = ОбщегоНазначенияСУ.ИндексМассив(0, КоличествоВопросов, Истина);
				
				Для Сч=0 По КоличествоВопросов-1 Цикл
					
					иВопрос = ВсеВопросыПодборки.Получить(ИндексМассив[Сч]);
					
					// Примечание: ГруппаВТЧ содержит только группы верхнего уровня подборки, которые образуют страницы подборки
					// или страницами могут быть сами элементы, если они размещены на верхнем уровне подборки.
					
					ГруппаВТЧ = ДокументСессии.ГруппыПодборки.Найти(иВопрос.Ссылка, "ГруппаПодборки"); // Если вопрос на первом уровне иерархии и сам является группой.
					
					Если ГруппаВТЧ = Неопределено Тогда // Если вопрос принадлежит группе
						
						ГруппаВТЧ = ДокументСессии.ГруппыПодборки.Найти(иВопрос.Родитель, "ГруппаПодборки"); // Вопрос находится в группе.
						
						Если ГруппаВТЧ = Неопределено Тогда
							ГруппаВТЧ = ДокументСессии.ГруппыПодборки.Найти(иВопрос.РодительРодителя, "ГруппаПодборки"); // Вопрос в подгруппе.
						КонецЕсли;
						
						// Находим сколько уже вопросов из данной группы размещено и можно ли добавлять вопрос.
						
						РодительВТаблице = ТаблицаОграниченияКоличестваВопросов.Найти(иВопрос.Родитель, "Родитель");
						
						Если РодительВТаблице = Неопределено Тогда
							
							РодительВТаблице = ТаблицаОграниченияКоличестваВопросов.Добавить();
							РодительВТаблице.Родитель                      = иВопрос.Родитель;
							РодительВТаблице.КоличествоРазмещенныхВопросов = 0;
							
							Если ПараметрыЭкспорта = Неопределено Тогда
								РодительВТаблице.ДопустимоеКоличествоВопросов  = иВопрос.КоличествоВопросов;
							Иначе
								РодительВТаблице.ДопустимоеКоличествоВопросов = 0;
							КонецЕсли;
							
						КонецЕсли;
						
						Если РодительВТаблице.ДопустимоеКоличествоВопросов = 0
							ИЛИ РодительВТаблице.КоличествоРазмещенныхВопросов < РодительВТаблице.ДопустимоеКоличествоВопросов Тогда
							РодительВТаблице.КоличествоРазмещенныхВопросов = РодительВТаблице.КоличествоРазмещенныхВопросов + 1;	
						Иначе 
							Продолжить; // Нельзя размещать вопрос, переходим к следующему
						КонецЕсли;
						
					КонецЕсли;
					
					ВопросВДокументе = ДокументСессии.Вопросы.Добавить();
					
					ВопросВДокументе.Вопрос                = иВопрос.СсылкаНаОбъектСУЗ;
					ВопросВДокументе.ВесВопроса            = иВопрос.ВесВопроса;
					ВопросВДокументе.ГруппаПодборки        = ГруппаВТЧ.ГруппаПодборки;
					ВопросВДокументе.ПсихологическийВопрос = ?(иВопрос.СсылкаНаОбъектСУЗ.ТипВопроса = Перечисления.ТипыВопросовСУЗ.ОдинИзМногихПсихологический
					ИЛИ иВопрос.СсылкаНаОбъектСУЗ.ТипВопроса = Перечисления.ТипыВопросовСУЗ.МногиеИзМногихПсихологический, Истина, Ложь);
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если ПараметрыЭкспорта = Неопределено Тогда // Обычное прохождение
				
				ДокументСессии.Записать(РежимЗаписиДокумента.Проведение); // Проводим документ. Потом он будет проведен при окончании теста.
				
				НомерДокумента = ДокументСессии.Номер;
				
			Иначе // Экспорт
				
				РезультатДействия.ДокументСессииОбъект = ДокументСессии;
				
				НомерДокумента = -1; // Условный номер для процедуры экспорта
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ДокументСессии.НазначениеТестирования)
				ИЛИ ДокументСессии.НазначениеТестирования = Перечисления.НазначенияТестированийСУЗ.Аттестация Тогда
				
				РезультатДействия.ВыполняетсяТестирование = Истина;
				РезультатДействия.СессияТестирования      = НомерДокумента;
				
			КонецЕсли;
			
			РезультатДействия.АдресОбъекта = "?" + "id=" + id + "&object=collection&window=this&numGroup=1&numDocument=" + Формат(НомерДокумента, "ЧГ=0");
			
		КонецЕсли;
		
		////////////////////////////////////////////////////////////////////////////////
		// submitQuestion, getHelpQuestion, repeatQuestion, saveScoreTeacher
		// Обрабатывается ответ на вопрос
		
		Если ДействиеСсылки = "submitQuestion" // Ответ на вопрос
			ИЛИ ДействиеСсылки = "getHelpQuestion" // Получение подсказки
			ИЛИ ДействиеСсылки = "repeatQuestion" // Запрос на повторный ответ
			ИЛИ ДействиеСсылки = "saveScoreTeacher" // Оценка преподавателем вопроса
			Тогда
			
			НомерДокументаОтветаНаВопрос = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "numAnswerDocument");
			СсылкаНаДокументОтветаНаВопрос = Документы.ОтветНаВопросСУЗ.НайтиПоНомеру(Число(НомерДокументаОтветаНаВопрос));
			
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.ОтветНаВопросСУЗ");
			ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", СсылкаНаДокументОтветаНаВопрос);
			ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
			БлокировкаДанных.Заблокировать();
			
			ДокументОтветаНаВопрос = СсылкаНаДокументОтветаНаВопрос.ПолучитьОбъект();
			
			// submitQuestion
			Если ДействиеСсылки = "submitQuestion" Тогда
				
				РезультатОбработки = ДокументОтветаНаВопрос.ОбработатьОтветНаВопрос(ПараметрыСсылки, КонтекстВыполнения, ПоставщикСводаЗнаний);
				
				Если РезультатОбработки.Код = 0 ИЛИ РезультатОбработки.Код = 7 Тогда
					
					numGroup    = Справочники.ПодборкиСУЗ.НомерСтраницы(ПараметрыСсылки);
					numDocument = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки,"numDocument");
					
					Если НЕ ПустаяСтрока(numGroup) И НЕ ПустаяСтрока(numDocument) Тогда
						
						numGroup = Число(numGroup);
						numDocument = Число(numDocument);
						
						ПервоначальныйNumGroup = numGroup;
						
						БлокировкаДанных = Новый БлокировкаДанных;
						ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.ПопыткаВыполненияПодборкиВопросовСУЗ");
						ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", ДокументОтветаНаВопрос.СессияВыполненияТеста);
						ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
						БлокировкаДанных.Заблокировать();						
						
						ДокументСессии = ДокументОтветаНаВопрос.СессияВыполненияТеста.ПолучитьОбъект(); // Блокировка выше
						
						Если НЕ ЗначениеЗаполнено(ДокументСессии.НазначениеТестирования)
							ИЛИ ДокументСессии.НазначениеТестирования = Перечисления.НазначенияТестированийСУЗ.Аттестация Тогда
							
							РезультатДействия.ВыполняетсяТестирование = Истина;
							РезультатДействия.СессияТестирования = ДокументСессии.Номер;
							
						КонецЕсли;
						
						ГруппаВТЧ = ДокументСессии.ГруппыПодборки.Получить(numGroup - 1);
						
						ВсеВопросыГруппыОтвечены = ДокументСессии.ВсеВопросыГруппыОтвечены(ГруппаВТЧ.ГруппаПодборки);
						
						ТребуетсяЗаписатьДокументСессии = Ложь;
						
						Если ГруппаВТЧ.ВсеВопросыОтвечены <> ВсеВопросыГруппыОтвечены Тогда
							ГруппаВТЧ.ВсеВопросыОтвечены = ВсеВопросыГруппыОтвечены;
							ТребуетсяЗаписатьДокументСессии = Истина;
						КонецЕсли;
						
						ВопросыГруппыТребуютПроверки = ДокументСессии.ВопросыГруппыТребуютПроверки(ГруппаВТЧ.ГруппаПодборки);
						Если ГруппаВТЧ.ЕстьВопросыНаПроверку <> ВопросыГруппыТребуютПроверки Тогда
							ГруппаВТЧ.ЕстьВопросыНаПроверку = ВопросыГруппыТребуютПроверки;
							ТребуетсяЗаписатьДокументСессии = Истина;
						КонецЕсли;
						
						Если ТребуетсяЗаписатьДокументСессии Тогда
							ДокументСессии.Записать();
						КонецЕсли;
						
						ПоказатьСледующийВопрос = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "AutoNext");
						
						Если ПоказатьСледующийВопрос = "true" И ВсеВопросыГруппыОтвечены Тогда
							
							// Учитываем, что автоматически мы можем двигаться вперед,
							// Если еще не дошли до последнего вопроса или скрыта навигация.
							
							// Если навигация отображается, то пользовать сам должен закончить тест.
							
							// В режиме симуляции это правило не действует.
							
							Если numGroup < ДокументСессии.ГруппыПодборки.Количество()
								ИЛИ НЕ ДокументСессии.ПоказыватьНавигацию
								ИЛИ Симуляция Тогда
								
								numGroup = numGroup + 1;
								
							КонецЕсли;
							
						КонецЕсли;
						
						// Если ПоказатьСледующийВопрос = "true" И НЕ ДокументСессии.ПоказыватьНавигацию Тогда
						// 	РезультатДействия.НеЗаписыватьВИсториюПереходСсылке = Истина;
						// КонецЕсли;
						
						idПодборки = ДокументСессии.Подборка.УникальныйИдентификатор();
						
						Если numGroup <> ПервоначальныйNumGroup Тогда
							РезультатДействия.АдресОбъекта = "?" + "id=" + idПодборки + "&object=collection&window=this&numGroup="+ Формат(numGroup, "ЧГ=0") +"&numDocument=" + Формат(numDocument, "ЧГ=0");
							// РезультатДействия.НеЗаписыватьВИсториюПереходСсылке = Истина;
						КонецЕсли;
						
						Если numGroup > ДокументСессии.ГруппыПодборки.Количество() ИЛИ РезультатОбработки.Код = 7 Тогда
							РезультатДействия.АдресОбъекта = "?" + "id=" + idПодборки + "&object=collection&window=this&numGroup=-1&numDocument=" + Формат(numDocument, "ЧГ=0");
							// РезультатДействия.НеЗаписыватьВИсториюПереходСсылке = Истина;
						КонецЕсли;
						
						// Если нет ссылки для перехода, то страница будет обновлена.
						
						// Элементы содержания для повторного изучения
						
						РезультатДействия.ПовторноеПрохождение = РегистрыСведений.ПовторноеПрохождениеЭлектронныхРесурсовСУЗ.ЭлементыСодержанияРегистратора(ДокументОтветаНаВопрос.Ссылка);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли; // submitQuestion
			
			// submitQuestion
			Если ДействиеСсылки = "getHelpQuestion" Тогда
				РезультатОбработки = ДокументОтветаНаВопрос.ОбработатьПолучениеПодсказки(ПараметрыСсылки);
				// Так как нет ссылки для перехода и сообщения, то страница будет просто обновлена.
			КонецЕсли;
			
			Если ДействиеСсылки = "repeatQuestion" Тогда
				РезультатОбработки = ДокументОтветаНаВопрос.ОбработатьЗапросНаПовторныйОтвет(ПараметрыСсылки);
				// Страница будет обновлена
			КонецЕсли;
			
			Если ДействиеСсылки = "saveScoreTeacher" Тогда
				
				РезультатОбработки = ДокументОтветаНаВопрос.ОбработатьОценкуПреподавателя(ПараметрыСсылки, КонтекстВыполнения);
				
				numGroup    = Справочники.ПодборкиСУЗ.НомерСтраницы(ПараметрыСсылки);
				numDocument = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки,"numDocument");
				
				Если НЕ ПустаяСтрока(numGroup) И НЕ ПустаяСтрока(numDocument) Тогда
					
					numGroup = Число(numGroup);
					numDocument = Число(numDocument);
					
					БлокировкаДанных = Новый БлокировкаДанных;
					ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.ПопыткаВыполненияПодборкиВопросовСУЗ");
					ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", ДокументОтветаНаВопрос.СессияВыполненияТеста);
					ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
					БлокировкаДанных.Заблокировать();
					
					
					ДокументСессии = ДокументОтветаНаВопрос.СессияВыполненияТеста.ПолучитьОбъект();
					
					ГруппаВТЧ = ДокументСессии.ГруппыПодборки.Получить(numGroup - 1);
					ГруппаВТЧ.ЕстьВопросыНаПроверку = ДокументСессии.ВопросыГруппыТребуютПроверки(ГруппаВТЧ.ГруппаПодборки);
					
					ДокументСессии.ЗакрытьСессию();
					ДокументСессии.Записать(РежимЗаписиДокумента.Проведение);
					
				КонецЕсли;
				
				// Страница будет обновлена
				
			КонецЕсли;
			
			Если РезультатОбработки.Код <> 0 Тогда
				
				РезультатДействия.ТекстСообщения = РезультатОбработки.Текст;
				
				Если РезультатОбработки.Свойство("Форма") Тогда
					РезультатДействия.Форма = РезультатОбработки.Форма;
				КонецЕсли;
				
			КонецЕсли;
			
			// Устанавливаем якорь
			
			СледуетУстановитьЯкорьВопроса = Истина;
			
			Если ЗначениеЗаполнено(КонтекстВыполнения.АдресЗагруженногоОбъекта) Тогда
				
				СтруктураАдресаЗагруженногоОбъекта = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(КонтекстВыполнения.АдресЗагруженногоОбъекта);
				
				ИмяЗагруженногоОбъекта           = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураАдресаЗагруженногоОбъекта, "object");
				ИдентификаторЗагруженногоОбъекта = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураАдресаЗагруженногоОбъекта, "id");
				
				Если ИмяЗагруженногоОбъекта = "collection" Тогда
					
					Подборка = ПолучитьСсылкуПоИдентификатору(ИмяЗагруженногоОбъекта, ИдентификаторЗагруженногоОбъекта);
					
					ТипНавигацииПодборки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подборка, "ТипНавигации");
					
					Если ТипНавигацииПодборки = Перечисления.ТипыНавигацииПодборкиСУЗ.Слайды Тогда
						СледуетУстановитьЯкорьВопроса = Ложь;	
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если СледуетУстановитьЯкорьВопроса Тогда
				РезультатДействия.Якорь = "questionForm_" + СтрЗаменить(ПараметрыСсылки.id, "-", "");
			КонецЕсли;
			
		КонецЕсли;
		
		////////////////////////////////////////////////////////////////////////////////
		// addAttempt Добавляется попытка к тесту.
		
		Если ДействиеСсылки = "addAttempt" Тогда
			
			ИмяОбъектаСУЗ = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "object");
			id            = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "id");
			
			Подборка = ПолучитьСсылкуПоИдентификатору(ИмяОбъектаСУЗ, id);
			
			ДобавившийПользователь = ОбъектыСУЗ.ТекущийПользователь(КонтекстВыполнения);		
			Пользователь           = ДобавившийПользователь; // Кому добавляем
			
			ЭлектронныеРесурсыПереопределяемый.ПередДобавлениемПопыткиТестирования(Пользователь, СводЗнаний, Подборка, ПрохождениеОбучения, Задание); 		
			
			Период = ТекущаяДата();
			
			НаборЗаписей = РегистрыСведений.ДополнительныеПопыткиПрохожденияТестовСУЗ.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.Период.Установить(Период);
			НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
			НаборЗаписей.Отбор.ЭлементСодержания.Установить(ЭлементСодержания);
			НаборЗаписей.Отбор.ПрохождениеОбучения.Установить(ПрохождениеОбучения);
			НаборЗаписей.Отбор.Задание.Установить(Задание);
			НаборЗаписей.Отбор.Тест.Установить(Подборка);
			
			НоваяЗапись = НаборЗаписей.Добавить();
			
			НоваяЗапись.Период                 = Период;
			НоваяЗапись.Пользователь           = Пользователь;
			НоваяЗапись.ЭлементСодержания      = ЭлементСодержания;
			НоваяЗапись.ПрохождениеОбучения    = ПрохождениеОбучения;
			НоваяЗапись.Задание                = Задание;
			НоваяЗапись.Тест                   = Подборка;
			
			НоваяЗапись.ДобавившийПользователь = ДобавившийПользователь;
			НоваяЗапись.ЭлектронныйРесурс      = СводЗнаний;
			
			НаборЗаписей.Записать();
			
			ЭлектронныеРесурсыПереопределяемый.ПослеДобавленияПопыткиТестирования(Пользователь, СводЗнаний, Подборка, ПрохождениеОбучения, Задание); 		
			
		КонецЕсли;
		
		////////////////////////////////////////////////////////////////////////////////
		// SCORequest (действия объектов SCORM)
		
		Если ДействиеСсылки = "SCORequest" Тогда
			
			КодОшибки = 0;
			
			ИмяЗапроса  = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "nameRequest");
			НомерСессии = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "numSession");
			
			Если ЗначениеЗаполнено(НомерСессии) Тогда
				ДокументПопыткиСсылка = Документы.ПопыткаВыполненияАктивногоРесурсаSCORM.НайтиПоНомеру(Число(НомерСессии));	
			КонецЕсли;
			
			ИмяОбъектаСУЗ     = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки,"object");
			id                = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки,"id");
			РесурсСсылка      = ПолучитьСсылкуПоИдентификатору(ИмяОбъектаСУЗ, id);
			Пользователь      = ОбъектыСУЗ.ТекущийПользователь(КонтекстВыполнения);
			
			//
			// Инициализация сессии (Initialize)
			//
			
			Если ИмяЗапроса = "Initialize" Тогда
				
				ПараметрЗапроса = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "request");
				
				Если ЗначениеЗаполнено(ПараметрЗапроса) Тогда
					
					КодОшибки = 201;
					
				Иначе
					
					Если ЗначениеЗаполнено(НомерСессии) Тогда
						
						КодОшибки = 103;
						
					Иначе
						
						// Ищем незавершенную попытку
						
						ПопыткаАктивногоРесурсаСсылка = ОбъектыSCORM.ПолучитьНезавершеннуюПопыткуВыполненияОбъектаSCORM(Пользователь, СводЗнаний, ЭлементСодержания, РесурсСсылка, ПрохождениеОбучения, Задание);
						
						Если ЗначениеЗаполнено(ПопыткаАктивногоРесурсаСсылка) Тогда
							
							БлокировкаДанных = Новый БлокировкаДанных;
							ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.ПопыткаВыполненияАктивногоРесурсаSCORM");
							ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", ПопыткаАктивногоРесурсаСсылка);
							ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
							БлокировкаДанных.Заблокировать();

							
							ДокументПопыткиОбъект = ПопыткаАктивногоРесурсаСсылка.ПолучитьОбъект();
							
						Иначе
							
							// Создаем новую попытку
							
							ДокументПопыткиОбъект = Документы.ПопыткаВыполненияАктивногоРесурсаSCORM.СоздатьДокумент();
							
							ДокументПопыткиОбъект.Дата                          = ТекущаяДата();
							ДокументПопыткиОбъект.Пользователь                  = Пользователь;
							ДокументПопыткиОбъект.Ресурс                        = РесурсСсылка;
							ДокументПопыткиОбъект.СводЗнаний                    = СводЗнаний;
							ДокументПопыткиОбъект.ПрохождениеОбучения           = ПрохождениеОбучения;
							ДокументПопыткиОбъект.Задание                       = Задание;
							ДокументПопыткиОбъект.ЭлементСодержанияСводаЗнаний  = ЭлементСодержания;
							ДокументПопыткиОбъект.ДатаНачалаВыполнения          = ТекущаяДата();
							ДокументПопыткиОбъект.СостояниеВыполнения           = Перечисления.СостоянияВыполненияОбъектовSCORM.unknown;
							ДокументПопыткиОбъект.СостояниеПрохождения          = Перечисления.СостоянияПрохожденияОбъектовSCORM.unknown;
							
						КонецЕсли;
						
						НоваяСессияСтрока = ДокументПопыткиОбъект.Сессии.Добавить();
						НоваяСессияСтрока.ДатаИнициализации = ТекущаяДатаСеанса();
						
						ДокументПопыткиОбъект.Записать(РежимЗаписиДокумента.Проведение);
						
						НомерСессии = ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(ДокументПопыткиОбъект.Номер);
						
						// Создаем структуру данных
						
						СтруктураДанныхXDTO = ОбъектыSCORM.ПолучитьМодельДанныхПопыткиОбъектаSCORM(ДокументПопыткиОбъект, КонтекстВыполнения, НЕ ЗначениеЗаполнено(ПопыткаАктивногоРесурсаСсылка));
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли; // Initialize
			
			//
			// Запись данных (Commit)
			// Примечание: запись данных выполняется и при вызове Terminate.
			//
			
			Если ИмяЗапроса = "Commit" ИЛИ ИмяЗапроса = "Terminate" Тогда
				
				ТаблицаСтатистикиПараметровSCORM = Перечисления.ИспользуемыеПараметрыSCORM.НоваяТаблицаСтатистикиПараметровSCORM();
				
				ЗапросНаСохранение = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "request");
				
				Если ДокументПопыткиСсылка = Неопределено Тогда
					
					КодОшибки = 142;
					
				Иначе
					
					Если ЗапросНаСохранение <> Неопределено Тогда
						
						Если ТипЗнч(ЗапросНаСохранение) = Тип("Строка") Тогда
							МассивЗначений = Новый Массив();
							МассивЗначений.Добавить(ЗапросНаСохранение);
						Иначе
							МассивЗначений = ЗапросНаСохранение;
						КонецЕсли;
						
						БлокировкаДанных = Новый БлокировкаДанных;
						ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.ПопыткаВыполненияАктивногоРесурсаSCORM");
						ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", ДокументПопыткиСсылка);
						ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
						БлокировкаДанных.Заблокировать();

						
						ДокументПопыткиОбъект = ДокументПопыткиСсылка.ПолучитьОбъект();	
						
						// Перебираем значения для сохранения.
						Для каждого ЗначениеЗапроса Из МассивЗначений Цикл
							
							ЗначениеЗадано = Истина;
							
							ПозицияРазделителя = Найти(ЗначениеЗапроса, "==");
							
							Если ПозицияРазделителя = 0 Тогда
								ИмяСохраняемогоЗначенияСтрока = ЗначениеЗапроса;
								ЗначениеСохраняемогоЗначения  = "";
								ЗначениеЗадано = Ложь;
							Иначе
								ИмяСохраняемогоЗначенияСтрока = Сред(ЗначениеЗапроса, 1, ПозицияРазделителя-1);
								ЗначениеСохраняемогоЗначения  = Сред(ЗначениеЗапроса, ПозицияРазделителя+2, СтрДлина(ЗначениеЗапроса)-ПозицияРазделителя-1);
							КонецЕсли;
							
							ИмяСохраняемогоЗначения = ОбщегоНазначенияСУКлиентСервер.РасщепитьСтроку(ИмяСохраняемогоЗначенияСтрока, "."); // Массив
							
							Если ИмяСохраняемогоЗначения.Количество() > 1 Тогда
								
								// cmi
								
								Если ИмяСохраняемогоЗначения[0] = "cmi" Тогда
									
									// completion_status
									Если ИмяСохраняемогоЗначения[1] = "completion_status" Тогда
										
										ПереданоСОшибкой = Ложь;
										
										Попытка
											ДокументПопыткиОбъект.СостояниеВыполнения = Перечисления.СостоянияВыполненияОбъектовSCORM[СтрЗаменить(ЗначениеСохраняемогоЗначения, " ", "")];
										Исключение
											ПереданоСОшибкой = Истина;
											КодОшибки = 101;											
											ТекстСообщения = "Невозможно интерпретировать переданное значение состояния объекта.";
										КонецПопытки;
										
										Перечисления.ИспользуемыеПараметрыSCORM.ДобавитьСтрокуВТаблицуСтатистики(
											ТаблицаСтатистикиПараметровSCORM,
											Неопределено,
											Неопределено,
											Перечисления.ИспользуемыеПараметрыSCORM.completion_status,
											ЗначениеЗаполнено(ЗначениеСохраняемогоЗначения),
											ПереданоСОшибкой,
											ЗначениеСохраняемогоЗначения);
												
									КонецЕсли;
									
									// location
									Если ИмяСохраняемогоЗначения[1] = "location" Тогда
										ДокументПопыткиОбъект.ТекущееПоложение = ЗначениеСохраняемогоЗначения;
									КонецЕсли;
									
									// suspend_data
									Если ИмяСохраняемогоЗначения[1] = "suspend_data" Тогда
										ДокументПопыткиОбъект.ДанныеПопытки = ЗначениеСохраняемогоЗначения;
									КонецЕсли;
									
									// progress_measure
									Если ИмяСохраняемогоЗначения[1] = "progress_measure" Тогда
										
										ПереданоСОшибкой = Ложь;

										Попытка
											ДокументПопыткиОбъект.ПроцентВыполнения = Число(ЗначениеСохраняемогоЗначения);
										Исключение
											КодОшибки = 101;
											ТекстСообщения = "Невозможно интерпретировать переданное значение процента выполнения (progress_measure).";
											ПереданоСОшибкой = Истина;
										КонецПопытки;
																				
										Перечисления.ИспользуемыеПараметрыSCORM.ДобавитьСтрокуВТаблицуСтатистики(
											ТаблицаСтатистикиПараметровSCORM,
											Неопределено,
											Неопределено,
											Перечисления.ИспользуемыеПараметрыSCORM.progress_measure,
											ЗначениеЗаполнено(ЗначениеСохраняемогоЗначения),
											ПереданоСОшибкой,
											ЗначениеСохраняемогоЗначения); 											
											
									КонецЕсли;
									
									// session_time
									Если ИмяСохраняемогоЗначения[1] = "session_time" Тогда
										
										ПереданоСОшибкой = Ложь;
										
										Попытка
											КоличествоСекунд = ОбъектыSCORM.ПолучитьКоличествоСекундВременногоИнтервалаSCORM(ЗначениеСохраняемогоЗначения);
										Исключение
											КодОшибки = 406;
											ТекстСообщения = "Невозможно интерпретировать переданный временной интервал.";
											ПереданоСОшибкой = Истина;
										КонецПопытки;
																			
										Перечисления.ИспользуемыеПараметрыSCORM.ДобавитьСтрокуВТаблицуСтатистики(
											ТаблицаСтатистикиПараметровSCORM,
											Неопределено,
											Неопределено,
											Перечисления.ИспользуемыеПараметрыSCORM.session_time,
											ЗначениеЗаполнено(ЗначениеСохраняемогоЗначения),
											ПереданоСОшибкой,
											ЗначениеСохраняемогоЗначения); 										
											
										ДокументПопыткиОбъект.ПродолжительностьПоследнейСессии = ЗначениеСохраняемогоЗначения;
										
									КонецЕсли;
									
									// exit
									Если ИмяСохраняемогоЗначения[1] = "exit" Тогда
										
										ДокументПопыткиОбъект.ПричинаВыхода = ЗначениеСохраняемогоЗначения;
										
										Перечисления.ИспользуемыеПараметрыSCORM.ДобавитьСтрокуВТаблицуСтатистики(
											ТаблицаСтатистикиПараметровSCORM,
											Неопределено,
											Неопределено,
											Перечисления.ИспользуемыеПараметрыSCORM.exit,
											ЗначениеЗаполнено(ЗначениеСохраняемогоЗначения),
											Ложь,
											ЗначениеСохраняемогоЗначения);
											
									КонецЕсли;
									
									// success_status
									Если ИмяСохраняемогоЗначения[1] = "success_status" Тогда
										
										ПереданоСОшибкой = Ложь;
										
										Попытка
											ДокументПопыткиОбъект.СостояниеПрохождения = Перечисления.СостоянияПрохожденияОбъектовSCORM[ЗначениеСохраняемогоЗначения];
										Исключение
											КодОшибки = 101;
											ТекстСообщения = "Невозможно интерпретировать переданное значение состояния прохождения объекта (success_status) (101).";
											ПереданоСОшибкой = Истина;
										КонецПопытки;										
										
										Перечисления.ИспользуемыеПараметрыSCORM.ДобавитьСтрокуВТаблицуСтатистики(
											ТаблицаСтатистикиПараметровSCORM,
											Неопределено,
											Неопределено,
											Перечисления.ИспользуемыеПараметрыSCORM.success_status,
											ЗначениеЗаполнено(ЗначениеСохраняемогоЗначения),
											ПереданоСОшибкой,
											ЗначениеСохраняемогоЗначения);																				
										
									КонецЕсли;
									
									// score
									Если ИмяСохраняемогоЗначения[1] = "score" Тогда
										
										Передано = Ложь;
										ПереданоСОшибкой = Ложь;
										
										Если ИмяСохраняемогоЗначения[2] = "scaled" Тогда
											
											Если ЗначениеЗаполнено(ЗначениеСохраняемогоЗначения) Тогда
												
												Передано = Истина;
												
												Попытка
													ДокументПопыткиОбъект.РезультатВПроцентах = Число(ЗначениеСохраняемогоЗначения);
												Исключение
													КодОшибки = 407;
													ТекстСообщения = "Невозможно интерпретировать переданное значение оценки в процентах (score.scaled) (407).";
													ПереданоСОшибкой = Истина;
												КонецПопытки;
												
											Иначе
												
												ДокументПопыткиОбъект.РезультатВПроцентах = 0;
												
											КонецЕсли;											
											
										КонецЕсли;
										
										Если ИмяСохраняемогоЗначения[2] = "min" Тогда
											
											Если ЗначениеЗаполнено(ЗначениеСохраняемогоЗначения) Тогда
												
												Передано = Истина;
												
												Попытка
													ДокументПопыткиОбъект.МинимальноВозможныйРезультат = Число(ЗначениеСохраняемогоЗначения);
												Исключение
													КодОшибки = 407;
													ТекстСообщения = "Невозможно интерпретировать переданное значение минимально возможного результата (score.min) (407).";
													ПереданоСОшибкой = Истина;
												КонецПопытки;
												
											Иначе
												
												ДокументПопыткиОбъект.МинимальноВозможныйРезультат = 0;
												
											КонецЕсли;
											
											
										КонецЕсли;
										
										Если ИмяСохраняемогоЗначения[2] = "max" Тогда
											
											Если ЗначениеЗаполнено(ЗначениеСохраняемогоЗначения) Тогда
												
												Передано = Истина;
												
												Попытка
													ДокументПопыткиОбъект.МаксимальноВозможныйРезультат = Число(ЗначениеСохраняемогоЗначения);
												Исключение
													КодОшибки = 407;
													ТекстСообщения = "Невозможно интерпретировать переданное значение максимально возможного результата (score.min) (407).";
													ПереданоСОшибкой = Истина;
												КонецПопытки;
												
											Иначе
												
												ДокументПопыткиОбъект.МаксимальноВозможныйРезультат = 0;
												
											КонецЕсли;
											
										КонецЕсли;
										
										Если ИмяСохраняемогоЗначения[2] = "raw" Тогда
											
											Если ЗначениеЗаполнено(ЗначениеСохраняемогоЗначения) Тогда
												
												Передано = Истина;
												
												Попытка
													ДокументПопыткиОбъект.Результат = Число(ЗначениеСохраняемогоЗначения);
												Исключение
													КодОшибки = 407;
													ТекстСообщения = "Невозможно интерпретировать переданное значение оценки (score.scaled) (407).";
													ПереданоСОшибкой = Истина;
												КонецПопытки;
												
											Иначе
												
												ДокументПопыткиОбъект.Результат = 0;
												
											КонецЕсли;
											
										КонецЕсли;
																				
										Перечисления.ИспользуемыеПараметрыSCORM.ДобавитьСтрокуВТаблицуСтатистики(
											ТаблицаСтатистикиПараметровSCORM,
											Неопределено,
											Неопределено,
											Перечисления.ИспользуемыеПараметрыSCORM.score,
											Передано,
											ПереданоСОшибкой,
											ЗначениеСохраняемогоЗначения);
										
									КонецЕсли; // score
									
									
									// comments_from_learner
									Если ИмяСохраняемогоЗначения[1] = "comments_from_learner" Тогда
										
										Попытка
											НомерКомментария = Число(ИмяСохраняемогоЗначения[2]);
										Исключение
											НомерКомментария = Неопределено;
										КонецПопытки;
										
										Если НомерКомментария <> Неопределено Тогда
											
											ЗаписьТчКомментария = ДокументПопыткиОбъект.КомментарииПользователей.Найти(НомерКомментария, "Номер");
											
											Если ЗаписьТчКомментария = Неопределено Тогда
												ЗаписьТчКомментария = ДокументПопыткиОбъект.КомментарииПользователей.Добавить();
												ЗаписьТчКомментария.Номер = НомерКомментария;
											КонецЕсли;
											
											Если ИмяСохраняемогоЗначения[3] = "comment" Тогда
												ЗаписьТчКомментария.Текст = ЗначениеСохраняемогоЗначения;
											КонецЕсли;
											
											Если ИмяСохраняемогоЗначения[3] = "location" Тогда
												ЗаписьТчКомментария.ТекущееПоложение = ЗначениеСохраняемогоЗначения;
											КонецЕсли;
											
											Если ИмяСохраняемогоЗначения[3] = "timestamp" Тогда
												ЗаписьТчКомментария.ДатаИзменения = ЗначениеСохраняемогоЗначения;
											КонецЕсли;
											
										Иначе
											КодОшибки = 101;
											ТекстСообщения = "Невозможно получить номер комментария.";
										КонецЕсли;
										
									КонецЕсли;
									
									// interactions
									Если ИмяСохраняемогоЗначения[1] = "interactions" Тогда
										
										Попытка
											НомерИнтерактивности = Число(ИмяСохраняемогоЗначения[2]);
										Исключение
											НомерИнтерактивности = Неопределено;
										КонецПопытки;
										
										Если НомерИнтерактивности <> Неопределено Тогда
											
											ЗаписьТчИнтерактивности = ДокументПопыткиОбъект.Интерактивности.Найти(НомерИнтерактивности, "Номер");
											
											Если ЗаписьТчИнтерактивности = Неопределено Тогда
												ЗаписьТчИнтерактивности = ДокументПопыткиОбъект.Интерактивности.Добавить();
												ЗаписьТчИнтерактивности.Номер = НомерИнтерактивности;
											КонецЕсли;
											
											Если ИмяСохраняемогоЗначения[3] = "id" Тогда
												ЗаписьТчИнтерактивности.Идентификатор = ЗначениеСохраняемогоЗначения;
											КонецЕсли;
											
											Если ИмяСохраняемогоЗначения[3] = "type" Тогда
												ЗаписьТчИнтерактивности.Тип = ЗначениеСохраняемогоЗначения;
											КонецЕсли;
											
											Если ИмяСохраняемогоЗначения[3] = "timestamp" Тогда
												ЗаписьТчИнтерактивности.ДатаИзменения = ЗначениеСохраняемогоЗначения;
											КонецЕсли;
											
											Если ИмяСохраняемогоЗначения[3] = "weighting" Тогда
												Попытка
													ЗаписьТчИнтерактивности.ВесОценки = Число(ЗначениеСохраняемогоЗначения);
												Исключение
													КодОшибки = 406;
													ТекстСообщения = "Вес оценки не является числом.";
												КонецПопытки;
											КонецЕсли;
											
											Если ИмяСохраняемогоЗначения[3] = "learner_response" Тогда
												ЗаписьТчИнтерактивности.ОтветПользователя = ЗначениеСохраняемогоЗначения;
											КонецЕсли;
											
											Если ИмяСохраняемогоЗначения[3] = "result" Тогда
												Попытка
													ЗаписьТчИнтерактивности.Результат = Число(ЗначениеСохраняемогоЗначения);
												Исключение
													ЗаписьТчИнтерактивности.Результат = ЗначениеСохраняемогоЗначения;
												КонецПопытки;
											КонецЕсли;
											
											Если ИмяСохраняемогоЗначения[3] = "latency" Тогда
												ЗаписьТчИнтерактивности.Продолжительность = ЗначениеСохраняемогоЗначения;
											КонецЕсли;
											
											Если ИмяСохраняемогоЗначения[3] = "description" Тогда
												ЗаписьТчИнтерактивности.Описание = ЗначениеСохраняемогоЗначения;
											КонецЕсли;
											
											Если ИмяСохраняемогоЗначения[3] = "objectives" Тогда
												
												Попытка
													НомерЦели = Число(ИмяСохраняемогоЗначения[4]);
												Исключение
													НомерЦели = Неопределено;
												КонецПопытки;
												
												Если НомерЦели <> Неопределено Тогда
													
													МассивЦелей = ЗаписьТчИнтерактивности.Цели.Получить();
													
													Если ТипЗнч(МассивЦелей) <> Тип("Массив") Тогда
														МассивЦелей = Новый Массив();
													КонецЕсли;
													
													МассивЦелей.Вставить(НомерЦели, ЗначениеСохраняемогоЗначения);
													
													ЗаписьТчИнтерактивности.Цели = Новый ХранилищеЗначения(МассивЦелей);
													
												Иначе
													КодОшибки = 101;
													ТекстСообщения = "Невозможно получить номер цели интерактивности.";
												КонецЕсли;
												
											КонецЕсли;
											
											Если ИмяСохраняемогоЗначения[3] = "correct_responses" Тогда
												
												Попытка
													НомерОтвета = Число(ИмяСохраняемогоЗначения[4]);
												Исключение
													НомерОтвета = Неопределено;
												КонецПопытки;
												
												Если НомерОтвета <> Неопределено Тогда
													
													МассивОтветов = ЗаписьТчИнтерактивности.ВерныеОтветы.Получить();
													
													Если ТипЗнч(МассивОтветов) <> Тип("Массив") Тогда
														МассивОтветов = Новый Массив();
													КонецЕсли;
													
													МассивОтветов.Вставить(НомерОтвета, ЗначениеСохраняемогоЗначения);
													
													ЗаписьТчИнтерактивности.ВерныеОтветы = Новый ХранилищеЗначения(МассивОтветов);
													
												Иначе
													КодОшибки = 101;
													ТекстСообщения = "Невозможно получить номер верного ответа интерактивности.";
												КонецЕсли;
												
											КонецЕсли;
											
											
										Иначе
											КодОшибки = 101;
											ТекстСообщения = "Невозможно получить номер интерактивности.";
										КонецЕсли;
										
										
									КонецЕсли; // interactions
									
									// objectives
									Если ИмяСохраняемогоЗначения[1] = "objectives" Тогда
										
										Попытка
											НомерЦели = Число(ИмяСохраняемогоЗначения[2]);
										Исключение
											НомерЦели = Неопределено;
										КонецПопытки;
										
										Если НомерЦели <> Неопределено Тогда
											
											ЗаписьТчЦели = ДокументПопыткиОбъект.Цели.Найти(НомерЦели, "Номер");
											
											Если ЗаписьТчЦели = Неопределено Тогда
												ЗаписьТчЦели = ДокументПопыткиОбъект.Цели.Добавить();
												ЗаписьТчЦели.Номер = НомерЦели;
											КонецЕсли;
											
											Если ИмяСохраняемогоЗначения[3] = "id" Тогда
												ЗаписьТчЦели.Идентификатор = ЗначениеСохраняемогоЗначения;
											КонецЕсли;
											
											Если ИмяСохраняемогоЗначения[3] = "score" Тогда
												
												Если ИмяСохраняемогоЗначения[4] = "scaled" Тогда
													Если НЕ ЗначениеЗаполнено(ЗначениеСохраняемогоЗначения) Тогда
														ЗначениеСохраняемогоЗначения = 0;
													КонецЕсли;
													Попытка
														ЗаписьТчЦели.РезультатВПроцентах = Число(ЗначениеСохраняемогоЗначения);
													Исключение
														КодОшибки = 407;
														ТекстСообщения = "Невозможно интерпретировать переданное значение оценки для цели в процентах (score.scaled) (407).";
													КонецПопытки;
												КонецЕсли;
												
												Если ИмяСохраняемогоЗначения[4] = "min" Тогда
													Если НЕ ЗначениеЗаполнено(ЗначениеСохраняемогоЗначения) Тогда
														ЗначениеСохраняемогоЗначения = 0;
													КонецЕсли;
													Попытка
														ЗаписьТчЦели.МинимальноВозможныйРезультат = Число(ЗначениеСохраняемогоЗначения);
													Исключение
														КодОшибки = 407;
														ТекстСообщения = "Невозможно интерпретировать переданное значение минимально возможного результата для цели (score.min) (407).";
													КонецПопытки;
												КонецЕсли;
												
												Если ИмяСохраняемогоЗначения[4] = "max" Тогда
													Если НЕ ЗначениеЗаполнено(ЗначениеСохраняемогоЗначения) Тогда
														ЗначениеСохраняемогоЗначения = 0;
													КонецЕсли;
													Попытка
														ЗаписьТчЦели.МаксимальноВозможныйРезультат = Число(ЗначениеСохраняемогоЗначения);
													Исключение
														КодОшибки = 407;
														ТекстСообщения = "Невозможно интерпретировать переданное значение максимально возможного результата для цели (score.min) (407).";
													КонецПопытки;
												КонецЕсли;
												
												Если ИмяСохраняемогоЗначения[4] = "raw" Тогда
													Если НЕ ЗначениеЗаполнено(ЗначениеСохраняемогоЗначения) Тогда
														ЗначениеСохраняемогоЗначения = 0;
													КонецЕсли;
													Попытка
														ЗаписьТчЦели.Результат = Число(ЗначениеСохраняемогоЗначения);
													Исключение
														КодОшибки = 407;
														ТекстСообщения = "Невозможно интерпретировать переданное значение оценки для цели (score.scaled) (407).";
													КонецПопытки;
												КонецЕсли;
												
											КонецЕсли;
											
											Если ИмяСохраняемогоЗначения[3] = "success_status" Тогда
												Попытка
													ЗаписьТчЦели.СостояниеПрохождения = Перечисления.СостоянияПрохожденияОбъектовSCORM[ЗначениеСохраняемогоЗначения];
												Исключение
													КодОшибки = 101;
													ТекстСообщения = "Невозможно интерпретировать переданное значение состояния прохождения объекта для цели (success_status) (101).";
												КонецПопытки;
											КонецЕсли;
											
											Если ИмяСохраняемогоЗначения[3] = "completion_status" Тогда
												ЗначениеСохраняемогоЗначения = СтрЗаменить(ЗначениеСохраняемогоЗначения, " ", "");
												Попытка
													ЗаписьТчЦели.СостояниеВыполнения = Перечисления.СостоянияВыполненияОбъектовSCORM[ЗначениеСохраняемогоЗначения];
												Исключение
													КодОшибки = 101;
													ТекстСообщения = "Невозможно интерпретировать переданное значение состояния объекта для цели.";
												КонецПопытки;
											КонецЕсли;
											
											Если ИмяСохраняемогоЗначения[3] = "progress_measure" Тогда
												Попытка
													ЗаписьТчЦели.Прогресс = Число(ЗначениеСохраняемогоЗначения);
												Исключение
													КодОшибки = 407;
													ТекстСообщения = "Невозможно интерпретировать переданное значение прогресса для цели (progress_measure).";
												КонецПопытки;
											КонецЕсли;
											
											Если ИмяСохраняемогоЗначения[3] = "description" Тогда
												ЗаписьТчЦели.Описание = ЗначениеСохраняемогоЗначения;
											КонецЕсли;
											
										Иначе
											КодОшибки = 101;
											ТекстСообщения = "Невозможно получить номер цели.";
										КонецЕсли;
										
									КонецЕсли; // objectives
									
								КонецЕсли;
								
								// adl
								
								Если ИмяСохраняемогоЗначения[0] = "adl" Тогда
									
									
									Если ИмяСохраняемогоЗначения[1] = "nav" Тогда
										
										Если ИмяСохраняемогоЗначения[2] = "request" Тогда
											
											
											Если ЗначениеСохраняемогоЗначения = "continue" Тогда
												СсылкаДляПерехода = ОбъектыСУЗПовтИсп.СсылкаНаОбъектЭлементаСодержанияПоНавигационномуЗапросу(СводЗнаний, ЭлементСодержания, "Следующий");
											КонецЕсли;
											
											Если ЗначениеСохраняемогоЗначения = "previous" Тогда
												СсылкаДляПерехода = ОбъектыСУЗПовтИсп.СсылкаНаОбъектЭлементаСодержанияПоНавигационномуЗапросу(СводЗнаний, ЭлементСодержания, "Предыдущий");
											КонецЕсли;
											
											
										КонецЕсли;
										
										
									КонецЕсли;
									
									
								КонецЕсли;
								
								
							Иначе
								КодОшибка = 101;
								ТекстСообщения = "Неверный формат запроса на сохранение данных.";
							КонецЕсли; // ИмяСохраняемогоЗначения.Количество() > 1
							
						КонецЦикла;
						
							
						// Изменяем реквизиты за которые ответственна LMS
						
						Если ЗначениеЗаполнено(ДокументПопыткиОбъект.ЭлементСодержанияСводаЗнаний.ПорогВыполнения)
							И ДокументПопыткиОбъект.ПроцентВыполнения > 0 Тогда
							
							Если ДокументПопыткиОбъект.ПроцентВыполнения < ДокументПопыткиОбъект.ЭлементСодержанияСводаЗнаний.ПорогВыполнения Тогда
								ДокументПопыткиОбъект.СостояниеВыполнения = Перечисления.СостоянияВыполненияОбъектовSCORM.incomplete;
							Иначе
								ДокументПопыткиОбъект.СостояниеВыполнения = Перечисления.СостоянияВыполненияОбъектовSCORM.completed;
							КонецЕсли;
							
						КонецЕсли;
						
						// Заполняем табличную часть СтатистикаПараметров
			
						Для каждого ПараметрSCORM Из Перечисления.ИспользуемыеПараметрыSCORM Цикл
							
							Если ТаблицаСтатистикиПараметровSCORM.Найти(ПараметрSCORM, "Параметр") = Неопределено Тогда
								
								СтрокаСПТЧ = ДокументПопыткиОбъект.СтатистикаПараметров.Найти(ПараметрSCORM, "Параметр");
								
								Если СтрокаСПТЧ = Неопределено Тогда
								
									Перечисления.ИспользуемыеПараметрыSCORM.ДобавитьСтрокуВТаблицуСтатистики(
										ТаблицаСтатистикиПараметровSCORM,
										Неопределено,
										Неопределено,
										ПараметрSCORM,
										Ложь,
										Ложь,
										"");
										
								Иначе
									
									Перечисления.ИспользуемыеПараметрыSCORM.ДобавитьСтрокуВТаблицуСтатистики(
										ТаблицаСтатистикиПараметровSCORM,
										Неопределено,
										Неопределено,
										СтрокаСПТЧ.Параметр,
										СтрокаСПТЧ.Передан,
										СтрокаСПТЧ.ПереданСОшибкой,
										СтрокаСПТЧ.Значение);
									
								КонецЕсли;
										
							КонецЕсли;
							
						КонецЦикла;

						ТаблицаСтатистикиПараметровSCORM.Колонки.Удалить("ЭлектронныйРесурс");
						ТаблицаСтатистикиПараметровSCORM.Колонки.Удалить("ЭлементСодержания");
						
						ДокументПопыткиОбъект.СтатистикаПараметров.Загрузить(ТаблицаСтатистикиПараметровSCORM);
						
						// Записываем						
						
						ДокументПопыткиОбъект.Записать(РежимЗаписиДокумента.Проведение);	
						
						СтруктураДанныхXDTO = ОбъектыSCORM.ПолучитьМодельДанныхПопыткиОбъектаSCORM(ДокументПопыткиОбъект, КонтекстВыполнения);
						
					КонецЕсли; // ЗапросНаСохранение <> Неопределено
					
				КонецЕсли;
				
			КонецЕсли; // Commit
			
			
			// Закрытие сессии (Terminate)
			// Примечание: выполняется после сохранения данных.
			//
			
			Если ИмяЗапроса = "Terminate" Тогда
				
				Если ДокументПопыткиСсылка = Неопределено Тогда 
					
					КодОшибки = 112;
					ТекстСообщения = "Невозможно завершить сессию, так как она не найдена (112).";
					
				Иначе 
					
					Если ДокументПопыткиОбъект = Неопределено Тогда
						
						БлокировкаДанных = Новый БлокировкаДанных;
						ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.ПопыткаВыполненияАктивногоРесурсаSCORM");
						ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", ДокументПопыткиСсылка);
						ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
						БлокировкаДанных.Заблокировать();						
						
						ДокументПопыткиОбъект = ДокументПопыткиСсылка.ПолучитьОбъект();
						
					КонецЕсли;
					
					ДокументПопыткиОбъект.Дата = ТекущаяДатаСеанса();
					
					Если ЗначениеЗаполнено(ДокументПопыткиОбъект.ПродолжительностьПоследнейСессии) Тогда
						
						Если ЗначениеЗаполнено(ДокументПопыткиОбъект.ОбщаяПродолжительностьСессий) Тогда
							ОбщийВременнойИнтервал = ОбъектыSCORM.СуммироватьДваВременногоИнтервала(ДокументПопыткиОбъект.ПродолжительностьПоследнейСессии, ДокументПопыткиОбъект.ОбщаяПродолжительностьСессий);
						Иначе
							ОбщийВременнойИнтервал = ДокументПопыткиОбъект.ПродолжительностьПоследнейСессии;
						КонецЕсли;
						
						ДокументПопыткиОбъект.ОбщаяПродолжительностьСессий = ОбщийВременнойИнтервал;
						ДокументПопыткиОбъект.ПродолжительностьПоследнейСессии = "";
						
					КонецЕсли;					
					
					СессияСтрока = ДокументПопыткиОбъект.Сессии.Получить(ДокументПопыткиОбъект.Сессии.Количество() - 1); 
					
					СессияСтрока.ДатаЗакрытия = ТекущаяДатаСеанса(); 
					
					ДокументПопыткиОбъект.Записать(РежимЗаписиДокумента.Проведение);
					
					РезультатДействия.Вставить("ЗакрытьСтраницу", Истина);
					
				КонецЕсли;
				
			КонецЕсли; // Terminate
			
			Если КодОшибки > 0 Тогда
				Значение = "false";	
			Иначе
				Значение = "true";	
			КонецЕсли;
			
						
			// Формируем структуру данных для передачи обратно на клиент
			
			РезультатДействия.Вставить("СсылкаДляПерехода", СсылкаДляПерехода);
			РезультатДействия.Вставить("ТекстСообщения", ТекстСообщения);
			РезультатДействия.Вставить("Значение", Значение);
			РезультатДействия.Вставить("КодОшибки", КодОшибки);
			РезультатДействия.Вставить("НомерСессии", НомерСессии);
			
			Если СтруктураДанныхXDTO <> Неопределено Тогда
				
				ЗаписьXML = Новый ЗаписьXML;
				ЗаписьXML.УстановитьСтроку();
				ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, СтруктураДанныхXDTO);
				XMLДанные = ЗаписьXML.Закрыть();
				
				РезультатДействия.Вставить("МодельДанныхПопыткиОбъектаSCORM", XMLДанные);
				
			КонецЕсли;
			
		КонецЕсли; // SCORequest
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	Возврат РезультатДействия;
	
КонецФункции

// Возвращает структуру действия.
// Используется перед формированием результата действия
// для обеспечения гарантированного наличия всех свойств
// в структуре данных выполненного действия.
//
Функция ПолучитьПустуюСтруктуруДействия()
	
	СтруктураДанных = Новый Структура;
	
	// Общее
	
	СтруктураДанных.Вставить("АдресОбъекта", ""); // Строка
	СтруктураДанных.Вставить("АдресФайла", ""); // Строка
	СтруктураДанных.Вставить("ВнешняяСсылка", ""); // Строка
	СтруктураДанных.Вставить("Якорь", ""); // Строка
	СтруктураДанных.Вставить("ТекстСообщения", ""); // Строка
	СтруктураДанных.Вставить("СессияТестирования", Неопределено); // Булево
	СтруктураДанных.Вставить("ВыполняетсяТестирование", Неопределено); // Булево
	СтруктураДанных.Вставить("ВнешняяОбработка", Неопределено); // Структура
	СтруктураДанных.Вставить("Форма", Неопределено); // Структура
	СтруктураДанных.Вставить("ПовторноеПрохождение", Неопределено); // Массив элементов содержания
	
	// Ресурсы для кэширования на клиенте
	
	Ресурсы = Новый Массив();
	СтруктураДанных.Вставить("Ресурсы", Ресурсы); // Массив
	
	//SCORM
	
	СтруктураДанных.Вставить("Значение", ""); // Строка (для объектов SCORM)
	СтруктураДанных.Вставить("КодОшибки", 0); // Число (для объектов SCORM)
	СтруктураДанных.Вставить("МодельДанныхПопыткиОбъектаSCORM", ""); // Объект XDTO как строка
	СтруктураДанных.Вставить("НомерСессии", ""); // Строка
	
	СтруктураДанных.Вставить("ЗакрытьСтраницу", Ложь); // Булево
	СтруктураДанных.Вставить("ЗакрытьОкно", Ложь); // Булево
	
	// Экспорт данных в автономный пакет
	
	СтруктураДанных.Вставить("ДокументСессииОбъект", Неопределено); // Объект документа "ПопыткаВыполненияСтатичногоОбъектаСУЗ"
	
	Возврат СтруктураДанных;
	
КонецФункции

// СТАТИЧНЫЕ ОБЪЕКТЫ

// Примечание: статичные объекты - это объекты, которые сами не умеют взаимодействовать
// С системой, например страницы. Статистика их просмотра накапливается при переходе
// К другому объекту или закрытии формы.

// Фиксирует попытку выполнения статичного объекта.
//
Процедура ЗавершитьПопыткуВыполненияСтатичногоОбъекта(ПопыткаВыполнения) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		УстановитьПривилегированныйРежим(Истина); 
				
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.ПопыткаВыполненияСтатичногоОбъектаСУЗ");
		ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", ПопыткаВыполнения);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		ПопыткаОбъект = ПопыткаВыполнения.ПолучитьОбъект();
		
		Если НЕ ПопыткаОбъект.ПопыткаЗавершена Тогда
			
			ПопыткаОбъект.ПопыткаЗавершена         = Истина;
			ПопыткаОбъект.ДатаОкончанияВыполнения  = ТекущаяДата();
			ПопыткаОбъект.ВремяВыполненияВСекундах = ПопыткаОбъект.ДатаОкончанияВыполнения - ПопыткаОбъект.ДатаНачалаВыполнения;
			ПопыткаОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЕсли;		
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// РЕСУРСЫ ОБЪЕКТОВ

// Получает уникальный постфикс ресурса СУЗ на основе кода данных.
// Используется в том случае, когда "склеиваются" в одном объекте,
// например в вопросе, различные форматированные документы и требуется
// разнести ресурсы из разных документов в разные каталоги.
//
Функция ПолучитьПостфиксРесурса(КодДанных) Экспорт
	
	Если ЗначениеЗаполнено(КодДанных) Тогда
		Возврат "_" + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(КодСимвола(КодДанных, 1))+Строка(СтрДлина(КодДанных));	
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

// Получает пустую структуру ресурса. Ресурсы выгружаются в локальный
// кэш на клиенте или на сервере. Структура используется
// для проверки необходимости выгрузки данных, и не содержит
// данные самого ресурса.
//
// В качестве ресурса могут выступать не только элементы справочника,
// РесурсыСУЗ, но и, например, документы "СообщениеОбсужденийСУЗ", которые
// содержат форматированный документ с картинками.
//
Функция ПолучитьСтруктуруРесурса(Ссылка, КодДанных = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.РесурсыСУЗ") Тогда
	
		ДанныеРесурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ДатаИзменения, ПодключитьAPI");
		
		Если ТипЗнч(ДанныеРесурса.ПодключитьAPI) <> Тип("Булево") Тогда
			ДанныеРесурса.ПодключитьAPI = Ложь;
		КонецЕсли;		
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЗависимыеРесурсыСУЗ.Ресурс.ДатаИзменения КАК ДатаИзменения
			|ИЗ
			|	Справочник.ЗависимыеРесурсыСУЗ КАК ЗависимыеРесурсыСУЗ
			|ГДЕ
			|	ЗависимыеРесурсыСУЗ.Владелец = &Ресурс
			|	И ЗависимыеРесурсыСУЗ.ПометкаУдаления = ЛОЖЬ
			|	И ЗависимыеРесурсыСУЗ.Ресурс.ДатаИзменения > &ДатаИзмененияРесурса
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаИзменения УБЫВ";
		
		Запрос.УстановитьПараметр("Ресурс", Ссылка);
		Запрос.УстановитьПараметр("ДатаИзмененияРесурса", ДанныеРесурса.ДатаИзменения);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
		
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			ВыборкаДетальныеЗаписи.Следующий();
			
			ДанныеРесурса.ДатаИзменения = ВыборкаДетальныеЗаписи.ДатаИзменения;
			
		КонецЕсли;
		
	Иначе
		
		ДанныеРесурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ДатаИзменения");
		
		ДанныеРесурса.Вставить("ПодключитьAPI", Ложь);
		
	КонецЕсли;
	
	СтруктураРесурса = Новый Структура();
	СтруктураРесурса.Вставить("Ссылка", Ссылка);
	СтруктураРесурса.Вставить("Идентификатор", Строка(Ссылка.УникальныйИдентификатор()));
	СтруктураРесурса.Вставить("ДатаИзменения", ДанныеРесурса.ДатаИзменения);
	СтруктураРесурса.Вставить("ПодключитьAPI", ДанныеРесурса.ПодключитьAPI);
	СтруктураРесурса.Вставить("КодДанных", КодДанных);
	СтруктураРесурса.Вставить("Постфикс", ПолучитьПостфиксРесурса(КодДанных));
	СтруктураРесурса.Вставить("Размер", 0); // Размер в МБ
	
	Возврат СтруктураРесурса;
	
КонецФункции

// Получает данные подсказки.
//
Функция ПолучитьСтруктуруПодсказки(Подсказка, Текст) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураПодсказки = Новый Структура;
	СтруктураПодсказки.Вставить("Подсказка", Подсказка);
	СтруктураПодсказки.Вставить("Текст", Текст);
	
	Возврат СтруктураПодсказки;
	
КонецФункции

// Получает структуру ресурса "Общий" справочника "РесурсыСУЗ".
//
Функция ПолучитьСтруктуруОбщегоРесурса() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураРесурса = ПолучитьСтруктуруРесурса(Справочники.РесурсыСУЗ.Общий);
	СтруктураРесурса.Идентификатор = ""; // Общий ресурс выгружается в корень кэша
	
	Возврат СтруктураРесурса;
	
КонецФункции

// Получает структуру ресурса "Модули" справочника "РесурсыСУЗ".
//
Функция ПолучитьСтруктуруРесурсаМодулей() Экспорт
	
	СтруктураРесурса = ПолучитьСтруктуруРесурса(Справочники.РесурсыСУЗ.Модули);
	СтруктураРесурса.Идентификатор = "plugins"; // Свой идентификатор
	
	Возврат СтруктураРесурса;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// КОНТЕКСТ ОБЪЕКТА

// Процедура добавляет в список шаблонов новый элемент.
//
// Параметры
//  ШаблонОбъекта  – ссылка на элемент справочника "ШаблоныСУЗ" или "ШаблоныСУО".
//  СписокШаблонов - массив.
//
// Возвращаемое значение:
//   Нет.
//
Процедура ДобавитьШаблонВСписокОбъекта(ШаблонОбъекта, СписокШаблонов) Экспорт

	Если СписокШаблонов.Найти(ШаблонОбъекта) = Неопределено Тогда
		СписокШаблонов.Добавить(ШаблонОбъекта);
	КонецЕсли;
	
КонецПроцедуры

// Добавляет ресурс (описание ресурса) в массив, если он не был добавлен в него ранее.
// Включая зависимые ресурсы для справочника РесурсыСУЗ.
//
Процедура ДобавитьРесурсВМассивРесурсов(Знач Ресурс, МассивРесурсов, КодДанных = "", ТаблицаЗависимыхРесурсов = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(Ресурс) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Ресурс) = Тип("СправочникСсылка.РесурсыСУЗ") Тогда
		
		ИдентичныйРесурс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ресурс, "ИдентичныйРесурс");		
		ДобавляемыйРесурс = ?(ЗначениеЗаполнено(ИдентичныйРесурс), ИдентичныйРесурс, Ресурс);
		
	Иначе
		
		ДобавляемыйРесурс = Ресурс;
		
	КонецЕсли;
	
	Для каждого Элемент Из МассивРесурсов Цикл
		Если Элемент.Ссылка = ДобавляемыйРесурс
			И Элемент.КодДанных = КодДанных Тогда
			Возврат; // Ресурс уже добавлен
		КонецЕсли;
	КонецЦикла;
	
	СтруктураРесурса = ПолучитьСтруктуруРесурса(ДобавляемыйРесурс, КодДанных);
	
	МассивРесурсов.Добавить(СтруктураРесурса);
	
	// Добавляем зависимые ресурсы
	
	Если ТипЗнч(ДобавляемыйРесурс) = Тип("СправочникСсылка.РесурсыСУЗ") Тогда
	
		Если ТаблицаЗависимыхРесурсов = Неопределено Тогда		
			ТаблицаЗависимыхРесурсов = ТаблицаЗависимыхРесурсов(ДобавляемыйРесурс);		
		КонецЕсли;
		
		Для каждого Строка Из ТаблицаЗависимыхРесурсов Цикл
			ДобавитьРесурсВМассивРесурсов(Строка.Ресурс, МассивРесурсов); // Рекурсия
		КонецЦикла;	
		
	КонецЕсли;
		
КонецПроцедуры

// Добавляет все ресурсы, подчиненные заданному объекту СУЗ.
// Подчиненные ресурсы сохраняются в справочнике "РесурсыОбъектовСУЗ".
//
Процедура ДобавитьРесурсыОбъектаВМассивРесурсов(Объект, СписокРесурсов, СписокПодсказок) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РесурсыОбъектовСУЗ.Ссылка,
		|	РесурсыОбъектовСУЗ.Ресурс,
		|	РесурсыОбъектовСУЗ.Текст,
		|	РесурсыОбъектовСУЗ.Подсказка
		|ИЗ
		|	Справочник.РесурсыОбъектовСУЗ КАК РесурсыОбъектовСУЗ
		|ГДЕ
		|	РесурсыОбъектовСУЗ.Владелец = &Владелец";

	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.Подсказка Тогда
			ОбъектыСУЗ.ДобавитьПодсказкуВМассивПодсказок(ВыборкаДетальныеЗаписи.Ссылка, ВыборкаДетальныеЗаписи.Текст, СписокПодсказок);
		Иначе
			ОбъектыСУЗ.ДобавитьРесурсВМассивРесурсов(ВыборкаДетальныеЗаписи.Ресурс, СписокРесурсов);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет подсказку в общий массив подсказок
//
Процедура ДобавитьПодсказкуВМассивПодсказок(Подсказка, Текст, СписокПодсказок) Экспорт

	Если НЕ ЗначениеЗаполнено(Подсказка) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Элемент Из СписокПодсказок Цикл
		Если Элемент.Подсказка = Подсказка Тогда
			Возврат; // Подсказка уже добавлена
		КонецЕсли;
	КонецЦикла;
	
	СтруктураПодсказки = ПолучитьСтруктуруПодсказки(Подсказка, Текст);
	
	СписокПодсказок.Добавить(СтруктураПодсказки);
	
КонецПроцедуры

// Добавляет ссылку на объект в общий массив ссылок
//
Процедура ДобавитьСсылкиОбъектаВМассив(СсылкаНаОбъект, КонтекстВыполнения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если КонтекстВыполнения.ПараметрыЭкспорта = Неопределено Тогда
		Возврат; // Ссылки нужны только при экспорте данных
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СсылкиОбъектовСУЗ.Ссылка
		|ИЗ
		|	Справочник.СсылкиОбъектовСУЗ КАК СсылкиОбъектовСУЗ
		|ГДЕ
		|	СсылкиОбъектовСУЗ.Владелец = &СсылкаНаОбъект";

	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если КонтекстВыполнения.СписокСсылок.Найти(ВыборкаДетальныеЗаписи.Ссылка) = Неопределено Тогда
			 КонтекстВыполнения.СписокСсылок.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		 КонецЕсли;
		 
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьМодулиРесурса(Ресурс, СписокМодулей, ТаблицаЗависимыхРесурсов = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Ресурс) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Ресурс) = Тип("СправочникСсылка.РесурсыСУЗ") Тогда
		
		ИдентичныйРесурс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ресурс, "ИдентичныйРесурс");		
		ДобавляемыйРесурс = ?(ЗначениеЗаполнено(ИдентичныйРесурс), ИдентичныйРесурс, Ресурс);
		
	Иначе
		
		ДобавляемыйРесурс = Ресурс;
		
	КонецЕсли;
	
	
	Если ТаблицаЗависимыхРесурсов = Неопределено Тогда		
		ТаблицаЗависимыхРесурсов = ТаблицаЗависимыхРесурсов(ДобавляемыйРесурс);		
	КонецЕсли;
	
	Для каждого Строка Из ТаблицаЗависимыхРесурсов Цикл
		ДобавитьМодульВМассив(Строка.Модуль, СписокМодулей);
	КонецЦикла;	
	
КонецПроцедуры

// Объявляет модуль в общий массив модулей страницы.
//
Процедура ДобавитьМодульВМассив(Знач Модуль, СписокМодулей) Экспорт
	
	Если ТипЗнч(Модуль) = Тип("Строка") Тогда
		Модуль = ОбъектыСУЗПовтИсп.МодульПоИмени(Модуль);		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Модуль) И СписокМодулей.Найти(Модуль) = Неопределено Тогда
		СписокМодулей.Добавить(Модуль);
	КонецЕсли;
	
КонецПроцедуры

Функция ТаблицаЗависимыхРесурсов(Ресурс) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗависимыеРесурсыСУЗ.Модуль,
		|	ЗависимыеРесурсыСУЗ.Ресурс,
		|	ЗависимыеРесурсыСУЗ.Дополняет
		|ИЗ
		|	Справочник.ЗависимыеРесурсыСУЗ КАК ЗависимыеРесурсыСУЗ
		|ГДЕ
		|	ЗависимыеРесурсыСУЗ.ПометкаУдаления = ЛОЖЬ
		|	И ЗависимыеРесурсыСУЗ.Владелец = &Ресурс
		|	И ЗависимыеРесурсыСУЗ.Ресурс <> &Ресурс";

		
	Запрос.УстановитьПараметр("Ресурс", Ресурс);
		
	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();	
	
КонецФункции
	
////////////////////////////////////////////////////////////////////////////////
// ШАБЛОНЫ ОБЪЕКТОВ

// Функция возвращает ссылку на шаблон объекта.
//
// Параметры
//  Объект  – Экземпляр обработки "ОбъектСУЗ" или справочник объект.
//
// Возвращаемое значение:
//   Ссылка на элемент справочника "ШаблоныСУЗ" или "ШаблоныСУО"
//
Функция ПолучитьСсылкуНаXSLШаблонОбъекта(Ссылка) Экспорт
	
	Шаблон = Ссылка.Шаблон;
	
	Если ЗначениеЗаполнено(Шаблон) Тогда
		
		Возврат Шаблон;	
		
	Иначе
		
		ТипОбъекта = ПолучитьТипОбъектаСУЗ(Ссылка);
		
		Возврат Справочники.ШаблоныСУЗ[Строка(ТипОбъекта)+"ПоУмолчанию"];
		
	КонецЕсли;
	
КонецФункции

// Возвращает необходимые для воспроизведения объекта XSL шаблоны.
// Шаблоны хранятся в регистре "КэшШаблоновСУЗ" или "КэшШаблоновСУО".
//
// Параметры
//  Шаблон  – ссылка на элемент справочника ШаблоныСУЗ или ШаблоныСУО.
//
// Возвращаемое значение:
//   Структура, содержащая шаблон представления и скрипта.
//
Функция ПолучитьИзКэшаТекстШаблона(Шаблон, Префикс) Экспорт
	
	СтруктураДанныхШаблона = Новый Структура;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	КэшШаблонов"+Префикс+".ШаблонПредставления,
	|	КэшШаблонов"+Префикс+".ШаблонСкрипта
	|ИЗ
	|	РегистрСведений.КэшШаблонов"+Префикс+" КАК КэшШаблонов"+Префикс+"
	|ГДЕ
	|	КэшШаблонов"+Префикс+".Шаблон = &Шаблон"); 
	
	
	Запрос.УстановитьПараметр("Шаблон", Шаблон); 
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Результат.Следующий();
	
	СтруктураДанныхШаблона.Вставить("ШаблонПредставления", Результат.ШаблонПредставления);
	СтруктураДанныхШаблона.Вставить("ШаблонСкрипта", Результат.ШаблонСкрипта);
	
	Возврат СтруктураДанныхШаблона;
		
КонецФункции

// Возвращает текст необходимых для отображения объекта стилей (CSS).
//
// Параметры
//  СписокШаблонов  – Массив - содержит участвующие в формировании объекта шаблоны.
//
// Возвращаемое значение:
//  Строка. 
//
Функция ПолучитьТекстСтилейОбъекта(СписокШаблонов) Экспорт

	// Получаем стили по умолчанию!
	ТекстСтилей = Справочники.ШаблоныСУЗ.ПредставлениеИнформации.ТаблицыСтилей;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.ШаблоныСУЗ"));
	
	ОписаниеТипов = Новый ОписаниеТипов(МассивТипов); 
	
	ТаблицаШаблонов = Новый ТаблицаЗначений;
	ТаблицаШаблонов.Колонки.Добавить("Ссылка", ОписаниеТипов);
	
	Для каждого Шаблон Из СписокШаблонов Цикл
		НоваяСтрока = ТаблицаШаблонов.Добавить();
		НоваяСтрока.Ссылка = Шаблон;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ВнешнийИсточник", ТаблицаШаблонов);
	Запрос.Текст =
	"ВЫБРАТЬ Ссылка
	|ПОМЕСТИТЬ ТаблицаШаблонов
	|ИЗ &ВнешнийИсточник КАК ВнешнийИсточник";
	Запрос.Выполнить();
	
	// Выбираем шаблоны СУЗ
	
	Запрос.Текст = "ВЫБРАТЬ
	|	КэшШаблоновСУЗ.ТаблицыСтилей КАК ТекстСтилей
	|ИЗ
	|	ТаблицаШаблонов КАК ТаблицаШаблонов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КэшШаблоновСУЗ КАК КэшШаблоновСУЗ
	|		ПО ТаблицаШаблонов.Ссылка = КэшШаблоновСУЗ.Шаблон";
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		ТекстСтилей = ТекстСтилей + Результат.ТекстСтилей;
	КонецЦикла;
	
	Возврат ТекстСтилей;

КонецФункции // ПолучитьТекстСтилейОбъектаСУЗ()

// Обновляет кэш шаблонов для всех шаблонов или одного.
//
Процедура ОбновитьКэшШаблоновСУЗ(Шаблон = Неопределено) Экспорт
	
	Если Шаблон = Неопределено Тогда
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	ШаблоныСУЗ.Ссылка
		|ИЗ
		|	Справочник.ШаблоныСУЗ КАК ШаблоныСУЗ
		|ГДЕ
		|	ШаблоныСУЗ.ЭтоГруппа = ЛОЖЬ");
		
		ТаблицаШаблонов = Запрос.Выполнить().Выгрузить();
		
	Иначе
		
		ТаблицаШаблонов = Новый ТаблицаЗначений;
		ТаблицаШаблонов.Колонки.Добавить("Ссылка");
		
		НоваяСтрока = ТаблицаШаблонов.Добавить();
		НоваяСтрока.Ссылка = Шаблон;
		
		// Находим все шаблоны, которые зависят от текущего.

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ШаблоныСУЗ.Ссылка
			|ИЗ
			|	Справочник.ШаблоныСУЗ КАК ШаблоныСУЗ
			|ГДЕ
			|	ШаблоныСУЗ.ДополняетШаблон = &ДополняетШаблон
			|	И ШаблоныСУЗ.ЭтоГруппа = ЛОЖЬ
			|	И ШаблоныСУЗ.ПометкаУдаления = ЛОЖЬ";

		Запрос.УстановитьПараметр("ДополняетШаблон", Шаблон);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрока = ТаблицаШаблонов.Добавить();
			НоваяСтрока.Ссылка = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
		
	КонецЕсли;
	
	Для каждого Строка Из ТаблицаШаблонов Цикл
	
		ЦепочкаШаблонов = СформироватьСписокДополняющихШаблонов(Строка.Ссылка);
		ДанныеШаблона   = ПолучитьСтруктуруДанныхXSLШаблона(ЦепочкаШаблонов);
		
		НаборЗаписей =  РегистрыСведений.КэшШаблоновСУЗ.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Шаблон.Установить(Строка.Ссылка);

		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.Шаблон              = Строка.Ссылка;
		НоваяЗапись.ШаблонПредставления = ДанныеШаблона["ШаблонПредставления"];
		НоваяЗапись.ШаблонСкрипта       = ДанныеШаблона["ШаблонСкрипта"];
		НоваяЗапись.ТаблицыСтилей       = ДанныеШаблона["ТаблицыСтилей"];

		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Если шаблон дополняет другой, то возвращается вся цепочка дополняющих друг-друга шаблонов.
//
Функция СформироватьСписокДополняющихШаблонов(Шаблон, МассивШаблонов = Неопределено)

	Если МассивШаблонов = Неопределено Тогда
		МассивШаблонов = Новый Массив();
	КонецЕсли;
	
	Если МассивШаблонов.Найти(Шаблон) = Неопределено Тогда
		Если ЗначениеЗаполнено(Шаблон.ДополняетШаблон) Тогда
			СформироватьСписокДополняющихШаблонов(Шаблон.ДополняетШаблон, МассивШаблонов);
		КонецЕсли;
		МассивШаблонов.Добавить(Шаблон);
	КонецЕсли;
	
	Возврат МассивШаблонов;
	
КонецФункции

// Получает итоговые данные всей цепочки шаблонов XSL.
//
Функция ПолучитьСтруктуруДанныхXSLШаблона(ЦепочкаШаблонов)
	
	ШаблонПредставления = "";
	ШаблонСкрипта       = "";
	ТаблицыСтилей       = "";
	
	XSLДанные = "<xsl:stylesheet version=""1.0"" "; // Записывается результирующий текст XSL шаблона.
		
	ТаблицаПространствИмен = Новый ТаблицаЗначений;
	ТаблицаПространствИмен.Колонки.Добавить("Префикс");
	ТаблицаПространствИмен.Колонки.Добавить("URI");
	
	НоваяСтрока = ТаблицаПространствИмен.Добавить();
	НоваяСтрока.Префикс = "xsl";
	НоваяСтрока.URI = "http://www.w3.org/1999/XSL/Transform";
	
	Для каждого Шаблон Из ЦепочкаШаблонов Цикл
		
		ПространствоИмен = Справочники.ПространстваИменШаблоновСУЗ.Выбрать(,Шаблон);
		
		Пока ПространствоИмен.Следующий() Цикл
			
			НоваяСтрока = ТаблицаПространствИмен.Добавить();
			НоваяСтрока.Префикс = СокрЛП(ПространствоИмен.Код);
			НоваяСтрока.URI = ПространствоИмен.Наименование;				
		
		КонецЦикла;
		
	КонецЦикла;
	
	Для каждого ПространствоИмен Из ТаблицаПространствИмен Цикл
	
		XSLДанные = XSLДанные + "
		|xmlns:"+ПространствоИмен.Префикс+"="""+ПространствоИмен.URI+"""";
	
	КонецЦикла;
	
	XSLДанные = XSLДанные + "> ";
	
	ШаблонПредставления = XSLДанные;
	ШаблонСкрипта = XSLДанные;

	ШаблонПредставления = ШаблонПредставления + "
	|<xsl:output method=""html""/>";
	ШаблонСкрипта = ШаблонСкрипта + "
	|<xsl:output method=""text""/>";
	
	XSLДанные = "
	|<xsl:template match=""/"">";
	
	// Добавляем вызов имеющихся шаблонов.
	Для каждого Шаблон Из ЦепочкаШаблонов Цикл
		ИдентификаторШаблона = Шаблон.УникальныйИдентификатор();
		XSLДанные = XSLДанные + "
		|<xsl:call-template name=""template_"+ ИдентификаторШаблона +"""/>";
	КонецЦикла;	
	
	XSLДанные = XSLДанные + "
	|</xsl:template>";
	
	ШаблонПредставления = ШаблонПредставления + XSLДанные;
	ШаблонСкрипта = ШаблонСкрипта + XSLДанные;

	// Порядок добавления шаблонов:
	// 1. Все основные шаблоны;
	// 2. Все дополнительные шаблоны.
	// Примечание: кроме стилей. Стили основных
	// Шаблонов добавляются после дополнительных,
	// Чтобы в них можно было переопределить стили доп. шаблонов.
	
	// 1. Добавляем текст основных шаблонов.
	Для каждого Шаблон Из ЦепочкаШаблонов Цикл
		ШаблонПредставления = ШаблонПредставления + Строка(Шаблон.ШаблонПредставления);
		ШаблонСкрипта       = ШаблонСкрипта + Строка(Шаблон.ШаблонСкрипта);
//		ТаблицыСтилей       = ТаблицыСтилей + Строка(Шаблон.ТаблицыСтилей); // Ниже добавляется
	КонецЦикла;	
	
	// 2. Добавляем дополнительные шаблоны.
	
	ТаблицаДопШаблонов = Новый ТаблицаЗначений;
	
	ТаблицаДопШаблонов.Колонки.Добавить("Ссылка");
	ТаблицаДопШаблонов.Колонки.Добавить("Match");
	ТаблицаДопШаблонов.Колонки.Добавить("Name");
	ТаблицаДопШаблонов.Колонки.Добавить("Priority");
	ТаблицаДопШаблонов.Колонки.Добавить("Mode");
	ТаблицаДопШаблонов.Колонки.Добавить("ТекстШаблона");
	ТаблицаДопШаблонов.Колонки.Добавить("ТекстСтилей");
	ТаблицаДопШаблонов.Колонки.Добавить("ДатаИзменения");
	ТаблицаДопШаблонов.Колонки.Добавить("Поставщик");
	ТаблицаДопШаблонов.Колонки.Добавить("ТипШаблона");
	
	Если Константы.ПоказыватьПоследнююВерсиюСУЗ.Получить() Тогда
		ПредпочитаемыйПоставщик = Константы.ПредпочитатьПоставщикаСУЗ.Получить();
	Иначе
		ПредпочитаемыйПоставщик = Неопределено;
	КонецЕсли;
	
	Для каждого Шаблон Из ЦепочкаШаблонов Цикл
		
		ВремТаблицаДопШаблонов = Новый ТаблицаЗначений; // Хранит все доп. шаблоны шаблона из цепочки.
	
		ВремТаблицаДопШаблонов.Колонки.Добавить("Ссылка");
		ВремТаблицаДопШаблонов.Колонки.Добавить("Match");
		ВремТаблицаДопШаблонов.Колонки.Добавить("Name");
		ВремТаблицаДопШаблонов.Колонки.Добавить("Priority");
		ВремТаблицаДопШаблонов.Колонки.Добавить("Mode");
		ВремТаблицаДопШаблонов.Колонки.Добавить("ТекстШаблона");
		ВремТаблицаДопШаблонов.Колонки.Добавить("ТекстСтилей");
		ВремТаблицаДопШаблонов.Колонки.Добавить("ДатаИзменения");
		ВремТаблицаДопШаблонов.Колонки.Добавить("Поставщик");
		ВремТаблицаДопШаблонов.Колонки.Добавить("ТипШаблона");
		
		ДопШаблон = Справочники.ДополнительныеШаблоныСУЗ.Выбрать(,Шаблон);
		
		Пока ДопШаблон.Следующий() Цикл // Заполняем таблицу ВремТаблицаДопШаблонов.
			
			// В рамках одного шаблона, при наличии двух доп. шаблонов
			// С одинаковым именем, шаблон от предпочитаемого поставщика
			// Заменяет другой шаблон.
			// Если невозможно определить предпочитаемый шаблон по поставщику,
			// То тот доп. шаблон, который был первым в цепочки будет предпочитаться.
			
			ТребуемоеДействие = ""; // Возможные значения: "Пропустить", "Заменить", "Добавить".
				
			Если ЗначениеЗаполнено(ДопШаблон.Name) Тогда
			
				Отбор = Новый Структура();
				Отбор.Вставить("ТипШаблона", ДопШаблон.ТипШаблона);
				Отбор.Вставить("Name", ДопШаблон.Name);
				
				// Находим все шаблоны того же типа, что и текущий и с таким же именем.
				НайденныеШаблоны = ВремТаблицаДопШаблонов.НайтиСтроки(Отбор);
				
				Если НайденныеШаблоны.Количество() > 0 Тогда // Должно быть всегда = 1
					
					ИмеющийсяШаблон = НайденныеШаблоны[0];
					
					Если ПредпочитаемыйПоставщик <> Неопределено
						И ИмеющийсяШаблон.Поставщик <> ДопШаблон.Поставщик Тогда
						
						Если ИмеющийсяШаблон.Поставщик = ПредпочитаемыйПоставщик Тогда
							ТребуемоеДействие = "Пропустить";
						КонецЕсли;
						
						Если ДопШаблон.Поставщик = ПредпочитаемыйПоставщик Тогда
							ТребуемоеДействие = "Заменить";
						КонецЕсли;
						
					КонецЕсли;
					
					Если ТребуемоеДействие = "" Тогда
						
//						Если ДопШаблон.ДатаИзменения >= ИмеющийсяШаблон.ДатаИзменения Тогда
//							ТребуемоеДействие = "Заменить";
//						Иначе
							ТребуемоеДействие = "Пропустить";
//						КонецЕсли;
						
					КонецЕсли;
					
				Иначе
					ТребуемоеДействие = "Добавить";
				КонецЕсли;
				
			Иначе
				ТребуемоеДействие = "Добавить";
			КонецЕсли;
			
			
			Если ТребуемоеДействие = "Пропустить" Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТребуемоеДействие = "Добавить" Тогда
				НоваяСтрока = ВремТаблицаДопШаблонов.Добавить();
			КонецЕсли;
			
			Если ТребуемоеДействие = "Заменить" Тогда
				НоваяСтрока = ИмеющийсяШаблон;
			КонецЕсли;
			
			НоваяСтрока.Ссылка        = ДопШаблон.Ссылка;
			НоваяСтрока.Match         = ДопШаблон.Match;
			НоваяСтрока.Name          = ДопШаблон.Name;
			НоваяСтрока.Priority      = ДопШаблон.Priority;
			НоваяСтрока.Mode          = ДопШаблон.Mode;
			
			НоваяСтрока.ТекстШаблона  = ДопШаблон.ТекстШаблона;
			НоваяСтрока.ТекстСтилей   = ДопШаблон.ТекстСтилей;
			НоваяСтрока.ДатаИзменения = ДопШаблон.ДатаИзменения;
			НоваяСтрока.Поставщик     = ДопШаблон.Поставщик;
			НоваяСтрока.ТипШаблона    = ДопШаблон.ТипШаблона;
					
		КонецЦикла;
		
		
		// Объединяем доп. шаблоны текущего шаблона из цепочки
		// С другими, найденными для других шаблонов цепочки.
		// В цепочке если есть шаблоны с одинаковым именем,
		// Последующий заменяет предыдущий.
		// Цепочка составлена так, что дополняющие шаблоны
		// Находятся позже.
		
		Для каждого ВремШаблон Из ВремТаблицаДопШаблонов Цикл
			
			Если ЗначениеЗаполнено(ВремШаблон.Name) Тогда
				
				Отбор = Новый Структура();
				Отбор.Вставить("ТипШаблона", ВремШаблон.ТипШаблона);
				Отбор.Вставить("Name", ВремШаблон.Name);
				
				НайденныеСтроки = ТаблицаДопШаблонов.НайтиСтроки(Отбор);
				
				Если НайденныеСтроки.Количество() > 0 Тогда
					НоваяСтрока = НайденныеСтроки[0]; // Заменяем существующий шаблон с этим же именем
				Иначе
					НоваяСтрока = ТаблицаДопШаблонов.Добавить();
				КонецЕсли;
				
			Иначе
				// Если имя шаблона не указано, то просто добавляем его к общему списку.
				НоваяСтрока = ТаблицаДопШаблонов.Добавить();				
			КонецЕсли;
			
			
			НоваяСтрока.Ссылка        = ВремШаблон.Ссылка;
			НоваяСтрока.Match         = ВремШаблон.Match;
			НоваяСтрока.Name          = ВремШаблон.Name;
			НоваяСтрока.Priority      = ВремШаблон.Priority;
			НоваяСтрока.Mode          = ВремШаблон.Mode;
			
			НоваяСтрока.ТекстШаблона  = ВремШаблон.ТекстШаблона;
			НоваяСтрока.ТекстСтилей   = ВремШаблон.ТекстСтилей;
			НоваяСтрока.ДатаИзменения = ВремШаблон.ДатаИзменения;
			НоваяСтрока.Поставщик     = ВремШаблон.Поставщик;
			НоваяСтрока.ТипШаблона    = ВремШаблон.ТипШаблона;
			
		КонецЦикла;
		
	КонецЦикла;		
	
	Для каждого ДопШаблон Из ТаблицаДопШаблонов Цикл
	
		XSLДанные = "
		|<xsl:template ";
		
		Если ЗначениеЗаполнено(ДопШаблон.Name) Тогда
			XSLДанные = XSLДанные + "name=""" + ДопШаблон.Name + """ ";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДопШаблон.Match) Тогда
			XSLДанные = XSLДанные + "match=""" + ДопШаблон.Match + """ ";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДопШаблон.Priority) Тогда
			XSLДанные = XSLДанные + "priority=""" + Формат(ДопШаблон.Priority, "ЧРД="".""") + """ ";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДопШаблон.Mode) Тогда
			XSLДанные = XSLДанные + "mode=""" + ДопШаблон.Mode + """ ";
		КонецЕсли;
		
		
		XSLДанные = XSLДанные + ">";
		XSLДанные = XSLДанные + ДопШаблон.ТекстШаблона;
		XSLДанные = XSLДанные + "</xsl:template>";
		
		Если ДопШаблон.ТипШаблона = Перечисления.ТипыШаблоновСУЗ.Представление Тогда
			ШаблонПредставления = ШаблонПредставления + XSLДанные;
		КонецЕсли;
		
		Если ДопШаблон.ТипШаблона = Перечисления.ТипыШаблоновСУЗ.Скрипт Тогда
			ШаблонСкрипта = ШаблонСкрипта + XSLДанные;
		КонецЕсли;
		
		ТаблицыСтилей = ТаблицыСтилей + ДопШаблон.ТекстСтилей;
	
	КонецЦикла;
	
	XSLДанные = "</xsl:stylesheet>";		
	
	// 1. Добавляем текст стилей основных шаблонов.
	Для каждого Шаблон Из ЦепочкаШаблонов Цикл
		ТаблицыСтилей = ТаблицыСтилей + Строка(Шаблон.ТаблицыСтилей);
	КонецЦикла;	
	
	ШаблонПредставления = ШаблонПредставления + XSLДанные;
	ШаблонСкрипта       = ШаблонСкрипта + XSLДанные;
	
	СтруктураДанных = Новый Структура();
	
	СтруктураДанных.Вставить("ШаблонПредставления", ШаблонПредставления);
	СтруктураДанных.Вставить("ШаблонСкрипта", ШаблонСкрипта);
	СтруктураДанных.Вставить("ТаблицыСтилей", ТаблицыСтилей);
	
	Возврат СтруктураДанных;
	
	
КонецФункции

Функция ПрименитьШаблонКТексту(Знач Текст, Знач ШаблонТекста, Знач ИмяКаталогаРесурсов = "") Экспорт
	
	Если НЕ ЗначениеЗаполнено(Текст) Тогда
		Возврат Текст;
	КонецЕсли;
	
	ТекстШаблона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШаблонТекста, "ТекстШаблона");
	
	Если НЕ ЗначениеЗаполнено(ТекстШаблона) Тогда
		Возврат Текст;
	КонецЕсли;
	
	ТекстШаблона = СтрЗаменить(ТекстШаблона, "{{КаталогРесурсов}}", "<xsl:variable name=""КаталогРесурсов"">"+ИмяКаталогаРесурсов+"</xsl:variable>");
	
	Текст = "<body>" + Текст + "</body>";
	
	Текст = СтрЗаменить(Текст, "&", "#amp;");
	
	ПреобразованиеXSL = Новый ПреобразованиеXSL;
	ПреобразованиеXSL.ЗагрузитьИзСтроки(ТекстШаблона);
	
	РезультатПреобразования = ПреобразованиеXSL.ПреобразоватьИзСтроки(Текст);
	РезультатПреобразования	= СтрЗаменить(РезультатПреобразования, "#amp;", "&");
	
	Возврат РезультатПреобразования;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// РЕДАКТИРОВАНИЕ ОБЪЕКТОВ

// Позволяет определить, можно ли редактировать данные указанного поставщика.
//
Функция ИзменениеДанныхОтПоставщикаЗапрещено(Поставщик, Отказ = Ложь, ПоказыватьСообщение = Истина) Экспорт
	
	Если Отказ = Неопределено Тогда
		Отказ = Ложь;
	КонецЕсли;
	
	Если Константы.ПоказыватьПоследнююВерсиюСУЗ.Получить() И
		Константы.ИзменятьДанныеТолькоПредпочитаемогоПоставщикаСУЗ.Получить() И
		Поставщик <> Константы.ПредпочитатьПоставщикаСУЗ.Получить() Тогда
		
		Если ПоказыватьСообщение Тогда
			Текст = НСтр("ru = 'Редактирование данных поставщика """ + Строка(Поставщик) + """ запрещено'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		Иначе
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБМЕН МАТЕРИАЛАМИ

// Получает параметры главного узла плана обмена "ОбменМатериаламиСУЗ".
//
Функция ПолучитьПараметрыГлавногоУзла(ИмяПараметра = "Код") Экспорт
	
	Если ИмяПараметра = "Код" Тогда
		Возврат "f0e1f496-1ed3-4f47-b06e-46b9bd8da578";
	КонецЕсли;
	
	Если ИмяПараметра = "Наименование" Тогда
		Возврат "Информационная база";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьМассивИменФайловИнформаторовПригодныхДляИмпорта(МассивИменФайловИнформаторов) Экспорт
	
	МассивИменПригодныхФайлов = Новый Массив();
	
	Для каждого ИмяФайла Из МассивИменФайловИнформаторов Цикл

		МассивПараметров = ОбщегоНазначенияСУКлиентСервер.РасщепитьСтроку(ИмяФайла, ".");
		Если МассивПараметров.Количество() < 3 Тогда
			Продолжить;
		КонецЕсли;
		
		КодПакетаДанных = МассивПараметров[1];
		НомерВерсииПакетаДанных = Число(МассивПараметров[2]);
		
		УзелПакетаДанных = ПланыОбмена.ОбменМатериаламиСУЗ.НайтиПоКоду(КодПакетаДанных);
		
		Если (УзелПакетаДанных = ПланыОбмена.ОбменМатериаламиСУЗ.ПустаяСсылка()
			ИЛИ УзелПакетаДанных.НомерПринятого < НомерВерсииПакетаДанных)
			И НЕ УзелПакетаДанных.ЗапретитьИмпортИзКаталогаШаблонов Тогда
			
			МассивИменПригодныхФайлов.Добавить(ИмяФайла);
				
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивИменПригодныхФайлов;
	
КонецФункции

Процедура ЗапретитьВДальнейшемАвтоматическийИмпорт(ОписаниеПакета) Экспорт
	
	УзелПакетаДанных = ПланыОбмена.ОбменМатериаламиСУЗ.НайтиПоКоду(ОписаниеПакета.Код);
	
	Если НЕ ЗначениеЗаполнено(УзелПакетаДанных)
		ИЛИ УзелПакетаДанных.ТипПакетаДанных <> Перечисления.ТипыПакетовДанныхСУЗ.XML_V8 Тогда
		УзелПакетаДанныхОбъект = ПланыОбмена.ОбменМатериаламиСУЗ.СоздатьУзел();
		УзелПакетаДанныхОбъект.ТипПакетаДанных = Перечисления.ТипыПакетовДанныхСУЗ.XML_V8;
	Иначе
		УзелПакетаДанныхОбъект = УзелПакетаДанных.ПолучитьОбъект();
	КонецЕсли;
	
	УзелПакетаДанныхОбъект.Код                               = ОписаниеПакета.Код;
	УзелПакетаДанныхОбъект.Наименование                      = ОписаниеПакета.Наименование;
	УзелПакетаДанныхОбъект.ЭтоИмпортированныйПакет           = Истина;
	УзелПакетаДанныхОбъект.ЗапретитьИмпортИзКаталогаШаблонов = Истина;
	
	УзелПакетаДанныхОбъект.Записать();
	
КонецПроцедуры

Функция ПолучитьОписаниеПакетаДанных(ПутьКПакетуДанныхНаСервере) Экспорт
	
	Возврат ПланыОбмена.ОбменМатериаламиСУЗ.ПолучитьИнформациюОПакетеДанных(ПутьКПакетуДанныхНаСервере, Истина);
	
КонецФункции

Функция ПолучитьПутьКПакетуДанных(АдресФайлаВоВременномХранилище, ИмяФайла) Экспорт 
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
	
	Файл = Новый Файл(ИмяФайла);
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Файл.Расширение);
	
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	Возврат ИмяВременногоФайла;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПОЛНОТЕКСТОВЫЙ ПОИСК

Функция ОбновитьВсеДанныеДляИндексирования() Экспорт
	ОбновитьДанныеДляИндексирования();
КонецФункции
	
Функция ОбновитьДанныеДляИндексирования(ЭлектронныйРесурс = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Очищаем данные регистра ДанныеДляПолнотекстовогоПоискаСУЗ
	
	НаборЗаписей = РегистрыСведений.ДанныеДляПолнотекстовогоПоискаСУЗ.СоздатьНаборЗаписей();
	
	Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		НаборЗаписей.Отбор.ЭлектронныйРесурс.Установить(ЭлектронныйРесурс);
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
	// Записываем данные в регистр
	
	Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		
		ЗаписатьЭлементВДанныеДляИндексирования(ЭлектронныйРесурс);
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СводыЗнанийСУЗ.Ссылка КАК ЭлектронныйРесурс
			|ИЗ
			|	Справочник.СводыЗнанийСУЗ КАК СводыЗнанийСУЗ
			|ГДЕ
			|	СводыЗнанийСУЗ.ЭтоГруппа = ЛОЖЬ
			|	И СводыЗнанийСУЗ.ПометкаУдаления = ЛОЖЬ";

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЗаписатьЭлементВДанныеДляИндексирования(ВыборкаДетальныеЗаписи.ЭлектронныйРесурс);
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

Функция УдалитьДанныеДляИндексирования() Экспорт
	
	НаборЗаписей = РегистрыСведений.ДанныеДляПолнотекстовогоПоискаСУЗ.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
КонецФункции

Процедура ЗаписатьЭлементВДанныеДляИндексирования(Знач ЭлектронныйРесурс,
	                                              Знач ЭлементСодержания=Неопределено,
	                                              Знач СсылкаНаЭлемент=Неопределено,
											      Знач ЭлементПодборки=Неопределено,
												  Знач ЭлементГлоссария=Неопределено,
												  ТаблицаОбработанных=Неопределено) 
												  
	УстановитьПривилегированныйРежим(Истина);	
	
	// Получаем переменные											  
	//
	
	Если ТаблицаОбработанных = Неопределено Тогда
		
		ТаблицаОбработанных = Новый ТаблицаЗначений;
		ТаблицаОбработанных.Колонки.Добавить("ЭлектронныйРесурс");
		ТаблицаОбработанных.Колонки.Добавить("ЭлементСодержания");
		ТаблицаОбработанных.Колонки.Добавить("СсылкаНаЭлемент");
		ТаблицаОбработанных.Колонки.Добавить("ЭлементПодборки");
		ТаблицаОбработанных.Колонки.Добавить("ЭлементГлоссария");
		
	КонецЕсли;
	
	Если ЭлементСодержания = Неопределено Тогда
		ЭлементСодержания = Справочники.СодержаниеСУЗ.ПустаяСсылка();
	КонецЕсли;
	
	Если СсылкаНаЭлемент = Неопределено Тогда
		СсылкаНаЭлемент = Справочники.СодержаниеСУЗ.ПустаяСсылка();
	КонецЕсли;
	
	Если ЭлементПодборки = Неопределено Тогда
		ЭлементПодборки = Справочники.ЭлементыПодборкиСУЗ.ПустаяСсылка();
	КонецЕсли;
	
	Если ЭлементГлоссария = Неопределено Тогда
		ЭлементГлоссария = Справочники.СодержаниеГлоссарияСУЗ.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлектронныйРесурс) И ЗначениеЗаполнено(ЭлементСодержания) И НЕ ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
		
		// Находим ссылку на элемент
		
		Если ЗначениеЗаполнено(ЭлементПодборки) Тогда
			СсылкаНаЭлемент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементПодборки, "СсылкаНаОбъектСУЗ");
		ИначеЕсли ЗначениеЗаполнено(ЭлементГлоссария) Тогда
			СсылкаНаЭлемент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементГлоссария, "ТерминГлоссария");
		Иначе
			СсылкаНаЭлемент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементСодержания, "СсылкаНаЭлемент");
		КонецЕсли;
			
	КонецЕсли;
	
	// Делаем проверки
	//
	
	Если ТаблицаОбработанных.НайтиСтроки(Новый Структура("ЭлектронныйРесурс, ЭлементСодержания, СсылкаНаЭлемент, ЭлементПодборки, ЭлементГлоссария", ЭлектронныйРесурс, ЭлементСодержания, СсылкаНаЭлемент, ЭлементПодборки, ЭлементГлоссария)).Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.ПодборкиСУЗ")
		И ЗначениеЗаполнено(СсылкаНаЭлемент)
		И Справочники.ПодборкиСУЗ.ПустаяПодборка(СсылкаНаЭлемент) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	// Запоминаем обрабатываемый элемент
	//
	
	НоваяСтрока = ТаблицаОбработанных.Добавить();
	НоваяСтрока.ЭлектронныйРесурс = ЭлектронныйРесурс;
	НоваяСтрока.ЭлементСодержания = ЭлементСодержания;
	НоваяСтрока.СсылкаНаЭлемент = СсылкаНаЭлемент;
	НоваяСтрока.ЭлементПодборки = ЭлементПодборки;
	НоваяСтрока.ЭлементГлоссария = ЭлементГлоссария;
	
	// Записываем данные в регистр
	//
	
	Если ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
	
		Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.ФайлыСУЗ") Тогда
			СсылкаНаЭлемент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаЭлемент, "Владелец");
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.ДанныеДляПолнотекстовогоПоискаСУЗ.СоздатьНаборЗаписей();
			
		НаборЗаписей.Отбор.ЭлектронныйРесурс.Установить(ЭлектронныйРесурс);
		НаборЗаписей.Отбор.ЭлементСодержания.Установить(ЭлементСодержания);
		НаборЗаписей.Отбор.СсылкаНаОбъектСУЗ.Установить(СсылкаНаЭлемент);
		НаборЗаписей.Отбор.ЭлементПодборки.Установить(ЭлементПодборки);
		НаборЗаписей.Отбор.ЭлементГлоссария.Установить(ЭлементГлоссария);
			
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.ЭлектронныйРесурс                = ЭлектронныйРесурс;
		НоваяЗапись.ИдентификаторЭлектронногоРесурса = Строка(ЭлектронныйРесурс.УникальныйИдентификатор());
		НоваяЗапись.ЭлементСодержания                = ЭлементСодержания;
		НоваяЗапись.СсылкаНаОбъектСУЗ                = СсылкаНаЭлемент;
		НоваяЗапись.ЭлементПодборки   = ЭлементПодборки;
		НоваяЗапись.ЭлементГлоссария  = ЭлементГлоссария;	
			
		Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.ВопросыСУЗ") Тогда
			НоваяЗапись.Метка = "ДоступноПриНаличииПраваИзмененияЭР";
		КонецЕсли;
		
		НоваяЗапись.Данные = ДанныеДляЗаписиВРегистрПолнотекстовогоПоиска(СсылкаНаЭлемент);
				
		Если ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
			
			НоваяЗапись.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаЭлемент, "Наименование");
			
		Иначе
			
			Если ЗначениеЗаполнено(ЭлементПодборки) Тогда
				
				НоваяЗапись.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементПодборки, "Наименование");
				
			ИначеЕсли ЗначениеЗаполнено(ЭлементСодержания) Тогда
				
				НоваяЗапись.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементСодержания, "Наименование");
				
			Иначе
				
				НоваяЗапись.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлектронныйРесурс, "Наименование");
				
			КонецЕсли;
			
			
		КонецЕсли;
			
		НаборЗаписей.Записать();
		
	КонецЕсли;
		
	//Рекурсивно обходим подчиненные структуры данных
	//
	
	// Содержание электронного ресурса
	
	Если ЗначениеЗаполнено(ЭлектронныйРесурс) И НЕ ЗначениеЗаполнено(ЭлементСодержания) Тогда

		// Обходим содержание электронного ресурса
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СодержаниеСУЗ.Ссылка
			|ИЗ
			|	Справочник.СодержаниеСУЗ КАК СодержаниеСУЗ
			|ГДЕ
			|	СодержаниеСУЗ.ПометкаУдаления = ЛОЖЬ
			|	И СодержаниеСУЗ.Владелец = &ЭлектронныйРесурс";

		Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ЗаписатьЭлементВДанныеДляИндексирования(ЭлектронныйРесурс,
			                                        ВыборкаДетальныеЗаписи.Ссылка,
													,
													,
													,
													ТаблицаОбработанных); // Рекурсия
													
		КонецЦикла;
		
	КонецЕсли;
	
	// Свойства электронного ресурса
	
	Если ЗначениеЗаполнено(ЭлектронныйРесурс) И НЕ ЗначениеЗаполнено(СсылкаНаЭлемент) И НЕ ЗначениеЗаполнено(ЭлементСодержания) Тогда	
		
		// Обходим свойства электронного ресурса
		
		СвойстваЭлектронногоРесурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлектронныйРесурс, "Глоссарий, СправочнаяИнформация, СтартоваяСтраница");
		
		Если ЗначениеЗаполнено(СвойстваЭлектронногоРесурса.Глоссарий) Тогда
			ЗаписатьЭлементВДанныеДляИндексирования(ЭлектронныйРесурс,,СвойстваЭлектронногоРесурса.Глоссарий,,,ТаблицаОбработанных); // Рекурсия
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СвойстваЭлектронногоРесурса.СправочнаяИнформация) Тогда
			ЗаписатьЭлементВДанныеДляИндексирования(ЭлектронныйРесурс,,СвойстваЭлектронногоРесурса.СправочнаяИнформация,,,ТаблицаОбработанных); // Рекурсия
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СвойстваЭлектронногоРесурса.СтартоваяСтраница) Тогда
			ЗаписатьЭлементВДанныеДляИндексирования(ЭлектронныйРесурс,,СвойстваЭлектронногоРесурса.СтартоваяСтраница,,,ТаблицаОбработанных); // Рекурсия
		КонецЕсли;		
		
		// Обходим скрытые ресурсы		
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СкрытыеРесурсы.Ресурс КАК Ресурс
			|ИЗ
			|	Справочник.СводыЗнанийСУЗ.СкрытыеРесурсы КАК СкрытыеРесурсы
			|ГДЕ
			|	СкрытыеРесурсы.Ссылка = &ЭлектронныйРесурс";
		
		Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЗаписатьЭлементВДанныеДляИндексирования(ЭлектронныйРесурс,,ВыборкаДетальныеЗаписи.Ресурс,,,ТаблицаОбработанных); // Рекурсия
		КонецЦикла;
		
	КонецЕсли;
	
	// Содержание подборок
	
	Если ЗначениеЗаполнено(ЭлектронныйРесурс)
		И ЗначениеЗаполнено(ЭлементСодержания)
		И ЗначениеЗаполнено(СсылкаНаЭлемент)
		И ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.ПодборкиСУЗ")
		И НЕ ЗначениеЗаполнено(ЭлементПодборки) Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЭлементыПодборкиСУЗ.Ссылка
			|ИЗ
			|	Справочник.ЭлементыПодборкиСУЗ КАК ЭлементыПодборкиСУЗ
			|ГДЕ
			|	ЭлементыПодборкиСУЗ.Владелец = &Подборка
			|	И ЭлементыПодборкиСУЗ.ПометкаУдаления = ЛОЖЬ";

		Запрос.УстановитьПараметр("Подборка", СсылкаНаЭлемент);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ЗаписатьЭлементВДанныеДляИндексирования(ЭлектронныйРесурс,
			                                        ЭлементСодержания,
													,
													ВыборкаДетальныеЗаписи.Ссылка,
													,
													ТаблицаОбработанных); // Рекурсия

		КонецЦикла;
		
	КонецЕсли;	
	
	// Термины глоссария
	
	Если ЗначениеЗаполнено(ЭлектронныйРесурс)
		И ЗначениеЗаполнено(ЭлементСодержания)
		И ЗначениеЗаполнено(СсылкаНаЭлемент)		
		И ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.ГлоссарииСУЗ")
		И НЕ ЗначениеЗаполнено(ЭлементГлоссария) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СодержаниеГлоссарияСУЗ.Ссылка
			|ИЗ
			|	Справочник.СодержаниеГлоссарияСУЗ КАК СодержаниеГлоссарияСУЗ
			|ГДЕ
			|	СодержаниеГлоссарияСУЗ.ПометкаУдаления = ЛОЖЬ
			|	И СодержаниеГлоссарияСУЗ.Владелец = &Глоссарий";

		Запрос.УстановитьПараметр("Глоссарий", СсылкаНаЭлемент);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ЗаписатьЭлементВДанныеДляИндексирования(ЭлектронныйРесурс,
			                                        ЭлементСодержания,
													СсылкаНаЭлемент,
													ЭлементПодборки,
													ВыборкаДетальныеЗаписи.Ссылка,
													ТаблицаОбработанных); // Рекурсия
													
		КонецЦикла;

	КонецЕсли;
	
	
КонецПроцедуры

Функция ДанныеДляЗаписиВРегистрПолнотекстовогоПоиска(СсылкаНаЭлемент)
	
	// Делаем проверки
	
	ДанныеДляИндексирования = "";
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
		Возврат ДанныеДляИндексирования;
	КонецЕсли;
	
	// Получаем данные термина глоссария	
	
	Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.ТерминыСУЗ") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОпределенияТерминаСУЗ.Текст КАК Текст
			|ИЗ
			|	Справочник.ОпределенияТерминаСУЗ КАК ОпределенияТерминаСУЗ
			|ГДЕ
			|	ОпределенияТерминаСУЗ.Владелец = &Термин
			|	И ОпределенияТерминаСУЗ.ПометкаУдаления = ЛОЖЬ";

		Запрос.УстановитьПараметр("Термин", СсылкаНаЭлемент);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ДанныеДляИндексирования = ДанныеДляИндексирования + ВыборкаДетальныеЗаписи.Текст + Символы.ПС;
		КонецЦикла;

		ФорматированныйДокумент = Новый ФорматированныйДокумент;
		ФорматированныйДокумент.УстановитьHTML(ДанныеДляИндексирования, Новый Структура());
		
		ДанныеДляИндексирования = ФорматированныйДокумент.ПолучитьТекст();
		
		Возврат ДанныеДляИндексирования;
		
	КонецЕсли;
	
	// Получаем данные ресурса, как совокупность данных файлов
	
	Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.РесурсыСУЗ") Тогда		
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ФайлыСУЗ.Ссылка
			|ИЗ
			|	Справочник.ФайлыСУЗ КАК ФайлыСУЗ
			|ГДЕ
			|	ФайлыСУЗ.ПометкаУдаления = ЛОЖЬ
			|	И ФайлыСУЗ.Владелец = &СсылкаНаЭлемент
			|	И ФайлыСУЗ.ЭтоГруппа = ЛОЖЬ
			|	И ФайлыСУЗ.Скрывать = ЛОЖЬ
			|	И ФайлыСУЗ.ВнешнийФайл = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("СсылкаНаЭлемент", СсылкаНаЭлемент);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ДанныеДляИндексирования = ДанныеДляИндексирования + " " + ДанныеДляЗаписиВРегистрПолнотекстовогоПоиска(ВыборкаДетальныеЗаписи.Ссылка); // Рекурсия
		КонецЦикла;
	
	КонецЕсли;
	
	// Получаем данные других объектов из регистра данных	
	
	ИмяРеквизита = Неопределено;
	
	Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.ВопросыСУЗ") Тогда
		
		ИмяРеквизита = Новый Массив();
		ИмяРеквизита.Добавить("ТекстовыеДанные");
		ИмяРеквизита.Добавить("ФорматированныйДокумент");
		ИмяРеквизита.Добавить("ВерныйКомментарий");
		ИмяРеквизита.Добавить("ОшибочныйКомментарий");
		
	КонецЕсли;
	
	Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.СтраницыСУЗ") Тогда
		
		ИмяРеквизита = Новый Массив();
		ИмяРеквизита.Добавить("ТекстовыеДанные");
		ИмяРеквизита.Добавить("ФорматированныйДокумент");
		
	КонецЕсли;
	
	Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.ФайлыСУЗ") Тогда
		
		// Примечание: текстовые данные двоичных данных извлекаются
		// При сохранении файлов.
		
		ИмяРеквизита = Новый Массив();
		ИмяРеквизита.Добавить("ТекстовыеДанные");
		
	КонецЕсли;
	
	Если ИмяРеквизита = Неопределено Тогда
		Возврат ДанныеДляИндексирования;
	КонецЕсли;	

	ВыборкаДанных = ПолучитьДанные(СсылкаНаЭлемент,,Истина,ИмяРеквизита);
		
	Пока ВыборкаДанных.Следующий() Цикл
		
		Если ВыборкаДанных.КодДанных = "Описание" Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого Реквизит Из ИмяРеквизита Цикл
			
			ТекстДанных = "";
			
			Если Реквизит = "ФорматированныйДокумент" Тогда
				ФорматированныйДокумент = ВыборкаДанных[Реквизит].Получить();
			Иначе
				ФорматированныйДокумент = Новый ФорматированныйДокумент;
				ФорматированныйДокумент.УстановитьHTML(ВыборкаДанных[Реквизит], Новый Структура());
			КонецЕсли;
			
			Если ФорматированныйДокумент <> Неопределено 
				И НЕ ФорматированныйДокумент = NULL Тогда 
				
				ТекстДанных = ФорматированныйДокумент.ПолучитьТекст();
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекстДанных) Тогда
				ДанныеДляИндексирования = ДанныеДляИндексирования + ТекстДанных + Символы.ПС;
			КонецЕсли;
		
		КонецЦикла;
	
	КонецЦикла;
	
	Возврат ДанныеДляИндексирования;
	
	
КонецФункции
