#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ПриЗаписиМатериала(Знач СсылкаНаХранение, Знач КонтекстРедактирования = Неопределено) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ПоказатьЕдиныйКаталогМатериаловСУО") Тогда
		Возврат;
	КонецЕсли;
	
	УчебныйМатериал = Справочники.УчебныеМатериалыСУО.НайтиПоРеквизиту("Хранение", СсылкаНаХранение);
	
	Если ЗначениеЗаполнено(УчебныйМатериал) Тогда
		УчебныйМатериалОбъект = УчебныйМатериал.ПолучитьОбъект();
	Иначе
		УчебныйМатериалОбъект = Справочники.УчебныеМатериалыСУО.СоздатьЭлемент();
	КонецЕсли;
	
	УчебныйМатериалОбъект.Заполнить(СсылкаНаХранение);
	Если ТипЗнч(КонтекстРедактирования) = Тип("Структура") Тогда
		КонтекстРедактирования.Свойство("Родитель", УчебныйМатериалОбъект.Родитель)
	КонецЕсли;
	УчебныйМатериалОбъект.Записать();	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
