#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоГруппа Тогда
		Возврат
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ЭлектронныеКурсы") Тогда
		
		Хранение = ДанныеЗаполнения;
		
		ДанныеЭлектронногоКурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения,
			Новый Структура("Тип, ДатаИзменения, Наименование", "Тип", "ДатаИзменения", "Наименование"));
			
		Наименование = ДанныеЭлектронногоКурса.Наименование;
		ДатаИзменения = ДанныеЭлектронногоКурса.ДатаИзменения;
		Размещение = Перечисления.РазмещениеУчебныхМатериаловСУО.БиблиотекаЭлектронногоОбучения;
				
		Если ДанныеЭлектронногоКурса.Тип = Перечисления.ТипыЭлектронныхКурсов.SCORM Тогда
			Тип = Перечисления.ТипыУчебныхМатериаловСУО.Другое;
		КонецЕсли;
		
		Если ДанныеЭлектронногоКурса.Тип = Перечисления.ТипыЭлектронныхКурсов.Слайдовый Тогда
			Тип = Перечисления.ТипыУчебныхМатериаловСУО.СлайдовыйКурс;
		КонецЕсли;
		
		Если ДанныеЭлектронногоКурса.Тип = Перечисления.ТипыЭлектронныхКурсов.Тест Тогда
			Тип = Перечисления.ТипыУчебныхМатериаловСУО.Тест;
		КонецЕсли;
		
		Если ДанныеЭлектронногоКурса.Тип = Перечисления.ТипыЭлектронныхКурсов.Учебник Тогда
			Тип = Перечисления.ТипыУчебныхМатериаловСУО.ЭлектронныйУчебник;
		КонецЕсли;		
		
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ЗаданияСУО") Тогда
		
		Хранение = ДанныеЗаполнения;
		
		ДанныеЗадания = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения,
			Новый Структура("Наименование, ДатаИзменения", "Наименование", "ДатаИзменения"));
		Размещение = Перечисления.РазмещениеУчебныхМатериаловСУО.КорпоративныйУниверситет;
		Тип = Перечисления.ТипыУчебныхМатериаловСУО.ЗаданиеНаПроверку;
		Наименование = ДанныеЗадания.Наименование;
		ДатаИзменения = ДанныеЗадания.ДатаИзменения;
		
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
		
		Хранение = ДанныеЗаполнения;
		
		ДанныеСводаЗнаний = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения,
			Новый Структура("Тип, ДатаИзменения, Наименование", "Тип", "ДатаИзменения", "Наименование"));
		
		Если ДанныеСводаЗнаний.Тип = Перечисления.ТипыЭлектронныхРесурсовСУЗ.ЭлектронныйКурс Тогда
			Тип = Перечисления.ТипыУчебныхМатериаловСУО.ЭлектронныйУчебник;
		КонецЕсли;
		
		Если ДанныеСводаЗнаний.Тип = Перечисления.ТипыЭлектронныхРесурсовСУЗ.Тест Тогда
			Тип = Перечисления.ТипыУчебныхМатериаловСУО.Тест;
		КонецЕсли;		
		
		Если ДанныеСводаЗнаний.Тип = Перечисления.ТипыЭлектронныхРесурсовСУЗ.ПустаяСсылка() Тогда
			Тип = Перечисления.ТипыУчебныхМатериаловСУО.Другое;
		КонецЕсли;
		
		Размещение = Перечисления.РазмещениеУчебныхМатериаловСУО.КонструкторКурсов;
		Наименование = ДанныеСводаЗнаний.Наименование;
		ДатаИзменения = ДанныеСводаЗнаний.ДатаИзменения;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;	
	
	СвойстваЭлементаВБазе = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ПометкаУдаления");
	ДополнительныеСвойства.Вставить("СтараяПометкаУдаления", СвойстваЭлементаВБазе.ПометкаУдаления);	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;	
	
	Если ДополнительныеСвойства.Свойство("СтараяПометкаУдаления")
		И ДополнительныеСвойства.СтараяПометкаУдаления <> ПометкаУдаления Тогда		
		Если ТипЗнч(Хранение) = Тип("СправочникСсылка.ЭлектронныеКурсы") Тогда
			РазработкаЭлектронныхКурсов.УстановитьПометкуУдаленияЭлектронногоКурса(Хранение, ПометкаУдаления); // Помечаем на удаление электронный курс
		Иначе
			РазмещениеОбъект = Хранение.ПолучитьОбъект();
			РазмещениеОбъект.УстановитьПометкуУдаления(ПометкаУдаления, Истина);
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#КонецЕсли
