#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция СлучайныйВариантЗадания(Задание) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВариантыЗаданийСУО.Ссылка КАК Вариант
		|ИЗ
		|	Справочник.ВариантыЗаданийСУО КАК ВариантыЗаданийСУО
		|ГДЕ
		|	ВариантыЗаданийСУО.Владелец = &Задание
		|	И ВариантыЗаданийСУО.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("Задание", Задание);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		Возврат Справочники.ВариантыЗаданийСУО.ПустаяСсылка();	
	КонецЕсли;
	
	ИндексСлучайногоВарианта = ОбщегоНазначенияСУ.СлучайноеЧисло(0, ВыборкаДетальныеЗаписи.Количество()-1);
	Индекс = 0;
	
	// Примечание: маловероятно, что количество вариантов будет велико, поэтому
	// Выборка всех вариантов задания для выбора случайного не окажет влияния на производительность.
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Индекс = ИндексСлучайногоВарианта Тогда
			Возврат ВыборкаДетальныеЗаписи.Вариант;
		КонецЕсли;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	Возврат Справочники.ВариантыЗаданийСУО.ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	ЭтоНовоеЗаданиеНаПроверку = (
		ВидФормы = "ФормаОбъекта"
		И Параметры.Свойство("ПараметрыВыбора")
		И Параметры.ПараметрыВыбора.Свойство("Владелец")
		И Параметры.ПараметрыВыбора.Владелец = Справочники.СхемыМероприятийСУО.Общая);
		
	Если НЕ ЭтоНовоеЗаданиеНаПроверку Тогда
		
		ЭтоНовоеЗаданиеНаПроверку = (
			ВидФормы = "ФормаОбъекта"
			И Параметры.Свойство("ЗначенияЗаполнения")
			И Параметры.ЗначенияЗаполнения.Свойство("Владелец")
			И Параметры.ЗначенияЗаполнения.Владелец = Справочники.СхемыМероприятийСУО.Общая);		
		
	КонецЕсли;		
		
	ЭтоЗаданиеНаПроверку = (
		ВидФормы = "ФормаОбъекта"
		И Параметры.Свойство("Ключ")
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Ключ, "Владелец") 
		= Справочники.СхемыМероприятийСУО.Общая);
		
	Если НЕ ЭтоЗаданиеНаПроверку Тогда		
		
		ЭтоЗаданиеНаПроверку = (
			ВидФормы = "ФормаОбъекта"
			И Параметры.Свойство("ЗначениеКопирования")
			И ЗначениеЗаполнено(Параметры.ЗначениеКопирования)
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ЗначениеКопирования, "Владелец") 
			= Справочники.СхемыМероприятийСУО.Общая);
			
	КонецЕсли;		
		
	Если ЭтоНовоеЗаданиеНаПроверку ИЛИ ЭтоЗаданиеНаПроверку Тогда
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "ЗаданиеНаПроверку";
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли


