#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;		
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользуетсяФорматированныйДокумент Тогда
		Описание = "";
		ФорматированныйДокументОписания = ОписаниеФорматированныйДокумент.Получить();
		Если ТипЗнч(ФорматированныйДокументОписания) = Тип("ФорматированныйДокумент") Тогда
			Описание = ФорматированныйДокументОписания.ПолучитьТекст();
		КонецЕсли;
	Иначе
		ОписаниеФорматированныйДокумент = Неопределено;
	КонецЕсли;		
	
	ДатаИзменения = ТекущаяДатаСеанса();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;	
	
	КонтекстРедактирования = Неопределено;
	ДополнительныеСвойства.Свойство("КонтекстРедактирования", КонтекстРедактирования);
	Справочники.УчебныеМатериалыСУО.ПриЗаписиМатериала(Ссылка, КонтекстРедактирования);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЭтоГруппа
		И НаОсновеЭлектронногоРесурса
		И НЕ НесколькоВариантов Тогда
		
		Если НЕ ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
			Текст = НСтр("ru = 'Заполните поле ""Электронный ресурс""'");
			Поле = "ЭлектронныйРесурс";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли

