
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Родитель = неопределено;
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник.ТекущийЭлемент) = Тип("ТаблицаФормы") Тогда
		Родитель = ОбщегоНазначенияСУКлиент.ВыделеннаяГруппаТаблицы(ПараметрыВыполненияКоманды.Источник.ТекущийЭлемент);
	КонецЕсли;
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("Тип, Родитель", ПредопределенноеЗначение("Перечисление.ТипыЭлектронныхРесурсовСУЗ.ЭлектронныйКурс"), Родитель));
	ОткрытьФорму("Справочник.СводыЗнанийСУЗ.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
