

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура РазместитьЗначениеНастройки()
	
	РазработкаСУЗ.РазметитьПолеРедактированияНастройкиИнтерактивногоРесурса(ЭтотОбъект, ОписаниеТипа);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	КЧ = Новый КвалификаторыЧисла(14,4);
	КС = Новый КвалификаторыСтроки(0);
	
	Элементы.ОписаниеТипа.ДоступныеТипы = Новый ОписаниеТипов("Строка, Булево, Число, Дата", КЧ, КС);
	Элементы.ОписаниеТипа.РазрешитьСоставнойТип = Ложь;
	
	РазработкаСУЗ.РазметитьПолеРедактированияНастройкиИнтерактивногоРесурса(ЭтотОбъект, ОписаниеТипа);
	
	Если Объект.Количество = 1 Тогда
		
		Элементы.ЗначениеНастройки.Видимость = Истина;
		Элементы.ЗначенияНастроек.Видимость = Ложь;
		
	Иначе
		
		Элементы.ЗначениеНастройки.Видимость = Ложь;
		Элементы.ЗначенияНастроек.Видимость = Истина;
		
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЗначенияНастроек.Отбор, "СсылкаНаОбъектСУЗ", ВладелецНастроек);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЗначенияНастроек.Отбор, "Настройка", Объект.Ссылка);
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ОписаниеТипа     = Новый ОписаниеТипов("Строка");
		ВладелецНастроек = ?(ЗначениеЗаполнено(Параметры.ВладелецНастроек), Параметры.ВладелецНастроек, Объект.Владелец);
		
		РазместитьЗначениеНастройки();
		
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Объект);
	РазработкаСУЗ.УстановитьДоступностьДанныхОтПоставщика(ЭтотОбъект);
	//////////////////////////////////////////////////////////////////
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОписаниеТипа     = ТекущийОбъект.ОписаниеТипа.Получить();
	ВладелецНастроек = ?(ЗначениеЗаполнено(Параметры.ВладелецНастроек), Параметры.ВладелецНастроек, Объект.Владелец);
	
	РазместитьЗначениеНастройки();
	
	Если ТекущийОбъект.Количество = 1 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗначенияНастроекИнтерактивныхРесурсовСУЗ.Значение
			|ИЗ
			|	РегистрСведений.ЗначенияНастроекИнтерактивныхРесурсовСУЗ КАК ЗначенияНастроекИнтерактивныхРесурсовСУЗ
			|ГДЕ
			|	ЗначенияНастроекИнтерактивныхРесурсовСУЗ.СсылкаНаОбъектСУЗ = &СсылкаНаОбъектСУЗ
			|	И ЗначенияНастроекИнтерактивныхРесурсовСУЗ.Настройка = &Настройка
			|	И ЗначенияНастроекИнтерактивныхРесурсовСУЗ.Поставщик = &Поставщик
			|	И ЗначенияНастроекИнтерактивныхРесурсовСУЗ.Номер = &Номер";

		Запрос.УстановитьПараметр("Настройка", ТекущийОбъект.Ссылка);
		Запрос.УстановитьПараметр("Номер", 1);
		Запрос.УстановитьПараметр("Поставщик", ТекущийОбъект.Поставщик);
		Запрос.УстановитьПараметр("СсылкаНаОбъектСУЗ", ВладелецНастроек);

		Результат = Запрос.Выполнить();

		Если НЕ Результат.Пустой() Тогда
		
			ВыборкаДетальныеЗаписи = Результат.Выбрать();

			ВыборкаДетальныеЗаписи.Следующий();
			
			ЭтотОбъект["ЗначениеНастройки"] = ВыборкаДетальныеЗаписи.Значение.Получить();
			
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ОписаниеТипа = Новый ХранилищеЗначения(ОписаниеТипа);
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.Количество = 1 Тогда
	
		НаборЗаписей = РегистрыСведений.ЗначенияНастроекИнтерактивныхРесурсовСУЗ.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.СсылкаНаОбъектСУЗ.Установить(ВладелецНастроек);
		НаборЗаписей.Отбор.Настройка.Установить(ТекущийОбъект.Ссылка);
		НаборЗаписей.Отбор.Поставщик.Установить(ТекущийОбъект.Поставщик);
		НаборЗаписей.Отбор.Номер.Установить(1);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.СсылкаНаОбъектСУЗ = ВладелецНастроек;
		НоваяЗапись.Настройка         = ТекущийОбъект.Ссылка;
		НоваяЗапись.Поставщик         = ТекущийОбъект.Поставщик;
		НоваяЗапись.Номер             = 1;
		
		НоваяЗапись.Значение          = Новый ХранилищеЗначения(ЭтотОбъект["ЗначениеНастройки"]);
		НоваяЗапись.Представление     = ЭтотОбъект["ЗначениеНастройки"];
		
		НаборЗаписей.Записать();	
		
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОписаниеТипаПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ ЗначенияНастроек

&НаКлиенте
Процедура ЗначенияНастроекПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияНастроекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбщегоНазначенияСУКлиент.ПередВыборомЭлементаПодчиненногоСправочника(ЭтотОбъект, СтандартнаяОбработка);

КонецПроцедуры







