
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	АдресПерехода = "?id=85067712-f57f-11e5-8d31-f83490ff24be&object=collection&window=this"; // Форма списка
	
	ИмяФормы = ПараметрыВыполненияКоманды.Источник.ИмяФормы;
	
	Если Найти(ИмяФормы, "СводыЗнанийСУЗ") > 0 Тогда
		
		Если Найти(ИмяФормы, "ФормаЭлемента") Тогда
			АдресПерехода = "?id=85067708-f57f-11e5-8d31-f83490ff24be&object=collection&window=this";
		КонецЕсли;
		
		Если Найти(ИмяФормы, "ФормаСписка") Тогда
			АдресПерехода = "?id=85067712-f57f-11e5-8d31-f83490ff24be&object=collection&window=this";
		КонецЕсли;		
		
	КонецЕсли;
	
	Если Найти(ИмяФормы, "ВопросыСУЗ") > 0 Тогда
		АдресПерехода = "?id=850676db-f57f-11e5-8d31-f83490ff24be&object=collection&window=this";
	КонецЕсли;
	
	Если Найти(ИмяФормы, "ГлоссарииСУЗ") > 0 Тогда
		
		Если Найти(ИмяФормы, "ФормаИмпортаГлоссария") Тогда
			АдресПерехода = "?id=850676f6-f57f-11e5-8d31-f83490ff24be&object=collection&window=this";
		Иначе
			АдресПерехода = "?id=850676e6-f57f-11e5-8d31-f83490ff24be&object=collection&window=this";
		КонецЕсли;

	КонецЕсли;
	
	Если Найти(ИмяФормы, "ПодборкиСУЗ") > 0 Тогда
		
		Если Найти(ИмяФормы, "ФормаСозданияИзФайлов") Тогда
			АдресПерехода = "?id=850676ed-f57f-11e5-8d31-f83490ff24be&object=collection&window=this";
		ИначеЕсли Найти(ИмяФормы, "ФормаТеста") Тогда
			АдресПерехода = "?id=a6ef618d-f57f-11e5-8d31-f83490ff24be&object=collection&window=this";
		Иначе
			АдресПерехода = "?id=a6ef6183-f57f-11e5-8d31-f83490ff24be&object=collection&window=this";
		КонецЕсли;
		
	КонецЕсли;
	
	Если Найти(ИмяФормы, "РесурсыСУЗ") > 0 Тогда
		
		Если Найти(ИмяФормы, "ФормаИмпортаФайлов") Тогда
			АдресПерехода = "?id=850676ff-f57f-11e5-8d31-f83490ff24be&object=collection&window=this";
		Иначе
			АдресПерехода = "?id=a6ef6198-f57f-11e5-8d31-f83490ff24be&object=collection&window=this";
		КонецЕсли;		
		
	КонецЕсли;
	
	Если Найти(ИмяФормы, "СтраницыСУЗ") > 0 Тогда
		АдресПерехода = "?id=a6ef617c-f57f-11e5-8d31-f83490ff24be&object=collection&window=this";
	КонецЕсли;
	
	Если Найти(ИмяФормы, "ФайлыСУЗ") > 0 Тогда
		АдресПерехода = "?id=a6ef6198-f57f-11e5-8d31-f83490ff24be&object=collection&window=this";
	КонецЕсли;
	
	ОбъектыСУЗКлиент.ОткрытьОбозреватель(,АдресПерехода,Истина,,,,,Истина,,,РежимОткрытияОкнаФормы.Независимый, НСтр("ru = 'Урок по использованию Конструктора курсов'"), ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
