
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоРасширеннаяФункциональность = ПолучитьФункциональнуюОпцию("РасширеннаяФункциональностьСУО");
	
	ИсключенныеПеременные = Новый Массив;
	
	Если НЕ ЭтоРасширеннаяФункциональность Тогда
		ИсключенныеПеременные.Добавить(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Книга);
		ИсключенныеПеременные.Добавить(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоЗавершенныхМероприятий);
		ИсключенныеПеременные.Добавить(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Мероприятие);
		ИсключенныеПеременные.Добавить(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Месторасположение);
		ИсключенныеПеременные.Добавить(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПинКод);
		ИсключенныеПеременные.Добавить(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПрограммаОбучения);
		ИсключенныеПеременные.Добавить(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПродолжительностьПрограммыОбучения);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеременныеШаблоновСообщенийСУО.Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.ПеременныеШаблоновСообщенийСУО КАК ПеременныеШаблоновСообщенийСУО
		|ГДЕ
		|	НЕ ПеременныеШаблоновСообщенийСУО.Ссылка В (&МассивИсключенных)";
	
	Запрос.Параметры.Вставить("МассивИсключенных", ИсключенныеПеременные);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = Переменные.Добавить();
		НоваяСтрока.Переменная = ВыборкаДетальныеЗаписи.Ссылка;
		НоваяСтрока.Подсказка = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПодсказкаКПеременной(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыПеременные

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Переменные

&НаКлиенте
Процедура ПеременныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ОповеститьОВыборе(Элемент.ТекущиеДанные.Переменная);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПеременную(Команда)
	Если Элементы.Переменные.ТекущиеДанные <> Неопределено Тогда
		ОповеститьОВыборе(Элементы.Переменные.ТекущиеДанные.Переменная);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти





