
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Участники.Очистить();
	
	Если ТекущийОбъект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеОТеме = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущийОбъект.Ссылка, "Контекст, Кому, Автор, ДатаСоздания, ДополнительныеПолучатели, ИсключенныеПолучатели");

	МассивУчастников = Документы.СообщениеСУО.ПолучателиСообщения(ДанныеОТеме);
	
	Для каждого Участник Из МассивУчастников Цикл
	
		НоваяСтрока = Участники.Добавить();
		НоваяСтрока.Пользователь = Участник;
	
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоПолныйИнтерфейс = ПолучитьФункциональнуюОпцию("ПолныйИнтерфейсСУО");
	
	Если НЕ ЭтоПолныйИнтерфейс Тогда
		Элементы.Страницы.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры
