#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ЗапомнитьПроверенныеФайлы(Знач МассивФайлов, Знач Преподаватель=Неопределено, Знач ДатаПроверки=Неопределено, НеОбновлятьДанныеВебКабинета=Неопределено) Экспорт
	
	Если ДатаПроверки = Неопределено Тогда
		ДатаПроверки = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Преподаватель = Неопределено Тогда
		Преподаватель = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Для каждого Файл Из МассивФайлов Цикл
	
		НаборЗаписей = РегистрыСведений.ФайлыПроверенныеПреподавателямиСУО.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Период.Установить(ДатаПроверки);
		НаборЗаписей.Отбор.Файл.Установить(Файл);
		НаборЗаписей.Отбор.Преподаватель.Установить(Преподаватель);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.Файл = Файл;
		НоваяЗапись.Преподаватель = Преподаватель;
		НоваяЗапись.Период = ДатаПроверки;
		
		Если НеОбновлятьДанныеВебКабинета <> Неопределено Тогда
			НаборЗаписей.ДополнительныеСвойства.Вставить("НеОбновлятьДанныеВебКабинета", НеОбновлятьДанныеВебКабинета);
		КонецЕсли;		
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьПроверенныеФайлы(Знач МассивФайлов, Знач Преподаватель=Неопределено, НеОбновлятьДанныеВебКабинета=Неопределено) Экспорт
	
	Если Преподаватель = Неопределено Тогда
		Преподаватель = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Для каждого Файл Из МассивФайлов Цикл
	
		НаборЗаписей = РегистрыСведений.ФайлыПроверенныеПреподавателямиСУО.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Файл.Установить(Файл);
		НаборЗаписей.Отбор.Преподаватель.Установить(Преподаватель);
		
		Если НеОбновлятьДанныеВебКабинета <> Неопределено Тогда
			НаборЗаписей.ДополнительныеСвойства.Вставить("НеОбновлятьДанныеВебКабинета", НеОбновлятьДанныеВебКабинета);
		КонецЕсли;		
		
		НаборЗаписей.Записать();
		
	КонецЦикла;	
	
КонецПроцедуры

// Веб-кабинет

Процедура ОбновитьДанныеВебКабинета(ФайлИлиОтбор, ДополнительныеДанные=Неопределено) Экспорт

	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(ФайлИлиОтбор) = Тип("СправочникСсылка.ПрохождениеОбученияСУОПрисоединенныеФайлы") Тогда
		
		Файл = ФайлИлиОтбор;
		
	Иначе
		
		Если ФайлИлиОтбор.Найти("Файл") = Неопределено Тогда
			Возврат;
		Иначе
			Файл = ФайлИлиОтбор.Файл.Значение;
		КонецЕсли;
		
	КонецЕсли;	
	
	РегистрыСведений.ДанныеВебКабинетаСУО_ПП.УдалитьДанные(Файл, Перечисления.ТипыДанныхВебКабинетаСУО.ФайлУчащегося); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФайлыПроверенныеПреподавателямиСУО.Период КАК ДатаПроверки,
		|	ФайлыПроверенныеПреподавателямиСУО.Преподаватель КАК Преподаватель
		|ИЗ
		|	РегистрСведений.ФайлыПроверенныеПреподавателямиСУО КАК ФайлыПроверенныеПреподавателямиСУО
		|ГДЕ
		|	ФайлыПроверенныеПреподавателямиСУО.Файл = &Файл";

	Запрос.УстановитьПараметр("Файл", Файл);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ОписаниеПроверки = ФайлУчащегосяПроверенJSON(Файл, ВыборкаДетальныеЗаписи.ДатаПроверки);
		
		РегистрыСведений.ДанныеВебКабинетаСУО_ПП.ДобавитьДанные(ВыборкаДетальныеЗаписи.ДатаПроверки, ВыборкаДетальныеЗаписи.Преподаватель, Перечисления.ТипыДанныхВебКабинетаСУО.ФайлУчащегося, Файл, ОписаниеПроверки, Перечисления.ФорматыВебДанныхСУ.json);
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ФайлУчащегосяПроверенJSON(Файл, ДатаПроверки)
	
	ОписаниеФайла = Новый Структура("Идентификатор, Проверено, ДатаПроверкиЧисло");
	ОписаниеФайла.Идентификатор = Файл.УникальныйИдентификатор();
	ОписаниеФайла.Проверено = Истина;
	ОписаниеФайла.ДатаПроверкиЧисло = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ДатаПроверки);
	
	Возврат ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеФайла); 
	
КонецФункции

#КонецЕсли

