
&НаКлиенте
Процедура ПриЗакрытии()
	Если БылиИзменения Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Для вступления изменений в силу перезапустите программу'"));
	КонецЕсли;
КонецПроцедуры

#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	ЗагрузитьФоруму();			
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура АдресИнформационнойБазыСУПриИзменении(Элемент)
	Если ПроверитьКорректностьАдресов() Тогда
		ЗаписатьНастройку(Элемент.Имя);
	Иначе
		ЗагрузитьФоруму();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АдресОбщегоКаталогаСУПриИзменении(Элемент)
	Если ПроверитьКорректностьАдресов() Тогда
		ЗаписатьНастройку(Элемент.Имя);
	Иначе
		ЗагрузитьФоруму();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПутьКОбщемуКаталогуСУПриИзменении(Элемент)
	ЗаписатьНастройку(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура СлужебныйПользовательУказанВПубликацииСУПриИзменении(Элемент)
	ЗаписатьНастройку(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьЗапросыКСервисамСДругихДоменовСУПриИзменении(Элемент)
	ЗаписатьНастройку(Элемент.Имя);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура МастерНастройкиОбщегоКаталога(Команда)
	Закрыть();
	ОткрытьФорму("ОбщаяФорма.МастерНастройкиОбщегоКаталогаСУ");
КонецПроцедуры

//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//

// КК: Удалить команду формы УстановитьКлючДоступаДляВыгрузкиРезультатовОбучения

&НаКлиенте
Процедура УстановитьКлючДоступаДляВыгрузкиРезультатовОбучения(Команда)
	НачатьВводКлючаИнтеграции("ХэшКлючаВыгрузкиРезультатовОбученияСУО");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКлючДоступаДляЗагрузкиПользователей(Команда)
	НачатьВводКлючаИнтеграции("ХэшКлючаЗагрузкиПользователейСУО");
КонецПроцедуры

//----------------------------------//

&НаКлиенте
Процедура ПроверитьСоединениеСБазой(Команда)
	ПроверитьСоединениеСБазойКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАдресБазыАвтоматически(Команда)
	АдресИнформационнойБазыСУ = АвтоАдресИнформационнойБазы;
	ЗаписатьНастройку(Элементы.АдресИнформационнойБазыСУ.Имя);
	ПроверитьСоединениеСБазойКлиент();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗагрузитьФоруму()
	
	АдресИнформационнойБазыСУ = Константы.АдресИнформационнойБазыСУ.Получить();
	АдресОбщегоКаталогаСУ = Константы.АдресОбщегоКаталогаСУ.Получить();
	ПутьКОбщемуКаталогуСУ = Константы.ПутьКОбщемуКаталогуСУ.Получить();
	СлужебныйПользовательУказанВПубликацииСУ = Константы.СлужебныйПользовательУказанВПубликацииСУ.Получить();
	РазрешитьЗапросыКСервисамСДругихДоменовСУ = Константы.РазрешитьЗапросыКСервисамСДругихДоменовСУ.Получить();
		
	ПараметрыКлиента = СтандартныеПодсистемыСервер.ПараметрыКлиентаНаСервере();	
	СтрокаСоединенияИнформационнойБазы = ПараметрыКлиента.Получить("СтрокаСоединенияИнформационнойБазы");	
	СтрокаСоединенияСтруктура = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(СтрокаСоединенияИнформационнойБазы,,";");
	Если СтрокаСоединенияСтруктура.Свойство("ws") Тогда
		АвтоАдресИнформационнойБазы = СтрЗаменить(СтрокаСоединенияСтруктура.ws, """", "");
		Элементы.ЗаполнитьАдресБазыАвтоматически.Видимость = Истина;
	Иначе
		Элементы.ЗаполнитьАдресБазыАвтоматически.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройку(ИмяЭлемента)
	
	УстановитьПривилегированныйРежим(Истина);
	Константы[ИмяЭлемента].Установить(ЭтотОбъект[ИмяЭлемента]);
	УстановитьПривилегированныйРежим(Ложь);	
	ОбновитьПовторноИспользуемыеЗначения();
	БылиИзменения = Истина;
	
КонецПроцедуры

//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//

// КК: удалить группу формы формы ГруппаИнтеграция

&НаКлиенте
Процедура НачатьВводКлючаИнтеграции(ИмяКлюча)
	Подсказка = "Укажите ключ удаленной базы";
	Оповещение = Новый ОписаниеОповещения("ПослеВводаКлюча", ЭтотОбъект, ИмяКлюча);
	ПоказатьВводСтроки(Оповещение, "", Подсказка, 0, Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаКлюча(ЗначениеКлюча, ИмяКлюча) Экспорт
	Если ЗначениеКлюча <> Неопределено Тогда
		УстановитьКлючДоступаНаСервере(ИмяКлюча, ЗначениеКлюча);
		ПоказатьПредупреждение(,НСтр("ru = 'Ключ успешно установлен'"));
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьКлючДоступаНаСервере(ИмяКлюча, ЗначениеКлюча)
	
	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA1);
	Хеширование.Добавить(ЗначениеКлюча);		
	ХэшКлюча = Base64Строка(Хеширование.ХешСумма);
	
	УстановитьПривилегированныйРежим(Истина);
	Константы[ИмяКлюча].Установить(ХэшКлюча);
	УстановитьПривилегированныйРежим(Ложь);		
	
КонецПроцедуры

//----------------------------------//

&НаСервере
Функция ПроверитьСоединениеСБазойНаСервере()
	Возврат ОбщегоНазначенияСУ.ПроверитьСоединениеСБазой();
КонецФункции

&НаКлиенте
Процедура ПроверитьСоединениеСБазойКлиент()
	РезультатПроверки = ПроверитьСоединениеСБазойНаСервере();
	Если РезультатПроверки = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Соединение успешно установлено'");
	Иначе
		ТекстСообщения = РезультатПроверки;
	КонецЕсли;
	ПоказатьПредупреждение(,ТекстСообщения);
КонецПроцедуры

&НаКлиенте
Функция ПроверитьКорректностьАдресов()
	
	Если ЗначениеЗаполнено(ЭтотОбъект.АдресОбщегоКаталогаСУ)
		И ЗначениеЗаполнено(ЭтотОбъект.АдресИнформационнойБазыСУ)
		И ЭтотОбъект.АдресОбщегоКаталогаСУ = ЭтотОбъект.АдресИнформационнойБазыСУ Тогда
		
		ПоказатьПредупреждение(,НСтр("ru = 'Адрес общего каталога не может совпадать с адресом информационной базы'"));				
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти


