
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЕстьПравоИзмененияСотрудников = УправлениеДоступом.ЕстьРоль("ДобавлениеИзменениеСотрудниковСУО",,Пользователи.ТекущийПользователь());
	
	Если НЕ ЕстьПравоИзмененияСотрудников Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РуководителиСУО.ОбъектРуководства
			|ИЗ
			|	РегистрСведений.РуководителиСУО КАК РуководителиСУО
			|ГДЕ
			|	РуководителиСУО.Пользователь = &Пользователь
			|	И (РуководителиСУО.ОбъектРуководства = &Организация
			|	ИЛИ РуководителиСУО.ОбъектРуководства = &ПодразделениеОрганизации
			|	ИЛИ РуководителиСУО.ОбъектРуководства = &ПодразделениеПредприятия)";

		Запрос.УстановитьПараметр("Организация", ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("ПодразделениеОрганизации", ТекущийОбъект.ПодразделениеОрганизации);
		Запрос.УстановитьПараметр("ПодразделениеПредприятия", ТекущийОбъект.ПодразделениеПредприятия);
		Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());

		Результат = Запрос.Выполнить();

		Если Результат.Пустой() Тогда
			
			Текст = НСтр("ru = 'Нарушение прав доступа'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
			
			Возврат;
			
		КонецЕсли;

	КонецЕсли;
	
	
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Пользователь) Тогда
		
		Если НЕ ЗначениеЗаполнено(ИмяНовогоПользователя) Тогда
			
			Текст = НСтр("ru = 'Укажите имя пользователя'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
			
			Возврат;
			
		КонецЕсли;
		
		НовыйПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
		НовыйПользовательОбъект.Наименование = ИмяНовогоПользователя;
		НовыйПользовательОбъект.Записать();
		
		ТекущийОбъект.Пользователь = НовыйПользовательОбъект.Ссылка;
				
		ПользователиСлужебный.ОбновитьСоставыГруппПользователей(Справочники.ГруппыПользователей.ВсеПользователи);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура УказатьСуществующегоПользователя(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УказатьСуществующегоПользователяПродолжение", ЭтотОбъект);		
	ПараметрыФормы = Новый Структура("РежимВыбора", Истина);
	
	ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыФормы,,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьСуществующегоПользователяПродолжение(Пользователь, ДополнительныеПараметры) Экспорт
	
	Запись.Пользователь = Пользователь;
	
	Если ЗначениеЗаполнено(Запись.Пользователь) Тогда
		Элементы.ГруппаДанныеНовогоПользователя.Видимость = Ложь;
		Элементы.Пользователь.Видимость                   = Истина;
	КонецЕсли;
	
	
КонецПроцедуры	

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		Элементы.ГруппаДанныеНовогоПользователя.Видимость = Истина;
		Элементы.Пользователь.Видимость = Ложь;
	Иначе
		Элементы.ГруппаДанныеНовогоПользователя.Видимость = Ложь;
		Элементы.Пользователь.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ДекорацияПредупреждение.Видимость = Запись.ИсходныйКлючЗаписи.Пустой();
	Элементы.ТабельныйНомер.Видимость = ЗначениеЗаполнено(Запись.ТабельныйНомер);

КонецПроцедуры

#КонецОбласти


