
&НаСервере
Функция ПолучитьПараметрыФормы(ПараметрКоманды)
	
	ПараметрыФормы = Новый Структура();
	
	ПараметрыФормы.Вставить("Контекст", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрКоманды, "ПроведениеОбучения"));
	
	РодительскоеПроведение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрКоманды, "РодительскоеПроведение");
	
	Если ЗначениеЗаполнено(РодительскоеПроведение) Тогда
		ПараметрыФормы.Вставить("ДополнительныйКонтекст", РодительскоеПроведение);		
	Иначе
		ПараметрыФормы.Вставить("ДополнительныйКонтекст", ПараметрКоманды);
	КонецЕсли;	
	
	Возврат ПараметрыФормы;
		
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = ПолучитьПараметрыФормы(ПараметрКоманды);	
	ОткрытьФорму("ОбщаяФорма.ОбщениеСУО", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры