#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ПоместитьВГруппу(Знач ПроведениеОбучения, Знач Группа) Экспорт
	
	ПроверитьВозможностьИзменятьСоставГруппы(Группа);
	
	Запись = РегистрыСведений.СоставыГруппПроведенийОбученияСУО.СоздатьМенеджерЗаписи();
	Запись.ГруппаПроведенийОбучения = Группа;
	Запись.ПроведениеОбучения = ПроведениеОбучения;
	Запись.Записать();
	
КонецПроцедуры

Процедура УдалитьИзГруппы(Знач ПроведениеОбучения, Знач Группа) Экспорт
	
	ПроверитьВозможностьИзменятьСоставГруппы(Группа);
	
	Набор = РегистрыСведений.СоставыГруппПроведенийОбученияСУО.СоздатьНаборЗаписей();
	Набор.Отбор.ГруппаПроведенийОбучения.Установить(Группа);
	Набор.Отбор.ПроведениеОбучения.Установить(ПроведениеОбучения);	
	Набор.Записать();
	
КонецПроцедуры

Процедура ПроверитьВозможностьИзменятьСоставГруппы(Знач Группа)
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Группа, "Предопределенный") Тогда
		ВызватьИсключение НСтр("ru = 'Невозможно изменить состав предопределенной группы'");
	КонецЕсли;
	
КонецПроцедуры

Функция ПроведенияОбученияГруппы(Знач Группа) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоставыГрупп.ПроведениеОбучения КАК ПроведениеОбучения
		|ИЗ
		|	РегистрСведений.СоставыГруппПроведенийОбученияСУО КАК СоставыГрупп
		|ГДЕ
		|	СоставыГрупп.ГруппаПроведенийОбучения = &Группа";
	
	Запрос.УстановитьПараметр("Группа", Группа);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПроведениеОбучения");
	
КонецФункции

Функция ЕстьОбученияСПрограммойОбучения(Знач Группа) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СоставыГрупп.ПроведениеОбучения КАК ПроведениеОбучения
		|ИЗ
		|	РегистрСведений.СоставыГруппПроведенийОбученияСУО КАК СоставыГрупп
		|ГДЕ
		|	СоставыГрупп.ГруппаПроведенийОбучения = &Группа
		|	И СоставыГрупп.ПроведениеОбучения.ПроведениеПрограммыОбучения <> &ПроведениеПрограммыОбученияПустаяСсылка
		|	И СоставыГрупп.ПроведениеОбучения.Статус <> &СтатусОтменено
		|	И СоставыГрупп.ПроведениеОбучения.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Группа", Группа);
	Запрос.УстановитьПараметр("ПроведениеПрограммыОбученияПустаяСсылка", Документы.ПроведениеПрограммыОбученияСУО.ПустаяСсылка());
	Запрос.УстановитьПараметр("СтатусОтменено", Перечисления.СтатусыПроведенияОбъектовСУО.Отменено);

	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция Пустая(Знач Группа, Знач ИсключитьОтмененныеИПомеченныеНаУдаление = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ИсключитьОтмененныеИПомеченныеНаУдаление Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	СоставыГрупп.ПроведениеОбучения КАК ПроведениеОбучения
			|ИЗ
			|	РегистрСведений.СоставыГруппПроведенийОбученияСУО КАК СоставыГрупп
			|ГДЕ
			|	СоставыГрупп.ГруппаПроведенийОбучения = &Группа
			|	И СоставыГрупп.ПроведениеОбучения.Статус <> &СтатусОтменено
			|	И СоставыГрупп.ПроведениеОбучения.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("СтатусОтменено", Перечисления.СтатусыПроведенияОбъектовСУО.Отменено);
		
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	СоставыГрупп.ПроведениеОбучения КАК ПроведениеОбучения
			|ИЗ
			|	РегистрСведений.СоставыГруппПроведенийОбученияСУО КАК СоставыГрупп
			|ГДЕ
			|	СоставыГрупп.ГруппаПроведенийОбучения = &Группа";
		
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Группа", Группа);
	
	Возврат Запрос.Выполнить().Пустой();	
	
КонецФункции

Функция ПервоеПроведениеОбученияГруппы(Знач Группа) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения КАК ПроведениеОбучения,
		|	СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.ДатаНачалаПроведения КАК ДатаНачала,
		|	СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.СкрытьВремяПроведения КАК СкрытьВремя
		|ИЗ
		|	РегистрСведений.СоставыГруппПроведенийОбученияСУО КАК СоставыГруппПроведенийОбученияСУО
		|ГДЕ
		|	СоставыГруппПроведенийОбученияСУО.ГруппаПроведенийОбучения = &Группа
		|	И СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.ВариантПродолжительности = &ВариантПродолжительности
		|	И СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.ДатаНачалаПроведения <> &ПустаяДата
		|	И СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.Статус <> &СтатусОтменено
		|	И СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачала";
	
	Запрос.УстановитьПараметр("Группа", Группа);
	Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101"));
	Запрос.УстановитьПараметр("ВариантПродолжительности", Перечисления.ПродолжительностьОбученияСУО.Фиксированная);
	Запрос.УстановитьПараметр("СтатусОтменено", Перечисления.СтатусыПроведенияОбъектовСУО.Отменено);
	
	ТаблицаОбучений = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения КАК ПроведениеОбучения,
		|	СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.ДатаНачалаДоступа КАК ДатаНачала,
		|	СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.СкрытьВремяПроведения КАК СкрытьВремя
		|ИЗ
		|	РегистрСведений.СоставыГруппПроведенийОбученияСУО КАК СоставыГруппПроведенийОбученияСУО
		|ГДЕ
		|	СоставыГруппПроведенийОбученияСУО.ГруппаПроведенийОбучения = &Группа
		|	И СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.ВариантПродолжительности = &ВариантПродолжительности
		|	И СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.ДатаНачалаДоступа <> &ПустаяДата
		|	И СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.Статус <> &СтатусОтменено
		|	И СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачала";
	
	Запрос.УстановитьПараметр("Группа", Группа);
	Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101"));
	Запрос.УстановитьПараметр("ВариантПродолжительности", Перечисления.ПродолжительностьОбученияСУО.Фиксированная);
	Запрос.УстановитьПараметр("СтатусОтменено", Перечисления.СтатусыПроведенияОбъектовСУО.Отменено);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Запрос.Выполнить().Выгрузить(), ТаблицаОбучений);
	
	Если ТаблицаОбучений.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаОбучений.Сортировать("ДатаНачала");
	
	РезультатСтруктура = УправлениеОбучениемСУО.ПервоеПроведенияОбученияПустаяСтруктура();
	РезультатСтруктура.Вставить("ПроведениеОбучения", ТаблицаОбучений[0].ПроведениеОбучения);
	РезультатСтруктура.Вставить("ДатаНачала", ТаблицаОбучений[0].ДатаНачала);
	РезультатСтруктура.Вставить("СкрытьВремя", ТаблицаОбучений[0].СкрытьВремя);
	
	Возврат РезультатСтруктура;
	
КонецФункции

Функция ПреподавателиГруппы(Знач Группа) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения КАК ПроведениеОбучения
		|ПОМЕСТИТЬ ПроведенияОбученияГруппы
		|ИЗ
		|	РегистрСведений.СоставыГруппПроведенийОбученияСУО КАК СоставыГруппПроведенийОбученияСУО
		|ГДЕ
		|	СоставыГруппПроведенийОбученияСУО.ГруппаПроведенийОбучения = &Группа
		|	И СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.Статус <> &СтатусОтменено
		|	И СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПроведениеПреподавателемОбученияСУО.Пользователь КАК Пользователь
		|ИЗ
		|	Документ.ПроведениеПреподавателемОбученияСУО КАК ПроведениеПреподавателемОбученияСУО
		|ГДЕ
		|	ПроведениеПреподавателемОбученияСУО.ПометкаУдаления = ЛОЖЬ
		|	И ПроведениеПреподавателемОбученияСУО.ПроведениеОбучения В
		|			(ВЫБРАТЬ
		|				ПроведенияОбученияГруппы.ПроведениеОбучения
		|			ИЗ
		|				ПроведенияОбученияГруппы)";
	
	Запрос.УстановитьПараметр("Группа", Группа);
	Запрос.УстановитьПараметр("СтатусОтменено", Перечисления.СтатусыПроведенияОбъектовСУО.Отменено);

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
	
КонецФункции

#КонецОбласти

#КонецЕсли
