
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТекущаяСтрока")
		И ЗначениеЗаполнено(Параметры.ТекущаяСтрока) Тогда
		
			Отбор = Неопределено;
			ПолеОрганизация = Новый ПолеКомпоновкиДанных("Владелец");
			Для каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
				
				Если ЭлементОтбора.ЛевоеЗначение = ПолеОрганизация Тогда
					Отбор = ЭлементОтбора;
					Отбор.ПравоеЗначение   = Параметры.ТекущаяСтрока.Владелец;
				КонецЕсли;
			
			КонецЦикла;
		
	КонецЕсли;
	

КонецПроцедуры
