

#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пользователь = Пользователи.ТекущийПользователь();
	
	// Получаем реквизиты формы
	
	ТребуемыеРеквизиты = Новый Структура;
	ТребуемыеРеквизиты.Вставить("ДатаОткрытияЗаписи", "ДатаОткрытияЗаписи");
	ТребуемыеРеквизиты.Вставить("ДатаЗакрытияЗаписи", "ДатаЗакрытияЗаписи");
	
	Если ТипЗнч(Параметры.ПредметЗаписи) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		ТребуемыеРеквизиты.Вставить("Описание", "КомментарийОткрытогоМероприятияДляУчастника");
	КонецЕсли;	
	
	Если ТипЗнч(Параметры.ПредметЗаписи) = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО") Тогда
		ТребуемыеРеквизиты.Вставить("Описание", "КомментарийОткрытойПрограммыДляУчастника");
	КонецЕсли;	
	
	ОбщиеДанныеПредметаЗаявки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.ПредметЗаписи, ТребуемыеРеквизиты);
	
	ДатаОткрытияЗаписи = ОбщиеДанныеПредметаЗаявки.ДатаОткрытияЗаписи;
	ДатаЗакрытияЗаписи = ОбщиеДанныеПредметаЗаявки.ДатаЗакрытияЗаписи;
	
	Если ТипЗнч(ОбщиеДанныеПредметаЗаявки.Описание) = Тип("ХранилищеЗначения") Тогда
		Описание = ОбщиеДанныеПредметаЗаявки.Описание.Получить();
	КонецЕсли;	

	Если НЕ ЗначениеЗаполнено(ДатаОткрытияЗаписи)
		И НЕ ЗначениеЗаполнено(ДатаЗакрытияЗаписи) Тогда		
		Элементы.ГруппаПериодЗаписи.Видимость = Ложь;		
	КонецЕсли;
	
	Если ТипЗнч(Описание) = Тип("ФорматированныйДокумент") Тогда
		ТекстОписаниHTML = ОбщегоНазначенияСУ.ПредставлениеФорматированныйДокументДляПоляHTML(Описание, УникальныйИдентификатор);
		Если НЕ ЗначениеЗаполнено(ТекстОписаниHTML) Тогда
			Элементы.Описание.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗаписатьсяНаОбучение(Команда)
	ОбучениеСУОКлиент.ЗаписатьсяНаОбучение(Параметры.ПредметЗаписи, Пользователь);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьМоеОбучение" Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти
