#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция УстановитьИспользованиеЕдиногоКаталога(Использование) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.НастройкиУчебныхМатериаловСУО.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Прочитать();	
	МенеджерЗаписи.ПоказатьЕдиныйКаталог = Использование;	
	МенеджерЗаписи.Записать();	
	
	УстановитьНастройки();
	
КонецФункции

Процедура УстановитьНастройки() Экспорт
	
	// В этой процедуре не следует использовать функциональные опции
	// из-за того, что она может вызываться фоновым заданием на сервере
	// до обновления кэша функциональных опций.
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.НастройкиУчебныхМатериаловСУО.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Прочитать();
		
	ПоказатьЕдиныйКаталог = МенеджерЗаписи.ПоказатьЕдиныйКаталог;		
	ИспользоватьЭО = ЭлектронноеОбучение.ИспользоватьЭлектронноеОбучение();

	Если ПоказатьЕдиныйКаталог Тогда
		
		МенеджерЗаписи.ПоказатьЛитературу = Ложь;
		МенеджерЗаписи.ПоказатьФайлы = Ложь;
		МенеджерЗаписи.ПоказатьЗадания = Ложь;
		МенеджерЗаписи.ПоказатьЭлектронныеРесурсы = Ложь;
		МенеджерЗаписи.ПоказатьЭлектронныеКурсы = Ложь;
		
	Иначе
		
		РасширеннаяФункциональность = Константы.РасширеннаяФункциональностьСУО.Получить();
		ПолныйИнтерфейс = Константы.ПолныйИнтерфейсСУО.Получить();	
					
		МенеджерЗаписи.ПоказатьЛитературу = РасширеннаяФункциональность;
		МенеджерЗаписи.ПоказатьФайлы = РасширеннаяФункциональность;
		МенеджерЗаписи.ПоказатьЗадания = ПолныйИнтерфейс;
		МенеджерЗаписи.ПоказатьЭлектронныеРесурсы = Истина;
		МенеджерЗаписи.ПоказатьЭлектронныеКурсы = ИспользоватьЭО;			
		
	КонецЕсли;		
	
	Если ИспользоватьЭО Тогда
		РегистрыСведений.ОбщиеНастройкиЭлектронногоОбучения.Сохранить("АдресОбщегоКаталогаНаВебСервере",
			ОбъектыСУЗПовтИсп.АдресОбщегоКаталога());
		РегистрыСведений.ОбщиеНастройкиЭлектронногоОбучения.Сохранить("ПутьКОбщемуКаталогуНаВебСервере",
			ОбъектыСУЗПовтИсп.ПутьКОбщемуКаталогу());
	КонецЕсли;		
		
	МенеджерЗаписи.Записать();	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
