

#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьДоступностьЭлементовФормыНаКлиенте();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	Если ТекущийОбъект.ИспользоватьОбщийКаталогВТонкомКлиентеСУЗ
		И НЕ ЗначениеЗаполнено(ОбъектыСУЗПовтИсп.АдресОбщегоКаталога()) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Перед установкой флажка ""Использовать общий каталог в тонком клиенте"" настройте общий каталог'"),,,,Отказ);
		
	КонецЕсли;
	
	//----------------------------------//
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)	
	ОбновитьПовторноИспользуемыеЗначения();
	ОбновитьИнтерфейс();	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ПоказыватьПоследнююВерсиюСУЗПриИзменении(Элемент)
	ЗаписатьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьДополнительныеМатериалыСУЗПриИзменении(Элемент)
	ЗаписатьНастройки();
	УстановитьДоступностьЭлементовФормыНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьУрокиПоРаботеСКонструкторомСУЗПриИзменении(Элемент)
	ЗаписатьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ИзменятьДанныеТолькоПредпочитаемогоПоставщикаСУЗПриИзменении(Элемент)
	ЗаписатьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ВестиИсториюРазработкиЭлектронныхРесурсовСУОПриИзменении(Элемент)
	ЗаписатьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ХранитьФайлыВидеоВТомахСУЗПриИзменении(Элемент)
	ЗаписатьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ШиринаВидеоПоУмолчаниюСУЗПриИзменении(Элемент)
	ЗаписатьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура МаксимальныйРазмерФайлаСУЗПриИзменении(Элемент)
	ЗаписатьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура РазрешенныеРасширенияФайловСУЗПриИзменении(Элемент)
	ЗаписатьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьОбщиеДополнительныеМатериалыПослеПроверкиСУЗПриИзменении(Элемент)
	ЗаписатьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ПредпочитатьПоставщикаСУЗПриИзменении(Элемент)
	ЗаписатьНастройки();
КонецПроцедуры


//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//

&НаКлиенте
Процедура ИспользоватьОбщийКаталогВТонкомКлиентеСУЗПриИзменении(Элемент)
	ЗаписатьНастройки();
	ПоказатьПредупреждение(,НСтр("ru = 'Для вступления изменения в силу сохраните изменения и перезапустите программу'"));
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьВстроенныйПлеерКурсовВебКабинетаСУЗПриИзменении(Элемент)
	Отказ = Ложь;
	ТекстСообщения = "";
	ПроверитьВозможностьИспользоватьВстроенныйПлеерКурсовВебКабинета(НаборКонстант.ИспользоватьВстроенныйПлеерКурсовВебКабинетаСУЗ, Отказ, ТекстСообщения);
	Если Отказ Тогда
		НаборКонстант.ИспользоватьВстроенныйПлеерКурсовВебКабинетаСУЗ = НЕ НаборКонстант.ИспользоватьВстроенныйПлеерКурсовВебКабинетаСУЗ;
		Модифицированность = Ложь;
		ПоказатьПредупреждение(,ТекстСообщения);		
	Иначе
		ЗаписатьНастройки();	
	КонецЕсли;	
КонецПроцедуры

//----------------------------------//

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура АвтоматическиУстановитьРазрешенныеРасширения(Команда)
	
	ВсеРасширения = РазработкаСУЗПовтИсп.ПолучитьСоответствиеРасширенияПоТипамФайлов();
	
	СписокРасширений = "";
	
	Для каждого Элемент Из ВсеРасширения Цикл
		СписокРасширений = СписокРасширений + Элемент.Ключ + " ";
	КонецЦикла;
	
	СписокРасширений = СтрЗаменить(СписокРасширений, "_", "");
	СписокРасширений = СокрЛП(СписокРасширений);
	
	НаборКонстант.РазрешенныеРасширенияФайловСУЗ = СписокРасширений;
	
	ЗаписатьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура Поставщики(Команда)
	ОткрытьФорму("Справочник.ПоставщикиСУЗ.ФормаСписка");
КонецПроцедуры


//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//

&НаКлиенте
Процедура ДекорацияНастройкаВбСервераОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("ОбщаяФорма.НастройкиВебСервераСУ");
КонецПроцедуры

&НаКлиенте
Процедура НастроитьХранениеФайловВидео(Команда)
	ОткрытьФорму("Обработка.НастройкаХраненияФайловВидеоСУЗ.Форма");
КонецПроцедуры


//----------------------------------//

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормыНаКлиенте()
	
	// ПредпочитатьПоставщикаСУЗ
	
	Если НаборКонстант.ПоказыватьПоследнююВерсиюСУЗ Тогда
		Элементы.ПредпочитатьПоставщикаСУЗ.Доступность = Истина;
	Иначе
		Элементы.ПредпочитатьПоставщикаСУЗ.Доступность = Ложь;
	КонецЕсли;
	
	// ИзменятьДанныеТолькоПредпочитаемогоПоставщикаСУЗ
	
	Если НаборКонстант.ПоказыватьПоследнююВерсиюСУЗ Тогда
		Элементы.ИзменятьДанныеТолькоПредпочитаемогоПоставщикаСУЗ.Доступность = Истина;
	Иначе
		Элементы.ИзменятьДанныеТолькоПредпочитаемогоПоставщикаСУЗ.Доступность = Ложь;
	КонецЕсли;
	
	// ПоказыватьОбщиеДополнительныеМатериалыПослеПроверкиСУЗ
	
	Элементы.ПоказыватьОбщиеДополнительныеМатериалыПослеПроверкиСУЗ.Доступность = НаборКонстант.ИспользоватьДополнительныеМатериалыСУЗ;
	
	// Хранение видео в томах
	
	Если Константы.ХранитьФайлыВТомахНаДиске.Получить() Тогда
		
		Если НаборКонстант.ХранитьФайлыВидеоВТомахСУЗ Тогда
			
			НастройкаНеТребуется = Неопределено;
			
			Обработки.НастройкаХраненияФайловВидеоСУЗ.СостояниеНастройки(,,, НастройкаНеТребуется);
			
			Элементы.НастроитьХранениеФайловВидео.Видимость = НЕ НастройкаНеТребуется;
			Элементы.ДекорацияНастройкаТомов.Видимость = НастройкаНеТребуется;
			
		Иначе
			
			Элементы.НастроитьХранениеФайловВидео.Видимость = Ложь;
			Элементы.ДекорацияНастройкаТомов.Видимость = Ложь;
			
		КонецЕсли;
		
	Иначе
				
		Элементы.ХранитьФайлыВидеоВТомахСУЗ.Доступность = Ложь;
		Элементы.НастроитьХранениеФайловВидео.Видимость = Ложь;
		Элементы.ДекорацияНастройкаТомов.Видимость = Ложь;
		
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройки()
	Записать();
	Оповестить("НастройкиЭлектронныхРесурсовИзменены",,ЭтотОбъект);
	УстановитьДоступностьЭлементовФормыНаКлиенте();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверитьВозможностьИспользоватьВстроенныйПлеерКурсовВебКабинета(ИспользоватьВстроенныйПлеерКурсовВебКабинета, Отказ, ТекстСообщения)
	
	Если ИспользоватьВстроенныйПлеерКурсовВебКабинета Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ РегистрыСведений.ПлеерКурсовВебКабинетаСУЗ.ВстроенныйПлеерИспользуетсяВЭлектронныхРесурсах() Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	ТекстСообщения = НСтр("ru = 'Чтобы полностью отказаться от использования встроенного плеера веб-кабинета переведите все электронные ресурсы на использование автономного плеера'");
	
КонецПроцедуры	

#КонецОбласти


//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//

// Удалить элемент формы:
// - ВестиИсториюРазработкиЭлектронныхРесурсовСУО
// - ДекорацияНастройкаВебСервера
// - ИспользоватьОбщийКаталогВТонкомКлиентеСУЗ
// - ДекорацияНастройкаТонкогоКлиента
// - ГруппаФайлыВидео
// - ИспользоватьВстроенныйПлеерКурсовВебКабинетаСУЗ
// - ДекорацияВстроенныйПлеер

//----------------------------------//