#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЭтоГруппа Тогда
		
		Если ОбщегоНазначенияСУКлиентСервер.ЕстьСовпаденияВКоллекцииЗначений(ГруппаКлассов, "Класс") Тогда
			Текст = НСтр("ru = 'Классы не уникальны'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
			Возврат;
		КонецЕсли;
		
		Если ГруппаКлассов.Количество() < 2 Тогда
			Текст = НСтр("ru = 'Группировка должна содержать не менее двух классов'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
			Возврат;
		КонецЕсли;

	КонецЕсли;
		
КонецПроцедуры

#КонецЕсли