
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор")
		И Параметры.Отбор.Свойство("Владелец")
		И ЗначениеЗаполнено(Параметры.Отбор.Владелец.Ссылка) Тогда
	
		СтандартнаяОбработка = Ложь;
		
		Шкала = Параметры.Отбор.Владелец.Ссылка;

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЭлементыШкалыОценокСУО.Ссылка,
			|	ЭлементыШкалыОценокСУО.Наименование
			|ИЗ
			|	Справочник.ЭлементыШкалыОценокСУО КАК ЭлементыШкалыОценокСУО
			|ГДЕ
			|	ЭлементыШкалыОценокСУО.Владелец = &Шкала
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЭлементыШкалыОценокСУО.Код";

		Запрос.УстановитьПараметр("Шкала", Шкала);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		ДанныеВыбора = Новый СписокЗначений;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ДанныеВыбора.Добавить(ВыборкаДетальныеЗаписи.Ссылка,
			                      ВыборкаДетальныеЗаписи.Наименование);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
