#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Устанавливает параметры загрузки.
//
Процедура УстановитьПараметрыЗагрузкиИзФайлаВТЧ(Параметры) Экспорт
	
КонецПроцедуры

// Производит сопоставление данных, загружаемых в табличную часть ПолноеИмяТабличнойЧасти,
// с данными в ИБ, и заполняет параметры АдресТаблицыСопоставления и СписокНеоднозначностей.
//
// Параметры:
//   ПолноеИмяТабличнойЧасти   – Строка – полное имя табличной части, в которую загружаются данные.
//   АдресЗагружаемыхДанных    – Строка – адрес временного хранилища с таблицей значений, в которой
//                                          находятся загруженные данные из файла. Состав колонок:
//     * Идентификатор – Число – порядковый номер строки;
//     * остальные колонки соответствуют колонкам макета ЗагрузкаИзФайла.
//   АдресТаблицыСопоставления – Строка – адрес временного хранилища с пустой таблицей значений,
//                                          являющейся копией табличной части документа, 
//                                        которую необходимо заполнить из таблицы АдресЗагружаемыхДанных.
//   СписокНеоднозначностей – ТаблицаЗначений – список неоднозначных значений, для которых в ИБ имеется несколько подходящих вариантов.
//       * Колонка       – Строка – имя колонки, в которой была обнаружена неоднозначность;
//       * Идентификатор – Число  – идентификатор строки, в которой была обнаружена неоднозначность.
//   ДополнительныеПараметры   – ЛюбойТип – Любые дополнительные сведения.
//
Процедура СопоставитьЗагружаемыеДанные(АдресЗагружаемыхДанных, АдресТаблицыСопоставления, СписокНеоднозначностей, ПолноеИмяТабличнойЧасти, ДополнительныеПараметры) Экспорт
	
	ТаблицаСопоставления =  ПолучитьИзВременногоХранилища(АдресТаблицыСопоставления);
	ЗагружаемыеДанные = ПолучитьИзВременногоХранилища(АдресЗагружаемыхДанных);
	
	Для каждого СтрокаТаблицы Из ЗагружаемыеДанные Цикл
		
		СтрокаТП = ТаблицаСопоставления.Добавить();
		СтрокаТП.ПолноеИмя = СокрЛП(СтрокаТаблицы.ПолноеИмя);
		СтрокаТП.Имя = СокрЛП(СтрокаТаблицы.Имя);
		СтрокаТП.ЭлектроннаяПочта = СокрЛП(СтрокаТаблицы.ЭлектроннаяПочта);
		СтрокаТП.Телефон = СокрЛП(СтрокаТаблицы.Телефон);
		СтрокаТП.Код = СокрЛП(СтрокаТаблицы.Код);
		
		СтрокаТП.ГруппаПользователей = СокрЛП(СтрокаТаблицы.ГруппаПользователей);
		СтрокаТП.УчебнаяГруппа = СокрЛП(СтрокаТаблицы.УчебнаяГруппа);
		
		СтрокаТП.ВходВПрограммуРазрешен = СокрЛП(СтрокаТаблицы.ВходВПрограммуРазрешен);
		СтрокаТП.АутентификацияСтандартная = СокрЛП(СтрокаТаблицы.АутентификацияСтандартная);
		СтрокаТП.АутентификацияОС = СокрЛП(СтрокаТаблицы.АутентификацияОС);
		СтрокаТП.АутентификацияOpenID = СокрЛП(СтрокаТаблицы.АутентификацияOpenID);
		СтрокаТП.АутентификацияВебКабинета = СокрЛП(СтрокаТаблицы.АутентификацияВебКабинета);
		СтрокаТП.ГруппаДоступа = СокрЛП(СтрокаТаблицы.ГруппаДоступа);
		СтрокаТП.Пароль = СокрЛП(СтрокаТаблицы.Пароль);
		СтрокаТП.ЗапрещеноИзменятьПароль = СокрЛП(СтрокаТаблицы.ЗапрещеноИзменятьПароль);
		СтрокаТП.ПользовательОС = СокрЛП(СтрокаТаблицы.ПользовательОС);
		СтрокаТП.ПоказыватьВСпискеВыбора = СокрЛП(СтрокаТаблицы.ПоказыватьВСпискеВыбора);
		СтрокаТП.ПродолжительностьДоступаВДнях = СокрЛП(СтрокаТаблицы.ПродолжительностьДоступаВДнях);
		СтрокаТП.НомерПроведенияПрограммыОбучения = СокрЛП(СтрокаТаблицы.НомерПроведенияПрограммыОбучения);
		СтрокаТП.НомерНовости = СокрЛП(СтрокаТаблицы.НомерНовости);
		СтрокаТП.Организатор = СокрЛП(СтрокаТаблицы.Организатор);
			
		// Ищем пользователя
		
		НайденныеПользователи = Новый Массив;
		
		// Сначала ищем по коду
		
		Если ЗначениеЗаполнено(СтрокаТП.Код) Тогда
			ПользователиПоКоду = ОбщегоНазначенияСУ.НайтиВсехПользователей("Код", СтрокаТП.Код);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НайденныеПользователи, ПользователиПоКоду, Истина);
		КонецЕсли;
		
		// Ищем по полному имени
		
		Если НайденныеПользователи.Количество() = 0 И ЗначениеЗаполнено(СтрокаТП.ПолноеИмя) Тогда
			ПользователиПоНаименованию = ОбщегоНазначенияСУ.НайтиВсехПользователей("Наименование", СтрокаТП.ПолноеИмя);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НайденныеПользователи, ПользователиПоНаименованию, Истина);
		КонецЕсли;
		
		// Определяем пользователя
		
		Если НайденныеПользователи.Количество() = 1 Тогда
			СтрокаТП.Пользователь = НайденныеПользователи[0];
		ИначеЕсли НайденныеПользователи.Количество() > 1 Тогда
			СтрокаТП.Пропустить = Истина;
		КонецЕсли;
			
	КонецЦикла;

	ПоместитьВоВременноеХранилище(ТаблицаСопоставления, АдресТаблицыСопоставления);
	
КонецПроцедуры

// Возвращает список подходящих объектов ИБ для неоднозначного значения ячейки.
// 
// Параметры:
//   ПолноеИмяТабличнойЧасти  – Строка – Полное имя табличной части, в которую загружаются данные.
//     ИмяКолонки               – Строка – Имя колонки, в который возникла неоднозначность. 
//  СписокНеоднозначностей    – Массив  – Массив для заполнения с неоднозначными данными.
//  ЗагружаемыеЗначенияСтрока – Строка  – Загружаемые данные, на основании которых возникла неоднозначность.
//  ДополнительныеПараметры   – ЛюбойТип – Любые дополнительные сведения
//
Процедура ЗаполнитьСписокНеоднозначностей(ПолноеИмяТабличнойЧасти, СписокНеоднозначностей, ИмяКолонки, ЗагружаемыеЗначенияСтрока, ДополнительныеПараметры) Экспорт
КонецПроцедуры

#КонецОбласти

#КонецЕсли