
Функция ПользователиДокумента(НаполнениеБиблиотеки) Экспорт
	
	Если ТипЗнч(НаполнениеБиблиотеки) = Тип("ДокументСсылка.НаполнениеБиблиотекиПользователейСУО") Тогда
		
		// МассивПользователей
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НаполнениеБиблиотекиПользователейСУОПользователи.Пользователь
			|ИЗ
			|	Документ.НаполнениеБиблиотекиПользователейСУО.Пользователи КАК НаполнениеБиблиотекиПользователейСУОПользователи
			|ГДЕ
			|	НаполнениеБиблиотекиПользователейСУОПользователи.Ссылка = &НаполнениеБиблиотеки";
		
		Запрос.УстановитьПараметр("НаполнениеБиблиотеки", НаполнениеБиблиотеки);
		
		МассивПользователей = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
		
		// МассивУчебныхГрупп
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НаполнениеБиблиотекиПользователейСУОУчебныеГруппы.УчебнаяГруппа
			|ИЗ
			|	Документ.НаполнениеБиблиотекиПользователейСУО.УчебныеГруппы КАК НаполнениеБиблиотекиПользователейСУОУчебныеГруппы
			|ГДЕ
			|	НаполнениеБиблиотекиПользователейСУОУчебныеГруппы.Ссылка = &НаполнениеБиблиотеки";
		
		Запрос.УстановитьПараметр("НаполнениеБиблиотеки", НаполнениеБиблиотеки);
		
		МассивУчебныхГрупп = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("УчебнаяГруппа");
		
		// МассивДолжностей
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НаполнениеБиблиотекиПользователейСУОДолжности.Должность
			|ИЗ
			|	Документ.НаполнениеБиблиотекиПользователейСУО.Должности КАК НаполнениеБиблиотекиПользователейСУОДолжности
			|ГДЕ
			|	НаполнениеБиблиотекиПользователейСУОДолжности.Ссылка = &НаполнениеБиблиотеки";
		
		Запрос.УстановитьПараметр("НаполнениеБиблиотеки", НаполнениеБиблиотеки);
		
		МассивДолжностей = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Должность");
		
		// МассивОрганизаций
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НаполнениеБиблиотекиПользователейСУООрганизации.Организация
			|ИЗ
			|	Документ.НаполнениеБиблиотекиПользователейСУО.Организации КАК НаполнениеБиблиотекиПользователейСУООрганизации
			|ГДЕ
			|	НаполнениеБиблиотекиПользователейСУООрганизации.Ссылка = &НаполнениеБиблиотеки";
		
		Запрос.УстановитьПараметр("НаполнениеБиблиотеки", НаполнениеБиблиотеки);
		
		МассивОрганизаций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация");
		
		// МассивПодразделенийОрганизаций
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НаполнениеБиблиотекиПользователейСУООрганизации.ПодразделениеОрганизации
			|ИЗ
			|	Документ.НаполнениеБиблиотекиПользователейСУО.Организации КАК НаполнениеБиблиотекиПользователейСУООрганизации
			|ГДЕ
			|	НаполнениеБиблиотекиПользователейСУООрганизации.Ссылка = &НаполнениеБиблиотеки";
		
		Запрос.УстановитьПараметр("НаполнениеБиблиотеки", НаполнениеБиблиотеки);
		
		МассивПодразделенийОрганизаций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПодразделениеОрганизации");
		
		// МассивПодразделенийПредприятия
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НаполнениеБиблиотекиПользователейСУОПодразделенияПредприятия.ПодразделениеПредприятия
			|ИЗ
			|	Документ.НаполнениеБиблиотекиПользователейСУО.ПодразделенияПредприятия КАК НаполнениеБиблиотекиПользователейСУОПодразделенияПредприятия
			|ГДЕ
			|	НаполнениеБиблиотекиПользователейСУОПодразделенияПредприятия.Ссылка = &НаполнениеБиблиотеки";
		
		Запрос.УстановитьПараметр("НаполнениеБиблиотеки", НаполнениеБиблиотеки);
		
		МассивПодразделенийПредприятия = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПодразделениеПредприятия");
		
	Иначе
		
		МассивПользователей = НаполнениеБиблиотеки.Пользователи.ВыгрузитьКолонку("Пользователь");
		МассивУчебныхГрупп = НаполнениеБиблиотеки.УчебныеГруппы.ВыгрузитьКолонку("УчебнаяГруппа");
		МассивДолжностей = НаполнениеБиблиотеки.Должности.ВыгрузитьКолонку("Должность");
		МассивОрганизаций = НаполнениеБиблиотеки.Организации.ВыгрузитьКолонку("Организация");
		МассивПодразделенийОрганизаций = НаполнениеБиблиотеки.Организации.ВыгрузитьКолонку("ПодразделениеОрганизации");
		МассивПодразделенийПредприятия = НаполнениеБиблиотеки.ПодразделенияПредприятия.ВыгрузитьКолонку("ПодразделениеПредприятия");
		
	КонецЕсли;
	
	// Учебные группы
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчебныеГруппыСУОСостав.Пользователь КАК Пользователь
		|ИЗ
		|	Справочник.УчебныеГруппыСУО.Состав КАК УчебныеГруппыСУОСостав
		|ГДЕ
		|	УчебныеГруппыСУОСостав.Ссылка В(&УчебныеГруппы)";

	Запрос.УстановитьПараметр("УчебныеГруппы", МассивУчебныхГрупп);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если МассивПользователей.Найти(ВыборкаДетальныеЗаписи.Пользователь) = Неопределено Тогда
			МассивПользователей.Добавить(ВыборкаДетальныеЗаписи.Пользователь);
		КонецЕсли;
		
	КонецЦикла;
	
	// Сотрудники
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиСУОСрезПоследних.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.СотрудникиСУО.СрезПоследних КАК СотрудникиСУОСрезПоследних
		|ГДЕ
		|	СотрудникиСУОСрезПоследних.Уволен = ЛОЖЬ
		|	И (СотрудникиСУОСрезПоследних.Должность В (&Должности)
		|			ИЛИ СотрудникиСУОСрезПоследних.ПодразделениеПредприятия В (&ПодразделенияПредприятия)
		|			ИЛИ СотрудникиСУОСрезПоследних.ПодразделениеОрганизации В (&ПодразделенияОрганизаций)
		|			ИЛИ СотрудникиСУОСрезПоследних.Организация В (&Организации))";

	Запрос.УстановитьПараметр("Должности", МассивДолжностей);
	Запрос.УстановитьПараметр("Организации", МассивОрганизаций);
	Запрос.УстановитьПараметр("ПодразделенияОрганизаций", МассивПодразделенийОрганизаций);
	Запрос.УстановитьПараметр("ПодразделенияПредприятия", МассивПодразделенийПредприятия);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если МассивПользователей.Найти(ВыборкаДетальныеЗаписи.Пользователь) = Неопределено Тогда
			МассивПользователей.Добавить(ВыборкаДетальныеЗаписи.Пользователь);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивПользователей;
	
КонецФункции

// Веб-кабинет

Процедура ОбновитьДанныеВебКабинета(НаполнениеБиблиотеки, ДополнительныеДанные=Неопределено) Экспорт
	

	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем пользователей, библиотека, которых наполняется этим документом
	//
	
	МассивПользователей = ПользователиДокумента(НаполнениеБиблиотеки);
			
	Если ДополнительныеДанные <> Неопределено И
		ТипЗнч(ДополнительныеДанные) = Тип("Структура") И
		ДополнительныеДанные.Свойство("ПользователиДоЗаписи") Тогда
		
		Для каждого Пользователь Из ДополнительныеДанные.ПользователиДоЗаписи Цикл
		
			Если МассивПользователей.Найти(Пользователь) = Неопределено Тогда
				МассивПользователей.Добавить(Пользователь);	
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
	// Формируем библиотеку каждого пользователя целиком
	//
	
	Для каждого Пользователь Из МассивПользователей Цикл
		РегистрыСведений.БиблиотекаПользователейСУО.ОбновитьДанныеВебКабинета(Пользователь);
	КонецЦикла;	
	
	// Зависимости
	//
	
	// Зависимость от элементов библиотеки не требуется,
	// Так как эти зависимости заполняются в разрезе пользователей
	// В регистре БиблиотекаПользователейСУО
	

	
КонецПроцедуры
