#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;			
	
	ДополнительныеСвойства.Вставить("РаспределитьОбновлениеВебКабинетаПоПользователям", Истина);
	ДополнительныеСвойства.Вставить("ИмяОбъектаМетаданныхОбновленияВебКабинета", "РегистрСведений.БиблиотекаПользователейСУО");
	
	ДополнительныеСвойства.Вставить("ПользователиДоЗаписи",
		РегистрыСведений.БиблиотекаПользователейСУО.ПользователиРегистратора(Ссылка));
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;				
	
	ДополнительныеСвойства.Вставить("ПользователиПослеЗаписи",
		Документы.НаполнениеБиблиотекиПользователейСУО.ПользователиДокумента(ЭтотОбъект));

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	МассивПользователей = ДополнительныеСвойства.ПользователиПослеЗаписи;
	
	// Делаем движения
	
	Движения.БиблиотекаПользователейСУО.Записывать = Истина;
	
	Для Каждого Пользователь Из МассивПользователей Цикл
	
		Для Каждого Строка Из ЭлектронныеРесурсы Цикл
			
			Движение = Движения.БиблиотекаПользователейСУО.Добавить();
			Движение.Период       = Дата;
			Движение.Пользователь = Пользователь;
			Движение.Ресурс       = Строка.Электронныйресурс;
			Движение.Фрагмент     = Строка.Фрагмент;
			Движение.Метка        = Строка.МеткаВБиблиотеке;
			
			Если ЗначениеЗаполнено(Движение.Метка) Тогда
				Движение.Библиотека = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Движение.Метка, "Владелец");
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого Строка Из Книги Цикл
			
			Движение = Движения.БиблиотекаПользователейСУО.Добавить();
			Движение.Период       = Дата;
			Движение.Пользователь = Пользователь;
			Движение.Ресурс       = Строка.Книга;
			Движение.Фрагмент     = Строка.Фрагмент;
			Движение.Метка        = Строка.МеткаВБиблиотеке;
			
			Если ЗначениеЗаполнено(Движение.Метка) Тогда
				Движение.Библиотека = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Движение.Метка, "Владелец");
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого Строка Из Файлы Цикл
			
			Движение = Движения.БиблиотекаПользователейСУО.Добавить();
			Движение.Период       = Дата;
			Движение.Пользователь = Пользователь;
			Движение.Ресурс       = Строка.Файл;
			Движение.Метка        = Строка.МеткаВБиблиотеке;
			
			Если ЗначениеЗаполнено(Движение.Метка) Тогда
				Движение.Библиотека = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Движение.Метка, "Владелец");
			КонецЕсли;
			
		КонецЦикла;		
		
	КонецЦикла;
	
	Движения.Записать();
	
	
	
КонецПроцедуры


#КонецОбласти
	

#КонецЕсли
