#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОВЕДНИЕ ОБУЧЕНИЯ

// Возвращает те проведения обучения, на которые надо зачислить нового пользователя
//
Функция ПроведенияОбученияДляАвтоЗачисленияНовогоВнешнегоПользователя(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроведениеОбученияСУО.Регистратор КАК ПроведениеОбучения
		|ИЗ
		|	РегистрСведений.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
		|ГДЕ
		|	ПроведениеОбученияСУО.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыПроведенияОбъектовСУО.Отменено)
		|	И ПроведениеОбученияСУО.ДоступноВсем = ИСТИНА
		|	И ПроведениеОбученияСУО.ДоступноВнешнимПользователям = ИСТИНА
		|	И ПроведениеОбученияСУО.АвтозачислениеНаОбучение = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ПроведениеОбучения");
	
КонецФункции

Функция СкопироватьПроведениеОбучения(Знач ПроведениеОбученияКопирования, Знач НастройкиКопирования) Экспорт
	
	// Копируем обучение
	
	НовоеПроведениеОбученияОбъект = ПроведениеОбученияКопирования.Скопировать();
	
	Если НовоеПроведениеОбученияОбъект.ПометкаУдаления
		ИЛИ НовоеПроведениеОбученияОбъект.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Отменено Тогда
		
		Возврат Неопределено; // Не копируем
		
	КонецЕсли;
	
	НовоеПроведениеОбученияОбъект.Дата = ТекущаяДатаСеанса();
	НовоеПроведениеОбученияОбъект.ДатаИзменения = НовоеПроведениеОбученияОбъект.Дата;
	НовоеПроведениеОбученияОбъект.ИдентификаторОбъектаКопирования = ПроведениеОбученияКопирования.УникальныйИдентификатор();
	НовоеПроведениеОбученияОбъект.ЗапросНаОбучение = Неопределено;
	НовоеПроведениеОбученияОбъект.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Запланировано;
	
	Если НастройкиКопирования.Свойство("ПроведениеПрограммыОбучения") Тогда
		НовоеПроведениеОбученияОбъект.ПроведениеПрограммыОбучения = НастройкиКопирования.ПроведениеПрограммыОбучения;
	КонецЕсли;
	
	Если НастройкиКопирования.Свойство("ТекстДляДобавления") Тогда
		НовоеПроведениеОбученияОбъект.Наименование = НовоеПроведениеОбученияОбъект.Наименование + " " + НастройкиКопирования.ТекстДляДобавления;	
	КонецЕсли;
	
	Если НастройкиКопирования.Свойство("ДатыПроведения")
		И НовоеПроведениеОбученияОбъект.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.Фиксированная  Тогда
				
		РазницаВДатах = 0;
		
		Если ЗначениеЗаполнено(НастройкиКопирования.ДатыПроведения.НоваяДатаНачала)
			И ЗначениеЗаполнено(НастройкиКопирования.ДатыПроведения.СтараяДатаНачала)
			И НастройкиКопирования.ДатыПроведения.НоваяДатаНачала > НастройкиКопирования.ДатыПроведения.СтараяДатаНачала Тогда
			
			РазницаВДатах = НастройкиКопирования.ДатыПроведения.НоваяДатаНачала - НастройкиКопирования.ДатыПроведения.СтараяДатаНачала;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НовоеПроведениеОбученияОбъект.ДатаНачалаПроведения) Тогда
			Если ЗначениеЗаполнено(РазницаВДатах) Тогда
				НовоеПроведениеОбученияОбъект.ДатаНачалаПроведения = НовоеПроведениеОбученияОбъект.ДатаНачалаПроведения + РазницаВДатах;
			Иначе
				НовоеПроведениеОбученияОбъект.ДатаНачалаПроведения = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НовоеПроведениеОбученияОбъект.ДатаОкончанияПроведения) Тогда
			Если ЗначениеЗаполнено(РазницаВДатах) Тогда
				НовоеПроведениеОбученияОбъект.ДатаОкончанияПроведения = НовоеПроведениеОбученияОбъект.ДатаОкончанияПроведения + РазницаВДатах;	
			Иначе
				НовоеПроведениеОбученияОбъект.ДатаОкончанияПроведения = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НовоеПроведениеОбученияОбъект.ДатаНачалаДоступа) Тогда
			Если ЗначениеЗаполнено(РазницаВДатах) Тогда
				НовоеПроведениеОбученияОбъект.ДатаНачалаДоступа = НовоеПроведениеОбученияОбъект.ДатаНачалаДоступа + РазницаВДатах;		
			Иначе
				НовоеПроведениеОбученияОбъект.ДатаНачалаДоступа = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НовоеПроведениеОбученияОбъект.ДатаКонтроля) Тогда
			Если ЗначениеЗаполнено(РазницаВДатах) Тогда
				НовоеПроведениеОбученияОбъект.ДатаКонтроля = НовоеПроведениеОбученияОбъект.ДатаКонтроля + РазницаВДатах;	
			Иначе
				НовоеПроведениеОбученияОбъект.ДатаКонтроля = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	НовоеПроведениеОбученияОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	Если НастройкиКопирования.Свойство("Преподаватели") Тогда
		
		Сценарий = Документы.ПроведениеОбученияСУО.СценарийОбучения(НовоеПроведениеОбученияОбъект.Ссылка);
		
		ПреподавателиМероприятияКопирования = Документы.ПроведениеОбученияСУО.Преподаватели(ПроведениеОбученияКопирования);
		
		Для каждого СтрокаТП Из ПреподавателиМероприятияКопирования Цикл
		
			НазначаемыйПреподаватель = НастройкиКопирования.Преподаватели.Получить(СтрокаТП.Преподаватель);	
			
			Если НЕ ЗначениеЗаполнено(НазначаемыйПреподаватель) Тогда
				Продолжить;
			КонецЕсли;
			
			УправлениеОбучениемСУО.НазначитьПреподавателяНаОбучение(НовоеПроведениеОбученияОбъект.Ссылка, Сценарий, НазначаемыйПреподаватель, СтрокаТП.Роль);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат НовоеПроведениеОбученияОбъект.Ссылка;
	
КонецФункции

// УЧАСТНИКИ

Функция УчастникиОбучения(ПроведениеОбучения = Неопределено, ТолькоАктивные = Ложь, ДиапазонБаллов = Неопределено, Сценарий = Неопределено, Статус = Неопределено, ДлительностьСтруктура = Неопределено, ПрогрессСтруктура = Неопределено, ВидОбучения = Неопределено, Пользователь = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Сценарий = Неопределено
		И ЗначениеЗаполнено(ПроведениеОбучения) Тогда
		
		Сценарий = СценарийОбучения(ПроведениеОбучения);
		
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчастникиОбученияСУО.Регистратор КАК Прохождение,
		|	УчастникиОбученияСУО.Пользователь КАК Пользователь,
		|	УчастникиОбученияСУО.Пользователь.Наименование КАК Наименование
		|ИЗ
		|	РегистрСведений.УчастникиОбученияСУО КАК УчастникиОбученияСУО
		|ГДЕ
		|	ИСТИНА ";
		
	
	Если ЗначениеЗаполнено(Сценарий) Тогда		
		Запрос.Текст = Запрос.Текст + " И УчастникиОбученияСУО.Сценарий = &Сценарий ";				
		Запрос.УстановитьПараметр("Сценарий", Сценарий);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ПроведениеОбучения) Тогда		
		Запрос.Текст = Запрос.Текст + " И УчастникиОбученияСУО.ПроведениеОбучения = &ПроведениеОбучения ";		
		Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Пользователь) Тогда		
		Запрос.Текст = Запрос.Текст + " И УчастникиОбученияСУО.Пользователь = &Пользователь ";		
		Запрос.УстановитьПараметр("Пользователь", Пользователь);		
	КонецЕсли;	
	
	Если ТолькоАктивные Тогда
		Запрос.Текст = Запрос.Текст + " И (УчастникиОбученияСУО.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПрохожденияОбъектовСУО.Проходит) ИЛИ УчастникиОбученияСУО.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПрохожденияОбъектовСУО.Зачислен))"
	КонецЕсли;	
	
	Если ДиапазонБаллов <> Неопределено 
		И ТипЗнч(ДиапазонБаллов) = Тип("Структура")
		И ДиапазонБаллов.Свойство("От")
		И ДиапазонБаллов.Свойство("До")
		И (ЗначениеЗаполнено(ДиапазонБаллов.От) ИЛИ ЗначениеЗаполнено(ДиапазонБаллов.До)) Тогда
		
		Если ЗначениеЗаполнено(ДиапазонБаллов.От) Тогда			
			Запрос.УстановитьПараметр("БаллыОт", ДиапазонБаллов.От);
			Запрос.Текст = Запрос.Текст + " И УчастникиОбученияСУО.Баллы >= &БаллыОт ";			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДиапазонБаллов.До) Тогда			
			Запрос.УстановитьПараметр("БаллыДо", ДиапазонБаллов.До);
			Запрос.Текст = Запрос.Текст + " И УчастникиОбученияСУО.Баллы <= &БаллыДо ";			
		КонецЕсли;		
		
	КонецЕсли;	
	
	Если Статус <> Неопределено И ЗначениеЗаполнено(Статус) Тогда
		Запрос.УстановитьПараметр("Статус", Статус);
		Запрос.Текст = Запрос.Текст + " И УчастникиОбученияСУО.Статус = &Статус";
	КонецЕсли;	
	
	Если ТипЗнч(ДлительностьСтруктура) = Тип("Структура")
		И (ЗначениеЗаполнено(ДлительностьСтруктура.От) ИЛИ ЗначениеЗаполнено(ДлительностьСтруктура.До)) Тогда
		
		ТекущаяДата = ТекущаяДатаСеанса();
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
		Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101"));
		
		Если ЗначениеЗаполнено(ДлительностьСтруктура.От) Тогда
			Запрос.УстановитьПараметр("ДлительностьОт", ДлительностьСтруктура.От*24);			
			Запрос.Текст = Запрос.Текст + " И УчастникиОбученияСУО.ДатаНачалаПрохождения <> &ПустаяДата
			| И РАЗНОСТЬДАТ(УчастникиОбученияСУО.ДатаНачалаПрохождения, &ТекущаяДата, ЧАС) >= &ДлительностьОт";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДлительностьСтруктура.До) Тогда
			Запрос.УстановитьПараметр("ДлительностьДо", ДлительностьСтруктура.До*24);
			Запрос.Текст = Запрос.Текст + " И (УчастникиОбученияСУО.ДатаНачалаПрохождения = &ПустаяДата 
			| ИЛИ РАЗНОСТЬДАТ(УчастникиОбученияСУО.ДатаНачалаПрохождения, &ТекущаяДата, ЧАС) <= &ДлительностьДо)";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ПрогрессСтруктура) = Тип("Структура")
		И (ЗначениеЗаполнено(ПрогрессСтруктура.От) ИЛИ ЗначениеЗаполнено(ПрогрессСтруктура.До)) Тогда
		
		Если ЗначениеЗаполнено(ПрогрессСтруктура.От) Тогда
			Запрос.УстановитьПараметр("ПрогрессОт", ПрогрессСтруктура.От);			
			Запрос.Текст = Запрос.Текст + " И УчастникиОбученияСУО.ЗавершеноВПроцентах >= &ПрогрессОт";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПрогрессСтруктура.До) Тогда
			Запрос.УстановитьПараметр("ПрогрессДо", ПрогрессСтруктура.До);			
			Запрос.Текст = Запрос.Текст + " И УчастникиОбученияСУО.ЗавершеноВПроцентах <= &ПрогрессДо";
		КонецЕсли;
		
	КонецЕсли;	
		
	Если ЗначениеЗаполнено(ВидОбучения) Тогда
		Запрос.УстановитьПараметр("ВидОбучения", ВидОбучения);
		Запрос.Текст = Запрос.Текст + " И УчастникиОбученияСУО.Вид = &ВидОбучения";
	КонецЕсли;	
	
	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
	
КонецФункции

Функция ПрохождениеОбучения(ПроведениеОбучения, Сценарий = Неопределено, Пользователь) Экспорт

	// Важно! Информация о прохождении берется именно из списка
	// Документов "ПрохождениеОбученияСУО", а не из регистров.
	// То есть функция возвращает любое прохождение, даже помеченное на удаление.
	// Это необходимо, так как дублирование документов прохождения обучения не допускается.
	
	// Но допускается создавать повторно прохождение для пользователя, если предыдущее
	// было отменено. Поэтому здесь не учитываем отмененные прохождения. Их как-будто нет.
	
	Если Сценарий = Неопределено Тогда
		Сценарий = СценарийОбучения(ПроведениеОбучения);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрохождениеОбученияСУО.Ссылка КАК Прохождение
		|ИЗ
		|	Документ.ПрохождениеОбученияСУО КАК ПрохождениеОбученияСУО
		|ГДЕ
		|	ПрохождениеОбученияСУО.Пользователь = &Пользователь
		|	И ПрохождениеОбученияСУО.ПроведениеОбучения = &ПроведениеОбучения
		|	И ПрохождениеОбученияСУО.Сценарий = &Сценарий
		|	И ПрохождениеОбученияСУО.Отменено = ЛОЖЬ";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Сценарий", Сценарий);
	Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе
	
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();		
		Возврат ВыборкаДетальныеЗаписи.Прохождение;
		
	КонецЕсли;
		
КонецФункции

Функция ПрохожденияОбучения(ПроведениеОбучения, ВключаяПодчиненные = Ложь, ЗначениеПометкаУдаления = Неопределено, МассивПользователей = Неопределено, СтатусПрохождения = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Не учитываем отмененные прохождения
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрохождениеОбученияСУО.Ссылка КАК Прохождение,
		|	ПрохождениеОбученияСУО.Пользователь,
		|	ПрохождениеОбученияСУО.УчебнаяГруппа,
		|	ПрохождениеОбученияСУО.Пользователь.Наименование КАК Наименование,
		|	ПрохождениеОбученияСУО.РодительскоеПрохождение,
		|	ПрохождениеОбученияСУО.ПроведениеОбучения.Мероприятие КАК Мероприятие,
		|	ПрохождениеОбученияСУО.Заявка,
		|	ПрохождениеОбученияСУО.Проведен,
		|	ПрохождениеОбученияСУО.ПроведениеОбучения
		|ИЗ
		|	Документ.ПрохождениеОбученияСУО КАК ПрохождениеОбученияСУО
		|ГДЕ
		|	&ОтборПроведенияОбучения
		|	И ПрохождениеОбученияСУО.Отменено = ЛОЖЬ
		|	И &ОтборПоРодителю
		|	И &ОтборУдаленных
		|	И &ОтборПользователей
		|   И &ОтборПоСтатусу";
	
	Если ВключаяПодчиненные Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоРодителю", "ИСТИНА");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоРодителю", "ПрохождениеОбученияСУО.РодительскоеПрохождение = ЗНАЧЕНИЕ(Документ.ПрохождениеОбученияСУО.ПустаяСсылка)")
	КонецЕсли;
	
	Если ЗначениеПометкаУдаления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборУдаленных", "ИСТИНА");
	Иначе		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборУдаленных", "ПрохождениеОбученияСУО.ПометкаУдаления = &ЗначениеПометкаУдаления");
		Запрос.Параметры.Вставить("ЗначениеПометкаУдаления", ЗначениеПометкаУдаления);
	КонецЕсли;
	
	Если МассивПользователей = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПользователей", "ИСТИНА");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПользователей", "ПрохождениеОбученияСУО.Пользователь В (&МассивПользователей)");
		Запрос.Параметры.Вставить("МассивПользователей", МассивПользователей);
	КонецЕсли;
	
	Если ТипЗнч(ПроведениеОбучения) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПроведенияОбучения", "ПрохождениеОбученияСУО.ПроведениеОбучения = &ПроведениеОбучения");
	ИначеЕсли ТипЗнч(ПроведениеОбучения) = Тип("Массив") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПроведенияОбучения", "ПрохождениеОбученияСУО.ПроведениеОбучения В (&ПроведениеОбучения)");
	Иначе
		ВызватьИсключение НСтр("ru = 'Неизвестный тип параметра ПроведениеОбучения'")
	КонецЕсли;
	Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);
	
	Если СтатусПрохождения = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоСтатусу", "ИСТИНА");
	ИначеЕсли ТипЗнч(СтатусПрохождения) = Тип("ПеречислениеСсылка.СтатусыПрохожденияОбъектовСУО") Тогда		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоСтатусу", "ПрохождениеОбученияСУО.Статус = &СтатусПрохождения");
		Запрос.УстановитьПараметр("СтатусПрохождения", СтатусПрохождения);
	ИначеЕсли ТипЗнч(СтатусПрохождения) = Тип("Массив") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоСтатусу", "ПрохождениеОбученияСУО.Статус В (&СтатусПрохождения)");
		Запрос.УстановитьПараметр("СтатусПрохождения", СтатусПрохождения);
	Иначе
		ВызватьИсключение НСтр("ru = 'Неизвестный тип параметра СтатусПрохождения'")
	КонецЕсли;

	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();

КонецФункции

Функция ЕстьУчастникОбучения(ПроведениеОбучения = Неопределено, Пользователь = Неопределено, Сценарий = Неопределено, Статус = Неопределено, ДиапазонБаллов = Неопределено, ДлительностьСтруктура = Неопределено, ПрогрессСтруктура = Неопределено, ВидОбучения = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УчастникиОбученияСУО.Регистратор
		|ИЗ
		|	РегистрСведений.УчастникиОбученияСУО КАК УчастникиОбученияСУО
		|ГДЕ";
		
	ЕстьУсловиеОтборка = Ложь;		
		
	Если Пользователь <> Неопределено И ЗначениеЗаполнено(Пользователь) Тогда
		Запрос.УстановитьПараметр("Пользователь", Пользователь);
		Запрос.Текст = Запрос.Текст + " УчастникиОбученияСУО.Пользователь = &Пользователь И";
		ЕстьУсловиеОтборка = Истина;		
	КонецЕсли;
	
	Если ПроведениеОбучения <> Неопределено И ЗначениеЗаполнено(ПроведениеОбучения) Тогда
		Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);
		Запрос.Текст = Запрос.Текст + " УчастникиОбученияСУО.ПроведениеОбучения = &ПроведениеОбучения И";
		ЕстьУсловиеОтборка = Истина;		
	КонецЕсли;	
	
	Если Статус <> Неопределено И ЗначениеЗаполнено(Статус) Тогда
		Запрос.УстановитьПараметр("Статус", Статус);
		Запрос.Текст = Запрос.Текст + " УчастникиОбученияСУО.Статус = &Статус И";
		ЕстьУсловиеОтборка = Истина;		
	КонецЕсли;

	Если Сценарий <> Неопределено И ЗначениеЗаполнено(Сценарий) Тогда
		Запрос.УстановитьПараметр("Сценарий", Сценарий);
		Запрос.Текст = Запрос.Текст + " УчастникиОбученияСУО.Сценарий = &Сценарий И";
		ЕстьУсловиеОтборка = Истина;		
	КонецЕсли;
	
	Если ДиапазонБаллов <> Неопределено 
		И ТипЗнч(ДиапазонБаллов) = Тип("Структура")
		И ДиапазонБаллов.Свойство("От")
		И ДиапазонБаллов.Свойство("До")
		И (ЗначениеЗаполнено(ДиапазонБаллов.От) ИЛИ ЗначениеЗаполнено(ДиапазонБаллов.До)) Тогда
		
		Если ЗначениеЗаполнено(ДиапазонБаллов.От) Тогда
			
			Запрос.УстановитьПараметр("БаллыОт", ДиапазонБаллов.От);
			Запрос.Текст = Запрос.Текст + " УчастникиОбученияСУО.Баллы >= &БаллыОт И";
			ЕстьУсловиеОтборка = Истина;		
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДиапазонБаллов.До) Тогда
			
			Запрос.УстановитьПараметр("БаллыДо", ДиапазонБаллов.До);
			Запрос.Текст = Запрос.Текст + " УчастникиОбученияСУО.Баллы <= &БаллыДо И";
			ЕстьУсловиеОтборка = Истина;		
			
		КонецЕсли;		
		
	КонецЕсли;
	
	Если ТипЗнч(ДлительностьСтруктура) = Тип("Структура")
		И (ЗначениеЗаполнено(ДлительностьСтруктура.От) ИЛИ ЗначениеЗаполнено(ДлительностьСтруктура.До)) Тогда
		
		ТекущаяДата = ТекущаяДатаСеанса();
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
		Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101"));
		
		Если ЗначениеЗаполнено(ДлительностьСтруктура.От) Тогда
			Запрос.УстановитьПараметр("ДлительностьОт", ДлительностьСтруктура.От*24);			
			Запрос.Текст = Запрос.Текст + " УчастникиОбученияСУО.ДатаНачалаПрохождения <> &ПустаяДата И
			| РАЗНОСТЬДАТ(УчастникиОбученияСУО.ДатаНачалаПрохождения, &ТекущаяДата, ЧАС) >= &ДлительностьОт И ";
			ЕстьУсловиеОтборка = Истина;					
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДлительностьСтруктура.До) Тогда
			Запрос.УстановитьПараметр("ДлительностьДо", ДлительностьСтруктура.До*24);
			Запрос.Текст = Запрос.Текст + "  (УчастникиОбученияСУО.ДатаНачалаПрохождения = &ПустаяДата ИЛИ 
			| РАЗНОСТЬДАТ(УчастникиОбученияСУО.ДатаНачалаПрохождения, &ТекущаяДата, ЧАС) <= &ДлительностьДо) И ";
			ЕстьУсловиеОтборка = Истина;					
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ПрогрессСтруктура) = Тип("Структура")
		И (ЗначениеЗаполнено(ПрогрессСтруктура.От) ИЛИ ЗначениеЗаполнено(ПрогрессСтруктура.До)) Тогда
		
		Если ЗначениеЗаполнено(ПрогрессСтруктура.От) Тогда
			Запрос.УстановитьПараметр("ПрогрессОт", ПрогрессСтруктура.От);			
			Запрос.Текст = Запрос.Текст + " УчастникиОбученияСУО.ЗавершеноВПроцентах >= &ПрогрессОт И";
			ЕстьУсловиеОтборка = Истина;					
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПрогрессСтруктура.До) Тогда
			Запрос.УстановитьПараметр("ПрогрессДо", ПрогрессСтруктура.До);			
			Запрос.Текст = Запрос.Текст + " УчастникиОбученияСУО.ЗавершеноВПроцентах <= &ПрогрессДо И";
			ЕстьУсловиеОтборка = Истина;					
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидОбучения) Тогда
		Запрос.УстановитьПараметр("ВидОбучения", ВидОбучения);
		Запрос.Текст = Запрос.Текст + " УчастникиОбученияСУО.Вид = &ВидОбучения И";
		ЕстьУсловиеОтборка = Истина;			
	КонецЕсли;
	
	Если ЕстьУсловиеОтборка Тогда
		Запрос.Текст = Сред(Запрос.Текст, 1, СтрДлина(Запрос.Текст) - 1);
		Возврат НЕ Запрос.Выполнить().Пустой();		
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция КоличествоУчастниковОбучения(ПроведениеОбучения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(УчастникиОбученияСУО.Пользователь) КАК КоличествоПользователей
		|ИЗ
		|	РегистрСведений.УчастникиОбученияСУО КАК УчастникиОбученияСУО
		|ГДЕ
		|	УчастникиОбученияСУО.ПроведениеОбучения = &ПроведениеОбучения";
	
	Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.КоличествоПользователей;
		
КонецФункции

Функция ВозможныеУчастникиОбучения(ПроведениеОбучения) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ПроведениеОбучения.ОткрытоДляРуководителей Тогда
		
		Если ПроведениеОбучения.ОткрытоДляВсех Тогда
			
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	РуководителиСУО.Пользователь КАК Пользователь
				|ИЗ
				|	РегистрСведений.РуководителиСУО КАК РуководителиСУО";
			
		Иначе
			
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	РуководителиСУО.Пользователь КАК Пользователь
				|ИЗ
				|	Документ.ПроведениеОбученияСУО.УчебныеГруппы КАК ПроведениеОбученияСУОУчебныеГруппы
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РуководителиСУО КАК РуководителиСУО
				|		ПО ПроведениеОбученияСУОУчебныеГруппы.УчебнаяГруппа = РуководителиСУО.ОбъектРуководства
				|ГДЕ
				|	ПроведениеОбученияСУОУчебныеГруппы.Ссылка = &ПроведениеОбучения
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	РуководителиСУО.Пользователь КАК Пользователь
				|ИЗ
				|	Документ.ПроведениеОбученияСУО.Организации КАК ПроведениеОбученияСУООрганизации
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РуководителиСУО КАК РуководителиСУО
				|		ПО ПроведениеОбученияСУООрганизации.Организация = РуководителиСУО.ОбъектРуководства
				|ГДЕ
				|	ПроведениеОбученияСУООрганизации.Ссылка = &ПроведениеОбучения
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	РуководителиСУО.Пользователь КАК Пользователь
				|ИЗ
				|	Документ.ПроведениеОбученияСУО.ПодразделенияПредприятия КАК ПроведениеОбученияСУОПодразделенияПредприятия
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РуководителиСУО КАК РуководителиСУО
				|		ПО ПроведениеОбученияСУОПодразделенияПредприятия.ПодразделениеПредприятия = РуководителиСУО.ОбъектРуководства
				|ГДЕ
				|	ПроведениеОбученияСУОПодразделенияПредприятия.Ссылка = &ПроведениеОбучения";
			
				
			Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);
				
		КонецЕсли;
		
	Иначе
		
		Если ПроведениеОбучения.ОткрытоДляВсех Тогда

			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Пользователи.Ссылка КАК Пользователь
				|ИЗ
				|	Справочник.Пользователи КАК Пользователи
				|ГДЕ
				|	Пользователи.ПометкаУдаления = ЛОЖЬ";

		Иначе
			
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	УчебныеГруппыСУОСостав.Пользователь КАК Пользователь
				|ИЗ
				|	Документ.ПроведениеОбученияСУО.УчебныеГруппы КАК ПроведениеОбученияСУОУчебныеГруппы
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчебныеГруппыСУО.Состав КАК УчебныеГруппыСУОСостав
				|		ПО ПроведениеОбученияСУОУчебныеГруппы.УчебнаяГруппа = УчебныеГруппыСУОСостав.Ссылка
				|ГДЕ
				|	ПроведениеОбученияСУОУчебныеГруппы.Ссылка = &ПроведениеОбучения
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	СотрудникиСУОСрезПоследних.Пользователь
				|ИЗ
				|	Документ.ПроведениеОбученияСУО.Должности КАК ПроведениеОбученияСУОДолжности
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиСУО.СрезПоследних(, Уволен = ЛОЖЬ) КАК СотрудникиСУОСрезПоследних
				|		ПО ПроведениеОбученияСУОДолжности.Должность = СотрудникиСУОСрезПоследних.Должность
				|ГДЕ
				|	ПроведениеОбученияСУОДолжности.Ссылка = &ПроведениеОбучения
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	СотрудникиСУОСрезПоследних.Пользователь
				|ИЗ
				|	Документ.ПроведениеОбученияСУО.Организации КАК ПроведениеОбученияСУООрганизации
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиСУО.СрезПоследних(, Уволен = ЛОЖЬ) КАК СотрудникиСУОСрезПоследних
				|		ПО ПроведениеОбученияСУООрганизации.Организация = СотрудникиСУОСрезПоследних.Организация
				|ГДЕ
				|	ПроведениеОбученияСУООрганизации.Ссылка = &ПроведениеОбучения
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	СотрудникиСУОСрезПоследних.Пользователь
				|ИЗ
				|	Документ.ПроведениеОбученияСУО.ПодразделенияПредприятия КАК ПроведениеОбученияСУОПодразделенияПредприятия
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиСУО.СрезПоследних(, Уволен = ЛОЖЬ) КАК СотрудникиСУОСрезПоследних
				|		ПО ПроведениеОбученияСУОПодразделенияПредприятия.ПодразделениеПредприятия = СотрудникиСУОСрезПоследних.ПодразделениеПредприятия
				|ГДЕ
				|	ПроведениеОбученияСУОПодразделенияПредприятия.Ссылка = &ПроведениеОбучения
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	СтудентыООСрезПоследних.Пользователь
				|ИЗ
				|	РегистрСведений.СтудентыОО.СрезПоследних КАК СтудентыООСрезПоследних
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроведениеОбученияСУО.Курсы КАК ПроведениеОбученияСУОКурсы
				|		ПО СтудентыООСрезПоследних.Курс = ПроведениеОбученияСУОКурсы.Курс
				|ГДЕ
				|	ПроведениеОбученияСУОКурсы.Ссылка = &ПроведениеОбучения
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	СтудентыООСрезПоследних.Пользователь
				|ИЗ
				|	РегистрСведений.СтудентыОО.СрезПоследних КАК СтудентыООСрезПоследних
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроведениеОбученияСУО.Специальности КАК ПроведениеОбученияСУОСпециальности
				|		ПО СтудентыООСрезПоследних.Специальность = ПроведениеОбученияСУОСпециальности.Специальность
				|ГДЕ
				|	ПроведениеОбученияСУОСпециальности.Ссылка = &ПроведениеОбучения
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	СтудентыООСрезПоследних.Пользователь
				|ИЗ
				|	РегистрСведений.СтудентыОО.СрезПоследних КАК СтудентыООСрезПоследних
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроведениеОбученияСУО.Отделения КАК ПроведениеОбученияСУООтделения
				|		ПО СтудентыООСрезПоследних.Отделение = ПроведениеОбученияСУООтделения.Отделение
				|ГДЕ
				|	ПроведениеОбученияСУООтделения.Ссылка = &ПроведениеОбучения
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	СтудентыООСрезПоследних.Пользователь
				|ИЗ
				|	РегистрСведений.СтудентыОО.СрезПоследних КАК СтудентыООСрезПоследних
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроведениеОбученияСУО.ГруппыСтудентов КАК ПроведениеОбученияСУОГруппыСтудентов
				|		ПО СтудентыООСрезПоследних.УчебнаяГруппа = ПроведениеОбученияСУОГруппыСтудентов.УчебнаяГруппа
				|ГДЕ
				|	ПроведениеОбученияСУОГруппыСтудентов.Ссылка = &ПроведениеОбучения";
				
			Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);
				
		КонецЕсли;
		
	КонецЕсли;
		
	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
	
КонецФункции

Функция ПроверитьВозможностьЗачисленияНаОбучение(Пользователь, ПроведениеОбучения, ДанныеПроведенияОбучения = Неопределено, ПрохождениеОбучения = Неопределено) Экспорт
	
	РезультатПроверки = Новый Структура("ЕстьОшибки, ТекстОшибки", Ложь, "");
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		РезультатПроверки.ЕстьОшибки  = Истина;
		РезультатПроверки.ТекстОшибки = НСтр("ru = 'Пользователь не задан'");
		Возврат РезультатПроверки;				
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПроведениеОбучения) Тогда
		РезультатПроверки.ЕстьОшибки  = Истина;
		РезультатПроверки.ТекстОшибки = НСтр("ru = 'Проведение обучение не задано'");
		Возврат РезультатПроверки;				
	КонецЕсли;	
	
	// Получаем данные
	
	Если ДанныеПроведенияОбучения = Неопределено Тогда
		ДанныеПроведенияОбучения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеОбучения, "Статус, ДатаКонтроля, МаксимальноеКоличествоУчастников, ДатаОткрытияЗаписи, ДатаЗакрытияЗаписи, ПрименениеУсловийЗачисления, Мероприятие, ФильтрПоДатеПриемаНаРаботу");
	КонецЕсли;	
	
	ТекущаяДата = ТекущаяДатаСеанса();	
	
	Если ПрохождениеОбучения = Неопределено Тогда
		Сценарий = Документы.ПроведениеОбученияСУО.СценарийОбучения(ПроведениеОбучения);
		ПрохождениеОбучения = Документы.ПроведениеОбученияСУО.ПрохождениеОбучения(ПроведениеОбучения, Сценарий, Пользователь);
	КонецЕсли;
	
	// Делаем проверки	
	
	Если ДанныеПроведенияОбучения.МаксимальноеКоличествоУчастников > 0 Тогда
		
		КоличествоУчастников = Документы.ПроведениеОбученияСУО.КоличествоУчастниковОбучения(ПроведениеОбучения);		
		Если КоличествоУчастников >= ДанныеПроведенияОбучения.МаксимальноеКоличествоУчастников Тогда
			РезультатПроверки.ЕстьОшибки  = Истина;
			РезультатПроверки.ТекстОшибки = НСтр("ru = 'Превышено допустимое количество участников'"); 
			Возврат РезультатПроверки;			
		КонецЕсли;		
		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ДанныеПроведенияОбучения.ДатаКонтроля) И ТекущаяДата > ДанныеПроведенияОбучения.ДатаКонтроля Тогда
			
		РезультатПроверки.ЕстьОшибки  = Истина;
		РезультатПроверки.ТекстОшибки = НСтр("ru = 'Дата контроля обучения прошла'"); 
		Возврат РезультатПроверки;		
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеПроведенияОбучения.ДатаОткрытияЗаписи)
		И ТекущаяДата < ДанныеПроведенияОбучения.ДатаОткрытияЗаписи Тогда
			
		РезультатПроверки.ЕстьОшибки  = Истина;
		РезультатПроверки.ТекстОшибки = НСтр("ru = 'Запись начинается с %1'"); 
		РезультатПроверки.ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(РезультатПроверки.ТекстОшибки, ДанныеПроведенияОбучения.ДатаОткрытияЗаписи);
		Возврат РезультатПроверки;			
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеПроведенияОбучения.ДатаЗакрытияЗаписи)
		И ТекущаяДата > ДанныеПроведенияОбучения.ДатаЗакрытияЗаписи Тогда
		
		РезультатПроверки.ЕстьОшибки  = Истина;
		РезультатПроверки.ТекстОшибки = НСтр("ru = 'Запись была доступна до %1'"); 
		РезультатПроверки.ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(РезультатПроверки.ТекстОшибки, ДанныеПроведенияОбучения.ДатаЗакрытияЗаписи);
		Возврат РезультатПроверки;			
		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ДанныеПроведенияОбучения.ФильтрПоДатеПриемаНаРаботу) Тогда
		
		Если РегистрыСведений.СотрудникиСУО.ЭтоСотрудник(Пользователь)
			И НЕ РегистрыСведений.СотрудникиСУО.СуществуетСотрудникПринятыйПослеДаты(Пользователь, ДанныеПроведенияОбучения.ФильтрПоДатеПриемаНаРаботу) Тогда
			
			РезультатПроверки.ЕстьОшибки  = Истина;
			РезультатПроверки.ТекстОшибки = НСтр("ru = 'Могут быть зачислены только сотрудники, принятые после %1'"); 
			РезультатПроверки.ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				РезультатПроверки.ТекстОшибки, Формат(ДанныеПроведенияОбучения.ФильтрПоДатеПриемаНаРаботу, "ДЛФ=D"));
			Возврат РезультатПроверки;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УсловияЗачисленияУчастников.Сценарий,
		|	УсловияЗачисленияУчастников.Статус,
		|	УсловияЗачисленияУчастников.НачалоДиапазонаБаллов КАК НачалоДиапазонаБаллов,
		|	УсловияЗачисленияУчастников.КонецДиапазонаБаллов КАК КонецДиапазонаБаллов
		|ИЗ
		|	Документ.ПроведениеОбученияСУО.УсловияЗачисленияУчастников КАК УсловияЗачисленияУчастников
		|ГДЕ
		|	УсловияЗачисленияУчастников.Ссылка = &ПроведениеОбучения
		|	И (УсловияЗачисленияУчастников.Ссылка.АвтозачислениеНаОбучение = ИСТИНА
		|			ИЛИ УсловияЗачисленияУчастников.Ссылка.ОткрытоеМероприятие = ИСТИНА)";
	
	Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаУсловий    = РезультатЗапроса.Выбрать();
		КоличествоУсловий = ВыборкаУсловий.Количество();
		КоличествоВыполненныхУсловий = 0;		
		МожноЗачислять = Ложь;		
		
		Пока ВыборкаУсловий.Следующий() Цикл
			
			ДиапазонБаллов = Новый Структура("От, До", ВыборкаУсловий.НачалоДиапазонаБаллов, ВыборкаУсловий.КонецДиапазонаБаллов);
			
			// Если в правиле указано проведение обучение, то смотрим по нему,
			// независимо от того, является оно сценарием или нет.
			
			Если ТипЗнч(ВыборкаУсловий.Сценарий) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
				
				Если ЕстьУчастникОбучения(ВыборкаУсловий.Сценарий ,Пользователь,, ВыборкаУсловий.Статус, ДиапазонБаллов) Тогда
					КоличествоВыполненныхУсловий = КоличествоВыполненныхУсловий + 1;
				КонецЕсли;								
				
			Иначе
				
				Если ЕстьУчастникОбучения(,Пользователь, ВыборкаУсловий.Сценарий, ВыборкаУсловий.Статус, ДиапазонБаллов) Тогда
					КоличествоВыполненныхУсловий = КоличествоВыполненныхУсловий + 1;
				КонецЕсли;				
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ДанныеПроведенияОбучения.ПрименениеУсловийЗачисления = Перечисления.ВариантыПримененияУсловийСУО.И Тогда			
			МожноЗачислять = ?(КоличествоУсловий = КоличествоВыполненныхУсловий, Истина, Ложь);			
		КонецЕсли;
		
		Если ДанныеПроведенияОбучения.ПрименениеУсловийЗачисления = Перечисления.ВариантыПримененияУсловийСУО.ИЛИ Тогда
			МожноЗачислять = ?(КоличествоВыполненныхУсловий > 0, Истина, Ложь);
		КонецЕсли;		
		
		Если НЕ МожноЗачислять Тогда
			
			РезультатПроверки.ЕстьОшибки  = Истина;
			РезультатПроверки.ТекстОшибки = НСтр("ru = 'Условия зачисления не выполнены'"); 
			Возврат РезультатПроверки;
			
		КонецЕсли;		
		
	КонецЕсли;

	Если ЗначениеЗаполнено(ДанныеПроведенияОбучения.Мероприятие)
		И УправлениеОбучениемСУОПовтИсп.ЗапрещеноПовторноеПрохождениеМероприятия(ДанныеПроведенияОбучения.Мероприятие) Тогда		
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	УчастникиОбученияСУО.Регистратор
			|ИЗ
			|	РегистрСведений.УчастникиОбученияСУО КАК УчастникиОбученияСУО
			|ГДЕ
			|	УчастникиОбученияСУО.Пользователь = &Пользователь
			|	И УчастникиОбученияСУО.Сценарий = &Сценарий
			|	И УчастникиОбученияСУО.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыПрохожденияОбъектовСУО.НеЗавершил)
			|	И УчастникиОбученияСУО.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыПрохожденияОбъектовСУО.НеДопущен)";
		
		Запрос.УстановитьПараметр("Пользователь", Пользователь);
		Запрос.УстановитьПараметр("Сценарий", ДанныеПроведенияОбучения.Мероприятие);
		
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			
			РезультатПроверки.ЕстьОшибки  = Истина;
			РезультатПроверки.ТекстОшибки = НСтр("ru = 'Пользователь проходил обучение ранее'");
			Возврат РезультатПроверки;			
			
		КонецЕсли;
	
	КонецЕсли;
	
	
	// Завершаем
	
	Возврат РезультатПроверки;
	
КонецФункции

Функция ЕстьОтмененныеПрохожденияОбучения(ПроведениеОбучения, Пользователь, Сценарий = Неопределено) Экспорт
	
	Если Сценарий = Неопределено Тогда
		Сценарий = СценарийОбучения(ПроведениеОбучения);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПрохождениеОбученияСУО.Ссылка КАК Прохождение
		|ИЗ
		|	Документ.ПрохождениеОбученияСУО КАК ПрохождениеОбученияСУО
		|ГДЕ
		|	ПрохождениеОбученияСУО.Пользователь = &Пользователь
		|	И ПрохождениеОбученияСУО.ПроведениеОбучения = &ПроведениеОбучения
		|	И ПрохождениеОбученияСУО.Сценарий = &Сценарий
		|	И ПрохождениеОбученияСУО.Отменено = ИСТИНА";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Сценарий", Сценарий);
	Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);

	Результат = Запрос.Выполнить();

	Возврат НЕ Результат.Пустой();	
	
КонецФункции

// ПРЕПОДАВАТЕЛИ

Функция Преподаватели(ПроведениеОбучения, Сценарий = Неопределено, ТолькоДоступныеУчащемуся = Ложь, Преподаватель = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПреподавателиОбученияСУО.Преподаватель КАК Преподаватель,
		|	ПреподавателиОбученияСУО.Преподаватель КАК Пользователь,
		|	ПреподавателиОбученияСУО.Преподаватель.Наименование КАК ИмяПреподавателя,
		|	ПреподавателиОбученияСУО.Регистратор КАК ПроведениеПреподавателемОбучения,
		|	ПреподавателиОбученияСУО.Роль,
		|	ПреподавателиОбученияСУО.Роль.Наименование КАК НаименованиеРоли,
		|	ПреподавателиОбученияСУО.СкрыватьОтУченика КАК СкрыватьОтУченика,
		|	ПреподавателиОбученияСУО.Проведено
		|ИЗ
		|	РегистрСведений.ПреподавателиОбученияСУО КАК ПреподавателиОбученияСУО
		|ГДЕ
		|	ПреподавателиОбученияСУО.ПроведениеОбучения = &ПроведениеОбучения";
		
	Если ЗначениеЗаполнено(Сценарий) Тогда			
		Запрос.Текст = Запрос.Текст + "
		|	И ПреподавателиОбученияСУО.Сценарий = &Сценарий";
		Запрос.УстановитьПараметр("Сценарий", Сценарий);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Преподаватель) Тогда			
		Запрос.Текст = Запрос.Текст + "
		|	И ПреподавателиОбученияСУО.Преподаватель = &Преподаватель";
		Запрос.УстановитьПараметр("Преподаватель", Преподаватель);
	КонецЕсли;
	
	Если ТолькоДоступныеУчащемуся Тогда		
		Запрос.Текст = Запрос.Текст + "
		|	И ПреподавателиОбученияСУО.СкрыватьОтУченика = ЛОЖЬ";		
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция РолиПреподавателей(ПроведениеОбучения, Мероприятие) Экспорт
	
	СписокРолей = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	
	Если ЗначениеЗаполнено(Мероприятие) Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КаталогМероприятийСУО.РольПреподавателя КАК РольПреподавателя
			|ИЗ
			|	Справочник.КаталогМероприятийСУО КАК КаталогМероприятийСУО
			|ГДЕ
			|	КаталогМероприятийСУО.Ссылка = &Мероприятие
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	КаталогМероприятийСУОДополнительныеПреподаватели.РольПреподавателя КАК РольПреподавателя
			|ИЗ
			|	Справочник.КаталогМероприятийСУО.ДополнительныеПреподаватели КАК КаталогМероприятийСУОДополнительныеПреподаватели
			|ГДЕ
			|	КаталогМероприятийСУОДополнительныеПреподаватели.Ссылка = &Мероприятие";

		Запрос.УстановитьПараметр("Мероприятие", Мероприятие);

	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РолиПреподавателейСУО.Ссылка КАК РольПреподавателя
			|ИЗ
			|	Справочник.РолиПреподавателейСУО КАК РолиПреподавателейСУО
			|ГДЕ
			|	РолиПреподавателейСУО.ПометкаУдаления = ЛОЖЬ";
		
	КонецЕсли;
	
	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать(); // Выбираем все роли преподавателей
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокРолей.Добавить(ВыборкаДетальныеЗаписи.РольПреподавателя);
	КонецЦикла;

	Возврат СписокРолей;
	
КонецФункции

Функция ПреподавательНазначен(ПроведениеОбучения, Мероприятие = Неопределено, Роль = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроведениеПреподавателемОбученияСУО.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПроведениеПреподавателемОбученияСУО КАК ПроведениеПреподавателемОбученияСУО
		|ГДЕ
		|	ПроведениеПреподавателемОбученияСУО.ПроведениеОбучения = &ПроведениеОбучения
		|	И &ОтборПоРоли
		|	И &ОтборПоМероприятию
		|	И ПроведениеПреподавателемОбученияСУО.ПометкаУдаления = ЛОЖЬ";

	Если ЗначениеЗаполнено(Мероприятие) Тогда		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоМероприятию", "ПроведениеПреподавателемОбученияСУО.Мероприятие = &Мероприятие");		
		Запрос.УстановитьПараметр("Мероприятие", Мероприятие);		
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоМероприятию", "ИСТИНА");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Роль) Тогда		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоРоли", "ПроведениеПреподавателемОбученияСУО.Роль = &Роль");		
		Запрос.УстановитьПараметр("Роль", Роль);		
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоРоли", "ИСТИНА");
	КонецЕсли;
		
	Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);	

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ПроведениеОбученияПреподавателем(ПроведениеОбучения, Сценарий = Неопределено, Пользователь) Экспорт
	
	// Важно! Информация о проведении берется именно из списка
	// документов "ПроведениеПреподавателемОбученияСУО", а не из регистров.
	// То есть функция возвращает любое проведение, кроме помеченных на удаление.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроведениеПреподавателемОбученияСУО.Ссылка
		|ИЗ
		|	Документ.ПроведениеПреподавателемОбученияСУО КАК ПроведениеПреподавателемОбученияСУО
		|ГДЕ
		|	ПроведениеПреподавателемОбученияСУО.ПроведениеОбучения = &ПроведениеОбучения
		|	И ПроведениеПреподавателемОбученияСУО.Пользователь = &Преподаватель
		|   И ПроведениеПреподавателемОбученияСУО.ПометкаУдаления = ЛОЖЬ";
		
		
	Если ЗначениеЗаполнено(Сценарий) Тогда
		
		// Мероприятие может быть не заполнено для мероприятий на основе электронных ресурсов.
		// В таких меропрятиях только один преподаватель, поэтому отбор по электронному ресурсу
		// не обязателен.
		
		Запрос.Текст = Запрос.Текст + "
			| И ПроведениеПреподавателемОбученияСУО.Сценарий = &Сценарий";
		
			
		Запрос.УстановитьПараметр("Сценарий", Сценарий);
		
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Преподаватель", Пользователь);
	Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе
	
		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
		
	КонецЕсли;
	
КонецФункции

Функция ПроведенияОбученияПреподавателей(ПроведениеОбучения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроведениеПреподавателемОбученияСУО.Ссылка  КАК ПроведениеПреподавателемОбучения,
		|	ПроведениеПреподавателемОбученияСУО.Пользователь,
		|	ПроведениеПреподавателемОбученияСУО.Пользователь.Наименование КАК Наименование
		|ИЗ
		|	Документ.ПроведениеПреподавателемОбученияСУО КАК ПроведениеПреподавателемОбученияСУО
		|ГДЕ
		|	ПроведениеПреподавателемОбученияСУО.ПроведениеОбучения = &ПроведениеОбучения";
		
	Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);

	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();	
	
КонецФункции

// ПОДЧИНЕННЫЕ МЕРОПРИЯТИЯ

// Процедура заполняет регистр ПроведениеПодчиненныхМероприятийСУО.
//
// Параметры
//  ПроведениеОбучения  - Ссылка на документ "ПроведениеОбученияСУО"
//
//  Мероприятие            - Ссылка на элемент справочника КаталогМероприятийСУО.
//                           Родительское мероприятие по отношению к создаваемым подчиненным.
//
//  СхемаПроведения        - Ссылка на элемент справочника СхемыМероприятийСУО.
//                           Схема проведения подчиненных мероприятий.
//
Процедура ЗаполнитьПодчиненныеМероприятия(ПроведениеОбучения, Мероприятие, СхемаПроведения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КаталогМероприятийСУО.Ссылка
		|ИЗ
		|	Справочник.КаталогМероприятийСУО КАК КаталогМероприятийСУО
		|ГДЕ
		|	КаталогМероприятийСУО.Владелец = &СхемаПроведения
		|	И КаталогМероприятийСУО.ЭтоГруппа = ЛОЖЬ
		|	И КаталогМероприятийСУО.ПометкаУдаления = ЛОЖЬ
		|	И КаталогМероприятийСУО.СтатусРазработки = ЗНАЧЕНИЕ(Перечисление.СтатусыРазработкиОбъектовСУ.Действительно)
		|
		|УПОРЯДОЧИТЬ ПО
		|	КаталогМероприятийСУО.РеквизитДопУпорядочивания";

	Запрос.УстановитьПараметр("СхемаПроведения", СхемаПроведения);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	НаборЗаписей = РегистрыСведений.ПроведениеПодчиненныхМероприятийСУО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПроведениеОбучения.Установить(ПроведениеОбучения);
	НаборЗаписей.Отбор.СхемаПроведения.Установить(СхемаПроведения);
	
	Номер = 1;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Запись = НаборЗаписей.Добавить(); 
		Запись.ПроведениеОбучения = ПроведениеОбучения;
		Запись.СхемаПроведения       = СхемаПроведения;
		Запись.Мероприятие           = ВыборкаДетальныеЗаписи.Ссылка;
		Запись.Номер                 = Номер;
		
		Номер = Номер + 1;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Функция возвращает таблицу подчиненных мероприятий.
//
Функция ПодчиненныеМероприятия(ПроведениеОбучения, ТребуетсяПреподаватель = Неопределено, СхемаПроведения = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если СхемаПроведения = Неопределено Тогда
		СхемаПроведения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроведениеОбучения, "СхемаПроведения");
	КонецЕсли;
	
	// Выбираем подчиненные мероприятия, которые проводятся в рамках данного общего.

	Запрос = Новый Запрос;
		
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроведениеПодчиненныхМероприятийСУО.Мероприятие КАК Мероприятие,
		|	ПроведениеПодчиненныхМероприятийСУО.Мероприятие.Значимость КАК Значимость,
		|	ПроведениеПодчиненныхМероприятийСУО.Мероприятие.РольПреподавателя КАК РольПреподавателя,
		|	ПроведениеПодчиненныхМероприятийСУО.Мероприятие.ПродолжительностьВСекундах КАК ПродолжительностьВСекундах,
		|	ПроведениеПодчиненныхМероприятийСУО.Аудитория,
		|	ПроведениеПодчиненныхМероприятийСУО.ДатаПроведения,
		|	ПроведениеПодчиненныхМероприятийСУО.Мероприятие.Вид КАК Вид,
		|	ПроведениеПодчиненныхМероприятийСУО.Мероприятие.Вид.Электронное КАК Электронное,
		|	ПроведениеПодчиненныхМероприятийСУО.Мероприятие.МестоПроведения КАК МестоПроведения,
		|	ПроведениеПодчиненныхМероприятийСУО.Мероприятие.ДополнительныеПреподаватели.(
		|		РольПреподавателя КАК РольПреподавателя
		|	) КАК ДополнительныеПреподаватели,
		|	ПроведениеПодчиненныхМероприятийСУО.Мероприятие.Вид.ТребуетсяПреподаватель КАК ТребуетсяПреподаватель,
		|	ПроведениеПодчиненныхМероприятийСУО.Мероприятие.Наименование КАК Наименование,
		|	ПроведениеПодчиненныхМероприятийСУО.Мероприятие.ТипАудитории КАК ТипАудитории,
		|	ПроведениеПодчиненныхМероприятийСУО.Мероприятие.РеквизитДопУпорядочивания КАК НомерМероприятия
		|ИЗ
		|	РегистрСведений.ПроведениеПодчиненныхМероприятийСУО КАК ПроведениеПодчиненныхМероприятийСУО
		|ГДЕ
		|	ПроведениеПодчиненныхМероприятийСУО.ПроведениеОбучения = &ПроведениеОбучения
		|	И ПроведениеПодчиненныхМероприятийСУО.СхемаПроведения = &СхемаПроведения";

	Если ТребуетсяПреподаватель <> Неопределено Тогда
		
		Запрос.Текст = Запрос.Текст + "
		| И ПроведениеПодчиненныхМероприятийСУО.Мероприятие.Вид.ТребуетсяПреподаватель = " + ?(ТребуетсяПреподаватель, "ИСТИНА", "ЛОЖЬ");
		
	КонецЕсли;
		
	Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);
	Запрос.УстановитьПараметр("СхемаПроведения", СхемаПроведения);
	
	Результат = Запрос.Выполнить();

	ТаблицаПодчиненныхМероприятий = Результат.Выгрузить();
	
	ТаблицаПодчиненныхМероприятий.Сортировать("НомерМероприятия"); // Сортировка важна для последовательного зачисления
	
	Возврат ТаблицаПодчиненныхМероприятий;
	
КонецФункции

// ДАТЫ ПРОВЕДЕНИЯ

Функция ДатаНачалаПроведения(ПроведениеОбучения, Мероприятие = Неопределено) Экспорт
	Возврат УправлениеОбучениемСУОПовтИсп.ДатаНачалаПроведенияОбучения(ПроведениеОбучения, Мероприятие);
КонецФункции

Функция ДатаОкончанияПроведения(ПроведениеОбучения, Мероприятие = Неопределено) Экспорт
	Возврат УправлениеОбучениемСУОПовтИсп.ДатаОкончанияПроведенияОбучения(ПроведениеОбучения, Мероприятие);
КонецФункции

Функция Продолжительность(Знач ПроведениеОбучения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(ПроведениеОбучения) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
	
		ДанныеПроведенияОбучения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеОбучения,
			"ДатаНачалаПроведения,
			|ДатаОкончанияПроведения,
			|ДатаНачалаДоступа,
			|ДатаКонтроля,
			|ПродолжительностьВСекундах,
			|ВариантПродолжительности");
		
	Иначе
		
		ДанныеПроведенияОбучения = ПроведениеОбучения;
		
	КонецЕсли;
		
	Если ДанныеПроведенияОбучения.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.СЗачисления
		ИЛИ ДанныеПроведенияОбучения.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.СНачалаОбучения Тогда
		
		Возврат ДанныеПроведенияОбучения.ПродолжительностьВСекундах;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеПроведенияОбучения.ДатаНачалаПроведения)
		И ЗначениеЗаполнено(ДанныеПроведенияОбучения.ДатаОкончанияПроведения) Тогда
		
		Возврат ДанныеПроведенияОбучения.ДатаОкончанияПроведения - ДанныеПроведенияОбучения.ДатаНачалаПроведения;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеПроведенияОбучения.ДатаНачалаДоступа)
		И ЗначениеЗаполнено(ДанныеПроведенияОбучения.ДатаКонтроля) Тогда
		
		Возврат ДанныеПроведенияОбучения.ДатаКонтроля - ДанныеПроведенияОбучения.ДатаНачалаДоступа;
		
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Процедура ЗаполнитьВариантПродолжительностиПоУмолчанию(Объект, ЭлектронноДистанционное) Экспорт
	
	Если ЭлектронноДистанционное Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ДатаНачалаДоступа)
			И НЕ ЗначениеЗаполнено(Объект.ДатаКонтроля)
			И НЕ ЗначениеЗаполнено(Объект.ПродолжительностьВСекундах) Тогда
			Объект.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.НеЗадана;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ДатаНачалаДоступа)
			ИЛИ ЗначениеЗаполнено(Объект.ДатаКонтроля) Тогда
			Объект.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.Фиксированная;
		КонецЕсли;
		
	Иначе
		Если ЗначениеЗаполнено(Объект.ДатаНачалаПроведения)
			ИЛИ ЗначениеЗаполнено(Объект.ДатаОкончанияПроведения) Тогда
			Объект.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.Фиксированная;	
		Иначе
			Объект.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.НеЗадана;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// СВОЙСТВА ОБЧЕНИЯ

Функция ВидОбучения(Знач ПроведениеОбучения, Сценарий = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Сценарий) Тогда
		
		Возврат ВидОбученияПоСценарию(Сценарий);
		
	Иначе
		
		Если ТипЗнч(ПроведениеОбучения) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
			ПроведениеОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеОбучения, "БезСценария, НаОсновеМероприятия, НаОсновеЭлектронногоРесурса, ВидОбучения, Мероприятие");
		Иначе
			ПроведениеОбученияСвойства = ПроведениеОбучения;
		КонецЕсли;	
		
		Если ПроведениеОбученияСвойства.НаОсновеЭлектронногоРесурса Тогда
			Возврат Справочники.ВидыМероприятийСУО.НаОсновеЭлектронногоРесурса;
		КонецЕсли;
		
		Если ПроведениеОбученияСвойства.НаОсновеМероприятия Тогда
			Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроведениеОбученияСвойства.Мероприятие, "Вид");
		КонецЕсли;
		
		Возврат ПроведениеОбученияСвойства.ВидОбучения;
		
	КонецЕсли;	
	
КонецФункции

Функция ВидОбученияПоСценарию(Знач СценарийОбучения) Экспорт
	
	Если ТипЗнч(СценарийОбучения) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СценарийОбучения, "ВидОбучения");
	КонецЕсли;
	
	Если ТипЗнч(СценарийОбучения) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
		Возврат Справочники.ВидыМероприятийСУО.НаОсновеЭлектронногоРесурса;
	КонецЕсли;
	
	Если ТипЗнч(СценарийОбучения) = Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СценарийОбучения, "Вид");
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ЭлектронныйРесурсОбучения(Знач ПроведениеОбучения, Сценарий = Неопределено, Электронное = Неопределено) Экспорт
	
	Если ТипЗнч(ПроведениеОбучения) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		ПроведениеОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеОбучения, "ЭлектронныйРесурс");
	Иначе
		ПроведениеОбученияСвойства = ПроведениеОбучения;
	КонецЕсли;
	
	Если Сценарий = Неопределено Тогда
		Сценарий = СценарийОбучения(ПроведениеОбучения);
	КонецЕсли;
	
	Если Электронное = Неопределено Тогда
		Электронное = ЭтоЭлектронноеОбучение(ПроведениеОбучения,, Сценарий);
	КонецЕсли;
	
	Если ТипЗнч(Сценарий) = Тип("СправочникСсылка.СводыЗнанийСУЗ")
		ИЛИ (ТипЗнч(Сценарий) = Тип("ДокументСсылка.ПроведениеОбученияСУО") И Электронное) Тогда	
			
		Возврат ?(ЗначениеЗаполнено(ПроведениеОбученияСвойства.ЭлектронныйРесурс), ПроведениеОбученияСвойства.ЭлектронныйРесурс, Неопределено);
			
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
			
КонецФункции

Функция ЭтоЭлектронноеОбучение(Знач ПроведениеОбучения, Знач ВидОбучения = Неопределено, Знач Сценарий = Неопределено) Экспорт
	
	Если ТипЗнч(ПроведениеОбучения) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		ПроведениеОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеОбучения, "БезСценария, НаОсновеЭлектронногоРесурса, НаОсновеМероприятия, Мероприятие, ВидОбучения");
	Иначе
		ПроведениеОбученияСвойства = ПроведениеОбучения;
	КонецЕсли;
	
	Если ВидОбучения = Неопределено Тогда
		ВидОбучения = ВидОбучения(ПроведениеОбученияСвойства, Сценарий);
	КонецЕсли;
	
	Если ПроведениеОбученияСвойства.НаОсновеЭлектронногоРесурса Тогда
		
		Возврат Истина;
		
	Иначе
		
		Если НЕ ВидОбучения.Общее Тогда
			Возврат ВидОбучения.Электронное
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция ДистанционноеОбучение(Знач ПроведениеОбучения, Знач Сценарий = Неопределено) Экспорт
	
	Если ТипЗнч(ПроведениеОбучения) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		ПроведениеОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеОбучения, "БезСценария, НаОсновеЭлектронногоРесурса, НаОсновеМероприятия, Мероприятие, МестоПроведения");
	Иначе
		ПроведениеОбученияСвойства = ПроведениеОбучения;
	КонецЕсли;
	
	Если ПроведениеОбученияСвойства.НаОсновеЭлектронногоРесурса Тогда
		Возврат Истина;
	КонецЕсли;
	
	МестоПроведения = Неопределено;
	
	Если ПроведениеОбученияСвойства.БезСценария Тогда
		МестоПроведения = ПроведениеОбученияСвойства.МестоПроведения
	КонецЕсли;
	
	Если ПроведениеОбученияСвойства.НаОсновеМероприятия Тогда
		Если Сценарий = Неопределено ИЛИ ТипЗнч(Сценарий) <> Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда
			МестоПроведения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроведениеОбученияСвойства.Мероприятие, "МестоПроведения");
		Иначе
			МестоПроведения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сценарий, "МестоПроведения");
		КонецЕсли;		
	КонецЕсли;
	
	Если МестоПроведения = Перечисления.МестаПроведенияМероприятийСУО.Дистанционно Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ЭлектронноДистанционноеОбучение(Знач ПроведениеОбучения, Знач ВидОбучения = Неопределено, Знач Сценарий = Неопределено) Экспорт
	Возврат ?(ЭтоЭлектронноеОбучение(ПроведениеОбучения, ВидОбучения, Сценарий) И ДистанционноеОбучение(ПроведениеОбучения, Сценарий), Истина, Ложь);
КонецФункции

Функция ОписаниеЕдинственногоЗаданияОбучения(Знач ПроведениеОбучения, Знач Сценарий = Неопределено) Экспорт
	
	Возврат УправлениеОбучениемСУОПовтИсп.ОписаниеЕдинственногоЗаданияСценария(Сценарий, ПроведениеОбучения);
	
КонецФункции

Процедура ЗаполнитьМассивЗаданийИЭлектронныхРесурсов(ПроведениеОбучения, МассивЗаданий, МассивЭлектронныхРесурсов, МассивЭлектронныхКурсов, ТаблицаНаименований, ВидОбучения, Знач Задание = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроведениеОбученияСУОЭлектронныеЗадания.Задание КАК Задание,
		|	ПроведениеОбученияСУОЭлектронныеЗадания.Наименование КАК Наименование,
		|	ПроведениеОбученияСУОЭлектронныеЗадания.Вес КАК Вес,
		|	ПроведениеОбученияСУОЭлектронныеЗадания.ПроходнойБалл КАК ПроходнойБалл,
		|	ПроведениеОбученияСУОЭлектронныеЗадания.НеЖдатьПроверки КАК НеЖдатьПроверки,
		|	ПроведениеОбученияСУОЭлектронныеЗадания.ДатаНачалаДоступаКЗаданию КАК ДатаНачалаДоступаКЗаданию,
		|	ПроведениеОбученияСУОЭлектронныеЗадания.ДатаОкончанияДоступаКЗаданию КАК ДатаОкончанияДоступаКЗаданию,
		|	ПроведениеОбученияСУОЭлектронныеЗадания.СкрытьВремяДоступаКЗаданию КАК СкрытьВремяДоступаКЗаданию,
		|	ПроведениеОбученияСУОЭлектронныеЗадания.ПриОтсутствииОценкиЗаЗадание КАК ПриОтсутствииОценкиЗаЗадание
		|ИЗ
		|	Документ.ПроведениеОбученияСУО.ЭлектронныеЗадания КАК ПроведениеОбученияСУОЭлектронныеЗадания
		|ГДЕ
		|	ПроведениеОбученияСУОЭлектронныеЗадания.Ссылка = &ПроведениеОбучения
		|	И &ОтборПоЗаданию
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПроведениеОбученияСУОЭлектронныеЗадания.НомерСтроки";
	
	Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);
	
	Если Задание = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоЗаданию", "ИСТИНА");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоЗаданию", "ПроведениеОбученияСУОЭлектронныеЗадания.Задание = &Задание");
		Запрос.УстановитьПараметр("Задание", Задание);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		
		ТребуемыеДанные = Новый Структура("ЭлектронныйРесурс, Наименование", "ЭлектронныйРесурс", "ЭлектронныйРесурс.Наименование");
		ДанныеЭлектронногоРесурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеОбучения, ТребуемыеДанные);
		
		Если ЗначениеЗаполнено(ДанныеЭлектронногоРесурса.ЭлектронныйРесурс)
			И (Задание = Неопределено ИЛИ ДанныеЭлектронногоРесурса.ЭлектронныйРесурс = Задание) Тогда
			
			НоваяСтрокаТН = ТаблицаНаименований.Добавить();
			НоваяСтрокаТН.Задание = ДанныеЭлектронногоРесурса.ЭлектронныйРесурс;
			НоваяСтрокаТН.Наименование = ДанныеЭлектронногоРесурса.Наименование;
			НоваяСтрокаТН.Номер = 1;
			НоваяСтрокаТН.Значимость = 1;
			НоваяСтрокаТН.ПроходнойБалл = 0;
			НоваяСтрокаТН.НеЖдатьПроверки = Ложь;
			НоваяСтрокаТН.ДатаНачалаДоступаКЗаданию = Неопределено;
			НоваяСтрокаТН.ДатаОкончанияДоступаКЗаданию = Неопределено;
			НоваяСтрокаТН.СкрытьВремяДоступаКЗаданию = Ложь;
			НоваяСтрокаТН.ПриОтсутствииОценкиЗаЗадание = Перечисления.ПриОтсутствииОценкиЗаЗаданиеСУО.БезОценки;
			
			МассивЭлектронныхРесурсов.Добавить(ДанныеЭлектронногоРесурса.ЭлектронныйРесурс);
			
		КонецЕсли;
		
	Иначе
		
		НомерЗадания = 1;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НоваяСтрокаТН = ТаблицаНаименований.Добавить();
			НоваяСтрокаТН.Задание = ВыборкаДетальныеЗаписи.Задание;
			НоваяСтрокаТН.Наименование = ВыборкаДетальныеЗаписи.Наименование;
			НоваяСтрокаТН.Номер = НомерЗадания;
			НоваяСтрокаТН.Значимость = ВыборкаДетальныеЗаписи.Вес;
			НоваяСтрокаТН.ПроходнойБалл = ВыборкаДетальныеЗаписи.ПроходнойБалл;
			НоваяСтрокаТН.НеЖдатьПроверки = ВыборкаДетальныеЗаписи.НеЖдатьПроверки;
			
			Если ТипЗнч(ВыборкаДетальныеЗаписи.Задание)	= Тип("СправочникСсылка.ЗаданияСУО") Тогда
				МассивЗаданий.Добавить(ВыборкаДетальныеЗаписи.Задание);
			КонецЕсли;
			
			Если ТипЗнч(ВыборкаДетальныеЗаписи.Задание)	= Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
				МассивЭлектронныхРесурсов.Добавить(ВыборкаДетальныеЗаписи.Задание);
			КонецЕсли;			
			
			Если ТипЗнч(ВыборкаДетальныеЗаписи.Задание)	= Тип("СправочникСсылка.ЭлектронныеКурсы") Тогда
				МассивЭлектронныхКурсов.Добавить(ВыборкаДетальныеЗаписи.Задание);
			КонецЕсли;
			
			НоваяСтрокаТН.ДатаНачалаДоступаКЗаданию = ВыборкаДетальныеЗаписи.ДатаНачалаДоступаКЗаданию;
			НоваяСтрокаТН.ДатаОкончанияДоступаКЗаданию = ВыборкаДетальныеЗаписи.ДатаОкончанияДоступаКЗаданию;
			НоваяСтрокаТН.СкрытьВремяДоступаКЗаданию = ВыборкаДетальныеЗаписи.СкрытьВремяДоступаКЗаданию;			
			НоваяСтрокаТН.ПриОтсутствииОценкиЗаЗадание = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПриОтсутствииОценкиЗаЗадание),
				ВыборкаДетальныеЗаписи.ПриОтсутствииОценкиЗаЗадание, Перечисления.ПриОтсутствииОценкиЗаЗаданиеСУО.БезОценки);	
			
			НомерЗадания = НомерЗадания + 1;
			
		КонецЦикла;			
		
	КонецЕсли;
	
	ТаблицаВыставляетсяОценка = Справочники.СводыЗнанийСУЗ.ТаблицаВыставляетсяОценка(МассивЭлектронныхРесурсов);
	
	Для каждого СтрокаТН Из ТаблицаНаименований Цикл
		
		СтрокаТН.ВыставляетсяОценка = ВидОбучения.ВыставляетсяОценка;
		
		Если ТипЗнч(СтрокаТН.Задание) = Тип("СправочникСсылка.СводыЗнанийСУЗ") И СтрокаТН.ВыставляетсяОценка Тогда
			Если СтрокаТН.ПриОтсутствииОценкиЗаЗадание = Перечисления.ПриОтсутствииОценкиЗаЗаданиеСУО.МаксимальныйБалл Тогда
				СтрокаТН.ВыставляетсяОценка = Истина;
			Иначе				
				СтрокаТВО = ТаблицаВыставляетсяОценка.Найти(СтрокаТН.Задание, "ЭлектронныйРесурс");
				СтрокаТН.ВыставляетсяОценка = СтрокаТВО.ВыставляетсяОценка;
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ПривестиТипыТаблицыЗаданий(ТаблицаЗаданий) Экспорт
	
	// Удаляем и добавляем колонку Задание, так как таблица заданий
	// не может хранить электронные ресурсы в колонке Задание по умолчанию.
	
	ВсеЗаданияМассив = ТаблицаЗаданий.ВыгрузитьКолонку("Задание");
	ТаблицаЗаданий.Колонки.Удалить("Задание");
	ТаблицаЗаданий.Колонки.Добавить("Задание");
	ТаблицаЗаданий.ЗагрузитьКолонку(ВсеЗаданияМассив, "Задание")
	
КонецПроцедуры

Функция ПустаяТаблицаНаименованийЗаданий() Экспорт
	ТаблицаНаименований = Новый ТаблицаЗначений;
	ТаблицаНаименований.Колонки.Добавить("Задание");
	ТаблицаНаименований.Колонки.Добавить("Наименование");
	ТаблицаНаименований.Колонки.Добавить("Номер");
	ТаблицаНаименований.Колонки.Добавить("Значимость");
	ТаблицаНаименований.Колонки.Добавить("ПроходнойБалл");
	ТаблицаНаименований.Колонки.Добавить("НеЖдатьПроверки");	
	ТаблицаНаименований.Колонки.Добавить("ДатаНачалаДоступаКЗаданию");
	ТаблицаНаименований.Колонки.Добавить("ДатаОкончанияДоступаКЗаданию");
	ТаблицаНаименований.Колонки.Добавить("СкрытьВремяДоступаКЗаданию");
	ТаблицаНаименований.Колонки.Добавить("ВыставляетсяОценка");
	ТаблицаНаименований.Колонки.Добавить("ПриОтсутствииОценкиЗаЗадание");
	Возврат ТаблицаНаименований;
КонецФункции

Функция СвойстваЗадания(ПроведениеОбучения, Задание, Знач Сценарий = Неопределено, Знач ВидОбучения = Неопределено) Экспорт
	
	ВсеЗадания = ЗаданияОбучения(ПроведениеОбучения, Сценарий, Задание, ВидОбучения);
	СтрокаЗадания = ВсеЗадания.Найти(Задание, "Задание");
	
	Если СтрокаЗадания = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НаборСвойств = Новый Структура;
	Для каждого КолонкаТЗ Из ВсеЗадания.Колонки Цикл
		НаборСвойств.Вставить(КолонкаТЗ.Имя, СтрокаЗадания[КолонкаТЗ.Имя]);
	КонецЦикла;
	
	Возврат НаборСвойств;
	
КонецФункции

Функция ЗаданияОбучения(ПроведениеОбучения, Знач Сценарий = Неопределено, Знач Задание = Неопределено, Знач ВидОбучения = Неопределено) Экспорт
	
	Если Сценарий = Неопределено Тогда
		Сценарий = СценарийОбучения(ПроведениеОбучения);
	КонецЕсли;
	
	МассивЗаданий = Новый Массив;
	МассивЭлектронныхРесурсов = Новый Массив;
	МассивЭлектронныхКурсов = Новый Массив;
	ТаблицаНаименований	= ПустаяТаблицаНаименованийЗаданий();
	Если ВидОбучения = Неопределено Тогда
		ВидОбучения = Документы.ПроведениеОбученияСУО.ВидОбучения(ПроведениеОбучения, Сценарий);
	КонецЕсли;
	
	Если ТипЗнч(Сценарий) = Тип("ДокументСсылка.ПроведениеОбученияСУО")
		ИЛИ ТипЗнч(Сценарий) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда		
		ЗаполнитьМассивЗаданийИЭлектронныхРесурсов(ПроведениеОбучения, МассивЗаданий, МассивЭлектронныхРесурсов, МассивЭлектронныхКурсов, ТаблицаНаименований, ВидОбучения, Задание);	
	КонецЕсли;
	
	Если ТипЗнч(Сценарий) = Тип("СправочникСсылка.СводыЗнанийСУЗ")
		И МассивЭлектронныхРесурсов.Найти(Сценарий) = Неопределено
		И (Задание = Неопределено ИЛИ Задание = Сценарий) Тогда		
		
		МассивЭлектронныхРесурсов.Добавить(Сценарий);
		
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданияСУО.Ссылка КАК Задание,
		|	ЗаданияСУО.Описание КАК Описание,
		|	ЗаданияСУО.ЗначимостьОценки КАК Значимость,
		|	ЗаданияСУО.НаОсновеЭлектронногоРесурса КАК НаОсновеЭлектронногоРесурса,
		|	ЗаданияСУО.ЭлектронныйРесурс КАК ЭлектронныйРесурс,
		|	ЗаданияСУО.Фрагмент КАК Фрагмент,
		|	ЗаданияСУО.Наименование КАК Наименование,
		|	ЗаданияСУО.ПреподавательВыставляетОценку КАК ПреподавательВыставляетОценку,
		|	ЗаданияСУО.МетодВыбораПопыткиПрохождения КАК МетодВыбораПопыткиПрохождения,
		|	ЗаданияСУО.НесколькоВариантов КАК НесколькоВариантов,
		|	ЗаданияСУО.НеЖдатьПроверки КАК НеЖдатьПроверки
		|ИЗ
		|	Справочник.ЗаданияСУО КАК ЗаданияСУО
		|ГДЕ
		|	&ОтборЗаданий
		|	И ЗаданияСУО.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаданияСУО.РеквизитДопУпорядочивания";

	Если ЗначениеЗаполнено(Сценарий)
		И ТипЗнч(Сценарий) = Тип("СправочникСсылка.КаталогМероприятийСУО")
		И МассивЗаданий.Количество() = 0 Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборЗаданий", "ЗаданияСУО.Владелец = &Мероприятие");
		Запрос.УстановитьПараметр("Мероприятие", Сценарий);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборЗаданий", "ЗаданияСУО.Ссылка В (&МассивЗаданий)");
		Запрос.УстановитьПараметр("МассивЗаданий", МассивЗаданий);
		
	КонецЕсли;

	Результат = Запрос.Выполнить();
	ТаблицаЗаданий = Результат.Выгрузить();	
	
	ПривестиТипыТаблицыЗаданий(ТаблицаЗаданий);
	
	ТаблицаЗаданий.Колонки.Добавить("Номер");
	ТаблицаЗаданий.Колонки.Добавить("ПроходнойБалл", Новый ОписаниеТипов("Число"));	
	ТаблицаЗаданий.Колонки.Добавить("ДатаНачалаДоступаКЗаданию", Новый ОписаниеТипов("Дата"));
	ТаблицаЗаданий.Колонки.Добавить("ДатаОкончанияДоступаКЗаданию", Новый ОписаниеТипов("Дата"));
	ТаблицаЗаданий.Колонки.Добавить("СкрытьВремяДоступаКЗаданию", Новый ОписаниеТипов("Булево"));
	ТаблицаЗаданий.Колонки.Добавить("ВыставляетсяОценка", Новый ОписаниеТипов("Булево"));
	
	НомерЗадания = 1;
	Для каждого СтрокаТЗ Из ТаблицаЗаданий Цикл
		
		СтрокаТЗ.Номер = НомерЗадания;
		СтрокаТЗ.ДатаНачалаДоступаКЗаданию = Дата("00010101");
		СтрокаТЗ.ДатаОкончанияДоступаКЗаданию = Дата("00010101");
		СтрокаТЗ.СкрытьВремяДоступаКЗаданию = Ложь;
		СтрокаТЗ.ВыставляетсяОценка = ВидОбучения.ВыставляетсяОценка;
		
		СтрокаТН = ТаблицаНаименований.Найти(СтрокаТЗ.Задание, "Задание");		
		Если СтрокаТН <> Неопределено Тогда
			СтрокаТЗ.Номер = СтрокаТН.Номер;
			СтрокаТЗ.ПроходнойБалл = СтрокаТН.ПроходнойБалл;
			СтрокаТЗ.Значимость = СтрокаТН.Значимость;
			СтрокаТЗ.НеЖдатьПроверки = СтрокаТН.НеЖдатьПроверки;
			СтрокаТЗ.ДатаНачалаДоступаКЗаданию = СтрокаТН.ДатаНачалаДоступаКЗаданию;
			СтрокаТЗ.ДатаОкончанияДоступаКЗаданию = СтрокаТН.ДатаОкончанияДоступаКЗаданию;
			СтрокаТЗ.СкрытьВремяДоступаКЗаданию = СтрокаТН.СкрытьВремяДоступаКЗаданию;
			Если ЗначениеЗаполнено(СтрокаТН.Наименование) Тогда
				СтрокаТЗ.Наименование = СтрокаТН.Наименование;
			КонецЕсли;
			СтрокаТЗ.ВыставляетсяОценка = СтрокаТН.ВыставляетсяОценка;
		КонецЕсли;
		
		НомерЗадания = НомерЗадания + 1;
		
	КонецЦикла;	

	Для каждого ЭлектронныйРесурс Из МассивЭлектронныхРесурсов Цикл
		
		НоваяСтрока = ТаблицаЗаданий.Добавить();
	    НоваяСтрока.Задание = ЭлектронныйРесурс;
		НоваяСтрока.Значимость = 1;
		НоваяСтрока.НаОсновеЭлектронногоРесурса = Истина;
		НоваяСтрока.ЭлектронныйРесурс = ЭлектронныйРесурс;
		НоваяСтрока.ПреподавательВыставляетОценку = Ложь;	
		НоваяСтрока.НесколькоВариантов = Ложь;
		НоваяСтрока.ДатаНачалаДоступаКЗаданию = Дата("00010101");
		НоваяСтрока.ДатаОкончанияДоступаКЗаданию = Дата("00010101");
		НоваяСтрока.СкрытьВремяДоступаКЗаданию = Ложь;
		НоваяСтрока.ВыставляетсяОценка = ВидОбучения.ВыставляетсяОценка;
		
		СтрокаТН = ТаблицаНаименований.Найти(ЭлектронныйРесурс, "Задание");
		Если СтрокаТН <> Неопределено Тогда
			НоваяСтрока.Номер = СтрокаТН.Номер;
			НоваяСтрока.ПроходнойБалл = СтрокаТН.ПроходнойБалл;
			НоваяСтрока.Значимость = СтрокаТН.Значимость;
			НоваяСтрока.НеЖдатьПроверки = СтрокаТН.НеЖдатьПроверки;
			НоваяСтрока.ДатаНачалаДоступаКЗаданию = СтрокаТН.ДатаНачалаДоступаКЗаданию;
			НоваяСтрока.ДатаОкончанияДоступаКЗаданию = СтрокаТН.ДатаОкончанияДоступаКЗаданию;
			НоваяСтрока.СкрытьВремяДоступаКЗаданию = СтрокаТН.СкрытьВремяДоступаКЗаданию;
			Если ЗначениеЗаполнено(СтрокаТН.Наименование) Тогда
				НоваяСтрока.Наименование = СтрокаТН.Наименование;
			Иначе
				НоваяСтрока.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлектронныйРесурс, "Наименование");
			КонецЕсли;
			НоваяСтрока.ВыставляетсяОценка = СтрокаТН.ВыставляетсяОценка;
		КонецЕсли;					
		
	КонецЦикла;	
	
	Для каждого ЭлектронныйКурс Из МассивЭлектронныхКурсов Цикл
		
		НоваяСтрока = ТаблицаЗаданий.Добавить();
	    НоваяСтрока.Задание = ЭлектронныйКурс;
		НоваяСтрока.Значимость = 1;
		НоваяСтрока.НаОсновеЭлектронногоРесурса = Ложь;
		НоваяСтрока.ЭлектронныйРесурс = Неопределено;
		НоваяСтрока.ПреподавательВыставляетОценку = Ложь;	
		НоваяСтрока.НесколькоВариантов = Ложь;
		НоваяСтрока.ДатаНачалаДоступаКЗаданию = Дата("00010101");
		НоваяСтрока.ДатаОкончанияДоступаКЗаданию = Дата("00010101");
		НоваяСтрока.СкрытьВремяДоступаКЗаданию = Ложь;
		НоваяСтрока.ВыставляетсяОценка = ВидОбучения.ВыставляетсяОценка;
		
		СтрокаТН = ТаблицаНаименований.Найти(ЭлектронныйКурс, "Задание");
		Если СтрокаТН <> Неопределено Тогда
			НоваяСтрока.Номер = СтрокаТН.Номер;
			НоваяСтрока.ПроходнойБалл = СтрокаТН.ПроходнойБалл;
			НоваяСтрока.Значимость = СтрокаТН.Значимость;
			НоваяСтрока.НеЖдатьПроверки = СтрокаТН.НеЖдатьПроверки;
			НоваяСтрока.ДатаНачалаДоступаКЗаданию = СтрокаТН.ДатаНачалаДоступаКЗаданию;
			НоваяСтрока.ДатаОкончанияДоступаКЗаданию = СтрокаТН.ДатаОкончанияДоступаКЗаданию;
			НоваяСтрока.СкрытьВремяДоступаКЗаданию = СтрокаТН.СкрытьВремяДоступаКЗаданию;			
			Если ЗначениеЗаполнено(СтрокаТН.Наименование) Тогда
				НоваяСтрока.Наименование = СтрокаТН.Наименование;
			Иначе
				НоваяСтрока.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлектронныйКурс, "Наименование");
			КонецЕсли;
			НоваяСтрока.ВыставляетсяОценка = СтрокаТН.ВыставляетсяОценка;
		КонецЕсли;			
		
	КонецЦикла;	
	
	ТаблицаЗаданий.Сортировать("Номер");
	
	Для каждого Колонка Из ТаблицаЗаданий.Колонки Цикл		
		Если Колонка.ТипЗначения.СодержитТип(Тип("Булево")) Тогда
			Для каждого Строка Из ТаблицаЗаданий Цикл		
				Если ТипЗнч(Строка[Колонка.Имя]) <> Тип("Булево") Тогда
					Строка[Колонка.Имя] = Ложь;
				КонецЕсли;		
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ТаблицаЗаданий;
	
КонецФункции

Функция НаименованиеОбучения(Знач ПроведениеОбучения) Экспорт
	
	Если ТипЗнч(ПроведениеОбучения) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		ПроведениеОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеОбучения, "БезСценария, НаОсновеМероприятия, НаОсновеЭлектронногоРесурса, Наименование, Мероприятие, ЭлектронныйРесурс");
	Иначе
		ПроведениеОбученияСвойства = ПроведениеОбучения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПроведениеОбученияСвойства.Наименование)
		ИЛИ ПроведениеОбученияСвойства.БезСценария Тогда
		Возврат ПроведениеОбученияСвойства.Наименование;
	КонецЕсли;	
	
	Если ПроведениеОбученияСвойства.НаОсновеМероприятия Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроведениеОбученияСвойства.Мероприятие, "Наименование");
	КонецЕсли;
	
	Если ПроведениеОбученияСвойства.НаОсновеЭлектронногоРесурса Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроведениеОбученияСвойства.ЭлектронныйРесурс, "Наименование");
	КонецЕсли;
	
КонецФункции

Функция ШкалаОценки(Знач ПроведениеОбучения) Экспорт
	
	Если ТипЗнч(ПроведениеОбучения) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		
		Если НЕ ЗначениеЗаполнено(ПроведениеОбучения) Тогда
			Возврат Справочники.ШкалыОценокСУО.ШкалаОценокПоУмолчанию();
		КонецЕсли;
		
		ТребуемыеСвойства = Новый Структура();
		ТребуемыеСвойства.Вставить("НаОсновеМероприятия", "НаОсновеМероприятия");
		ТребуемыеСвойства.Вставить("Мероприятие", "Мероприятие");
		ТребуемыеСвойства.Вставить("ВидОбучения", "ВидОбучения");
		
		ПроведениеОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеОбучения, ТребуемыеСвойства);
		
	Иначе
		
		ПроведениеОбученияСвойства = ПроведениеОбучения;
		
	КонецЕсли;
	
	ШкалаОценки = Неопределено;
	
	Если ПроведениеОбученияСвойства.НаОсновеМероприятия Тогда
		ШкалаОценки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроведениеОбученияСвойства.Мероприятие, "ШкалаОценки");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ШкалаОценки) Тогда
		Если ПроведениеОбученияСвойства.ВидОбучения.ВыставляетсяОценка Тогда
			ШкалаОценки = ПроведениеОбученияСвойства.ВидОбучения.ШкалаОценки;
		Иначе
			ШкалаОценки = Справочники.ШкалыОценокСУО.НеОценивается;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ШкалаОценки) Тогда
		ШкалаОценки = Справочники.ШкалыОценокСУО.ШкалаОценокПоУмолчанию();
	КонецЕсли;	
	
	Возврат ШкалаОценки;
	
КонецФункции

Функция СценарийОбучения(Знач ПроведениеОбучения) Экспорт
	
	Если ТипЗнч(ПроведениеОбучения) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		ПроведениеОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеОбучения, "Ссылка, БезСценария, НаОсновеМероприятия, НаОсновеЭлектронногоРесурса, Мероприятие, ЭлектронныйРесурс");
	Иначе
		ПроведениеОбученияСвойства = ПроведениеОбучения;
	КонецЕсли;
	
	Если ПроведениеОбученияСвойства.НаОсновеМероприятия Тогда
		Возврат ПроведениеОбученияСвойства.Мероприятие;
	КонецЕсли;
	
	Если ПроведениеОбученияСвойства.НаОсновеЭлектронногоРесурса Тогда
		Возврат ПроведениеОбученияСвойства.ЭлектронныйРесурс;
	КонецЕсли;
	
	Если ПроведениеОбученияСвойства.БезСценария Тогда
		Возврат ПроведениеОбученияСвойства.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция МожноПоказатьРесурсПроведения(СтатусПроведения, ПоказатьПриСтатусеЗапланировано, ПоказатьПриСтатусеАктивно, ПоказатьПриСтатусеЗавершено) Экспорт
	
	МожноПоказатьПриДанномСтатусеПроведения = Ложь;
			
	Если ПоказатьПриСтатусеЗапланировано
		И СтатусПроведения = Перечисления.СтатусыПроведенияОбъектовСУО.Запланировано Тогда
		
		МожноПоказатьПриДанномСтатусеПроведения = Истина;
		
	КонецЕсли;
	
	Если ПоказатьПриСтатусеАктивно
		И СтатусПроведения = Перечисления.СтатусыПроведенияОбъектовСУО.Активно Тогда
		
		МожноПоказатьПриДанномСтатусеПроведения = Истина;
		
	КонецЕсли;
	
	Если ПоказатьПриСтатусеЗавершено
		И СтатусПроведения = Перечисления.СтатусыПроведенияОбъектовСУО.Завершено Тогда
		
		МожноПоказатьПриДанномСтатусеПроведения = Истина;
		
	КонецЕсли;

	Возврат МожноПоказатьПриДанномСтатусеПроведения;
	
КонецФункции

Функция ДоступноОбщение(Знач ПроведениеОбучения) Экспорт
	
	Если ТипЗнч(ПроведениеОбучения) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		ПроведениеОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеОбучения, "ЗапретитьОбщениеМеждуУчастниками, Статус");
	Иначе
		ПроведениеОбученияСвойства = ПроведениеОбучения;
	КонецЕсли;
	
	Если ПроведениеОбученияСвойства.ЗапретитьОбщениеМеждуУчастниками Тогда
		
		Возврат Ложь;
		
	Иначе
		
		Если ПроведениеОбученияСвойства.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Активно Тогда
			Возврат Истина
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция ДоступноПрикреплениеФайлов(Знач ПроведениеОбучения, Знач Сценарий = Неопределено) Экспорт
	
	Если ТипЗнч(ПроведениеОбучения) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		ПроведениеОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеОбучения, "Статус");
	Иначе
		ПроведениеОбученияСвойства = ПроведениеОбучения;
	КонецЕсли;
	
	ВидОбучения = ВидОбучения(ПроведениеОбучения, Сценарий);
	
	Если ПроведениеОбученияСвойства.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Активно
		И ВидОбучения.РазрешитьУчащимсяПрикреплятьФайлы
		И НЕ ВидОбучения.Общее Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;		
	
КонецФункции

Функция ДоступноЗавершениеУчащимся(Знач ПроведениеОбучения, Знач Сценарий = Неопределено, Знач ВидОбучения = Неопределено) Экспорт
	
	Если ТипЗнч(ПроведениеОбучения) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		ПроведениеОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеОбучения, "Статус");
	Иначе
		ПроведениеОбученияСвойства = ПроведениеОбучения;
	КонецЕсли;
	
	Если ВидОбучения = Неопределено Тогда
		ВидОбучения = ВидОбучения(ПроведениеОбучения, Сценарий);
	КонецЕсли;
	
	Если ПроведениеОбученияСвойства.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Активно
		И ВидОбучения.ЗавершаетУчащийся
		И НЕ ВидОбучения.Общее Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;		
	
КонецФункции

Функция ПрикрепленныеЭлектронныеРесурсы(ПроведениеОбучения, Сценарий, ВернутьТаблицу = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПроведениеОбученияСУОЭлектронныеРесурсы.ЭлектронныйРесурс,
		|	ПроведениеОбученияСУОЭлектронныеРесурсы.Фрагмент,
		|	ПроведениеОбученияСУОЭлектронныеРесурсы.ПоказатьПослеПрохождения,
		|	ПроведениеОбученияСУОЭлектронныеРесурсы.ЭлектронныйРесурс.Наименование КАК НаименованиеЭлектронногоРесурса,
		|	ПроведениеОбученияСУОЭлектронныеРесурсы.Фрагмент.Наименование КАК НаименованиеФрагмента,
		|	ПроведениеОбученияСУОЭлектронныеРесурсы.СкрыватьОтУченика,
		|	ПроведениеОбученияСУОЭлектронныеРесурсы.ПоказатьПриСтатусеЗапланировано КАК ПоказатьПриСтатусеЗапланировано,
		|	ПроведениеОбученияСУОЭлектронныеРесурсы.ПоказатьПриСтатусеАктивно КАК ПоказатьПриСтатусеАктивно,
		|	ПроведениеОбученияСУОЭлектронныеРесурсы.ПоказатьПриСтатусеЗавершено КАК ПоказатьПриСтатусеЗавершено
		|ИЗ
		|	Документ.ПроведениеОбученияСУО.ЭлектронныеРесурсы КАК ПроведениеОбученияСУОЭлектронныеРесурсы
		|ГДЕ
		|	ПроведениеОбученияСУОЭлектронныеРесурсы.Ссылка = &ПроведениеОбучения
		|";
		
	Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);
		
	Если ТипЗнч(Сценарий) = Тип("СправочникСсылка.КаталогМероприятийСУО")
		И ЗначениеЗаполнено(Сценарий) Тогда	
		
		Запрос.Текст = Запрос.Текст + "
		|ОБЪЕДИНИТЬ ВСЕ
		|";
		
		Запрос.Текст = Запрос.Текст + 
			"ВЫБРАТЬ
			|	КаталогМероприятийСУОЭлектронныеРесурсы.ЭлектронныйРесурс,
			|	КаталогМероприятийСУОЭлектронныеРесурсы.Фрагмент,
			|	КаталогМероприятийСУОЭлектронныеРесурсы.ПоказатьПослеПрохождения,
			|	КаталогМероприятийСУОЭлектронныеРесурсы.ЭлектронныйРесурс.Наименование КАК НаименованиеЭлектронногоРесурса,
			|	КаталогМероприятийСУОЭлектронныеРесурсы.Фрагмент.Наименование КАК НаименованиеФрагмента,
			|	КаталогМероприятийСУОЭлектронныеРесурсы.СкрыватьОтУченика,
			|	КаталогМероприятийСУОЭлектронныеРесурсы.ПоказатьПриСтатусеЗапланировано КАК ПоказатьПриСтатусеЗапланировано,
			|	КаталогМероприятийСУОЭлектронныеРесурсы.ПоказатьПриСтатусеАктивно КАК ПоказатьПриСтатусеАктивно,
			|	КаталогМероприятийСУОЭлектронныеРесурсы.ПоказатьПриСтатусеЗавершено КАК ПоказатьПриСтатусеЗавершено
			|ИЗ
			|	Справочник.КаталогМероприятийСУО.ЭлектронныеРесурсы КАК КаталогМероприятийСУОЭлектронныеРесурсы
			|ГДЕ
			|	КаталогМероприятийСУОЭлектронныеРесурсы.Ссылка = &Мероприятие
			|";
		
		Запрос.УстановитьПараметр("Мероприятие", Сценарий);
		
	КонецЕсли;
	
	Результат = Запрос.Выполнить();	
	
	Если ВернутьТаблицу Тогда
		Возврат Результат.Выгрузить();
	Иначе
		Возврат Результат.Выбрать();	
	КонецЕсли;
	
КонецФункции

Функция ЦветНаКалендаре(ПроведениеОбучения, ВидОбучения, ТипУчебнойАктивности) Экспорт
	
	Если ТипЗнч(ПроведениеОбучения) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		
		ПроведениеОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеОбучения, "
		|Статус,
		|ЦветЗапланированногоМероприятияНаКалендареУчащегося,
		|ЦветАктивногоМероприятияНаКалендареУчащегося,
		|ЦветЗавершенногоМероприятияНаКалендареУчащегося,
		|ЦветОтмененногоМероприятияНаКалендареУчащегося,
		|ЦветЗапланированногоМероприятияНаКалендареМенеджера,
		|ЦветАктивногоМероприятияНаКалендареМенеджера,
		|ЦветЗавершенногоМероприятияНаКалендареМенеджера,
		|ЦветОтмененногоМероприятияНаКалендареМенеджера,
		|ЦветЗапланированногоМероприятияНаКалендареПреподавателя,
		|ЦветАктивногоМероприятияНаКалендареПреподавателя,
		|ЦветЗавершенногоМероприятияНаКалендареПреподавателя,
		|ЦветОтмененногоМероприятияНаКалендареПреподавателя");
		
	Иначе
		
		ПроведениеОбученияСвойства = ПроведениеОбучения;
		
	КонецЕсли;	
	
	ЦветНаКалендаре = "";
	
	Если ПроведениеОбученияСвойства.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Запланировано Тогда
		ЦветНаКалендаре = ВидОбучения.ЦветЗапланированного;
	КонецЕсли;	
	
	Если ПроведениеОбученияСвойства.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Активно Тогда
		ЦветНаКалендаре = ВидОбучения.ЦветАктивного;
	КонецЕсли;	
	
	Если ПроведениеОбученияСвойства.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Завершено Тогда
		ЦветНаКалендаре = ВидОбучения.ЦветЗавершенного;
	КонецЕсли;
	
	Если ПроведениеОбученияСвойства.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Отменено Тогда
		ЦветНаКалендаре = ВидОбучения.ЦветОтмененного;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЦветНаКалендаре) Тогда // Цвет вида важнее
		
		ТекстСтатуса = "";
		
		Если ПроведениеОбученияСвойства.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Запланировано Тогда
			ТекстСтатуса = "Запланированного";
		КонецЕсли;	
		
		Если ПроведениеОбученияСвойства.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Активно Тогда
			ТекстСтатуса = "Активного";
		КонецЕсли;	
		
		Если ПроведениеОбученияСвойства.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Завершено Тогда
			ТекстСтатуса = "Завершенного";
		КонецЕсли;
		
		Если ПроведениеОбученияСвойства.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Отменено Тогда
			ТекстСтатуса = "Отмененного";
		КонецЕсли;
		
		ТекстТипаАктивности = "";
		
		Если ТипУчебнойАктивности = Перечисления.ТипыУчебныхАктивностейСУО.Обучение Тогда
			ТекстТипаАктивности = "Учащегося";
		КонецЕсли;
		
		Если ТипУчебнойАктивности = Перечисления.ТипыУчебныхАктивностейСУО.Преподавание Тогда
			ТекстТипаАктивности = "Преподавателя";
		КонецЕсли;
		
		Если ТипУчебнойАктивности = Перечисления.ТипыУчебныхАктивностейСУО.Контроль Тогда
			ТекстТипаАктивности = "Менеджера";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекстСтатуса) И ЗначениеЗаполнено(ТекстТипаАктивности) Тогда
			ЦветНаКалендаре = ПроведениеОбученияСвойства["Цвет"+ТекстСтатуса+"МероприятияНаКалендаре"+ТекстТипаАктивности];
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат ЦветНаКалендаре;
	
КонецФункции

Функция ПутьККаталогуФайловПроведенияОбучения(Знач ПутьККаталогуРазмещения, Знач ПроведениеОбучения) Экспорт
	ПутьККаталогу = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуРазмещения);
	ПутьККаталогу = ПутьККаталогу + Строка(ПроведениеОбучения.УникальныйИдентификатор());
	ПутьККаталогу = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогу);
	Возврат ПутьККаталогу; 
КонецФункции

Функция ИмяФайлаКартинки(Знач РасширениеКартинки) Экспорт
	Возврат "image." + РасширениеКартинки; 
КонецФункции

Функция АдресФайлаКартинки(Знач ПроведениеОбучения, Знач РасширениеКартинки) Экспорт
	АдресКартинки = ПутьККаталогуФайловПроведенияОбучения("", ПроведениеОбучения)
			+ ИмяФайлаКартинки(РасширениеКартинки);
	АдресКартинки = СтрЗаменить(АдресКартинки, "\", "/");
	Возврат АдресКартинки;
КонецФункции

Функция ПроведенияОбученияСоВстроеннымПлеером(Знач ЭлектронныйРесурс) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроведениеОбученияСУО.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
		|ГДЕ
		|	ПроведениеОбученияСУО.Проведен = ИСТИНА
		|	И ПроведениеОбученияСУО.Статус = &Статус
		|	И ПроведениеОбученияСУО.ПлеерВебКабинета = &ПлеерВебКабинета
		|	И ПроведениеОбученияСУО.ЭлектронныйРесурс = &ЭлектронныйРесурс
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПроведениеОбученияСУОЭлектронныеЗадания.Ссылка
		|ИЗ
		|	Документ.ПроведениеОбученияСУО.ЭлектронныеЗадания КАК ПроведениеОбученияСУОЭлектронныеЗадания
		|ГДЕ
		|	ПроведениеОбученияСУОЭлектронныеЗадания.Задание = &ЭлектронныйРесурс
		|	И ПроведениеОбученияСУОЭлектронныеЗадания.ПлеерВебКабинета = &ПлеерВебКабинета
		|	И ПроведениеОбученияСУОЭлектронныеЗадания.Ссылка.Проведен = ИСТИНА
		|	И ПроведениеОбученияСУОЭлектронныеЗадания.Ссылка.Статус = &Статус
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПроведениеОбученияСУОЭлектронныеРесурсы.Ссылка
		|ИЗ
		|	Документ.ПроведениеОбученияСУО.ЭлектронныеРесурсы КАК ПроведениеОбученияСУОЭлектронныеРесурсы
		|ГДЕ
		|	ПроведениеОбученияСУОЭлектронныеРесурсы.ЭлектронныйРесурс = &ЭлектронныйРесурс
		|	И ПроведениеОбученияСУОЭлектронныеРесурсы.Ссылка.Проведен = ИСТИНА
		|	И ПроведениеОбученияСУОЭлектронныеРесурсы.Ссылка.Статус = &Статус
		|	И ПроведениеОбученияСУОЭлектронныеРесурсы.ПлеерВебКабинета = &ПлеерВебКабинета";
	
	Запрос.УстановитьПараметр("ПлеерВебКабинета", Перечисления.ПлеерыКурсовВебКабинетаСУЗ.Встроенный);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыПроведенияОбъектовСУО.Активно);
	Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);
	
	МассивПроведенийОбучений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	МассивПроведенийОбучений = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивПроведенийОбучений);
	Возврат МассивПроведенийОбучений;
	
КонецФункции

Функция ПлеерВебКабинетаЗадания(Знач ПроведениеОбучения, Знач ЭлектронныйРесурс) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроведениеОбученияСУОЭлектронныеЗадания.ПлеерВебКабинета КАК ПлеерВебКабинета
		|ИЗ
		|	Документ.ПроведениеОбученияСУО.ЭлектронныеЗадания КАК ПроведениеОбученияСУОЭлектронныеЗадания
		|ГДЕ
		|	ПроведениеОбученияСУОЭлектронныеЗадания.Ссылка = &ПроведениеОбучения
		|	И ПроведениеОбученияСУОЭлектронныеЗадания.Задание = &ЭлектронныйРесурс";
	
	Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);
	Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Перечисления.ПлеерыКурсовВебКабинетаСУЗ.ПустаяСсылка();
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	ВыборкаДетальныеЗаписи.Следующий();

	Возврат ВыборкаДетальныеЗаписи.ПлеерВебКабинета;
	
КонецФункции	

Функция ПлеерВебКабинетаДополнительногоМатериала(Знач ПроведениеОбучения, Знач ЭлектронныйРесурс) Экспорт

	УстановитьПривилегированныйРежим(Истина);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроведениеОбученияСУОЭлектронныеРесурсы.ПлеерВебКабинета КАК ПлеерВебКабинета
		|ИЗ
		|	Документ.ПроведениеОбученияСУО.ЭлектронныеРесурсы КАК ПроведениеОбученияСУОЭлектронныеРесурсы
		|ГДЕ
		|	ПроведениеОбученияСУОЭлектронныеРесурсы.Ссылка = &ПроведениеОбучения
		|	И ПроведениеОбученияСУОЭлектронныеРесурсы.ЭлектронныйРесурс = &ЭлектронныйРесурс";
	
	Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);
	Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Перечисления.ПлеерыКурсовВебКабинетаСУЗ.ПустаяСсылка();
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	ВыборкаДетальныеЗаписи.Следующий();

	Возврат ВыборкаДетальныеЗаписи.ПлеерВебКабинета;
	
КонецФункции

Функция ВыставляетсяОценка(Знач ВидОбучения, Знач ЭлектронныйРесурс, Знач Задания) Экспорт
	
	ВыставляетсяОценка = ВидОбучения.ВыставляетсяОценка;
	
	Если НЕ ВидОбучения.Электронное Тогда
		Возврат ВыставляетсяОценка;
	КонецЕсли;
	
	Если ВыставляетсяОценка Тогда
		
		Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
			
			Возврат Справочники.СводыЗнанийСУЗ.ВыставляетсяОценка(ЭлектронныйРесурс);
						
		ИначеЕсли ВидОбучения.Общее Тогда
			
			Возврат ВыставляетсяОценка; // Не реализовано
			
		ИначеЕсли Задания <> Неопределено Тогда			
			
			Если Задания.Количество() = 0 Тогда
				Возврат ВыставляетсяОценка;
			КонецЕсли;
			
			Если Задания.Найти(Истина, "ВыставляетсяОценка") <> Неопределено Тогда
				Возврат Истина;
			Иначе
				Возврат Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат ВыставляетсяОценка;
	
КонецФункции

// ДОПОЛНИТЕЛЬНО

Процедура УстановитьВидСценария(Объект, Отказ) Экспорт
	
	КоличествоУстановленныхСценариев = 0;
	
	Если Объект.БезСценария Тогда
		КоличествоУстановленныхСценариев = КоличествоУстановленныхСценариев + 1;
	КонецЕсли;
	
	Если Объект.НаОсновеМероприятия Тогда
		КоличествоУстановленныхСценариев = КоличествоУстановленныхСценариев + 1;
	КонецЕсли;
	
	Если Объект.НаОсновеЭлектронногоРесурса Тогда
		КоличествоУстановленныхСценариев = КоличествоУстановленныхСценариев + 1;
	КонецЕсли;
	
	Если КоличествоУстановленныхСценариев = 0 Тогда
		
		Если ЗначениеЗаполнено(Объект.Мероприятие) И ЗначениеЗаполнено(Объект.ЭлектронныйРесурс) Тогда
			Текст = НСтр("ru = 'Произошла ошибка при установке вида сценария: неопределенная ситуация'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Мероприятие) Тогда
			Объект.НаОсновеМероприятия = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ЭлектронныйРесурс) Тогда
			Объект.НаОсновеЭлектронногоРесурса = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.Мероприятие) И НЕ ЗначениеЗаполнено(Объект.ЭлектронныйРесурс) Тогда
			Объект.БезСценария = Истина;
		КонецЕсли;
		
	КонецЕсли;		
	
	Если КоличествоУстановленныхСценариев > 1 Тогда
		Текст = НСтр("ru = 'Произошла ошибка при установке вида сценария. Противоречивая ситуация'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Функция ЕстьЭлементыВГруппеПораСделатьАктивным() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ПроведениеОбученияСУО.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
		|ГДЕ
		|	ПроведениеОбученияСУО.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПроведенияОбъектовСУО.Запланировано)
		|	И ПроведениеОбученияСУО.ПометкаУдаления = ЛОЖЬ
		|	И НАЧАЛОПЕРИОДА(ПроведениеОбученияСУО.ДатаНачалаПроведения, ДЕНЬ) <= НАЧАЛОПЕРИОДА(&ЭтотДень, ДЕНЬ)
		|	И ПроведениеОбученияСУО.ДатаНачалаПроведения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И ПроведениеОбученияСУО.Проведен = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПроведениеОбученияСУО.Ссылка
		|ИЗ
		|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
		|ГДЕ
		|	ПроведениеОбученияСУО.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПроведенияОбъектовСУО.Запланировано)
		|	И ПроведениеОбученияСУО.ПометкаУдаления = ЛОЖЬ
		|	И НАЧАЛОПЕРИОДА(ПроведениеОбученияСУО.ДатаНачалаДоступа, ДЕНЬ) <= НАЧАЛОПЕРИОДА(&ЭтотДень, ДЕНЬ)
		|	И ПроведениеОбученияСУО.ДатаНачалаДоступа <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И ПроведениеОбученияСУО.Проведен = ИСТИНА";
	
	Запрос.Параметры.Вставить("ЭтотДень", ТекущаяДатаСеанса());
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ЕстьЭлементыВГруппеПораЗавершить() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ПроведениеОбученияСУО.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
		|ГДЕ
		|	ПроведениеОбученияСУО.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПроведенияОбъектовСУО.Активно)
		|	И ГОД(ПроведениеОбученияСУО.ДатаОкончанияПроведения) > 1
		|	И НЕ ПроведениеОбученияСУО.ДатаОкончанияПроведения ЕСТЬ NULL
		|	И НАЧАЛОПЕРИОДА(ПроведениеОбученияСУО.ДатаОкончанияПроведения, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ЭтотДень, ДЕНЬ)
		|	И ПроведениеОбученияСУО.Проведен = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПроведениеОбученияСУО.Ссылка
		|ИЗ
		|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
		|ГДЕ
		|	ПроведениеОбученияСУО.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПроведенияОбъектовСУО.Активно)
		|	И ГОД(ПроведениеОбученияСУО.ДатаКонтроля) > 1
		|	И НЕ ПроведениеОбученияСУО.ДатаКонтроля ЕСТЬ NULL
		|	И НАЧАЛОПЕРИОДА(ПроведениеОбученияСУО.ДатаКонтроля, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ЭтотДень, ДЕНЬ)
		|	И ПроведениеОбученияСУО.Проведен = ИСТИНА";
	
	Запрос.Параметры.Вставить("ЭтотДень", ТекущаяДатаСеанса());
	
	Возврат НЕ Запрос.Выполнить().Пустой();	
	
КонецФункции

// ВЕБ-КАБИНЕТ

Процедура ОбновитьДанныеВебКабинета(ПроведениеОбучения, ДополнительныеДанные = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем переменные
	
	ТаблицаФайловВебКабинета = Новый ТаблицаЗначений;
	ТаблицаФайловВебКабинета.Колонки.Добавить("ИмяРеквизита");
	ТаблицаФайловВебКабинета.Колонки.Добавить("ИдентификаторКаталога");
	ТаблицаФайловВебКабинета.Колонки.Добавить("ДвоичныеДанные");
	
	НоваяСтрока = ТаблицаФайловВебКабинета.Добавить();
	НоваяСтрока.ИмяРеквизита = "КомментарийОткрытогоМероприятияДляУчастника";	
	
	НоваяСтрока = ТаблицаФайловВебКабинета.Добавить();
	НоваяСтрока.ИмяРеквизита = "КомментарийЗапланированногоМероприятияДляУчастника";
	
	НоваяСтрока = ТаблицаФайловВебКабинета.Добавить();
	НоваяСтрока.ИмяРеквизита = "КомментарийАктивногоМероприятияДляУчастника";
	
	НоваяСтрока = ТаблицаФайловВебКабинета.Добавить();
	НоваяСтрока.ИмяРеквизита = "КомментарийЗавершенногоМероприятияДляУчастника";
	
	НоваяСтрока = ТаблицаФайловВебКабинета.Добавить();
	НоваяСтрока.ИмяРеквизита = "КомментарийОтмененногоМероприятияДляУчастника";
	
	НоваяСтрока = ТаблицаФайловВебКабинета.Добавить();
	НоваяСтрока.ИмяРеквизита = "КомментарийЗапланированногоМероприятияДляПреподавателя";
	
	НоваяСтрока = ТаблицаФайловВебКабинета.Добавить();
	НоваяСтрока.ИмяРеквизита = "КомментарийАктивногоМероприятияДляПреподавателя";
	
	НоваяСтрока = ТаблицаФайловВебКабинета.Добавить();
	НоваяСтрока.ИмяРеквизита = "КомментарийЗавершенногоМероприятияДляПреподавателя";
	
	НоваяСтрока = ТаблицаФайловВебКабинета.Добавить();
	НоваяСтрока.ИмяРеквизита = "КомментарийОтмененногоМероприятияДляПреподавателя";
		
	
	РеквизитыДляПолучения = Новый Структура;
	РеквизитыДляПолучения.Вставить("Проведен", "Проведен");	
	РеквизитыДляПолучения.Вставить("Открытое", "ОткрытоеМероприятие");	
	РеквизитыДляПолучения.Вставить("ДатаОткрытияЗаписи", "ДатаОткрытияЗаписи");	
	РеквизитыДляПолучения.Вставить("ДатаЗакрытияЗаписи", "ДатаЗакрытияЗаписи");	
	РеквизитыДляПолучения.Вставить("ФайлКартинки", "ФайлКартинки");
	РеквизитыДляПолучения.Вставить("КачествоОбученияОцениваетсяУчастниками", "КачествоОбученияОцениваетсяУчастниками");
	РеквизитыДляПолучения.Вставить("ПоказыватьОценкиИКомментарииВсемУчастникам", "ПоказыватьОценкиИКомментарииВсемУчастникам");
	РеквизитыДляПолучения.Вставить("ВариантПродолжительности", "ВариантПродолжительности");
	РеквизитыДляПолучения.Вставить("ПродолжительностьВСекундах", "ПродолжительностьВСекундах");	
	
	Для каждого Строка Из ТаблицаФайловВебКабинета Цикл
		РеквизитыДляПолучения.Вставить(Строка.ИмяРеквизита, Строка.ИмяРеквизита);
	КонецЦикла;
	
	ДанныеПроведенияОбучения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеОбучения, РеквизитыДляПолучения);	
	
	Сценарий = Документы.ПроведениеОбученияСУО.СценарийОбучения(ПроведениеОбучения);
	
	// Выгружаем файлы форматированных документов
	
	Если ДанныеПроведенияОбучения.Проведен Тогда
	
		Для каждого Строка Из ТаблицаФайловВебКабинета Цикл
			
			КонтекстныйКомментарийСтруктура = ОбщегоНазначенияСУ.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ДанныеПроведенияОбучения[Строка.ИмяРеквизита].Получить(), Строка(ПроведениеОбучения.УникальныйИдентификатор()), Строка.ИмяРеквизита, Истина, Ложь);
			
			Если КонтекстныйКомментарийСтруктура.ЕстьВложения Тогда					
				ВебКабинетСУО.ВыгрузитьФайлыФорматированногоДокументаВКаталогВебКабинета(КонтекстныйКомментарийСтруктура.ДвоичныеДанные, КонтекстныйКомментарийСтруктура.ИдентификаторКаталога);					
			КонецЕсли;
				
		КонецЦикла;		
		
	КонецЕсли;
	
	// Выгружаем файл картинки
	
	Если ЗначениеЗаполнено(ДанныеПроведенияОбучения.ФайлКартинки) Тогда
		
		ПутьККаталогуПроведенияОбучения = ПутьККаталогуФайловПроведенияОбучения(
			ВебКабинетСУ.ПутьККаталогуКартинок(ОбъектыСУЗПовтИсп.ПутьКОбщемуКаталогу()), ПроведениеОбучения);
			
		СоздатьКаталог(ПутьККаталогуПроведенияОбучения);			
			
		ОписаниеФайлаКартинки = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаИДвоичныеДанные(ДанныеПроведенияОбучения.ФайлКартинки);
		ОписаниеФайлаКартинки.ДвоичныеДанные.Записать(ПутьККаталогуПроведенияОбучения 
			+ ИмяФайлаКартинки(ОписаниеФайлаКартинки.ДанныеФайла.Расширение));
		
	КонецЕсли;
	
	// Обновляем список авто-разделов форума у пользователей
		
	РегистрыСведений.ДанныеВебКабинетаСУО_ПН.УдалитьДанные(ПроведениеОбучения, Перечисления.ТипыДанныхВебКабинетаСУО.РазделФорума);
	
	Если ДанныеПроведенияОбучения.Проведен Тогда
		
		ТаблицаПользовательскихРазделов = РегистрыСведений.АвтоРазделыФорумаСУО.РазделыПользователя(,ПроведениеОбучения); // Пользователи, которым доступен авто-раздел

		ОписаниеРазделаJSON = Справочники.РазделыФорумаСУО.РазделJSON(ПроведениеОбучения);

		Для каждого Строка Из ТаблицаПользовательскихРазделов Цикл
			РегистрыСведений.ДанныеВебКабинетаСУО_ПН.ДобавитьДанные(Строка.Пользователь, Перечисления.ТипыДанныхВебКабинетаСУО.РазделФорума, ПроведениеОбучения, ОписаниеРазделаJSON, Перечисления.ФорматыВебДанныхСУ.json);
		КонецЦикла;
			
	КонецЕсли;	
	
	// Обновляем преподавателей участников
	
	ПрохожденияОбучения = Документы.ПроведениеОбученияСУО.ПрохожденияОбучения(ПроведениеОбучения, Истина);
	
	Для каждого Строка Из ПрохожденияОбучения Цикл
		РегистрыСведений.ПреподавателиОбученияСУО.ОбновитьДанныеВебКабинета(Строка.Пользователь);		
	КонецЦикла;
	
	// Отборы
	
	РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.УдалитьОтбор(ПроведениеОбучения);
		
	// Обновляем открытое обучение
	
	РегистрыСведений.ДанныеВебКабинетаСУО_ПП.УдалитьДанные(ПроведениеОбучения, Перечисления.ТипыДанныхВебКабинетаСУО.УчебнаяАктивность);
	РегистрыСведений.ДанныеВебКабинетаСУО_ПН.УдалитьДанные(ПроведениеОбучения, Перечисления.ТипыДанныхВебКабинетаСУО.УчебнаяАктивность);
	
	Если ДанныеПроведенияОбучения.Проведен Тогда
	
		ОткрытоеОбучениеВыборка = РегистрыСведений.ОткрытоеОбучениеСУО.ВыбратьЭлементыРасписания(ПроведениеОбучения);
		
		Если ОткрытоеОбучениеВыборка.Количество() > 0 Тогда
			
			// Устанавливаем отбор именно для проведения обучения, как открытое,
			// чтобы оно нашлось при запросе открытого обучения пользователя.
			// Отбор не пользовательский, а общий.
			
			РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.ДобавитьОтбор(ПроведениеОбучения, Перечисления.ОтборыДанныхВебКабинетаСУО.Открытые);
			
			// Устанавливаем данные для каждого потенциального участника открытого обучения.
			
			ЭлектронноДистанционное = Документы.ПроведениеОбученияСУО.ЭлектронноДистанционноеОбучение(ПроведениеОбучения);
			ВидОбучения = Документы.ПроведениеОбученияСУО.ВидОбучения(ПроведениеОбучения); 
			
			Пока ОткрытоеОбучениеВыборка.Следующий() Цикл			
				
				ОписаниеОткрытогоОбучения = Документы.ПрохождениеОбученияСУО.УчебнаяАктивностьПустаяСтруктура();		
				
				ОписаниеОткрытогоОбучения.Тип = ?(ОткрытоеОбучениеВыборка.ТребуетсяЗаявка, "ЗаявкаНаОбучение", "ЗаписьНаОбучение");
				ОписаниеОткрытогоОбучения.Идентификатор = Строка(ПроведениеОбучения.УникальныйИдентификатор());
				ОписаниеОткрытогоОбучения.Наименование = ОткрытоеОбучениеВыборка.Наименование;			
				ОписаниеОткрытогоОбучения.ДатаНачала = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ОткрытоеОбучениеВыборка.ДатаНачалаПроведения);				
				ОписаниеОткрытогоОбучения.ДатаОкончания = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ОткрытоеОбучениеВыборка.ДатаОкончанияПроведения);		
				ОписаниеОткрытогоОбучения.ЭлектронноДистанционное = ЭлектронноДистанционное;
				ОписаниеОткрытогоОбучения.СкрытьВремяПроведения = ОткрытоеОбучениеВыборка.СкрытьВремяПроведения;		
				ОписаниеОткрытогоОбучения.ПрохождениеОбучения = ОткрытоеОбучениеВыборка.ПрохождениеОбучения;
				ОписаниеОткрытогоОбучения.ДатаОткрытияЗаписи = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ОткрытоеОбучениеВыборка.ДатаОткрытияЗаписи);				
				ОписаниеОткрытогоОбучения.ДатаЗакрытияЗаписи = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ОткрытоеОбучениеВыборка.ДатаЗакрытияЗаписи);			
				ОписаниеОткрытогоОбучения.ПроведениеОбучения = ПроведениеОбучения;				
				ОписаниеОткрытогоОбучения.РодительскаяАктивность = Справочники.ВидыМероприятийСУО.ПустаяСсылка();
				
				ОписаниеОткрытогоОбучения.ПродолжительностьВСекундах = ДанныеПроведенияОбучения.ПродолжительностьВСекундах;
	
				ОписаниеОткрытогоОбучения.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.ЗначениеВЧисло(
					ДанныеПроведенияОбучения.ВариантПродолжительности);

				// Качество обучения
	
				ОписаниеОткрытогоОбучения.СредняяОценкаКачестваОбучения = 0;
				ОписаниеОткрытогоОбучения.КоличествоОценокКачестваОбучения = 0;
								
				Если ДанныеПроведенияОбучения.КачествоОбученияОцениваетсяУчастниками
					И ДанныеПроведенияОбучения.ПоказыватьОценкиИКомментарииВсемУчастникам Тогда
					
					ОписаниеОценокКачества = УправлениеОбучениемСУОПовтИсп.ОценкаКачестваПроведенияОбучения(ПроведениеОбучения);						
					ОписаниеОткрытогоОбучения.СредняяОценкаКачестваОбучения = ОписаниеОценокКачества.СредняяОценка;
					ОписаниеОткрытогоОбучения.КоличествоОценокКачестваОбучения = ОписаниеОценокКачества.КоличествоОценок;
						
				КонецЕсли;

				// Картинка обучения
				
				ОписаниеОткрытогоОбучения.Картинка = "";
				Если ЗначениеЗаполнено(ОткрытоеОбучениеВыборка.ФайлКартинки) Тогда
					ОписаниеОткрытогоОбучения.Картинка = Документы.ПроведениеОбученияСУО.АдресФайлаКартинки(
						ОткрытоеОбучениеВыборка.ПроведениеОбучения, ОткрытоеОбучениеВыборка.РасширениеКартинки); 
				КонецЕсли;
				
				ДанныеУчебнойАктивности = ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеОткрытогоОбучения);		
				
				Если НЕ ЗначениеЗаполнено(ОткрытоеОбучениеВыборка.ДатаНачалаПроведения) Тогда
					РегистрыСведений.ДанныеВебКабинетаСУО_ПН.ДобавитьДанные(ОткрытоеОбучениеВыборка.Пользователь, Перечисления.ТипыДанныхВебКабинетаСУО.УчебнаяАктивность, ПроведениеОбучения, ДанныеУчебнойАктивности, Перечисления.ФорматыВебДанныхСУ.json);				
				Иначе				
					РегистрыСведений.ДанныеВебКабинетаСУО_ПП.ДобавитьДанные(ОткрытоеОбучениеВыборка.ДатаНачалаПроведения, ОткрытоеОбучениеВыборка.Пользователь, Перечисления.ТипыДанныхВебКабинетаСУО.УчебнаяАктивность, ПроведениеОбучения, ДанныеУчебнойАктивности, Перечисления.ФорматыВебДанныхСУ.json);				
				КонецЕсли;
				
			КонецЦикла;
		
		КонецЕсли;
		
	КонецЕсли;
		
	// Обновляем описание проведения обучения
	
	РегистрыСведений.ДанныеВебКабинетаСУО_ОН.УдалитьДанные(ПроведениеОбучения, Перечисления.ТипыДанныхВебКабинетаСУО.ОписаниеОбучения);
	
	Если ДанныеПроведенияОбучения.Проведен Тогда
	
		ОписаниеОбученияСтруктура = Новый Структура(
		"Идентификатор,
		|Наименование,
		|Открытое,
		|ОписаниеОткрытогоОбучения");
		
		ОписаниеОбученияСтруктура.Идентификатор      = Строка(ПроведениеОбучения.УникальныйИдентификатор());
		ОписаниеОбученияСтруктура.Наименование       = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сценарий, "Наименование");
		ОписаниеОбученияСтруктура.Открытое           = ДанныеПроведенияОбучения.Открытое;
		
		Если ДанныеПроведенияОбучения.Открытое Тогда
		
			ОписаниеОбученияСтруктура.ОписаниеОткрытогоОбучения = Новый Структура("ДатаОткрытияЗаписи, ДатаЗакрытияЗаписи, Описание, ДополнительныеСведения");
			
			ОписаниеОбученияСтруктура.ОписаниеОткрытогоОбучения.ДатаОткрытияЗаписи = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ДанныеПроведенияОбучения.ДатаОткрытияЗаписи);
			ОписаниеОбученияСтруктура.ОписаниеОткрытогоОбучения.ДатаЗакрытияЗаписи = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ДанныеПроведенияОбучения.ДатаЗакрытияЗаписи);
			
			Если ТипЗнч(ДанныеПроведенияОбучения.КомментарийОткрытогоМероприятияДляУчастника) = Тип("ХранилищеЗначения") Тогда
				
			    ОписаниеОткрытогоОбученияДляУчастникаФорматированныйДокумент = ДанныеПроведенияОбучения.КомментарийОткрытогоМероприятияДляУчастника.Получить();
		
				ОписаниеОткрытогоОбученияДляУчастникаСтруктура = ОбщегоНазначенияСУ.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ОписаниеОткрытогоОбученияДляУчастникаФорматированныйДокумент, Строка(ПроведениеОбучения.УникальныйИдентификатор()), "КомментарийОткрытогоМероприятияДляУчастника", Истина);
					
				ОписаниеОткрытогоОбученияДляУчастникаHTML = СокрЛП(ОписаниеОткрытогоОбученияДляУчастникаСтруктура.ПредставлениеHTML);
				
				Если ЗначениеЗаполнено(ОписаниеОткрытогоОбученияДляУчастникаHTML) Тогда
					ОписаниеОбученияСтруктура.ОписаниеОткрытогоОбучения.Описание = ОписаниеОткрытогоОбученияДляУчастникаHTML;
				КонецЕсли;	
				
			КонецЕсли;
			
			ОписаниеОбученияСтруктура.ОписаниеОткрытогоОбучения.ДополнительныеСведения = ВебКабинетСУО.ТаблицаДополнительныхРеквизитовОбъекта(Документы.ЗаявкаНаОбучениеСУО.ПустаяСсылка());
			
		КонецЕсли;
			
		ОписаниеОбученияJSON = ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеОбученияСтруктура);
		
		РегистрыСведений.ДанныеВебКабинетаСУО_ОН.ДобавитьДанные(Перечисления.ТипыДанныхВебКабинетаСУО.ОписаниеОбучения, ПроведениеОбучения, ОписаниеОбученияJSON, Перечисления.ФорматыВебДанныхСУ.json); 
		
	КонецЕсли;
	
	// Обновляем оценки качества обучения
	
	РегистрыСведений.ДанныеВебКабинетаСУО_ОН.УдалитьДанные(ПроведениеОбучения, Перечисления.ТипыДанныхВебКабинетаСУО.ОценкиКачестваОбучения);
	
	Если ДанныеПроведенияОбучения.Проведен Тогда
		
		ОписаниеОценокJSON = ОбщегоНазначенияСУ.ДанныеВJSON(
			РегистрыСведений.ОценкиКачестваОбученияСУО.ОписаниеОценокПроведенияОбучения(ПроведениеОбучения));
		
		РегистрыСведений.ДанныеВебКабинетаСУО_ОН.ДобавитьДанные(Перечисления.ТипыДанныхВебКабинетаСУО.ОценкиКачестваОбучения, ПроведениеОбучения, ОписаниеОценокJSON, Перечисления.ФорматыВебДанныхСУ.json);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("ЭлектронныйРесурс");
	Поля.Добавить("Мероприятие");
	Поля.Добавить("НаОсновеЭлектронногоРесурса");
	Поля.Добавить("НаОсновеМероприятия");
	Поля.Добавить("БезСценария");
	Поля.Добавить("Наименование");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтандартнаяОбработка = Ложь;
	
	НаименованиеСценария = "";
	
	Если ЗначениеЗаполнено(Данные.Наименование) Тогда
		
		НаименованиеСценария = Данные.Наименование;
		
	Иначе
		
		Если Данные.НаОсновеЭлектронногоРесурса Тогда
			НаименованиеСценария = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные.ЭлектронныйРесурс, "Наименование");
		ИначеЕсли Данные.НаОсновеМероприятия Тогда
			НаименованиеСценария = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные.Мероприятие, "Наименование");
		Иначе
			НаименованиеСценария = НСтр("ru = 'Обучение'");
		КонецЕсли;		
		
	КонецЕсли;
	
	Представление = Строка(НаименованиеСценария);
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		
		Если Параметры.Свойство("Ключ") Тогда
			Возврат;
		КонецЕсли;
		
		Если Параметры.Свойство("ЗначениеКопирования") Тогда
			Возврат;
		КонецЕсли;			
		
		ПоказатьФормуСоздания = Истина;
		
		Если Параметры.Свойство("ЗначенияЗаполнения")
			И (Параметры.ЗначенияЗаполнения.Свойство("БезСценария")
			ИЛИ Параметры.ЗначенияЗаполнения.Свойство("НаОсновеМероприятия")
			ИЛИ Параметры.ЗначенияЗаполнения.Свойство("НаОсновеЭлектронногоРесурса"))
			ИЛИ ПолучитьФункциональнуюОпцию("ОбразовательнаяОрганизацияОО")
			ИЛИ ПолучитьФункциональнуюОпцию("ЭкзаменаторЭР") Тогда
			
			ПоказатьФормуСоздания = Ложь;
			
		КонецЕсли;
		
		Если Параметры.Свойство("Основание") Тогда
			ПоказатьФормуСоздания = Ложь;
		КонецЕсли;
			
		Если ПоказатьФормуСоздания Тогда
			
			СтандартнаяОбработка = Ложь;
			
			ВыбраннаяФорма = "ФормаСоздания";
			
		КонецЕсли;
		
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
