#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Перем ВозможныеУчастники; // Участники, которые могут быть записаны на открытое мероприятие.
Перем ПрохожденияУчастников; // Документы "ПрохождениеОбученияСУО" участников мероприятия.
Перем ПодчиненныеМероприятия; // Таблица из регистра "ПроведениеПодчиненныхМероприятийСУО".

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда
		Мероприятие = ДанныеЗаполнения;
		СхемаПроведения = Справочники.КаталогМероприятийСУО.ЕдинственныйВариантОбучения(Мероприятие);
		НаОсновеМероприятия = Истина;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
		ЭлектронныйРесурс = ДанныеЗаполнения;
		НаОсновеЭлектронногоРесурса = Истина;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Мероприятие") Тогда
			НаОсновеМероприятия = Истина;
			СхемаПроведения = Справочники.КаталогМероприятийСУО.ЕдинственныйВариантОбучения(ДанныеЗаполнения.Мероприятие);
		КонецЕсли;		
		
		Если ДанныеЗаполнения.Свойство("ЭлектронныйРесурс") Тогда
			НаОсновеЭлектронногоРесурса = Истина;
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если БезСценария Тогда
		
		// Примечание: проверка на заполнение электронного ресурса делается в форме,
		// так как после записи это поле будет нередактируемым, а данный обработчик
		// вызывается только при проведении.
		
		Если НЕ ЗначениеЗаполнено(Наименование) Тогда
			
			Текст = НСтр("ru = 'Укажите наименование обучения'");
			Поле = "Наименование";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);			
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВидОбучения) Тогда
			
			Текст = НСтр("ru = 'Укажите вид обучения'");
			Поле = "ВидОбучения";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);			
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(МестоПроведения) Тогда
			
			Текст = НСтр("ru = 'Укажите место проведения обучения'");
			Поле = "МестоПроведения";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);			
			
		КонецЕсли;				
		
	КонецЕсли;
		
	Если НаОсновеМероприятия Тогда
		
		// Примечание: проверка на заполнение мероприятия делается в форме,
		// Так как после записи это поле будет нередактируемым, а данный обработчик
		// Вызывается только при проведении.
		
		// Схема проведения
		
		Если Мероприятие.Вид.Общее И НЕ ЗначениеЗаполнено(СхемаПроведения) Тогда
			Текст = НСтр("ru = 'Укажите схему проведения мероприятия'");
			Поле = "СхемаПроведения";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);			
		КонецЕсли;
		
		// Аудитория
		
		Если НЕ Мероприятие.Вид.Общее
			И Мероприятие.МестоПроведения = Перечисления.МестаПроведенияМероприятийСУО.Аудитория
			И НЕ ЗначениеЗаполнено(Аудитория) Тогда
			
			Текст = НСтр("ru = 'Укажите аудиторию проведения обучения ""%1""'");
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, Мероприятие);
			Поле  = "Аудитория";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
		
		// Дата проведения мероприятия
				
		Если НЕ Мероприятие.Вид.Общее
			И (Мероприятие.МестоПроведения = Перечисления.МестаПроведенияМероприятийСУО.Аудитория 
				ИЛИ НЕ Мероприятие.Вид.Электронное)
			И НЕ ЗначениеЗаполнено(ДатаНачалаПроведения) Тогда
			
			Текст = НСтр("ru = 'Укажите дату проведения обучения'");
			Поле = "ДатаНачалаПроведения";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;

	КонецЕсли;

	// Проверяем корректность дат
	
	Если ЗначениеЗаполнено(НачалоДня(ДатаНачалаПроведения))
		И ЗначениеЗаполнено(НачалоДня(ДатаОкончанияПроведения))
		И ДатаНачалаПроведения > ДатаОкончанияПроведения Тогда
		
		Текст = НСтр("ru = 'Дата начала обучения не может быть больше даты окончания'");
		Поле = "ДатаНачалаПроведения";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);			
		
	КонецЕсли;
		
	Если ЗначениеЗаполнено(НачалоДня(ДатаНачалаДоступа))
		И ЗначениеЗаполнено(НачалоДня(ДатаКонтроля))
		И ДатаНачалаДоступа > ДатаКонтроля Тогда
		
		Текст = НСтр("ru = 'Дата начала обучения не может быть больше даты окончания'");
		Поле = "ДатаНачалаДоступа";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);						
		
	КонецЕсли;	
	
	Если СкрытьВремяПроведения
		И ЗначениеЗаполнено(НачалоДня(ДатаНачалаДоступа))
		И ЗначениеЗаполнено(НачалоДня(ДатаКонтроля))
		И НачалоДня(ДатаНачалаДоступа) = НачалоДня(ДатаКонтроля) Тогда
		
		Текст = НСтр("ru = 'Совпадают даты обучения с... и по... Снимите флажок ""Скрыть время"" и задайте время'");
		Поле = "СкрытьВремяПроведения";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);								
		
	КонецЕсли;
	
	Если СкрытьВремяПроведения
		И ЗначениеЗаполнено(НачалоДня(ДатаНачалаПроведения))
		И ЗначениеЗаполнено(НачалоДня(ДатаОкончанияПроведения))
		И НачалоДня(ДатаНачалаПроведения) = НачалоДня(ДатаОкончанияПроведения) Тогда
		
		Текст = НСтр("ru = 'Совпадают даты обучения с... и по... Снимите флажок ""Скрыть время"" и задайте время'");
		Поле = "СкрытьВремяПроведения";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);								
		
	КонецЕсли;
	
	
	Если ОткрытоеМероприятие Тогда // Открытое
		
		Если ЗначениеЗаполнено(ДатаОткрытияЗаписи)
			И НЕ ЗначениеЗаполнено(ДатаЗакрытияЗаписи) Тогда
			
			Текст = НСтр("ru = 'Укажите дату закрытия записи'");
			Поле = "ДатаЗакрытияЗаписи";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДатаОткрытияЗаписи)
			И ЗначениеЗаполнено(ДатаЗакрытияЗаписи) Тогда
			
			Текст = НСтр("ru = 'Укажите дату открытия записи'");
			Поле = "ДатаОткрытияЗаписи";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДатаОткрытияЗаписи)
			И ЗначениеЗаполнено(ДатаЗакрытияЗаписи)
			И ДатаЗакрытияЗаписи < ДатаОткрытияЗаписи Тогда
			
			Текст = НСтр("ru = 'Дата закрытия записи на обучение не может быть меньше даты открытия записи на обучение'");
			Поле = "ДатаЗакрытияЗаписи";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДатаНачалаПроведения)
			И ЗначениеЗаполнено(ДатаОткрытияЗаписи)
			И ЗначениеЗаполнено(ДатаЗакрытияЗаписи)
			И ДатаОткрытияЗаписи > ДатаНачалаПроведения Тогда
			
			Текст = НСтр("ru = 'Дата открытия записи на обучение не может быть больше даты начала проведения обучения'");
			Поле = "ДатаОткрытияЗаписи";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Учебные группы
	
	Если ОбщегоНазначенияСУКлиентСервер.ЕстьСовпаденияВКоллекцииЗначений(УчебныеГруппы, "УчебнаяГруппа") Тогда
		Текст = НСтр("ru = 'Укажите различные учебные группы'");
		Поле = "УчебныеГруппы";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);			
	КонецЕсли;
	
	// Предупреждение по открытому или общедоступному обучению
	
	Если (АвтозачислениеНаОбучение ИЛИ ОткрытоеМероприятие) И НЕ ОткрытоДляВсех Тогда
		
		Если УчебныеГруппы.Количество() = 0
			И Должности.Количество() = 0
			И Организации.Количество() = 0
			И ПодразделенияПредприятия.Количество() = 0
			И Курсы.Количество() = 0
			И Специальности.Количество() = 0
			И Отделения.Количество() = 0
			И ГруппыСтудентов.Количество() = 0 Тогда
			
			Текст = НСтр("ru = 'Не указаны пользователи, которым будет доступно обучение'");
			Поле = "ГруппаПотенциальныеУчастники";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле);
			
			// Отказ не требуется, так как это может быть обучение для зачисление
			// через внешний HTTP API.
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Условия зачисления
	
	Если УсловияЗачисленияУчастников.Количество() > 0 Тогда
		
		Для каждого СтрокаТЧ Из УсловияЗачисленияУчастников Цикл
		
			Если ЗначениеЗаполнено(СтрокаТЧ.НачалоДиапазонаБаллов)
				И ЗначениеЗаполнено(СтрокаТЧ.КонецДиапазонаБаллов)
				И СтрокаТЧ.НачалоДиапазонаБаллов > СтрокаТЧ.КонецДиапазонаБаллов Тогда
				
				Текст = НСтр("ru = 'Диапазон баллов в условиях зачисления указан неверно'");
				Поле = "УсловияЗачисленияУчастников";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,,Отказ);
				
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
		
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Делаем проверки
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Устанавливаем вид сценария до получения данных
	
	Документы.ПроведениеОбученияСУО.УстановитьВидСценария(ЭтотОбъект, Отказ);
	
	// Получаем данные
	
	ВидОбучения = Документы.ПроведениеОбученияСУО.ВидОбучения(ЭтотОбъект); // Будет заполнено в реквизите
	ДистанционноеОбучение = Документы.ПроведениеОбученияСУО.ДистанционноеОбучение(ЭтотОбъект);
	ЭтоЭлектронноеОбучение   = Документы.ПроведениеОбученияСУО.ЭтоЭлектронноеОбучение(ЭтотОбъект, ВидОбучения);
	ЭтоПолныйИнтерфейс = ПолучитьФункциональнуюОпцию("ПолныйИнтерфейсСУО");
	ЭлектронноДистанционное = ?(ДистанционноеОбучение И ЭтоЭлектронноеОбучение, Истина, Ложь);	
	
	// Устанавливем реквизиты
	
	ДатаИзменения = ТекущаяДатаСеанса();
	
	Если ОткрытоеМероприятие Тогда
		АвтозачислениеНаОбучение = Ложь;
	КонецЕсли;
	
	Если НЕ ОткрытоеМероприятие Тогда
		ТребуетсяЗаявка = Ложь;
	КонецЕсли;
	
	Если ДоступноВнешнимПользователям Тогда		
		ЗапретитьОбщениеМеждуУчастниками = Истина;		
	КонецЕсли;
	
	Если НЕ ЭлектронноДистанционное Тогда
		ДатаКонтроля = Дата("00010101");
		ДатаНачалаДоступа = Дата("00010101");
	КонецЕсли;
	
	Если НачалоДня(ДатаКонтроля) = Дата("00010101") Тогда
		ДатаКонтроля = Дата("00010101");
	КонецЕсли;
	
	Если НачалоДня(ДатаНачалаДоступа) = Дата("00010101") Тогда
		ДатаНачалаДоступа = Дата("00010101");
	КонецЕсли;
	
	Если ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.Фиксированная
		ИЛИ ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.НеЗадана Тогда
		ПродолжительностьВСекундах = 0;	
	КонецЕсли;
	
	Если ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.СЗачисления
		ИЛИ ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.СНачалаОбучения
		ИЛИ ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.НеЗадана Тогда
		ДатаНачалаДоступа = Дата("00010101");
		ДатаКонтроля = Дата("00010101");
	КонецЕсли;
	
	Если ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.СЗачисления
		ИЛИ ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.СНачалаОбучения Тогда
		
		Для каждого СтрокаЭЗ Из ЭлектронныеЗадания Цикл
			СтрокаЭЗ.ДатаНачалаДоступаКЗаданию = Неопределено;
			СтрокаЭЗ.ДатаОкончанияДоступаКЗаданию = Неопределено;
			СтрокаЭЗ.СкрытьВремяДоступаКЗаданию = Ложь;
		КонецЦикла;
		
	КонецЕсли;		
	
	Если ЭлектронныеЗадания.Количество() = 1 Тогда
		ЭлектронныеЗадания[0].ДатаНачалаДоступаКЗаданию = Неопределено;
		ЭлектронныеЗадания[0].ДатаОкончанияДоступаКЗаданию = Неопределено;
		ЭлектронныеЗадания[0].СкрытьВремяДоступаКЗаданию = Ложь;
	КонецЕсли;
	
	Документы.ПроведениеОбученияСУО.ЗаполнитьВариантПродолжительностиПоУмолчанию(ЭтотОбъект, ЭлектронноДистанционное);
	
	Если НЕ ОткрытоеМероприятие Тогда
		ДатаОткрытияЗаписи = Дата("00010101");
		ДатаЗакрытияЗаписи = Дата("00010101");
	КонецЕсли;
	
	Если НачалоДня(ДатаОткрытияЗаписи) = Дата("00010101") Тогда
		ДатаОткрытияЗаписи = Дата("00010101");
	КонецЕсли;
	
	Если НачалоДня(ДатаЗакрытияЗаписи) = Дата("00010101") Тогда
		ДатаЗакрытияЗаписи = Дата("00010101");
	КонецЕсли;
	
	Если АвтозачислениеНаОбучение Тогда
		МаксимальноеКоличествоУчастников = 0;
		ОткрытоеМероприятие              = Ложь;
		ОткрытоДляРуководителей          = Ложь;
	КонецЕсли;
	
	Если НЕ ОткрытоеМероприятие И НЕ АвтозачислениеНаОбучение Тогда
		ОткрытоДляВсех          = Ложь;
		ОткрытоДляРуководителей = Ложь;
	КонецЕсли;	
	
	Если (НЕ ОткрытоеМероприятие И НЕ АвтозачислениеНаОбучение) ИЛИ ОткрытоДляВсех Тогда
		
		УчебныеГруппы.Очистить();
		Должности.Очистить();
		Организации.Очистить();
		ПодразделенияПредприятия.Очистить();
		
	КонецЕсли;

	Если НЕ АвтозачислениеНаОбучение Тогда
		ФильтрПоДатеПриемаНаРаботу = Дата("00010101");
	КонецЕсли;
	
	Если ЭлектронноДистанционное ИЛИ ВидОбучения.Общее Тогда
		ДатаНачалаПроведения = Дата("00010101");
		ДатаОкончанияПроведения = Дата("00010101");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаНачалаПроведения) Тогда
		ДатаОкончанияПроведения = Дата("00010101");
	КонецЕсли;
	
	Если ДистанционноеОбучение ИЛИ ВидОбучения.Общее Тогда
		Аудитория = Неопределено;
	КонецЕсли;
	
	Если НЕ КачествоОбученияОцениваетсяУчастниками Тогда
		ПоказыватьОценкиИКомментарииВсемУчастникам = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПроведениеПрограммыОбучения)
		И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	
		ДокументПроведениеПрограммыОбученияПроведен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроведениеПрограммыОбучения, "Проведен");
		
		Если НЕ ДокументПроведениеПрограммыОбученияПроведен Тогда
			
			Текст = НСтр("ru = 'Для проведения обучения ""%1"" необходимо провести документ программы обучения ""%2""'");
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, Строка(Ссылка), ПроведениеПрограммыОбучения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПорядковыйНомер)
		И ЗначениеЗаполнено(ПроведениеПрограммыОбучения) Тогда
		ПорядковыйНомер = Документы.ПроведениеПрограммыОбученияСУО.ПоследнийПорядковыйНомер(ПроведениеПрограммыОбучения);
	КонецЕсли;
	
	Если НЕ НаОсновеМероприятия Тогда
		Мероприятие = Неопределено;
	КонецЕсли;
	
	Если Ссылка.Пустая() И НЕ ВидОбучения.Общее Тогда
		СхемаПроведения = Неопределено;
	КонецЕсли;
	
	Если НЕ ДистанционноеОбучение Тогда
		АдресВИнтернете = "";
	КонецЕсли;
		
	Если ЭлектронныеЗадания.Количество() > 0 Тогда
		ВсеТесты = ВсеТестыЗаданий();
		ВсеЗаданияИмеютВесНоль = Истина;
		Для каждого СтрокаТЧ Из ЭлектронныеЗадания Цикл
			Если ТипЗнч(СтрокаТЧ.Задание) = Тип("СправочникСсылка.ЗаданияСУО") Тогда
				СтрокаТЧ.ПлеерВебКабинета = Неопределено;
				СтрокаТЧ.ПриОтсутствииОценкиЗаЗадание = Неопределено;
			КонецЕсли;
			Если ВсеТесты.Найти(СтрокаТЧ.Задание) <> Неопределено Тогда
				СтрокаТЧ.ПриОтсутствииОценкиЗаЗадание = Неопределено;
			КонецЕсли;
			Если СтрокаТЧ.Вес <> 0 Тогда
				ВсеЗаданияИмеютВесНоль = Ложь;
			КонецЕсли;
			Если НЕ ВидОбучения.ВыставляетсяОценка Тогда
				СтрокаТЧ.ПроходнойБалл = 0;
				СтрокаТЧ.Вес = 1;
			КонецЕсли;
		КонецЦикла;
		Если ВсеЗаданияИмеютВесНоль Тогда
			Текст = НСтр("ru = 'Вес хотя бы одного задания должен быть больше нуля'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);			
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ВидОбучения.ТребуетсяПреподаватель Тогда
		ЕстьЗаданияНаПроверку = Ложь;
		Для каждого СтрокаЭЗ Из ЭлектронныеЗадания Цикл
			Если ТипЗнч(СтрокаЭЗ.Задание) = Тип("СправочникСсылка.ЗаданияСУО") Тогда
				ЕстьЗаданияНаПроверку = Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		Если ЕстьЗаданияНаПроверку Тогда
			Текст = НСтр("ru = 'В настройках вида обучения ""%1"" снят флажок Требуется преподаватель, но на закладке Обязательные задания указаны задания на проверку. Установите флажок у данного вида, замените вид обучения или удалите задания на проверку.'");
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, ВидОбучения.Наименование);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);	
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("СоздатьАвтоматическуюРассылку", Ложь);
		
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ Проведен Тогда
		ДополнительныеСвойства.СоздатьАвтоматическуюРассылку = Истина;	
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И ОткрытоеМероприятие Тогда
		ДополнительныеСвойства.СоздатьАвтоматическуюРассылку = Истина;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Получаем данные
	//
	
	ВидОбучения = Документы.ПроведениеОбученияСУО.ВидОбучения(ЭтотОбъект);
	СценарийОбучения = Документы.ПроведениеОбученияСУО.СценарийОбучения(ЭтотОбъект);
	ШкалаОценки = Документы.ПроведениеОбученияСУО.ШкалаОценки(ЭтотОбъект);
	
	ДатаНачалаПроведения    = Документы.ПроведениеОбученияСУО.ДатаНачалаПроведения(Ссылка, Мероприятие);
	ДатаОкончанияПроведения = Документы.ПроведениеОбученияСУО.ДатаОкончанияПроведения(Ссылка, Мероприятие);
		
	// Делаем движения
	//
	
	Движения.ПроведениеОбученияСУО.Записывать = Истина;
	Движения.ОткрытоеОбучениеСУО.Записывать   = Истина;	
	Движения.ИспользованиеАудиторийСУО.Записывать            = Истина;
	Движения.РасписаниеОбученияОбщееСУО.Записывать           = Истина;
	
	// ПроведениеОбученияСУО
	
	Движение = Движения.ПроведениеОбученияСУО.Добавить();
	
	Движение.Период                       = Дата;
	Движение.Сценарий                     = СценарийОбучения;
	Движение.ДатаНачалаПроведения         = ДатаНачалаПроведения;
	Движение.ДатаОкончанияПроведения      = ДатаОкончанияПроведения;
	Движение.ДатаПроведения               = Движение.ДатаНачалаПроведения; // День проведения
	Движение.ПродолжительностьВЧасах      = Документы.ПроведениеОбученияСУО.Продолжительность(ЭтотОбъект) / 3600; 
	Движение.Статус                       = Статус;
	Движение.ДоступноВсем                 = ?(АвтозачислениеНаОбучение И ОткрытоДляВсех, Истина, Ложь);
	Движение.АвтозачислениеНаОбучение     = АвтозачислениеНаОбучение;
	Движение.ДоступноВнешнимПользователям = ДоступноВнешнимПользователям;
	Движение.Вид                          = ВидОбучения;
	Движение.Общее                        = ВидОбучения.Общее;
	Движение.НаОсновеЭлектронногоРесурса  = НаОсновеЭлектронногоРесурса;
	Движение.ВыставляетсяОценка           = ВидОбучения.ВыставляетсяОценка;
	Движение.ДатаНачалаДоступа            = ДатаНачалаДоступа;
	Движение.ДатаКонтроля                 = ДатаКонтроля;
	Движение.ТребуетсяПреподаватель       = ВидОбучения.ТребуетсяПреподаватель;
	Движение.ЗапросНаОбучение             = ЗапросНаОбучение;
	
	Если Статус <> Перечисления.СтатусыПроведенияОбъектовСУО.Отменено Тогда
			
		// ОткрытоеОбучениеСУО
		
		Если ОткрытоеМероприятие И (Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Запланировано
			ИЛИ Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Активно) Тогда
		
	        ВозможныеУчастники = ВозможныеУчастникиОбучения();
			
			ВремяДоступаПользователей = РегистрыСведений.ВремяДоступаПользователейСУО.ТаблицаВремениДоступа(ВозможныеУчастники.ВыгрузитьКолонку("Пользователь"), ДатаНачалаПроведения);
			
			Для каждого Строка Из ВозможныеУчастники Цикл
				
				ВремяДоступаПользователя = ВремяДоступаПользователей.Найти(Строка.Пользователь, "Пользователь");
				
				Если ВремяДоступаПользователя = Неопределено ИЛИ ВремяДоступаПользователя.ДоступРазрешен Тогда
				
					Движение = Движения.ОткрытоеОбучениеСУО.Добавить();
					
					Движение.Пользователь                = Строка.Пользователь;
					Движение.ПроведениеОбучения          = Ссылка;
					Движение.Сценарий                    = СценарийОбучения;
					Движение.Вид                         = ВидОбучения;
					Движение.ДатаОткрытияЗаписи          = ДатаОткрытияЗаписи;
					Движение.ДатаЗакрытияЗаписи          = ДатаЗакрытияЗаписи;
					Движение.ТребуетсяЗаявка             = ТребуетсяЗаявка;
					Движение.ОткрытоДляРуководителей     = ОткрытоДляРуководителей;
					Движение.ДатаНачалаПроведения        = ДатаНачалаПроведения;
					Движение.ДатаОкончанияПроведения     = ДатаОкончанияПроведения;

				КонецЕсли;
					
			КонецЦикла;
		
		КонецЕсли;
		
		Если НаОсновеМероприятия Тогда
			
			// РасписаниеОбученияОбщееСУО
			
			Если ВидОбучения.Общее Тогда
				
				ПодчиненныеМероприятия = ПодчиненныеМероприятияОбучения();
				
				Для каждого Строка Из ПодчиненныеМероприятия Цикл
					
					Если ЗначениеЗаполнено(Строка.ДатаПроведения)
						И ЗначениеЗаполнено(Строка.ПродолжительностьВСекундах) Тогда
					
						Движение = Движения.РасписаниеОбученияОбщееСУО.Добавить();
						Движение.Период                  = Дата;
						Движение.Мероприятие             = Строка.Мероприятие;
						Движение.ДатаНачалаПроведения    = Строка.ДатаПроведения;
						Движение.ДатаОкончанияПроведения = Строка.ДатаПроведения + Строка.ПродолжительностьВСекундах;
					    Движение.Статус                  = Статус;
						
						Движение.ЦветНаКалендаре = Документы.ПроведениеОбученияСУО.ЦветНаКалендаре(ЭтотОбъект, ВидОбучения, Перечисления.ТипыУчебныхАктивностейСУО.Контроль);
						
						
					КонецЕсли;
					
				КонецЦикла;
				
				Для каждого Строка Из ПодчиненныеМероприятия Цикл
					
					Если ЗначениеЗаполнено(Строка.Аудитория)
						И ЗначениеЗаполнено(Строка.ПродолжительностьВСекундах)
						И ЗначениеЗаполнено(Строка.ДатаПроведения) Тогда
					
						Движение = Движения.ИспользованиеАудиторийСУО.Добавить();
						Движение.Период                     = Строка.ДатаПроведения;
						Движение.Аудитория                  = Строка.Аудитория;
						Движение.Территория                 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Аудитория, "Владелец");
						Движение.ПродолжительностьВСекундах = Строка.ПродолжительностьВСекундах;
						Движение.ДатаОкончанияИспользования = Движение.Период + Строка.ПродолжительностьВСекундах;
						
					КонецЕсли;
						
				КонецЦикла;
				
				
			Иначе
				
				Если ЗначениеЗаполнено(ДатаНачалаПроведения)
					И ЗначениеЗаполнено(Мероприятие.ПродолжительностьВСекундах) Тогда
					
					Движение = Движения.РасписаниеОбученияОбщееСУО.Добавить();
					Движение.Период                  = Дата;
					Движение.Мероприятие             = Мероприятие;
					Движение.ДатаНачалаПроведения    = ДатаНачалаПроведения;
					Движение.ДатаОкончанияПроведения = ДатаНачалаПроведения + Мероприятие.ПродолжительностьВСекундах;
					Движение.Статус                  = Статус;
					
					Движение.ЦветНаКалендаре = Документы.ПроведениеОбученияСУО.ЦветНаКалендаре(ЭтотОбъект, ВидОбучения, Перечисления.ТипыУчебныхАктивностейСУО.Контроль);
					
									
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Аудитория)
					И ЗначениеЗаполнено(ДатаНачалаПроведения)
					И ЗначениеЗаполнено(Мероприятие.ПродолжительностьВСекундах) Тогда
				
					Движение = Движения.ИспользованиеАудиторийСУО.Добавить();
					Движение.Период                     = ДатаНачалаПроведения;
					Движение.Аудитория                  = Аудитория;
					Движение.Территория                 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аудитория, "Владелец");
					Движение.ПродолжительностьВСекундах = Мероприятие.ПродолжительностьВСекундах;
					Движение.ДатаОкончанияИспользования = Движение.Период + Мероприятие.ПродолжительностьВСекундах;
					
				КонецЕсли;
				
				
			КонецЕсли;
					
		Иначе			
			
			Если ЗначениеЗаполнено(Аудитория)
				И ЗначениеЗаполнено(ДатаНачалаПроведения)
				И ЗначениеЗаполнено(ДатаОкончанияПроведения) Тогда
			
				Движение = Движения.ИспользованиеАудиторийСУО.Добавить();
				Движение.Период                     = ДатаНачалаПроведения;
				Движение.Аудитория                  = Аудитория;
				Движение.Территория                 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аудитория, "Владелец");
				Движение.ПродолжительностьВСекундах = ДатаОкончанияПроведения - ДатаНачалаПроведения;
				Движение.ДатаОкончанияИспользования = ДатаОкончанияПроведения;
				
			КонецЕсли;
			
			
		КонецЕсли; // Не на основе мероприятия		
	
	КонецЕсли; // НЕ ОТМЕНЕНО	
	
	Движения.Записать(); // Записываем движения
		
	// Перепроводим подчиненные документы, зачисляем участников
	//
		
	ОбновитьПодчиненныеДокументы(РежимЗаписиДокумента.Проведение);
		
	// Создание новых подчиненных элементов
	
	Если Статус <> Перечисления.СтатусыПроведенияОбъектовСУО.Отменено Тогда
	
		// Зачисление новых участников
		
		Если АвтозачислениеНаОбучение Тогда
			
	        ВозможныеУчастники = ВозможныеУчастникиОбучения();
			
			Если ВозможныеУчастники.Количество() > 0 Тогда				
				
				РегистрыСведений.НовыеЗачисленияНаОбучениеСУО.ДобавитьЗачисления(Ссылка, ВозможныеУчастники.ВыгрузитьКолонку("Пользователь"));
				
				// При данном подходе все пользователи, которые уже зачислены
				// и которые не могут зачислиться на обучение по условию,
				// каждый раз добавляются в регистр новых зачислений и каждый
				// раз регламентное задание пытается их зачислить.
				
				// Так как при зачислении существующее прохождение не обновляется, то бесконечный цикл
				// не возникает. В противном случае возможна ситуация, когда обновление прохождения
				// обучения будет порождать обновление документа проведения обучения, который в свою очередь
				// будет формировать новые зачисления.
				
			КонецЕсли;			
			
		КонецЕсли;
					
		// Создание рассылки
		
		Если ДополнительныеСвойства.Свойство("СоздатьАвтоматическуюРассылку")
			И ДополнительныеСвойства.СоздатьАвтоматическуюРассылку Тогда
			
			ВозможныеУчастники = Неопределено;
			
			Если ОткрытоеМероприятие Тогда
				ВозможныеУчастники = ВозможныеУчастникиОбучения();
			КонецЕсли;
			
			УправлениеОбучениемСУО.СоздатьАвтоматическуюРассылку(ЭтотОбъект, ВозможныеУчастники);

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбновитьПодчиненныеДокументы(РежимЗаписиДокумента.ОтменаПроведения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ИдентификаторОбъектаКопирования = ОбъектКопирования.Ссылка.УникальныйИдентификатор();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ОбновитьПодчиненныеДокументы(РежимЗаписи)

	ОбновлятьПодчиненныеДокументы = УправлениеОбучениемСУО.МожноОбновлятьПодчиненныеДокументы(ЭтотОбъект);
	
	Запрос = Новый Запрос;
	
	Если ОбновлятьПодчиненныеДокументы Тогда
	
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПрохождениеОбученияСУО.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПрохождениеОбученияСУО КАК ПрохождениеОбученияСУО
			|ГДЕ
			|	ПрохождениеОбученияСУО.ПроведениеОбучения = &ПроведениеОбучения
			|	И ПрохождениеОбученияСУО.ПометкаУдаления = ЛОЖЬ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПроведениеПреподавателемОбученияСУО.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПроведениеПреподавателемОбученияСУО КАК ПроведениеПреподавателемОбученияСУО
			|ГДЕ
			|	ПроведениеПреподавателемОбученияСУО.ПометкаУдаления = ЛОЖЬ
			|	И ПроведениеПреподавателемОбученияСУО.ПроведениеОбучения = &ПроведениеОбучения
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПопыткаВыполненияЗаданияСУО.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПопыткаВыполненияЗаданияСУО КАК ПопыткаВыполненияЗаданияСУО
			|ГДЕ
			|	ПопыткаВыполненияЗаданияСУО.ПометкаУдаления = ЛОЖЬ
			|	И ПопыткаВыполненияЗаданияСУО.ПроведениеОбучения = &ПроведениеОбучения
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СообщениеСУО.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.СообщениеСУО КАК СообщениеСУО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТемыСообщенийСУО КАК ТемыСообщенийСУО
			|		ПО СообщениеСУО.Тема = ТемыСообщенийСУО.Ссылка
			|ГДЕ
			|	(ТемыСообщенийСУО.Контекст = &ПроведениеОбучения
			|			ИЛИ ТемыСообщенийСУО.Контекст.ПроведениеОбучения = &ПроведениеОбучения)
			|	И СообщениеСУО.ПервоеСообщениеВТеме = ИСТИНА
			|	И СообщениеСУО.ПометкаУдаления = ЛОЖЬ
			|	И СообщениеСУО.Проведен = ИСТИНА
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ПроведениеОбученияСУОУсловияЗачисленияУчастников.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПроведениеОбученияСУО.УсловияЗачисленияУчастников КАК ПроведениеОбученияСУОУсловияЗачисленияУчастников
			|ГДЕ
			|	(ПроведениеОбученияСУОУсловияЗачисленияУчастников.Сценарий = &СценарийОбучения
			|			ИЛИ ПроведениеОбученияСУОУсловияЗачисленияУчастников.Сценарий = &ПроведениеОбучения)
			|	И ПроведениеОбученияСУОУсловияЗачисленияУчастников.Ссылка.АвтозачислениеНаОбучение = ИСТИНА
			|	И ПроведениеОбученияСУОУсловияЗачисленияУчастников.Ссылка <> &ПроведениеОбучения
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СертификатСУО.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.СертификатСУО КАК СертификатСУО
			|ГДЕ
			|	СертификатСУО.ПрохождениеОбучения.ПроведениеОбучения = &ПроведениеОбучения
			|	И СертификатСУО.Проведен = ИСТИНА";
		
		СценарийОбучения = Документы.ПроведениеОбученияСУО.СценарийОбучения(ЭтотОбъект);
		Запрос.УстановитьПараметр("СценарийОбучения", СценарийОбучения);

	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПрохождениеОбученияСУО.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПрохождениеОбученияСУО КАК ПрохождениеОбученияСУО
			|ГДЕ
			|	ПрохождениеОбученияСУО.ПроведениеОбучения = &ПроведениеОбучения
			|	И ПрохождениеОбученияСУО.ПометкаУдаления = ЛОЖЬ
			|	И ПрохождениеОбученияСУО.Проведен = ЛОЖЬ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПроведениеПреподавателемОбученияСУО.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПроведениеПреподавателемОбученияСУО КАК ПроведениеПреподавателемОбученияСУО
			|ГДЕ
			|	ПроведениеПреподавателемОбученияСУО.ПометкаУдаления = ЛОЖЬ
			|	И ПроведениеПреподавателемОбученияСУО.ПроведениеОбучения = &ПроведениеОбучения
			|	И ПроведениеПреподавателемОбученияСУО.Проведен = ЛОЖЬ";		
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПроведениеОбучения", Ссылка);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Для каждого Результат Из МассивРезультатов Цикл	
		ВыборкаДетальныеЗаписи = Результат.Выбрать();		
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокументы(ВыборкаДетальныеЗаписи, РежимЗаписи,,3,Ссылка);
	КонецЦикла;	
	
	Если ОбновлятьПодчиненныеДокументы И ЗначениеЗаполнено(ПроведениеПрограммыОбучения) Тогда
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(ПроведениеПрограммыОбучения);	
	КонецЕсли;
	
КонецПроцедуры

Функция ВозможныеУчастникиОбучения()
	
	Если ВозможныеУчастники = Неопределено Тогда
		Возврат Документы.ПроведениеОбученияСУО.ВозможныеУчастникиОбучения(Ссылка);
	Иначе
		Возврат ВозможныеУчастники;
	КонецЕсли;
	
КонецФункции

Функция ПрохожденияУчастниковОбучения()
	
	Если ПрохожденияУчастников = Неопределено Тогда
		Возврат Документы.ПроведениеОбученияСУО.ПрохожденияОбучения(Ссылка, Истина);  // Включая подчиненные
	Иначе
		Возврат ПрохожденияУчастников;
	КонецЕсли;
	
КонецФункции

Функция ПодчиненныеМероприятияОбучения()
	
	Если ПодчиненныеМероприятия = Неопределено Тогда
		Возврат Документы.ПроведениеОбученияСУО.ПодчиненныеМероприятия(Ссылка);
	Иначе
		Возврат ПодчиненныеМероприятия;
	КонецЕсли;
	
КонецФункции

Функция ВсеТестыЗаданий()
	
	МассивЭлектронныхРесурсов = Новый Массив;
	МассивЭлектронныхКурсов = Новый Массив;
	
	Для каждого Строка Из ЭлектронныеЗадания Цикл
	
		Если ТипЗнч(Строка.Задание) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
	    	МассивЭлектронныхРесурсов.Добавить(Строка.Задание);
		КонецЕсли;
		
		Если ТипЗнч(Строка.Задание) = Тип("СправочникСсылка.ЭлектронныеКурсы") Тогда
	    	МассивЭлектронныхКурсов.Добавить(Строка.Задание);
		КонецЕсли;
		
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СводыЗнанийСУЗ.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СводыЗнанийСУЗ КАК СводыЗнанийСУЗ
		|ГДЕ
		|	СводыЗнанийСУЗ.Ссылка В(&МассивЭлектронныхРесурсов)
		|	И СводыЗнанийСУЗ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыЭлектронныхРесурсовСУЗ.Тест)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЭлектронныеКурсы.Ссылка
		|ИЗ
		|	Справочник.ЭлектронныеКурсы КАК ЭлектронныеКурсы
		|ГДЕ
		|	ЭлектронныеКурсы.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыЭлектронныхКурсов.Тест)
		|	И ЭлектронныеКурсы.Ссылка В(&МассивЭлектронныхКурсов)";
	
	Запрос.УстановитьПараметр("МассивЭлектронныхКурсов", МассивЭлектронныхКурсов);
	Запрос.УстановитьПараметр("МассивЭлектронныхРесурсов", МассивЭлектронныхРесурсов);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#КонецОбласти

#КонецЕсли