#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура СостояниеНастройки(ТребуетсяНастройкаТомов = Неопределено, ТребуетсяПереносВТома = Неопределено, ТребуетсяОтказатьсяОтТомов = Неопределено, НастройкаНеТребуется = Неопределено) Экспорт
	
	ХранитьФайлыВидеоВТомах = Константы.ХранитьФайлыВидеоВТомахСУЗ.Получить();
	ТомаПодключены = Константы.ХранитьФайлыВТомахНаДиске.Получить() И РаботаСфайлами.ЕстьТомаХраненияФайлов();	
	КоличествоФайловВидео = РегистрыСведений.ДанныеФайлыСУЗ.КоличествоФайловВидео();
	КоличествоФайловВидеоВИБ = РегистрыСведений.ДанныеФайлыСУЗ.КоличествоФайловВидеоРазмещенныхВБазе();
	КоличествоФайловВТомах = РегистрыСведений.ДанныеФайлыСУЗ.КоличествоФайловВТомах();
	РасширеннаяФункциональность = Константы.РасширеннаяФункциональностьСУО.Получить();
	
	ТребуетсяНастройкаТомов = ХранитьФайлыВидеоВТомах И КоличествоФайловВидео > 0 И НЕ ТомаПодключены;
	ТребуетсяПереносВТома = ХранитьФайлыВидеоВТомах И КоличествоФайловВидео > 0 И НЕ ТребуетсяНастройкаТомов
		И КоличествоФайловВидеоВИБ > 0;
	ТребуетсяОтказатьсяОтТомов = НЕ ХранитьФайлыВидеоВТомах И НЕ ТомаПодключены И КоличествоФайловВидео > 0 
		И КоличествоФайловВТомах > 0 И НЕ ТребуетсяПереносВТома И РасширеннаяФункциональность;
		
	НастройкаНеТребуется = НЕ ТребуетсяНастройкаТомов И НЕ ТребуетсяПереносВТома И НЕ ТребуетсяОтказатьсяОтТомов;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
