
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьПравоУправлятьПоставщиком = ПравоДоступа("Редактирование", Метаданные.Константы.ПредпочитатьПоставщикаСУЗ);
	
	Элементы.ОсновнойПоставщик.Видимость = ЕстьПравоУправлятьПоставщиком;

	Если ЕстьПравоУправлятьПоставщиком Тогда
		ОсновнойПоставщик = Константы.ПредпочитатьПоставщикаСУЗ.Получить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОсновнойПоставщикПриИзменении(Элемент)
	ЗаписатьПоставщика();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Список

&НаКлиенте
Процедура СписокОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(НовыйОбъект) ИЛИ НЕ ЕстьПравоУправлятьПоставщиком Тогда
		Возврат;
	КонецЕсли;
	
	СпроситьОбУстановкеПоставщика(НовыйОбъект);	
	
КонецПроцедуры

&НаКлиенте
Процедура СпроситьОбУстановкеПоставщика(НовыйПоставщик)
	
	СчетчикТаймаутов = СчетчикТаймаутов + 1;
	
	Если СчетчикТаймаутов > 10 Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СписокОбработкаЗаписиНовогоПродолжение", ЭтотОбъект, НовыйПоставщик);
	
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Установить нового поставщика основным?'"),  РежимДиалогаВопрос.ДаНет);	
	
КонецПроцедуры


&НаКлиенте
Процедура СписокОбработкаЗаписиНовогоПродолжение(Результат, НовыйПоставщик) Экспорт	

	Если Результат = КодВозвратаДиалога.Таймаут Тогда

		СпроситьОбУстановкеПоставщика(НовыйПоставщик);
		
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
	    ОсновнойПоставщик = НовыйПоставщик;

		ЗаписатьПоставщика();		
		
		СчетчикТаймаутов = 0;
		
	КонецЕсли;		
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаписатьПоставщика()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Константы.ПредпочитатьПоставщикаСУЗ.Установить(ОсновнойПоставщик);
	
	Если ЗначениеЗаполнено(ОсновнойПоставщик) Тогда
		Константы.ПоказыватьПоследнююВерсиюСУЗ.Установить(Истина);
	Иначе
		Константы.ПоказыватьПоследнююВерсиюСУЗ.Установить(Ложь);
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры


#КонецОбласти

