Процедура ДобавитьДанные(Дата, Тип, Объект, Данные, Формат) Экспорт
	
	
	НаборЗаписей = РегистрыСведений.ДанныеВебКабинетаСУО_ОП.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Период.Установить(Дата);
	НаборЗаписей.Отбор.Тип.Установить(Тип);
	НаборЗаписей.Отбор.Объект.Установить(Объект);

	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Дата;
	НоваяЗапись.Тип = Тип;
	НоваяЗапись.Объект = Объект;
	
	НоваяЗапись.Данные = Новый ХранилищеЗначения(Данные);
	НоваяЗапись.Формат = Формат;
	НоваяЗапись.ДатаИзменения = ТекущаяДатаСеанса();

	НаборЗаписей.Записать();	

	
КонецПроцедуры

Процедура УдалитьДанные(Объект, Тип=Неопределено) Экспорт	
		
	НаборЗаписей = РегистрыСведений.ДанныеВебКабинетаСУО_ОП.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Объект.Установить(Объект);
	
	Если Тип <> Неопределено Тогда
		НаборЗаписей.Отбор.Тип.Установить(Тип);	
	КонецЕсли;	
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
