
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	// Устанавливаем переменные
	
	Если ЗначениеЗаполнено(Параметры.Пользователь) Тогда
		
		Пользователь = Параметры.Пользователь;
		Заголовок    = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Результаты пользователя %1'"), Пользователь);
		
	Иначе
		
		Пользователь = Пользователи.ТекущийПользователь();
		Заголовок    = НСтр("ru = 'Мои результаты'");
		
	КонецЕсли;	
	
	ЭтоПолныйИнтерфейс = ПолучитьФункциональнуюОпцию("ПолныйИнтерфейсСУО");
	
	ПросматриваетВладелец = ?(Пользователь = Пользователи.ТекущийПользователь(), Истина, Ложь);
	
	// Устанавливаем видимость
	
	Элементы.СтраницаОбучение.Видимость     = Ложь;
	Элементы.СтраницаПреподавание.Видимость = Ложь;
	
	РолиПользователя = ОбучениеСУОПовтИсп.СписокБазовыхПравПользователя(Пользователь);
	
	Для каждого РольПользователя Из РолиПользователя Цикл
		
		Если РольПользователя = Перечисления.БазовыйРолиПользователейСУО.Учащийся Тогда			
			Элементы.СтраницаОбучение.Видимость = Истина;
		КонецЕсли;
		
		Если РольПользователя = Перечисления.БазовыйРолиПользователейСУО.Преподаватель Тогда
			
			Элементы.СтраницаПреподавание.Видимость = Истина;
			
			Если НЕ ЭтоПолныйИнтерфейс Тогда
				
				Элементы.РаботаПреподавателяВид.Видимость = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;		
		
	КонецЦикла;
	
	УстановитьПараметрыДинамическихСписков();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьМоеОбучение" Тогда
		Элементы.ЗачетнаяКнижка.Обновить();
		Элементы.РаботаПреподавателя.Обновить();
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗачетнаяКнижка

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ЗачетнаяКнижка

&НаКлиенте
Процедура ЗачетнаяКнижкаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ПросматриваетВладелец И Элемент.ТекущиеДанные <> Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ОткрытьФорму("ОбщаяФорма.КарточкаОбученияСУО", Новый Структура("Обучение", Элемент.ТекущиеДанные.Прохождение));
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаботаПреподавателя

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ РаботаПреподавателя

&НаКлиенте
Процедура РаботаПреподавателяВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ПросматриваетВладелец Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ОткрытьФорму("ОбщаяФорма.КарточкаОбученияСУО", Новый Структура("Обучение", Элемент.ТекущиеДанные.ПроведениеОбученияПреподавателем));
		
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаботаПреподавателя

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ РаботаПреподавателя

&НаКлиенте
Процедура СертификатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Элементы.Сертификаты.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДанныеСертификата = ДанныеСертификатаДляСкачивания(Элементы.Сертификаты.ТекущиеДанные.Ссылка);
	Если ДанныеСертификата = Неопределено Тогда	
		ПоказатьЗначение(,Элементы.Сертификаты.ТекущиеДанные.Ссылка);
	Иначе
		ПолучитьФайл(ДанныеСертификата.АдресХранения, ДанныеСертификата.ИмяФайла, Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти



#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьПараметрыДинамическихСписков()
	
	ЗачетнаяКнижка.Параметры.УстановитьЗначениеПараметра("Пользователь", Пользователь);	
	РаботаПреподавателя.Параметры.УстановитьЗначениеПараметра("Пользователь", Пользователь);	
	Сертификаты.Параметры.УстановитьЗначениеПараметра("Пользователь", Пользователь);
	
КонецПроцедуры

&НаСервере
Функция ДанныеСертификатаДляСкачивания(СсылкаНаСертификат)
	УстановитьПривилегированныйРежим(Истина);
	ТребуемыеДанныеШаблона = Новый Структура("ФорматPDF, ФорматHTML", "Шаблон.ФорматPDF", "Шаблон.ФорматHTML");
	ДанныеШаблона = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаСертификат, ТребуемыеДанныеШаблона);
	Если ДанныеШаблона.ФорматPDF И НЕ ДанныеШаблона.ФорматHTML Тогда
		Возврат Документы.СертификатСУО.ДанныеСертификатаДляСкачивания(СсылкаНаСертификат, УникальныйИдентификатор);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

#КонецОбласти

