
&НаСервере
Функция НайтиПреподавателя(Преподаватели, РольПреподавателя)
	
	НайденныйПреподаватель = Неопределено;
	
	Преподаватели.Сортировать("Номер");
	
	Для каждого Строка Из Преподаватели Цикл
	
		Если Строка.РольПреподавателя = РольПреподавателя Тогда
			НайденныйПреподаватель = Строка.Преподаватель;
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат НайденныйПреподаватель;
	
КонецФункции

&НаСервере
Процедура НазначитьПреподавателей(ПроведениеОбучения, СтатистикаНазначения)
	
	// Получаем нужные данные
	
	ДанныеОПроведенииМероприятия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеОбучения, "Мероприятие, СхемаПроведения, НаОсновеЭлектронногоРесурса, БезСценария");
	
	Если ДанныеОПроведенииМероприятия.НаОсновеЭлектронногоРесурса ИЛИ ДанныеОПроведенииМероприятия.БезСценария Тогда
		Возврат;
	КонецЕсли;
	
	Мероприятие        = ДанныеОПроведенииМероприятия.Мероприятие;
	СхемаПроведения    = ДанныеОПроведенииМероприятия.СхемаПроведения;
	ДанныеОМероприятии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Мероприятие, "Вид, РольПреподавателя, ДополнительныеПреподаватели");
	ВидМероприятия     = ДанныеОМероприятии.Вид;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПреподавателиСУО.Пользователь КАК Преподаватель,
		|	ПреподавателиСУО.Номер КАК Номер,
		|	ПреподавателиСУО.Роль КАК РольПреподавателя
		|ИЗ
		|	РегистрСведений.ПреподавателиСУО КАК ПреподавателиСУО
		|ГДЕ
		|	ПреподавателиСУО.Предмет = &Мероприятие
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер";

	Запрос.УстановитьПараметр("Мероприятие", Мероприятие);

	Результат     = Запрос.Выполнить();
	Преподаватели = Результат.Выгрузить();
	
	// Назначаем преподавателей
	
	НачатьТранзакцию();
	
	ТребуетсяПреподавателей = 0;
	НазначеноПреподавателей = 0;
	
	Если ЗначениеЗаполнено(СхемаПроведения) Тогда
		
		// Примечание:
		// Прикрепить преподавателя к подчиненному преподавателю нельзя,
		// Поэтому преподавателей для подчиненных мероприятий не ищем.
		
		// Получаем подчиненные мероприятия и назначаем преподавателей на них
		
		ТаблицаМероприятий = Документы.ПроведениеОбученияСУО.ПодчиненныеМероприятия(ПроведениеОбучения, Истина, СхемаПроведения);
		
		Для каждого Строка Из ТаблицаМероприятий Цикл
			
			Если НЕ Строка.ТребуетсяПреподаватель Тогда
				Продолжить;
			КонецЕсли;
			
			МассивРолейПреподавателей = Строка.ДополнительныеПреподаватели.ВыгрузитьКолонку("РольПреподавателя");
			МассивРолейПреподавателей.Добавить(Строка.РольПреподавателя);
			
			Для каждого РольПреподавателя Из МассивРолейПреподавателей Цикл
			
				ПреподавательНазначен = Документы.ПроведениеОбученияСУО.ПреподавательНазначен(ПроведениеОбучения, Строка.Мероприятие, РольПреподавателя);
				
				Если НЕ ПреподавательНазначен Тогда

					НайденныйПреподаватель = НайтиПреподавателя(Преподаватели, РольПреподавателя);
					
					Если НайденныйПреподаватель <> Неопределено Тогда
						УправлениеОбучениемСУО.НазначитьПреподавателяНаОбучение(
							ПроведениеОбучения, Строка.Мероприятие, НайденныйПреподаватель, РольПреподавателя);
						НазначеноПреподавателей = НазначеноПреподавателей + 1;
					КонецЕсли;
					
				КонецЕсли;
				
				ТребуетсяПреподавателей = ТребуетсяПреподавателей + 1;
				
			КонецЦикла;
		
		КонецЦикла; // Конец. Перебор подчиненных мероприятий.
		
	Иначе
		
		ТребуетсяПреподаватель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидМероприятия, "ТребуетсяПреподаватель");
		
		Если ТребуетсяПреподаватель Тогда // Простое с преподавателем
			
			ДополнительныеПреподаватели = ДанныеОМероприятии.ДополнительныеПреподаватели.Выгрузить();
			
			МассивРолейПреподавателей = ДополнительныеПреподаватели.ВыгрузитьКолонку("РольПреподавателя");
			МассивРолейПреподавателей.Добавить(ДанныеОМероприятии.РольПреподавателя);
			
			Для каждого РольПреподавателя Из МассивРолейПреподавателей Цикл
				
				ПреподавательНазначен = Документы.ПроведениеОбученияСУО.ПреподавательНазначен(ПроведениеОбучения, Мероприятие, РольПреподавателя);
				
				Если НЕ ПреподавательНазначен Тогда

					НайденныйПреподаватель = НайтиПреподавателя(Преподаватели, РольПреподавателя);
					
					Если НайденныйПреподаватель <> Неопределено Тогда
						УправлениеОбучениемСУО.НазначитьПреподавателяНаОбучение(
							ПроведениеОбучения, Мероприятие, НайденныйПреподаватель, РольПреподавателя);
						НазначеноПреподавателей = НазначеноПреподавателей + 1;
					КонецЕсли;
					
				КонецЕсли;
				
				ТребуетсяПреподавателей = ТребуетсяПреподавателей + 1;
				
			КонецЦикла;
				
		КонецЕсли;		
		
	КонецЕсли;	
	
	СтатистикаНазначения = Новый Структура("ТребуетсяПреподавателей, НазначеноПреподавателей", ТребуетсяПреподавателей, НазначеноПреподавателей);
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СтатистикаНазначения = Новый Структура("НазначеноПреподавателей, ТребуетсяПреподавателей", 0, 0);
	НазначитьПреподавателей(ПараметрКоманды, СтатистикаНазначения);
	
	Заголовок = НСтр("ru = 'Изменение:'");
	Текст = НСтр("ru = 'На ""%1"" было назначено преподавателей %2 из %3'");
	Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, ПараметрКоманды, СтатистикаНазначения.НазначеноПреподавателей, СтатистикаНазначения.ТребуетсяПреподавателей);
	
	ПоказатьОповещениеПользователя(Заголовок,ПолучитьНавигационнуюСсылку(ПараметрКоманды),Текст,БиблиотекаКартинок.Информация32);
	
	Оповестить("ПреподавателиНазначены", ПараметрКоманды);
	
КонецПроцедуры
