Процедура ДобавитьДанные(Тип, Объект, Данные, Формат) Экспорт
	
	НаборЗаписей = РегистрыСведений.ДанныеВебКабинетаСУО_ОН.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Тип.Установить(Тип);
	НаборЗаписей.Отбор.Объект.Установить(Объект);

	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Тип = Тип;
	НоваяЗапись.Объект = Объект;
	
	НоваяЗапись.Данные = Новый ХранилищеЗначения(Данные);
	НоваяЗапись.Формат = Формат;
	НоваяЗапись.ДатаИзменения = ТекущаяДатаСеанса();

	НаборЗаписей.Записать();		
	
КонецПроцедуры

Процедура УдалитьДанные(Объект, Тип=Неопределено) Экспорт
	
	НаборЗаписей = РегистрыСведений.ДанныеВебКабинетаСУО_ОН.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Объект.Установить(Объект);
	
	Если Тип <> Неопределено Тогда
		НаборЗаписей.Отбор.Тип.Установить(Тип);	
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
