
&НаСервере
Функция ПолучитьДанныеТеста(ПопыткаВыполненияТеста)
	
	ДанныеПопытки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПопыткаВыполненияТеста, "Подборка, ПрохождениеОбучения, Задание, Вариант, ПоказыватьНавигацию");
	
	ДопСвойстваСсылки = Новый Структура;
	ДопСвойстваСсылки.Вставить("НомерГруппыПодборки", 1);
	ДопСвойстваСсылки.Вставить("ДокументСессии", ПопыткаВыполненияТеста);
	ДопСвойстваСсылки.Вставить("РазрешенПереходКВопросамТеста", Истина);
	
	СсылкаНаТест = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(ДанныеПопытки.Подборка,,,ДопСвойстваСсылки);
	
	ДанныеПопытки.Вставить("СсылкаНаЭлемент", СсылкаНаТест);
	
	Возврат ДанныеПопытки;
	
	
КонецФункции



&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДанныеТеста = ПолучитьДанныеТеста(ПараметрКоманды);
	
	ОбъектыСУЗКлиент.ОткрытьОбозреватель(,
										 ДанныеТеста.СсылкаНаЭлемент,
										 Ложь,
										 ,
										 ДанныеТеста.ПрохождениеОбучения,
										 ДанныеТеста.Задание,
										 ДанныеТеста.Вариант);
									 
КонецПроцедуры
