
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//////////////////////////////////////////////////////////////////
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Объект);
	РазработкаСУЗ.УстановитьДоступностьДанныхОтПоставщика(ЭтотОбъект);
	//////////////////////////////////////////////////////////////////
	
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		Элементы.ГруппаНастройкиТеста.Видимость = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец, "ЭтоТест");	
	КонецЕсли;	
	
КонецПроцедуры
