#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Функция АдресатПоКонтексту(Контекст) Экспорт

	Если ТипЗнч(Контекст) = Тип("СправочникСсылка.УчебныеГруппыСУО") Тогда
		Возврат Перечисления.АдресатыСообщенийСУО.УчебнойГруппе;
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("ДокументСсылка.ПрохождениеПрограммыОбученияСУО") Тогда
		Возврат Перечисления.АдресатыСообщенийСУО.УчастникуПрограммыОбучения;
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("ДокументСсылка.ПроведениеПреподавателемОбученияСУО") Тогда
		Возврат Перечисления.АдресатыСообщенийСУО.Преподавателю;
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("ДокументСсылка.ПрохождениеОбученияСУО") Тогда
		Возврат Перечисления.АдресатыСообщенийСУО.УчастникуМероприятия;
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО") Тогда
		Возврат Перечисления.АдресатыСообщенийСУО.УчастникамПрограммыОбучения;
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		Возврат Перечисления.АдресатыСообщенийСУО.УчастникамМероприятия;
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("СправочникСсылка.Пользователи") Тогда
		Возврат Перечисления.АдресатыСообщенийСУО.Пользователю;
	КонецЕсли;

	Если ТипЗнч(Контекст) = Тип("СправочникСсылка.РазделыФорумаСУО") Тогда
		Возврат Перечисления.АдресатыСообщенийСУО.НаФоруме;
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("СправочникСсылка.ОрганизаторыСУО") Тогда
		Возврат Перечисления.АдресатыСообщенийСУО.Организатору;
	КонецЕсли;	
	
	Возврат Перечисления.АдресатыСообщенийСУО.ПустаяСсылка();
	
КонецФункции

Функция ЕдинственныйАдресат(Контекст) Экспорт

	Если ТипЗнч(Контекст) = Тип("СправочникСсылка.УчебныеГруппыСУО") Тогда
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("ДокументСсылка.ПрохождениеПрограммыОбученияСУО") Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контекст, "Пользователь");
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("ДокументСсылка.ПроведениеПреподавателемОбученияСУО") Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контекст, "Пользователь");
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("ДокументСсылка.ПрохождениеОбученияСУО") Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контекст, "Пользователь");
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО") Тогда
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("СправочникСсылка.Пользователи") Тогда
		Возврат Контекст;
	КонецЕсли;

	Если ТипЗнч(Контекст) = Тип("СправочникСсылка.РазделыФорумаСУО") Тогда
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	
	Возврат Справочники.Пользователи.ПустаяСсылка();
	
КонецФункции

Процедура ЗаписатьПользовательскиеНастройкиТемы(Тема, ИмяРеквизита = Неопределено, Значение = Неопределено, Пользователь = Неопределено, ТекущаяДата = Неопределено, НеОбновлятьДанныеВебКабинета = Ложь) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Если Пользователь = Неопределено Тогда
			Пользователь = Пользователи.ТекущийПользователь();
		КонецЕсли;
		
		Если ТекущаяДата = Неопределено Тогда
			ТекущаяДата = ТекущаяДатаСеанса();
		КонецЕсли;
		
		ДанныеТемы             = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Тема, "Кому, Контекст");
		ЭтоГрупповоеОбсуждение = Документы.СообщениеСУО.ЭтоГрупповоеОбсуждение(ДанныеТемы.Кому);
		
		РегистрыСведений.НастройкиТемОбщенияСУО.ЗаписатьНастройки(Тема, ИмяРеквизита, Значение, Пользователь, ТекущаяДата);
		
		Если ЭтоГрупповоеОбсуждение Тогда
			
			РегистрыСведений.НастройкиТемФорумаСУО.ЗаписатьНастройки(Тема, ИмяРеквизита, Значение, Пользователь, ТекущаяДата, НеОбновлятьДанныеВебКабинета);
			
		Иначе
			
			// Записываем настройки личных сообщений
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СообщенияТемСУО.Регистратор КАК Сообщение
			|ИЗ
			|	РегистрСведений.СообщенияТемСУО КАК СообщенияТемСУО
			|ГДЕ
			|	СообщенияТемСУО.Тема = &Тема";
			
			Запрос.УстановитьПараметр("Тема", Тема);
			
			Результат = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				РегистрыСведений.НастройкиЛичныхСообщенийСУО.ЗаписатьНастройки(ВыборкаДетальныеЗаписи.Сообщение,,,Пользователь,ТекущаяДата);
			КонецЦикла;
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

Функция КоличествоСообщенийВТеме(Тема) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(СообщенияТемСУО.Регистратор) КАК КоличествоСообщений
		|ИЗ
		|	РегистрСведений.СообщенияТемСУО КАК СообщенияТемСУО
		|ГДЕ
		|	СообщенияТемСУО.Тема = &Тема";
	
	Запрос.УстановитьПараметр("Тема", Тема);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат 0;
		
	Иначе
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
		ВыборкаДетальныеЗаписи.Следующий();

		Возврат ВыборкаДетальныеЗаписи.КоличествоСообщений;
		
	КонецЕсли;
	
КонецФункции

// Веб-кабинет
//

Процедура ОбновитьДанныеВебКабинета(Тема, ДополнительныеДанные = Неопределено) Экспорт
		
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем данные темы
	
	ТемаОбъект = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Тема, "Закрыта, Контекст, ПометкаУдаления, Автор, ДатаСоздания");
	
	// Добавляем общее описание темы
	
	РегистрыСведений.ДанныеВебКабинетаСУО_ОН.УдалитьДанные(Тема, Перечисления.ТипыДанныхВебКабинетаСУО.ТемаОбщения);
	РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.УдалитьДанные(Тема, "Справочник.ТемыСообщенийСУО");
	РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.УдалитьОтбор(Тема); 
	
	Если НЕ ТемаОбъект.ПометкаУдаления И НЕ ТемаОбъект.Закрыта И ЗначениеЗаполнено(ТемаОбъект.Контекст) Тогда
		
		// Данные темы
		
		ТемаСообщенийJSON = ТемаСообщенийJSON(Тема);
		РегистрыСведений.ДанныеВебКабинетаСУО_ОН.ДобавитьДанные(Перечисления.ТипыДанныхВебКабинетаСУО.ТемаОбщения, Тема, ТемаСообщенийJSON, Перечисления.ФорматыВебДанныхСУ.json);
		
		// Отбор по контексту
		
		РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.ДобавитьОтбор(Тема, ТемаОбъект.Контекст);	
		
		// Отбор по пользователям
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТемыПользователейСУО.Пользователь
			|ИЗ
			|	РегистрСведений.ТемыПользователейСУО КАК ТемыПользователейСУО
			|ГДЕ
			|	ТемыПользователейСУО.Тема = &Тема";
		
		Запрос.УстановитьПараметр("Тема", Тема);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.ДобавитьОтбор(Тема, ВыборкаДетальныеЗаписи.Пользователь);
		КонецЦикла;
	
		// Зависимости
		
		Зависимости = Новый Массив;
		
		Если ТемаОбъект.ДатаСоздания + (7*24*60*60) > ТекущаяДатаСеанса() Тогда			
			
			Зависимости.Добавить(ТемаОбъект.Контекст);
			Зависимости.Добавить(ТемаОбъект.Автор);
		
			РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.ДобавитьДанные(Тема, "Справочник.ТемыСообщенийСУО", Зависимости);
			
		КонецЕсли;
		
	КонецЕсли;	
			
КонецПроцедуры

Функция ТемаСообщенийJSON(ТемаСообщений) Экспорт
	
	ДанныеТемы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТемаСообщений, "Ссылка, Наименование, Автор, Автор.Наименование, ДатаСоздания, Контекст, Контекст.Наименование");
	
		
	ОписаниеРаздела = Новый Структура(
		"Наименование, Автор, ДатаСоздания, Идентификатор, Контекст, НаименованиеКонтекста",
		ДанныеТемы.Наименование,
		ВебКабинетСУО.ПользовательСтруктура(ДанныеТемы.Автор, ДанныеТемы.АвторНаименование),
		ДанныеТемы.ДатаСоздания,
		Строка(ДанныеТемы.Ссылка.УникальныйИдентификатор()),
		?(ЗначениеЗаполнено(ТемаСообщений.Контекст), Строка(ТемаСообщений.Контекст.УникальныйИдентификатор()), ""),
		ДанныеТемы.КонтекстНаименование
	);
	
	ОписаниеРаздела	= ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеРаздела);	
	
	Возврат ОписаниеРаздела;	
	
КонецФункции

Функция ТемаСообщенийОписаниеОбщееJSON(ТемаСообщений) Экспорт
	
	// ПоследнееСообщение
	
	ПоследнееСообщение = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СообщенияТемСУОСрезПоследних.Регистратор КАК Сообщение
		|ИЗ
		|	РегистрСведений.СообщенияТемСУО.СрезПоследних(, Тема = &Тема) КАК СообщенияТемСУОСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	СообщенияТемСУОСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Тема", ТемаСообщений);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		ПоследнееСообщение = Документы.СообщениеСУО.СообщениеСтруктура(ВыборкаДетальныеЗаписи.Сообщение);
		
	КонецЕсли;
	
	// КоличествоСообщений	
	
	КоличествоСообщений = КоличествоСообщенийВТеме(ТемаСообщений);
	
	// Результат
	
	ОписаниеРаздела = Новый Структура("ПоследнееСообщение, КоличествоСообщений", ПоследнееСообщение, КоличествоСообщений);
	ОписаниеРаздела	= ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеРаздела);	
	
	Возврат ОписаниеРаздела;	
	
КонецФункции

Функция ТемаФорумаОписаниеПользовательскоеJSON(ТемаФорума, Пользователь) Экспорт
	
	// ДатаПросмотра
	
	ДатаПросмотра = Дата("00010101");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиТемФорумаСУО.ДатаПросмотра
		|ИЗ
		|	РегистрСведений.НастройкиТемФорумаСУО КАК НастройкиТемФорумаСУО
		|ГДЕ
		|	НастройкиТемФорумаСУО.Пользователь = &Пользователь
		|	И НастройкиТемФорумаСУО.Тема = &Тема";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Тема", ТемаФорума);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		
		ДатаПросмотра = ВыборкаДетальныеЗаписи.ДатаПросмотра;
		
	КонецЕсли;
		
	// Результат
	
	ОписаниеРаздела = Новый Структура("ДатаПросмотра", ДатаПросмотра);
	ОписаниеРаздела	= ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеРаздела);	
	
	Возврат ОписаниеРаздела;	
	
КонецФункции

#КонецЕсли
