
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Отбор.Свойство("Задание")
		ИЛИ НЕ Параметры.Отбор.Свойство("ПрохождениеОбучения") Тогда
	
		Отказ = Истина;
		Текст = НСтр("ru = 'Значения отбора списка не заполнены. Действие отменено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
		
	КонецЕсли;
	
	Задание                     = Параметры.Отбор.Задание;
	ПрохождениеОбучения         = Параметры.Отбор.ПрохождениеОбучения; 
	НаОсновеЭлектронногоРесурса = Параметры.Отбор.Задание.НаОсновеЭлектронногоРесурса;
	
	ВидМероприятия              = ПрохождениеОбучения.Мероприятие.Вид;
	
	Если ВидМероприятия.Электронное
		И НЕ НаОсновеЭлектронногоРесурса Тогда
		
		Элементы.Список.ТолькоПросмотр = Ложь;
		
	Иначе
		
		Элементы.Список.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
