

&НаСервере
Функция ПолучитьПараметрыФормы(ПараметрКоманды)
	
	ПараметрыФормы = Новый Структура();
	
	ПараметрыФормы.Вставить("ДополнительныйКонтекст", ПараметрКоманды);
	ПараметрыФормы.Вставить("Контекст", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрКоманды, "ПроведениеПрограммыОбучения"));
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = ПолучитьПараметрыФормы(ПараметрКоманды);
	
	ОткрытьФорму("ОбщаяФорма.ОбщениеСУО", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

