Функция ВыбратьЭлементыРасписания(Пользователь, НачалоПериода=Неопределено, КонецПериода=Неопределено) Экспорт	
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос();

	Запрос.Параметры.Вставить("Пользователь", Пользователь);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрСведенийРасписаниеПреподавателейСУО.Регистратор КАК ПроведениеОбученияПреподавателем,
		|	РегистрСведенийРасписаниеПреподавателейСУО.ДатаНачалаПроведения,
		|	РегистрСведенийРасписаниеПреподавателейСУО.ДатаОкончанияПроведения,
		|   РегистрСведенийРасписаниеПреподавателейСУО.Преподаватель КАК Пользователь,
		|   РегистрСведенийРасписаниеПреподавателейСУО.Преподаватель КАК Преподаватель
		|ИЗ
		|	РегистрСведений.РасписаниеПреподавателейСУО КАК РегистрСведенийРасписаниеПреподавателейСУО
		|ГДЕ
		|	РегистрСведенийРасписаниеПреподавателейСУО.Преподаватель В(&Пользователь)
		|	И РегистрСведенийРасписаниеПреподавателейСУО.Проведено = ЛОЖЬ";
		
	Если НачалоПериода <> Неопределено И КонецПериода <> Неопределено Тогда			   
				   
		Запрос.Текст = Запрос.Текст + "			   
		|	И (РегистрСведенийРасписаниеПреподавателейСУО.ДатаНачалаПроведения МЕЖДУ &НачалоПериода И &КонецПериода
		|			ИЛИ РегистрСведенийРасписаниеПреподавателейСУО.ДатаНачалаПроведения = &ПустаяДата
		|			ИЛИ РегистрСведенийРасписаниеПреподавателейСУО.ДатаОкончанияПроведения МЕЖДУ &НачалоПериода И &КонецПериода
		|			ИЛИ РегистрСведенийРасписаниеПреподавателейСУО.ДатаНачалаПроведения < &НачалоПериода
		|				И РегистрСведенийРасписаниеПреподавателейСУО.ДатаОкончанияПроведения > &КонецПериода)";
					   
		Запрос.Параметры.Вставить("НачалоПериода", НачалоПериода);
		Запрос.Параметры.Вставить("КонецПериода", КонецПериода);
		Запрос.Параметры.Вставить("ПустаяДата", Дата("00010101"));
	
	КонецЕсли;
		
	Результат = Запрос.Выполнить();

	Возврат Результат.Выбрать();
	
КонецФункции
