
Функция СоздатьПроведениеОбученияPOST(ЗапросHTTP)
	
	// Получаем параметры запроса
	
	КлючЗапроса = СокрЛП(Строка(ЗапросHTTP.ПараметрыЗапроса.Получить("key")));
	
	Если НЕ ЗначениеЗаполнено(КлючЗапроса) Тогда
		Ответ = Новый HTTPСервисОтвет(400);
		Возврат Ответ;								
	КонецЕсли;		
	
	// Проверяем ключ
	
	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA1);
	Хеширование.Добавить(КлючЗапроса);		
	ХэшКлюча = Base64Строка(Хеширование.ХешСумма);
	ХэшКлючаВБазе = Константы.ХэшКлючаЗагрузкиПользователейСУО.Получить();
	
	Если ХэшКлючаВБазе <> ХэшКлюча Тогда
		Ответ = Новый HTTPСервисОтвет(403);
		Возврат Ответ;												
	КонецЕсли;

	// Возвращаем ответ, если это запрос для тестирования
	
	ВариантЗапроса = СокрЛП(Строка(ЗапросHTTP.ПараметрыЗапроса.Получить("mode")));
	Если ВариантЗапроса = "test" Тогда
		Ответ = Новый HTTPСервисОтвет(200);
		Возврат Ответ;		
	КонецЕсли;	
	
	// Получаем таблицу с данными из тела запроса
	
	ТелоХранилище = XMLЗначение(Тип("ХранилищеЗначения"), ЗапросHTTP.ПолучитьТелоКакСтроку());	
	СтруктураДанных = ТелоХранилище.Получить();
	
	Если ТипЗнч(СтруктураДанных) <> Тип("Структура") Тогда
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки(НСтр("ru = 'Неверный формат структуры данных'"));
		Возврат Ответ;														
	КонецЕсли;
	
	// Загружаем данные
	
	НачатьТранзакцию();
	
	Попытка
		
		УстановитьПривилегированныйРежим(Истина);
		
		// Проведения обучения
		
		Если СтруктураДанных.Свойство("ПроведенияОбучения") Тогда
			УправлениеОбучениемСУО.ЗагрузитьПроведенияОбучения(СтруктураДанных.ПроведенияОбучения);
		КонецЕсли;
		
		// Зачисляем сотрудников
		
		Если СтруктураДанных.Свойство("Сотрудники") Тогда
			УправлениеОбучениемСУО.ЗагрузитьУчастниковОбучения(СтруктураДанных.Сотрудники);
		КонецЕсли;		
		
		// УУЦ (порядок загрузки данных важен)
		//
		
		// Расписание курсов
		
		Если СтруктураДанных.Свойство("ФизическиеЛицаУУЦ") Тогда
			
			ТаблицаГруппПользователей = Новый ТаблицаЗначений;
			ТаблицаГруппПользователей.Колонки.Добавить("Ссылка");
			ТаблицаГруппПользователей.Колонки.Добавить("ПометкаУдаления");
			ТаблицаГруппПользователей.Колонки.Добавить("Родитель");
			ТаблицаГруппПользователей.Колонки.Добавить("Наименование");
			
			ОписаниеГруппыПреподавателей = Новый Структура("Тип, Идентификатор", "СправочникСсылка.ГруппыПользователей", "09896f07-6e46-4846-927a-86eda8c470ee"); 
			ОписаниеГруппыСлушателей = Новый Структура("Тип, Идентификатор", "СправочникСсылка.ГруппыПользователей", "0dfbdefa-feda-4210-9f8a-8824c7e7e6c2");
			
			СтрокаПреподаватели = ТаблицаГруппПользователей.Добавить();
			СтрокаПреподаватели.Ссылка = ОписаниеГруппыПреподавателей;
			СтрокаПреподаватели.ПометкаУдаления = Ложь;
			СтрокаПреподаватели.Родитель = "";
			СтрокаПреподаватели.Наименование = НСтр("ru = 'Преподаватели'");
			
			СтрокаСлушатели = ТаблицаГруппПользователей.Добавить();
			СтрокаСлушатели.Ссылка = ОписаниеГруппыСлушателей;
			СтрокаСлушатели.ПометкаУдаления = Ложь;
			СтрокаСлушатели.Родитель = "";
			СтрокаСлушатели.Наименование = НСтр("ru = 'Слушатели'");
			
			УправлениеОбучениемСУО.ЗагрузитьГруппыПользователейИзГруппФизическихЛиц(ТаблицаГруппПользователей);
			
			СтруктураДанных.ФизическиеЛицаУУЦ.Колонки.Добавить("Родитель");
			
			Если СтруктураДанных.Свойство("ТаблицаСлушателейУУЦ") Тогда
				Для каждого СтрокаТФЛ Из СтруктураДанных.ФизическиеЛицаУУЦ Цикл
					Для каждого СтрокаТС Из СтруктураДанных.ТаблицаСлушателейУУЦ Цикл					
						Если СтрокаТС.Слушатель.Идентификатор = СтрокаТФЛ.Ссылка.Идентификатор Тогда
							СтрокаТФЛ.Родитель = ОписаниеГруппыСлушателей;
						КонецЕсли;					
					КонецЦикла;				
				КонецЦикла;
			КонецЕсли;
			
			Если СтруктураДанных.Свойство("ПреподавателиУУЦ") Тогда
				Для каждого СтрокаТФЛ Из СтруктураДанных.ФизическиеЛицаУУЦ Цикл
					Для каждого СтрокаТП Из СтруктураДанных.ПреподавателиУУЦ Цикл					
						Если СтрокаТП.Преподаватель.Идентификатор = СтрокаТФЛ.Ссылка.Идентификатор Тогда
							СтрокаТФЛ.Родитель = ОписаниеГруппыПреподавателей;
						КонецЕсли;					
					КонецЦикла;				
				КонецЦикла;
			КонецЕсли;
			
			УправлениеОбучениемСУО.ЗагрузитьФизическиеЛицаУУЦ(СтруктураДанных.ФизическиеЛицаУУЦ);
			
		КонецЕсли;
		
		Если СтруктураДанных.Свойство("ГруппыСлушателейУУЦ") Тогда
			УправлениеОбучениемСУО.ЗагрузитьГруппыСлушателейУУЦ(СтруктураДанных.ГруппыСлушателейУУЦ);
		КонецЕсли;
		
		Если СтруктураДанных.Свойство("ПрограммыОбученияУУЦ") Тогда
			УправлениеОбучениемСУО.ЗагрузитьПрограммыОбученияУУЦ(СтруктураДанных.ПрограммыОбученияУУЦ);
		КонецЕсли;
				
		Если СтруктураДанных.Свойство("РасписаниеКурсовУУЦ") Тогда
			УправлениеОбучениемСУО.ЗагрузитьРасписаниеКурсовУУЦ(СтруктураДанных.РасписаниеКурсовУУЦ);
		КонецЕсли;	
		
		Если СтруктураДанных.Свойство("ТаблицаСлушателейУУЦ") Тогда
			УправлениеОбучениемСУО.ЗагрузитьСлушателейКурсовУУЦ(СтруктураДанных.ТаблицаСлушателейУУЦ);
		КонецЕсли;	
		
		Если СтруктураДанных.Свойство("ПреподавателиУУЦ") Тогда
			УправлениеОбучениемСУО.ЗагрузитьПреподавателейКурсовУУЦ(СтруктураДанных.ПреподавателиУУЦ);
		КонецЕсли;
		
		// Завершаем
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;	
	
	// Завершаем
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции
