Функция Заявка(Знач ПредметЗаявки, Знач Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкиНаОбучениеСУОСрезПоследних.Регистратор КАК Заявка,
		|	ЗаявкиНаОбучениеСУОСрезПоследних.Статус
		|ИЗ
		|	РегистрСведений.ЗаявкиНаОбучениеСУО.СрезПоследних(
		|			,
		|			Пользователь = &Пользователь
		|				И ПредметЗаявки = &ПредметЗаявки) КАК ЗаявкиНаОбучениеСУОСрезПоследних";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ПредметЗаявки", ПредметЗаявки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат Новый Структура("Заявка, Статус", ВыборкаДетальныеЗаписи.Заявка, ВыборкаДетальныеЗаписи.Статус);
		
	КонецЕсли;
	
КонецФункции
