#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ДобавитьСведения(Знач Пользователь, Знач Наименование = Неопределено) Экспорт
	
	Если Наименование = Неопределено Тогда
		Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "Наименование");
	КонецЕсли;
	
	Пробел = " ";
	
	Запись = РегистрыСведений.ФИОПользователейСУО.СоздатьМенеджерЗаписи();
	Запись.Пользователь = Пользователь;
	
	Наименование = СокрЛП(Наименование);
	МассивНаименования = ОбщегоНазначенияСУКлиентСервер.РасщепитьСтроку(Наименование, Пробел);
	ДлинаМассива = МассивНаименования.Количество();
	Для Индекс = 0 По ДлинаМассива - 1 Цикл
		МассивНаименования[Индекс] = СокрЛП(МассивНаименования[Индекс]);
	КонецЦикла;
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(МассивНаименования, "");
	ДлинаМассива = МассивНаименования.Количество();
	
	Если ДлинаМассива > 0 Тогда
		Запись.Фамилия = МассивНаименования[0];
	КонецЕсли;
	
	Если ДлинаМассива > 1 Тогда
		Запись.Имя = МассивНаименования[1];
	КонецЕсли;
	
	Если ДлинаМассива > 2 Тогда
		Запись.Отчество = МассивНаименования[2];
	КонецЕсли;
	
	Запись.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
