#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Процедура ЗаписатьНастройки(Сообщение, ИмяНастройки=Неопределено, ЗначениеНастройки=Неопределено, Пользователь=Неопределено, ТекущаяДата=Неопределено, ОбновитьДанныеВебКабинетаВТранзакции=Ложь) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если ТекущаяДата = Неопределено Тогда
		ТекущаяДата  = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Запоминаем просмотр сообщения
	
	НаборЗаписей = РегистрыСведений.НастройкиЛичныхСообщенийСУО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Отбор.Сообщение.Установить(Сообщение);

	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		Запись = НаборЗаписей.Добавить();
		
		Запись.Пользователь = Пользователь;
		Запись.Сообщение    = Сообщение;
		
	Иначе
		
		Запись = НаборЗаписей[0];
		
	КонецЕсли;
	
	Запись.ДатаПросмотра = ТекущаяДата;
	
	Если ИмяНастройки <> Неопределено Тогда
		Запись[ИмяНастройки] = ЗначениеНастройки;
	КонецЕсли;
	
	НаборЗаписей.ДополнительныеСвойства.Вставить("ОбновитьДанныеВебКабинетаВТранзакции", ОбновитьДанныеВебКабинетаВТранзакции);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ОбновитьДанныеВебКабинета(Отбор) Экспорт


	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Отбор.Найти("Пользователь") = Неопределено Тогда
		Пользователь = Неопределено;
	Иначе
		Пользователь = Отбор.Пользователь.Значение;
	КонецЕсли;
	
	Если Отбор.Найти("Сообщение") = Неопределено Тогда
		Сообщение = Неопределено;
	Иначе
		Сообщение = Отбор.Сообщение.Значение;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.НастройкиЛичныхСообщенийСУО.СоздатьНаборЗаписей();
	
	Если ЗначениеЗаполнено(Пользователь) И ЗначениеЗаполнено(Сообщение) Тогда
		
		НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
		НаборЗаписей.Отбор.Сообщение.Установить(Сообщение);		
		
	КонецЕсли;
		
	НаборЗаписей.Прочитать();	
	
	Для каждого Запись Из НаборЗаписей Цикл
		Документы.СообщениеСУО.ОбновитьДанныеВебКабинета(Запись.Сообщение, Новый Структура("ОбновитьТолькоПользовательскиеДанные", Истина));
	КонецЦикла;
	
	
КонецПроцедуры

#КонецЕсли