#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;			
	
	Если ЭтотОбъект.Количество() = 0 Тогда // Удаляется запись

		// Помечаем на удаление объект СУЗ удаляемой записи.
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДополнительныеМатериалыПользователейСУЗ.СсылкаНаОбъектСУЗ КАК СсылкаНаОбъектСУЗ
			|ИЗ
			|	РегистрСведений.ДополнительныеМатериалыПользователейСУЗ КАК ДополнительныеМатериалыПользователейСУЗ
			|ГДЕ
			|	ДополнительныеМатериалыПользователейСУЗ.Период = &Период
			|	И ДополнительныеМатериалыПользователейСУЗ.ЭлементСодержания = &ЭлементСодержания";

		Запрос.УстановитьПараметр("Период", Отбор.Период.Значение);
		Запрос.УстановитьПараметр("ЭлементСодержания", Отбор.ЭлементСодержания.Значение);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			СсылкаНаОбъектСУЗ = ВыборкаДетальныеЗаписи.СсылкаНаОбъектСУЗ;
			
			Если ЗначениеЗаполнено(СсылкаНаОбъектСУЗ) И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъектСУЗ, "ПометкаУдаления") Тогда 
			
				ОбъектСУЗ = СсылкаНаОбъектСУЗ.ПолучитьОбъект();
				ОбъектСУЗ.УстановитьПометкуУдаления(Истина);
				
				Если ТипЗнч(СсылкаНаОбъектСУЗ) = Тип("СправочникСсылка.ФайлыСУЗ") Тогда
					
					УстановитьПривилегированныйРежим(Истина);
					
					Ресурс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъектСУЗ, "Владелец");
					
					РесурсОбъект = Ресурс.ПолучитьОбъект();
					РесурсОбъект.УстановитьПометкуУдаления(Истина);
					
					УстановитьПривилегированныйРежим(Ложь);
					
				КонецЕсли;
			
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;
	
	Если ЭтотОбъект.Количество() > 0 Тогда
		
		 Для каждого Запись Из ЭтотОбъект Цикл
		 
			СсылкаНаОбъектСУЗ = Запись.СсылкаНаОбъектСУЗ;
			
			Если НЕ ЗначениеЗаполнено(СсылкаНаОбъектСУЗ) ИЛИ НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъектСУЗ, "ПометкаУдаления") Тогда 
				Продолжить;
			КонецЕсли;
			
			ОбъектСУЗ = СсылкаНаОбъектСУЗ.ПолучитьОбъект();
			ОбъектСУЗ.УстановитьПометкуУдаления(Ложь);
			
			Если ТипЗнч(СсылкаНаОбъектСУЗ) = Тип("СправочникСсылка.ФайлыСУЗ") Тогда
				
				УстановитьПривилегированныйРежим(Истина);
				
				Ресурс = СсылкаНаОбъектСУЗ.Владелец;
				
				РесурсОбъект = Ресурс.ПолучитьОбъект();
				РесурсОбъект.УстановитьПометкуУдаления(Ложь);
				
				УстановитьПривилегированныйРежим(Ложь);
				
			КонецЕсли;
		 
		 КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

