
Функция ОписаниеЕдинственногоЗаданияПрохождения(ПрохождениеОбучения) Экспорт
	Возврат Документы.ПрохождениеОбученияСУО.ОписаниеЕдинственногоЗаданияПрохождения(ПрохождениеОбучения);
КонецФункции

Функция ОписаниеЕдинственногоЗаданияОбучения(ПроведениеОбучения) Экспорт
	Возврат Документы.ПроведениеОбученияСУО.ОписаниеЕдинственногоЗаданияОбучения(ПроведениеОбучения);
КонецФункции

Функция ЗаявкаНаОбучениеПользователя(Знач ПредметЗаявки, Знач Пользователь) Экспорт
	Возврат РегистрыСведений.ЗаявкиНаОбучениеСУО.Заявка(ПредметЗаявки, Пользователь);		
КонецФункции

Функция ЗаписатьПользователяНаОткрытоеОбучение(Знач ПроведениеОбучения, Знач Пользователь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);	
		
	Возврат ОбучениеСУО.ЗаписатьПользователяНаОткрытоеОбучение(ПроведениеОбучения, Пользователь);
	
КонецФункции

	