
// Функция возвращает структуру параметров значений HTML ссылки.
//
// Параметры
//  АдресСсылки  – Строка, содержащая адрес ссылки.
//
// Возвращаемое значение:
//   Структура – содержит структуру параметров: Ключ (имя параметра) и Значение.
//
Функция СтруктураСтрокиПараметров(АдресСсылки, СимволНачала= "?", РазделительПараметров="&", РазделительЗначения="=", МассивЗначений=Ложь) Экспорт
	
	Если ТипЗнч(АдресСсылки)= Тип("Структура") Тогда
    	Возврат АдресСсылки;
    КонецЕсли;
	
	СтруктураПараметров = Новый Структура();			
	
	Если НЕ ЗначениеЗаполнено(АдресСсылки) Тогда
		Возврат СтруктураПараметров;
	КонецЕсли;
	
	// Находим начало строки параметров.
	
	Если ЗначениеЗаполнено(СимволНачала) Тогда
	
		НачалоПараметров = Найти(АдресСсылки, СимволНачала);
			
		Если НачалоПараметров > 0 Тогда
			СтрокаПараметров = Сред(АдресСсылки, НачалоПараметров+1);
		Иначе
			СтрокаПараметров = АдресСсылки;
		КонецЕсли;
		
	Иначе
		
		СтрокаПараметров = АдресСсылки;
		
	КонецЕсли;
		
	// Расщепляем строку
		
	МассивПараметров = Новый Массив();
	МассивПараметров = ОбщегоНазначенияСУКлиентСервер.РасщепитьСтроку(СтрокаПараметров, РазделительПараметров);
	МассивЗначенийПараметра = Новый Массив;
		
	Для а=0 По МассивПараметров.Количество()-1 Цикл
			
		НайтиРазделитель = Найти(МассивПараметров[а], РазделительЗначения);
			
		ТекИмяПараметра = Сред(МассивПараметров[а], 1, НайтиРазделитель-1);
		
		ТекЗначениеПараметра = Сред(МассивПараметров[а], НайтиРазделитель+1, СтрДлина(МассивПараметров[а]));
		
		СущЗначениеПараметра = "";
		
		Попытка
			СтруктураПараметров.Свойство(ТекИмяПараметра, СущЗначениеПараметра);
		Исключение
			Продолжить;	
		КонецПопытки;
		
		// Если в структуре нет такого параметра, просто его добавляем.
		Если ПустаяСтрока(СущЗначениеПараметра) И НЕ МассивЗначений Тогда 
			
			СтруктураПараметров.Вставить(ТекИмяПараметра, ТекЗначениеПараметра);
			
		Иначе
			
			// Если такой параметр есть и значение его находится в массиве, то добавляем
			// Текущий параметр в массив.
			Если ТипЗнч(СущЗначениеПараметра) = Тип("Массив") Тогда 
				СущЗначениеПараметра.Добавить(ТекЗначениеПараметра);
				СтруктураПараметров.Вставить(ТекИмяПараметра, СущЗначениеПараметра);
				
			// Если это второе значение параметра, то добавляем уже существующее и текущее
			// значение в массив.	
			Иначе 
				МассивЗначЭтогоПараметра = Новый Массив();
				Если СущЗначениеПараметра <> Неопределено Тогда
					МассивЗначЭтогоПараметра.Добавить(СущЗначениеПараметра);
				КонецЕсли;
				МассивЗначЭтогоПараметра.Добавить(ТекЗначениеПараметра);
				СтруктураПараметров.Вставить(ТекИмяПараметра, МассивЗначЭтогоПараметра);
			КонецЕсли;
		КонецЕсли;
			
	КонецЦикла;

	
	Возврат СтруктураПараметров;
	
КонецФункции // ПолучитьСтруктуруСтрокиПоискаСсылкиСУЗ()

// Функция получает значение параметра ссылки из структуры ссылки.
//
// Параметры
//  ПараметрыСсылки  – Структура.
//  ИмяПараметра     - Строка, имя параметра.
//
// Возвращаемое значение:
//   Строка или Неопределено, если параметр не найден.
//
Функция ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, ИмяПараметра) Экспорт
	
	ЗначениеПараметра = Неопределено;
	ПараметрыСсылки.Свойство(ИмяПараметра, ЗначениеПараметра);
	
	Если ЗначениеПараметра = Неопределено Тогда
		
		// Если нет параметра window в ссылке, то по умолчанию параметр равен main.
		Если ИмяПараметра = "window" Тогда
			Возврат "main";
		Иначе
			Возврат Неопределено;	
		КонецЕсли;
		
	Иначе
		
		// Примечание: символы " ", "&", "=", "+" кодируются скриптом на клиенте,
		// Перед передачей на сервер, чтобы отличить их от служебных символов URL.
		// Здесь они преобразовываются обратно.
		
		Если ТипЗнч(ЗначениеПараметра) = Тип("Строка") Тогда
		
	        ЗначениеПараметра = СтрЗаменить(ЗначениеПараметра, "+", " "); 
			ЗначениеПараметра = СтрЗаменить(ЗначениеПараметра, "#x26", "&");
			ЗначениеПараметра = СтрЗаменить(ЗначениеПараметра, "#x3D", "=");
			ЗначениеПараметра = СтрЗаменить(ЗначениеПараметра, "#x2B", "+");
			ЗначениеПараметра = СтрЗаменить(ЗначениеПараметра, "#x3F", "?");
			
		КонецЕсли;
		
		Если ТипЗнч(ЗначениеПараметра) = Тип("Массив") Тогда
			
			ДлинаМассива = ЗначениеПараметра.Количество();
			
			Для Индекс=0 По ДлинаМассива-1 Цикл
				
				Значение = ЗначениеПараметра[Индекс];
				
				Если ТипЗнч(Значение) = Тип("Строка") Тогда
					 
			        Значение = СтрЗаменить(Значение, "+", " "); 
					Значение = СтрЗаменить(Значение, "#x26", "&");
					Значение = СтрЗаменить(Значение, "#x3D", "=");
					Значение = СтрЗаменить(Значение, "#x2B", "+");
					Значение = СтрЗаменить(Значение, "#x3F", "?");
					 
				КонецЕсли;
			 
				ЗначениеПараметра[Индекс] = Значение;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Возврат ЗначениеПараметра;
		
	КонецЕсли;
			
КонецФункции // ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки()

Функция ПолучитьАдресСсылкиИзСтруктуры(СтруктураСсылки) Экспорт
	
	Если ТипЗнч(СтруктураСсылки) <> Тип("Структура") Тогда
		Возврат "";
	КонецЕсли;
	
	АдресСсылки = "?";
	
	Для каждого Элемент Из СтруктураСсылки Цикл
		АдресСсылки = АдресСсылки + Элемент.Ключ + "=" + Элемент.Значение + "&";
	КонецЦикла;
	
	АдресСсылки = Лев(АдресСсылки, СтрДлина(АдресСсылки) - 1); // Убираем последний символ
	
	Возврат АдресСсылки;
	
КонецФункции

Функция ПолучитьПутьККаталогуРесурсовОтносительноФайла(УровеньВложенности) Экспорт

	ПутьККаталогуРесурсов = "";
	
	Уровень = 0;
	
	Пока Уровень < УровеньВложенности Цикл
		
		ПутьККаталогуРесурсов = ПутьККаталогуРесурсов + "../";
		
		Уровень = Уровень + 1;
	
	КонецЦикла;
	
    Возврат ПутьККаталогуРесурсов;
	
КонецФункции

Функция ИдентификаторВидеоYouTubeИзURI(ГиперссылкаНаВидео) Экспорт
	
	ИдентификаторВидео = "";
	
	Если НЕ ЗначениеЗаполнено(ГиперссылкаНаВидео) Тогда
		Возврат ИдентификаторВидео;
	КонецЕсли;
	
	// Находим идентификатор
	
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(ГиперссылкаНаВидео);	
	
	Если СтруктураURI.Хост = "youtu.be" Тогда
		
		НачалоПараметров = Найти(СтруктураURI.ПутьНаСервере, "?");
		НачалоХеша = Найти(СтруктураURI.ПутьНаСервере, "#");
		
		Если НачалоПараметров > 0 Тогда
			ИдентификаторВидео = Лев(СтруктураURI.ПутьНаСервере, НачалоПараметров-1);
		ИначеЕсли НачалоХеша > 0 Тогда
			ИдентификаторВидео = Лев(СтруктураURI.ПутьНаСервере, НачалоХеша-1);
		Иначе
			ИдентификаторВидео = СтруктураURI.ПутьНаСервере;
		КонецЕсли;		
		
	Иначе
		
		НачалоПараметров = Найти(СтруктураURI.ПутьНаСервере, "?");
		
		Если НачалоПараметров > 0 Тогда
			
			СтруктураПараметров = СтруктураСтрокиПараметров(ГиперссылкаНаВидео);
			
			Если СтруктураПараметров.Свойство("v") Тогда
				ИдентификаторВидео = СтруктураПараметров["v"];
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;
	
	Возврат ИдентификаторВидео;
	
КонецФункции
