#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция НоваяТаблицаСтатистикиПараметровSCORM() Экспорт
	
	ТаблицаСтатистики = Новый ТаблицаЗначений;
	ТаблицаСтатистики.Колонки.Добавить("ЭлектронныйРесурс");
	ТаблицаСтатистики.Колонки.Добавить("ЭлементСодержания");
	ТаблицаСтатистики.Колонки.Добавить("Параметр");
	ТаблицаСтатистики.Колонки.Добавить("Передан");
	ТаблицаСтатистики.Колонки.Добавить("ПереданСОшибкой");
	ТаблицаСтатистики.Колонки.Добавить("Значение");
	
	Возврат ТаблицаСтатистики;
	
КонецФункции

Процедура ДобавитьСтрокуВТаблицуСтатистики(ТаблицаСтатистики, ЭлектронныйРесурс, ЭлементСодержания, Параметр, Передан, ПереданСОшибкой, Значение) Экспорт
	
	НоваяСтрока = ТаблицаСтатистики.Добавить();	
	НоваяСтрока.ЭлектронныйРесурс = ЭлектронныйРесурс;
	НоваяСтрока.ЭлементСодержания = ЭлементСодержания;
	НоваяСтрока.Параметр = Параметр;
	НоваяСтрока.Передан = Передан;
	НоваяСтрока.ПереданСОшибкой = ПереданСОшибкой;
	НоваяСтрока.Значение = Значение;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
