#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ЗначениеВТекст(Вариант) Экспорт
	
	Если Вариант = Перечисления.ВариантыОформленияКомандыПрофиляВебКабинетаСУО.ИмяДляВхода Тогда
		Возврат "login";
	КонецЕсли;
	
	Если Вариант = Перечисления.ВариантыОформленияКомандыПрофиляВебКабинетаСУО.ИмяДляВходаИФотография Тогда
		Возврат "loginAndPhoto";
	КонецЕсли;
	
	Если Вариант = Перечисления.ВариантыОформленияКомандыПрофиляВебКабинетаСУО.ПолноеИмя Тогда
		Возврат "name";
	КонецЕсли;
	
	Если Вариант = Перечисления.ВариантыОформленияКомандыПрофиляВебКабинетаСУО.ПолноеИмяИАватар Тогда
		Возврат "nameAndPhoto";
	КонецЕсли;
	
	Если Вариант = Перечисления.ВариантыОформленияКомандыПрофиляВебКабинетаСУО.Фотография Тогда
		Возврат "photo";
	КонецЕсли;
	
	Возврат "photo";
	
КонецФункции

#КонецОбласти

#КонецЕсли
