

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Параметры.Пользователь) Тогда
		Пользователь = Параметры.Пользователь;
	Иначе
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	УчебныеГруппы.Параметры.УстановитьЗначениеПараметра("Пользователь", Пользователь);
	
	СоставУчебнойГруппы.Параметры.УстановитьЗначениеПараметра("УчебнаяГруппа", Справочники.УчебныеГруппыСУО.ПустаяСсылка());
	СоставУчебнойГруппы.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", Пользователь);
	
	ЕстьПравоУчастияВОбсуждениях = УправлениеДоступом.ЕстьРоль("ЛичныйКабинетУниверсальныйСервисОбщенияСУО");
	
	Если ЕстьПравоУчастияВОбсуждениях Тогда
		Элементы.НаписатьУчебнойГруппе.Видимость          = Истина;
		Элементы.НаписатьУчастникуУчебнойГруппы.Видимость = Истина;
	Иначе
		Элементы.НаписатьУчебнойГруппе.Видимость          = Ложь;
		Элементы.НаписатьУчастникуУчебнойГруппы.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура НаписатьУчастникуУчебнойГруппы(Команда)
	
	ТекущиеДанные = Элементы.СоставУчебнойГруппы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПараметрыФормы = Новый Структура("Контекст", ТекущиеДанные.Пользователь);
	ОткрытьФорму("Документ.СообщениеСУО.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура НаписатьУчебнойГруппе(Команда)
	
	ТекущиеДанные = Элементы.УчебныеГруппы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПараметрыФормы = Новый Структура("Контекст", ТекущиеДанные.Ссылка);
	ОткрытьФорму("Документ.СообщениеСУО.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ УчебныеГруппы

&НаКлиенте
Процедура УчебныеГруппыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура УчебныеГруппыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СоставУчебнойГруппы.Параметры.УстановитьЗначениеПараметра("УчебнаяГруппа", ТекущиеДанные.Ссылка);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ СоставУчебнойГруппы

&НаКлиенте
Процедура СоставУчебнойГруппыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПоказатьЗначение(,ТекущиеДанные.Пользователь);

КонецПроцедуры


