Процедура ДобавитьДанные(СсылкаНаОбъект, ОбъектМетаданныхСтрока, Зависимости) Экспорт
	
	НаборЗаписей = РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СсылкаНаОбъект.Установить(СсылкаНаОбъект);
	НаборЗаписей.Отбор.ОбъектМетаданных.Установить(ОбъектМетаданныхСтрока);
	
	Если ТипЗнч(Зависимости) = Тип("Массив") Тогда
		
		МассивДобавленныхЗависимостей = Новый Массив;
		
		Для каждого Зависимость Из Зависимости Цикл
			
			Если НЕ ЗначениеЗаполнено(Зависимость) Тогда
				Продолжить;
			КонецЕсли;
			
			Если МассивДобавленныхЗависимостей.Найти(Зависимость) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.СсылкаНаОбъект = СсылкаНаОбъект;
			НоваяЗапись.ОбъектМетаданных = ОбъектМетаданныхСтрока;
			НоваяЗапись.Зависимость = Зависимость;		
			
			МассивДобавленныхЗависимостей.Добавить(Зависимость);
			
		КонецЦикла;
		
	Иначе
		
		Если ЗначениеЗаполнено(Зависимость) Тогда
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.СсылкаНаОбъект = СсылкаНаОбъект;
			НоваяЗапись.ОбъектМетаданных = ОбъектМетаданныхСтрока;
			НоваяЗапись.Зависимость = Зависимость;
			
		КонецЕсли;
		
	КонецЕсли;
	
	НаборЗаписей.Записать();		
	
КонецПроцедуры

Процедура УдалитьДанные(СсылкаНаОбъект, ОбъектМетаданныхСтрока) Экспорт
	
	НаборЗаписей = РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СсылкаНаОбъект.Установить(СсылкаНаОбъект);
	НаборЗаписей.Отбор.ОбъектМетаданных.Установить(ОбъектМетаданныхСтрока);
	
	НаборЗаписей.Записать();	
	
КонецПроцедуры

