
&НаСервере
Функция ЕстьПравоПросмотраПользователя(Пользователь)
	
	Если УправлениеДоступом.ЕстьРоль("ПолныеПрава") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РуководителиСУО.Пользователь
		|ИЗ
		|	РегистрСведений.РуководителиСУО КАК РуководителиСУО
		|ГДЕ
		|	РуководителиСУО.Пользователь = &ТекущийПользователь
		|	И РуководителиСУО.ОбъектРуководства = &Пользователь";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если НЕ ЕстьПравоПросмотраПользователя(ПараметрКоманды) Тогда
		
		ПоказатьПредупреждение(,НСтр("ru = 'Нарушение права доступа'"));
		Возврат;
		
	КонецЕсли;
	
	Заголовок = НСтр("ru = 'Результаты пользователя ""%1""'");
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Заголовок, Строка(ПараметрКоманды));
	
	ПараметрыФормы = Новый Структура("ВыбраннаяКоманда, Пользователь, Заголовок", "ЗачетнаяКнижка", ПараметрКоманды, Заголовок);
	
	ОткрытьФорму("ОбщаяФорма.МоиРезультатыСУО", ПараметрыФормы);
	
КонецПроцедуры
