#Область СлужебныеПроцедурыИФункции

#Область Публикация

// Возвращает структуру данных курса, которая используется для его просмотра и публикации.
//
// Параметры:
//   ЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - электронный курс.
//   ФрагментКурса  - СправочникСсылка.СодержаниеЭлектронныхКурсов - фрагмент курса, который надо отобразить.
//   ДатаИзмененияСуществующихДанных - Дата - дата уже выгруженных данных.
//
// Возвращаемое значение:
//  Структура - данные курса.
//
Функция ДанныеПубликацииЭлектронногоКурса(Знач ЭлектронныйКурс, Знач ФрагментКурса = Неопределено, Знач ДатаИзмененияСуществующихДанных = Неопределено) Экспорт
	
	// Делаем проверки
	//
	
	Если ЭлектронныйКурс = ФрагментКурса Тогда
		ВызватьИсключение НСтр("ru = 'Фрагмент курса не может быть самим курсом'");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭлектронныйКурс) Тогда
		ВызватьИсключение НСтр("ru = 'Электронный курс для публикации не задан'");
	КонецЕсли;	
	
	// Получаем реквизиты курса и его содержание
	//
	
	ТребуемыеДанныеЭК = Новый Структура();
	ТребуемыеДанныеЭК.Вставить("Наименование", "Наименование");
	ТребуемыеДанныеЭК.Вставить("ДатаИзменения", "ДатаИзменения");
	ТребуемыеДанныеЭК.Вставить("Презентация", "Презентация");
	ТребуемыеДанныеЭК.Вставить("Глоссарий", "Глоссарий");
	ТребуемыеДанныеЭК.Вставить("Тип", "Тип");
		
	Если ФрагментКурса = Неопределено ИЛИ ФрагментКурса = Перечисления.ТипыЭлементовСодержанияЭлектронногоКурса.Начало Тогда
		ТребуемыеДанныеЭК.Вставить("СтартоваяСтраница", "СтартоваяСтраница");
		ТребуемыеДанныеЭК.Вставить("СтартоваяСтраницаЭлемент", "СтартоваяСтраница.ЕдинственныйЭлемент");			
	КонецЕсли;
		
	Если ФрагментКурса = Неопределено ИЛИ ФрагментКурса = Перечисления.ТипыЭлементовСодержанияЭлектронногоКурса.Финальный Тогда
		ТребуемыеДанныеЭК.Вставить("ФинальнаяСтраница", "ФинальнаяСтраница");
		ТребуемыеДанныеЭК.Вставить("ФинальнаяСтраницаЭлемент", "ФинальнаяСтраница.ЕдинственныйЭлемент");
	КонецЕсли;		
		
	ДанныеЭлектронногоКурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлектронныйКурс, ТребуемыеДанныеЭК);	
	
	Если ТипЗнч(ФрагментКурса) = Тип("СправочникСсылка.СтраницыЭлементовЭлектронныхКурсов") Тогда				
		ДанныеСтраницыПодборки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ФрагментКурса, "Владелец, СсылкаНаЭлементКурса, ДатаИзменения");
	Иначе
		ДанныеСтраницыПодборки = Неопределено;
	КонецЕсли;		
	
	ЭлементыСодержания = Неопределено;
	
	Если ФрагментКурса = Неопределено ИЛИ ТипЗнч(ФрагментКурса) = Тип("СправочникСсылка.СодержаниеЭлектронныхКурсов") Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Содержание.Ссылка КАК Ссылка,
			|	Содержание.Элемент КАК СсылкаНаЭлемент,
			|	Содержание.ТипЭлемента КАК ТипЭлемента,
			|	Содержание.Наименование КАК Наименование,
			|	Содержание.ДатаИзменения КАК ДатаИзменения,
			|	Содержание.ПараметрыЗапуска КАК ПараметрыЗапуска,
			|	Содержание.КоличествоПопыток КАК КоличествоПопыток,
			|	Содержание.ПродолжительностьПопытки КАК ПродолжительностьПопытки,
			|	Содержание.ПорогВыполнения КАК ПорогВыполнения,
			|	Содержание.ДанныеИнициализации КАК ДанныеИнициализации,
			|	Содержание.ДействиеПослеИстеченияВремени КАК ДействиеПослеИстеченияВремени,
			|	Содержание.Скрытый КАК Скрытый
			|ИЗ
			|	Справочник.СодержаниеЭлектронныхКурсов КАК Содержание
			|ГДЕ
			|	Содержание.Владелец = &ЭлектронныйКурс
			|	И Содержание.ЭтоГруппа = ЛОЖЬ
			|	И Содержание.ПометкаУдаления = ЛОЖЬ
			|	И &ОтборПоЭлементуСодержания
			|
			|УПОРЯДОЧИТЬ ПО
			|	Содержание.Код";
		
		Запрос.УстановитьПараметр("ЭлектронныйКурс", ЭлектронныйКурс);
		
		Если ЗначениеЗаполнено(ФрагментКурса) Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоЭлементуСодержания", "Содержание.Ссылка = &ЭлементСодержания");
			Запрос.УстановитьПараметр("ЭлементСодержания", ФрагментКурса);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоЭлементуСодержания", "ИСТИНА");
		КонецЕсли;	
		
		ЭлементыСодержания = Запрос.Выполнить().Выгрузить();		
		
	КонецЕсли;	
		
	// Определяем дату изменения
	//
	
	ДатаИзменения = ОбновлениеИнформационнойБазыБЭО.ДатаИзмененияПоставляемыхМакетов();
	
	Если ДанныеЭлектронногоКурса.ДатаИзменения > ДатаИзменения Тогда 	
		ДатаИзменения = ДанныеЭлектронногоКурса.ДатаИзменения;
	КонецЕсли;
	
	Если ЭлементыСодержания <> Неопределено Тогда
		
		Для каждого Строка Из ЭлементыСодержания Цикл
			Если Строка.ДатаИзменения > ДатаИзменения Тогда
				ДатаИзменения = Строка.ДатаИзменения;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ДанныеСтраницыПодборки <> Неопределено
		И ДанныеСтраницыПодборки.ДатаИзменения > ДатаИзменения Тогда
		
		ДатаИзменения = ДанныеСтраницыПодборки.ДатаИзменения;
		
	КонецЕсли;
	
	// Проверяем дату изменения предыдущих данных
	//
	
	Если ДатаИзмененияСуществующихДанных <> Неопределено
		И ДатаИзменения < ДатаИзмененияСуществующихДанных Тогда		
		Возврат Неопределено;		
	КонецЕсли;	
	
	// Получаем структуру курса и список ресурсов для выгрузки
	//
	
	СтруктураКурса = Новый Структура;
	СтруктураКурса.Вставить("title", ДанныеЭлектронногоКурса.Наименование);
	СтруктураКурса.Вставить("uuid", ИзучениеЭлектронныхКурсовСлужебныйКлиентСервер.ИдентификаторДанныхПубликации(ЭлектронныйКурс, ФрагментКурса));
	
	РесурсыКурса = Новый Массив;
	
	ЭлементыПоиска = Неопределено;
	
	Если ФрагментКурса = Неопределено И ДанныеЭлектронногоКурса.Тип = Перечисления.ТипыЭлектронныхКурсов.Учебник Тогда
		
		ДанныеПоиска = Новый Структура();
		ДанныеПоиска.Вставить("index", Новый Структура);
		
		ДанныеПоиска.index = Новый Структура;
		ДанныеПоиска.index.Вставить("type", "RAW");
		ДанныеПоиска.index.Вставить("data", Новый Структура);
		
		ДанныеПоиска.index.data = Новый Структура();
		ДанныеПоиска.index.data.Вставить("elements", Новый Массив);
		
		СтруктураКурса.Вставить("search", ДанныеПоиска);
		
		ЭлементыПоиска = ДанныеПоиска.index.data.elements; 
		
	КонецЕсли;
	
	// Добавляем слайды
	//
	
	МассивСлайдов = Новый Массив;
	СтруктураКурса.Вставить("slides", МассивСлайдов);
	
	// Стартовый слайд
	
	Если ДанныеЭлектронногоКурса.Свойство("СтартоваяСтраницаЭлемент") И ЗначениеЗаполнено(ДанныеЭлектронногоКурса.СтартоваяСтраницаЭлемент) Тогда
		
		ФорматированныйДокументИзБазы = Справочники.ЭлементыЭлектронныхРесурсов.ДанныеЭлементаДляВыгрузки(ДанныеЭлектронногоКурса.СтартоваяСтраницаЭлемент, Перечисления.ТипыЭлементовЭлектронныхРесурсов.Text);
		ОтносительныйПутьККаталогуРесурсов = ИзучениеЭлектронныхКурсовСлужебныйКлиентСервер.ОтносительныйАдресКаталогаРесурсовКурса(ЭлектронныйКурс);
		ДанныеФорматированногоДокумента = ЭлектронноеОбучениеСлужебный.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ФорматированныйДокументИзБазы, ДанныеЭлектронногоКурса.СтартоваяСтраница.УникальныйИдентификатор(),,,,ОтносительныйПутьККаталогуРесурсов);
		
		Если НЕ ЭлектронноеОбучениеСлужебный.ЭтоПустойHTMLДокумент(ДанныеФорматированногоДокумента.ПредставлениеHTML) Тогда // Пустой слайд не делаем
			
			СтруктураСлайда = Новый Структура;
			СтруктураСлайда.Вставить("uuid", Строка(ЭлектронныйКурс.УникальныйИдентификатор())+ "-start");
			СтруктураСлайда.Вставить("type", "START");		
			
			ДанныеДокумента = Новый Структура;
			ДанныеДокумента.Вставить("encoded", Истина);
			ДанныеДокумента.Вставить("data", ЭлектронноеОбучениеСлужебный.Base64ИзСтроки(ДанныеФорматированногоДокумента.ПредставлениеHTML));
			
			СтруктураСлайда.Вставить("text", ДанныеДокумента);
			
			Если ДанныеФорматированногоДокумента.ЕстьВложения Тогда
				ДобавитьРесурсВМассивРесурсов(ДанныеЭлектронногоКурса.СтартоваяСтраница, РесурсыКурса); 
			КонецЕсли;		
			
			МассивСлайдов.Добавить(СтруктураСлайда);
			
			ДобавитьЭлементПоиска(ЭлементыПоиска, СтруктураСлайда.uuid, "", ДанныеФорматированногоДокумента.ТекстовыеДанные);
			
		КонецЕсли;
			
	КонецЕсли;
	
	// Единичная страница подборки
	
	Если ТипЗнч(ФрагментКурса) = Тип("СправочникСсылка.СтраницыЭлементовЭлектронныхКурсов") Тогда		
		
		СтраницаПодборки = ФрагментКурса; 

		Подборка = ДанныеСтраницыПодборки.Владелец;		
		
		СтруктураПодборки = Новый Структура;
		СтруктураПодборки.Вставить("uuid", Подборка.УникальныйИдентификатор());		
		СтруктураПодборки.Вставить("elements", Новый Массив);
		
		СтруктураСлайда = Новый Структура;
		СтруктураСлайда.Вставить("uuid", Строка(Подборка.УникальныйИдентификатор()));
		СтруктураСлайда.Вставить("type", "COLLECTION");
		СтруктураСлайда.Вставить("collection", СтруктураПодборки);			
		
		Если ТипЗнч(ДанныеСтраницыПодборки.СсылкаНаЭлементКурса) = Тип("СправочникСсылка.ТестовыеВопросы") Тогда
			
			МассивВопросов = Новый Массив;
			МассивВопросов.Добавить(ДанныеСтраницыПодборки.СсылкаНаЭлементКурса);
			
			ВопросыТеста = СтруктураТестовыхВопросовДляПросмотра(МассивВопросов, РесурсыКурса, ЭлектронныйКурс);			
			
			СтруктураВопроса = ВопросыТеста[0];
			
			СтруктураЭлементаПодборки = Новый Структура;
			СтруктураЭлементаПодборки.Вставить("uuid", ФрагментКурса.УникальныйИдентификатор());
			СтруктураЭлементаПодборки.Вставить("type", "QUESTION");
			СтруктураЭлементаПодборки.Вставить("question", СтруктураВопроса);			
			
		Иначе
			
			ВызватьИсключение НСтр("ru = 'Неизвестный тип фрагмента курса'");
			
		КонецЕсли;

		СтруктураПодборки.elements.Добавить(СтруктураЭлементаПодборки);				
		
		МассивСлайдов.Добавить(СтруктураСлайда);
		
	КонецЕсли;

	// Слайды элементов содержания
	
	ДеревоЭлементовРесурсаSCO = Неопределено;
	
	Если ЭлементыСодержания <> Неопределено Тогда
	
		Для каждого Строка Из ЭлементыСодержания Цикл		
			
			СтруктураСлайда = Новый Структура;
			СтруктураСлайда.Вставить("uuid", Строка(Строка.Ссылка.УникальныйИдентификатор()));		
			
			Если Строка.Ссылка = ФрагментКурса Тогда
				СтруктураСлайда.Вставить("hidden", Ложь); // Показываем один фрагмент и его скрывать не надо
			Иначе				
				СтруктураСлайда.Вставить("hidden", Строка.Скрытый);
			КонецЕсли;
			
			// TEXT
			
			Если Строка.ТипЭлемента = Перечисления.ТипыЭлементовСодержанияЭлектронногоКурса.Документ Тогда
				
				СтруктураСлайда.Вставить("type", "TEXT");
				
				РесурсСДокументом = Справочники.ТеорияЭлектронныхКурсов.ЕдинственныйЭлемент(Строка.СсылкаНаЭлемент);
				ЭлементРесурса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РесурсСДокументом, "ЕдинственныйЭлемент");			
				
				Если НЕ ЗначениеЗаполнено(ЭлементРесурса) Тогда
					ВызватьИсключение НСтр("ru = 'Элемент ресурса с текстовым документом не найден'");
				КонецЕсли;
				
				ФорматированныйДокументИзБазы = Справочники.ЭлементыЭлектронныхРесурсов.ДанныеЭлементаДляВыгрузки(ЭлементРесурса, Перечисления.ТипыЭлементовЭлектронныхРесурсов.Text);
				ОтносительныйПутьККаталогуРесурсов = ИзучениеЭлектронныхКурсовСлужебныйКлиентСервер.ОтносительныйАдресКаталогаРесурсовКурса(ЭлектронныйКурс);
				ДанныеФорматированногоДокумента = ЭлектронноеОбучениеСлужебный.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ФорматированныйДокументИзБазы, РесурсСДокументом.УникальныйИдентификатор(),,,,ОтносительныйПутьККаталогуРесурсов);
				
				ДанныеДокумента = Новый Структура;
				ДанныеДокумента.Вставить("encoded", Истина);
				ДанныеДокумента.Вставить("data", ЭлектронноеОбучениеСлужебный.Base64ИзСтроки(ДанныеФорматированногоДокумента.ПредставлениеHTML));
				
				СтруктураСлайда.Вставить("text", ДанныеДокумента);
				
				Если ДанныеФорматированногоДокумента.ЕстьВложения Тогда
					ДобавитьРесурсВМассивРесурсов(РесурсСДокументом, РесурсыКурса); 
				КонецЕсли;
				
				ДобавитьЭлементПоиска(ЭлементыПоиска, СтруктураСлайда.uuid, Строка.Наименование, ДанныеФорматированногоДокумента.ТекстовыеДанные);
				
			КонецЕсли;
			
			// WORD
			
			Если Строка.ТипЭлемента = Перечисления.ТипыЭлементовСодержанияЭлектронногоКурса.ДокументWord
				ИЛИ Строка.ТипЭлемента = Перечисления.ТипыЭлементовСодержанияЭлектронногоКурса.ДокументOpenOffice Тогда
				
				СтруктураСлайда.Вставить("type", "WORD");			
				ЭлементКурсаСДокументомWord = Справочники.ТеорияЭлектронныхКурсов.ЕдинственныйЭлемент(Строка.СсылкаНаЭлемент);			
				СтруктураСлайда.Вставить("doc", ЭлементКурсаСДокументомWord.УникальныйИдентификатор());			
				ДобавитьРесурсВМассивРесурсов(ЭлементКурсаСДокументомWord, РесурсыКурса);  
				
				Если ЭлементыПоиска <> Неопределено Тогда
					
					ЭлементРесурса = Справочники.ЭлектронныеРесурсы.ЕдинственныйЭлемент(ЭлементКурсаСДокументомWord);
					ДанныеДляИндексирования = Справочники.ЭлементыЭлектронныхРесурсов.ПроизвольныеДанныеЭлемента(ЭлементРесурса, "ДанныеДляИндексирования", "ДвоичныеДанные");
					
					ДобавитьЭлементПоиска(ЭлементыПоиска, СтруктураСлайда.uuid, Строка.Наименование, ДанныеДляИндексирования);
					
				КонецЕсли;
				
			КонецЕсли;
			
			// QUIZ 
			
			Если Строка.ТипЭлемента = Перечисления.ТипыЭлементовСодержанияЭлектронногоКурса.Тест Тогда			
				
				// Получаем данные теста и вопросов
				
				ЭлектронныйТест = Строка.СсылкаНаЭлемент;
				
				ДанныеЭлектронногоТеста = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
					ЭлектронныйТест,
					"ВремяТеста,
					|КоличествоПопыток,
					|КоличествоВопросов,
					|РазрешитьИсправлятьОшибки,
					|ПеремешиватьВопросы,
					|ПоказыватьРезультатОтвета,
					|ПоказыватьСтатистику,
					|ПоказыватьПравильныеОтветы");
				
				СтруктураТеста = Новый Структура;			
				СложностьТеста = Новый Структура;
				
				// Добавляем тест к слайду
				
				СтруктураСлайда.Вставить("quiz", СтруктураТеста);			
				СтруктураСлайда.Вставить("type", "QUIZ");
				
				// Заполняем свойства теста
				
				СтруктураТеста.Вставить("uuid", ЭлектронныйТест.УникальныйИдентификатор());			
				СтруктураТеста.Вставить("level", СложностьТеста);
				СтруктураТеста.Вставить("countAttempts", ДанныеЭлектронногоТеста.КоличествоПопыток);
				
				СтруктураТеста.Вставить("displayQuestionResults", ДанныеЭлектронногоТеста.ПоказыватьРезультатОтвета);
				СтруктураТеста.Вставить("allowCorrectMistakes", ДанныеЭлектронногоТеста.РазрешитьИсправлятьОшибки);
				СтруктураТеста.Вставить("randomizeQuestions", ДанныеЭлектронногоТеста.ПеремешиватьВопросы);
				СтруктураТеста.Вставить("displayFinalStatistic", ДанныеЭлектронногоТеста.ПоказыватьСтатистику);
				СтруктураТеста.Вставить("displayKeys", ДанныеЭлектронногоТеста.ПоказыватьПравильныеОтветы);
				
				// Заполняем свойства сложности
				
				СложностьТеста.Вставить("countQuestions", ДанныеЭлектронногоТеста.КоличествоВопросов);
				СложностьТеста.Вставить("timePeriod", ИзучениеЭлектронныхКурсовСлужебныйSCORM.КоличествоСекундИзДаты(ДанныеЭлектронногоТеста.ВремяТеста));
				
				// Заполняем вопросы
				
				ТаблицаВопросовТеста = Справочники.ЭлектронныеТесты.ВопросыТеста(ЭлектронныйТест);			
				МассивВопросов = ТаблицаВопросовТеста.ВыгрузитьКолонку("Ссылка");
				
				ВопросыТеста = СтруктураТестовыхВопросовДляПросмотра(МассивВопросов, РесурсыКурса, ЭлектронныйКурс);
				СтруктураТеста.Вставить("questions", ВопросыТеста);
								
			КонецЕсли;
			
					
			// VIDEO
			
			Если Строка.ТипЭлемента = Перечисления.ТипыЭлементовСодержанияЭлектронногоКурса.Видео Тогда
				
				СтруктураСлайда.Вставить("type", "VIDEO");
				
				РесурсСВидео = Справочники.ТеорияЭлектронныхКурсов.ЕдинственныйЭлемент(Строка.СсылкаНаЭлемент);
				
				НеобходимыеДанныеВидео = Новый Структура;
				НеобходимыеДанныеВидео.Вставить("ЭлементРесурса", "ЕдинственныйЭлемент");
				НеобходимыеДанныеВидео.Вставить("ИмяФайла", "ЕдинственныйЭлемент.ИмяФайла");
				НеобходимыеДанныеВидео.Вставить("ПроигрыватьАвтоматически", "ЕдинственныйЭлемент.ПроигрыватьАвтоматически");
				НеобходимыеДанныеВидео.Вставить("Описание", "ЕдинственныйЭлемент.Описание");
				НеобходимыеДанныеВидео.Вставить("ЭтоВнешнийЭлемент", "ЕдинственныйЭлемент.ЭтоВнешнийЭлемент");
				
				ДанныеВидео = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РесурсСВидео, НеобходимыеДанныеВидео);
				
				СтруктураВидео = Новый Структура;
				СтруктураВидео.Вставить("autoplay", ДанныеВидео.ПроигрыватьАвтоматически);
				СтруктураВидео.Вставить("isExternal", ДанныеВидео.ЭтоВнешнийЭлемент);
							
				ФорматыВидео = Новый Массив;
				СтруктураФормата = Новый Структура;
				
				Если ДанныеВидео.ЭтоВнешнийЭлемент Тогда
					
					ФорматВидео = Справочники.ЭлементыЭлектронныхРесурсов.ПроизвольныеДанныеЭлемента(ДанныеВидео.ЭлементРесурса, "ХранилищеДанных", "ФорматВидео");
					
					СтруктураФормата.Вставить("type", ФорматВидео);
					СтруктураФормата.Вставить("file", ДанныеВидео.ИмяФайла);					
					
				Иначе
					
					ФорматДляВыгрузки = Справочники.ЭлементыЭлектронныхРесурсов.ФорматВидеоФайлаДляВыгрузки(ДанныеВидео.ЭлементРесурса);
					ФорматДляВыгрузки = НРег(ФорматДляВыгрузки);
					
					СтруктураФормата.Вставить("type", "video/" + ФорматДляВыгрузки);
					СтруктураФормата.Вставить("file", Строка(РесурсСВидео.УникальныйИдентификатор()) + "/video." + ФорматДляВыгрузки);
					
				КонецЕсли;
					
				ФорматыВидео.Добавить(СтруктураФормата);
				
				СтруктураВидео.Вставить("formats", ФорматыВидео);
				
				ОписаниеВидеоФорматированныйДокумент = ДанныеВидео.Описание.Получить();
				
				Если ОписаниеВидеоФорматированныйДокумент <> Неопределено Тогда
					
					ОтносительныйПутьККаталогуРесурсов = ИзучениеЭлектронныхКурсовСлужебныйКлиентСервер.ОтносительныйАдресКаталогаРесурсовКурса(ЭлектронныйКурс);
					ДанныеФорматированногоДокумента = ЭлектронноеОбучениеСлужебный.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ОписаниеВидеоФорматированныйДокумент, ДанныеВидео.ЭлементРесурса.УникальныйИдентификатор(), "Описание",,,ОтносительныйПутьККаталогуРесурсов);
					
					Если НЕ ЭлектронноеОбучениеСлужебный.ЭтоПустойHTMLДокумент(ДанныеФорматированногоДокумента.ПредставлениеHTML) Тогда
						
						ДанныеДокумента = Новый Структура;
						ДанныеДокумента.Вставить("encoded", Истина);
						ДанныеДокумента.Вставить("data", ЭлектронноеОбучениеСлужебный.Base64ИзСтроки(ДанныеФорматированногоДокумента.ПредставлениеHTML));
						
						СтруктураВидео.Вставить("description", ДанныеДокумента);
						
						Если ДанныеФорматированногоДокумента.ЕстьВложения Тогда
							ДобавитьРесурсВМассивРесурсов(ДанныеВидео.ЭлементРесурса, РесурсыКурса, "Описание"); 
						КонецЕсли;
						
						ДобавитьЭлементПоиска(ЭлементыПоиска, СтруктураСлайда.uuid, Строка.Наименование, ДанныеФорматированногоДокумента.ТекстовыеДанные);
						
					КонецЕсли;
					
				КонецЕсли;
				
				СтруктураСлайда.Вставить("video", СтруктураВидео);							
				
				Если НЕ ДанныеВидео.ЭтоВнешнийЭлемент Тогда
					ДобавитьРесурсВМассивРесурсов(РесурсСВидео, РесурсыКурса);  
				КонецЕсли;
				
			КонецЕсли;		
			
			// YOUTUBE
			
			Если Строка.ТипЭлемента = Перечисления.ТипыЭлементовСодержанияЭлектронногоКурса.YouTube Тогда
				
				СтруктураСлайда.Вставить("type", "YOUTUBE");
				
				РесурсСВидео = Справочники.ТеорияЭлектронныхКурсов.ЕдинственныйЭлемент(Строка.СсылкаНаЭлемент);
				
				НеобходимыеДанныеВидео = Новый Структура;
				НеобходимыеДанныеВидео.Вставить("ЭлементРесурса", "ЕдинственныйЭлемент");
				НеобходимыеДанныеВидео.Вставить("ИдентификаторВидео", "ЕдинственныйЭлемент.ИмяФайла");
				НеобходимыеДанныеВидео.Вставить("ПроигрыватьАвтоматически", "ЕдинственныйЭлемент.ПроигрыватьАвтоматически");
				НеобходимыеДанныеВидео.Вставить("Описание", "ЕдинственныйЭлемент.Описание");
				
				ДанныеВидео = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РесурсСВидео, НеобходимыеДанныеВидео);
				
				СтруктураВидео = Новый Структура;
				СтруктураВидео.Вставить("autoplay", ДанныеВидео.ПроигрыватьАвтоматически);
				СтруктураВидео.Вставить("id", ДанныеВидео.ИдентификаторВидео);
				
				ОписаниеВидеоФорматированныйДокумент = Неопределено;
				
				Если ЗначениеЗаполнено(ДанныеВидео.Описание) Тогда
					ОписаниеВидеоФорматированныйДокумент = ДанныеВидео.Описание.Получить();
				КонецЕсли;
				
				Если ОписаниеВидеоФорматированныйДокумент <> Неопределено Тогда
					
					ОтносительныйПутьККаталогуРесурсов = ИзучениеЭлектронныхКурсовСлужебныйКлиентСервер.ОтносительныйАдресКаталогаРесурсовКурса(ЭлектронныйКурс);
					ДанныеФорматированногоДокумента = ЭлектронноеОбучениеСлужебный.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ОписаниеВидеоФорматированныйДокумент, ДанныеВидео.ЭлементРесурса.УникальныйИдентификатор(), "Описание",,,ОтносительныйПутьККаталогуРесурсов);
					
					Если НЕ ЭлектронноеОбучениеСлужебный.ЭтоПустойHTMLДокумент(ДанныеФорматированногоДокумента.ПредставлениеHTML) Тогда
						
						ДанныеДокумента = Новый Структура;
						ДанныеДокумента.Вставить("encoded", Истина);
						ДанныеДокумента.Вставить("data", ЭлектронноеОбучениеСлужебный.Base64ИзСтроки(ДанныеФорматированногоДокумента.ПредставлениеHTML));
						
						СтруктураВидео.Вставить("description", ДанныеДокумента);
						
						Если ДанныеФорматированногоДокумента.ЕстьВложения Тогда
							ДобавитьРесурсВМассивРесурсов(ДанныеВидео.ЭлементРесурса, РесурсыКурса, "Описание"); 
						КонецЕсли;
						
						ДобавитьЭлементПоиска(ЭлементыПоиска, СтруктураСлайда.uuid, Строка.Наименование, ДанныеФорматированногоДокумента.ТекстовыеДанные);
						
					КонецЕсли;
					
				КонецЕсли;
				
				СтруктураСлайда.Вставить("youtube", СтруктураВидео);			
				
				ДобавитьРесурсВМассивРесурсов(РесурсСВидео, РесурсыКурса);  
				
			КонецЕсли;				
			
			// AUDIO
			
			Если Строка.ТипЭлемента = Перечисления.ТипыЭлементовСодержанияЭлектронногоКурса.Звук Тогда
				
				СтруктураСлайда.Вставить("type", "AUDIO");
				
				РесурсСАудио = Справочники.ТеорияЭлектронныхКурсов.ЕдинственныйЭлемент(Строка.СсылкаНаЭлемент);
				
				НеобходимыеДанныеАудио = Новый Структура;
				НеобходимыеДанныеАудио.Вставить("ЭлементРесурса", "ЕдинственныйЭлемент");
				НеобходимыеДанныеАудио.Вставить("ИмяФайла","ЕдинственныйЭлемент.ИмяФайла");
				НеобходимыеДанныеАудио.Вставить("Описание","ЕдинственныйЭлемент.Описание");
				НеобходимыеДанныеАудио.Вставить("ПроигрыватьАвтоматически","ЕдинственныйЭлемент.ПроигрыватьАвтоматически");				
				
				ДанныеАудио = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РесурсСАудио, НеобходимыеДанныеАудио);				
				ФорматАудио = НРег(ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ДанныеАудио.ИмяФайла)));
				
				СтруктураАудио = Новый Структура;
				СтруктураАудио.Вставить("autoplay", ДанныеАудио.ПроигрыватьАвтоматически);
				
				ФорматыАудио = Новый Массив;
				
				СтруктураФормата = Новый Структура;
				СтруктураФормата.Вставить("type", "audio/" + ФорматАудио);
				СтруктураФормата.Вставить("file", Строка(РесурсСАудио.УникальныйИдентификатор()) + "/audio." + ФорматАудио);
				
				ФорматыАудио.Добавить(СтруктураФормата);
				
				СтруктураАудио.Вставить("formats", ФорматыАудио);
				
				
				ОписаниеАудиоФорматированныйДокумент = ДанныеАудио.Описание.Получить();
				
				Если ОписаниеАудиоФорматированныйДокумент <> Неопределено Тогда
					
					ОтносительныйПутьККаталогуРесурсов = ИзучениеЭлектронныхКурсовСлужебныйКлиентСервер.ОтносительныйАдресКаталогаРесурсовКурса(ЭлектронныйКурс);
					ДанныеФорматированногоДокумента = ЭлектронноеОбучениеСлужебный.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ОписаниеАудиоФорматированныйДокумент, ДанныеАудио.ЭлементРесурса.УникальныйИдентификатор(), "Описание",,,ОтносительныйПутьККаталогуРесурсов);
					
					Если НЕ ЭлектронноеОбучениеСлужебный.ЭтоПустойHTMLДокумент(ДанныеФорматированногоДокумента.ПредставлениеHTML) Тогда
						
						ДанныеДокумента = Новый Структура;
						ДанныеДокумента.Вставить("encoded", Истина);
						ДанныеДокумента.Вставить("data", ЭлектронноеОбучениеСлужебный.Base64ИзСтроки(ДанныеФорматированногоДокумента.ПредставлениеHTML));
						
						СтруктураАудио.Вставить("description", ДанныеДокумента);
						
						Если ДанныеФорматированногоДокумента.ЕстьВложения Тогда
							ДобавитьРесурсВМассивРесурсов(ДанныеАудио.ЭлементРесурса, РесурсыКурса, "Описание"); 
						КонецЕсли;
						
						ДобавитьЭлементПоиска(ЭлементыПоиска, СтруктураСлайда.uuid, Строка.Наименование, ДанныеФорматированногоДокумента.ТекстовыеДанные);
						
					КонецЕсли;
					
				КонецЕсли;				
				
				СтруктураСлайда.Вставить("audio", СтруктураАудио);			
				
				ДобавитьРесурсВМассивРесурсов(РесурсСАудио, РесурсыКурса);  
				
			КонецЕсли;				
			
			// Слайды презентаций (IMAGE)
			
			Если Строка.ТипЭлемента = Перечисления.ТипыЭлементовСодержанияЭлектронногоКурса.СлайдПрезентацииPowerPoint
				ИЛИ Строка.ТипЭлемента = Перечисления.ТипыЭлементовСодержанияЭлектронногоКурса.СлайдПрезентацииImpress Тогда
				
				СтруктураСлайда.Вставить("type", "IMAGE");
				
				РесурсСКартинками = ДанныеЭлектронногоКурса.Презентация;
				
				СтруктураКартинки = Новый Структура;
				СтруктураКартинки.Вставить("path", Строка(РесурсСКартинками.УникальныйИдентификатор()) + "/" + Строка.ПараметрыЗапуска);
				
				СтруктураСлайда.Вставить("image", СтруктураКартинки);
				
				ДобавитьРесурсВМассивРесурсов(РесурсСКартинками, РесурсыКурса);
				
			КонецЕсли;
			
			// SCO
			
			Если Строка.ТипЭлемента = Перечисления.ТипыЭлементовСодержанияЭлектронногоКурса.SCO Тогда
				
				СтруктураСлайда.Вставить("type", "SCO");
				
				РесурсSCO = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.СсылкаНаЭлемент, "Владелец");
				
				// ДеревоЭлементовРесурсаSCO - это переменная выше, в которой запоминается дерево ресурса SCO,
				// так как он один на весь курс.
				
				ПутьКЭлементу = Справочники.ЭлектронныеРесурсы.ОтносительныйПутьКЭлементуРесурса(Строка.СсылкаНаЭлемент, ДеревоЭлементовРесурсаSCO);
				
				СтруктураSCO = Новый Структура;
				СтруктураSCO.Вставить("path", ПутьКЭлементу);
				СтруктураSCO.Вставить("parameters", Строка.ПараметрыЗапуска);
				СтруктураSCO.Вставить("attemptLimit", Строка.КоличествоПопыток);
				СтруктураSCO.Вставить("limitConditions", Строка.ПродолжительностьПопытки);
				СтруктураSCO.Вставить("completionThreshold", Строка.ПорогВыполнения);
				СтруктураSCO.Вставить("dataFromLMS", Строка.ДанныеИнициализации);
				СтруктураSCO.Вставить("timeLimitAction", Перечисления.ДействияПослеИстеченияВремениЭлектронногоКурса.ЗначениеSCORM(Строка.ДействиеПослеИстеченияВремени));
				
				СтруктураСлайда.Вставить("sco", СтруктураSCO);

				ДобавитьРесурсВМассивРесурсов(РесурсSCO, РесурсыКурса);
				
			КонецЕсли;			
			
			// HTML
			
			Если Строка.ТипЭлемента = Перечисления.ТипыЭлементовСодержанияЭлектронногоКурса.HTML Тогда
				
				СтруктураСлайда.Вставить("type", "HTML");
				
				Если ТипЗнч(Строка.СсылкаНаЭлемент) = Тип("СправочникСсылка.ТеорияЭлектронныхКурсов") Тогда
					РесурсHTML = Справочники.ТеорияЭлектронныхКурсов.ЕдинственныйЭлемент(Строка.СсылкаНаЭлемент);
					ПутьКЭлементу = Строка(РесурсHTML.УникальныйИдентификатор()) + "/index.html";
				ИначеЕсли ТипЗнч(Строка.СсылкаНаЭлемент) = Тип("СправочникСсылка.ЭлементыЭлектронныхРесурсов") Тогда
					РесурсHTML = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.СсылкаНаЭлемент, "Владелец");				
					ПутьКЭлементу = Справочники.ЭлектронныеРесурсы.ОтносительныйПутьКЭлементуРесурса(Строка.СсылкаНаЭлемент);
				Иначе
					ВызватьИсключение НСтр("ru = 'Неизвестный тип ресурса HTML'");
				КонецЕсли;
				
				ДобавитьРесурсВМассивРесурсов(РесурсHTML, РесурсыКурса);
				
				СтруктураHTML = Новый Структура;
				СтруктураHTML.Вставить("path", ПутьКЭлементу);				
				
				СтруктураСлайда.Вставить("html", СтруктураHTML);
				
			КонецЕсли;			
			
			// PDF
			
			Если Строка.ТипЭлемента = Перечисления.ТипыЭлементовСодержанияЭлектронногоКурса.PDF Тогда
				
				СтруктураСлайда.Вставить("type", "PDF");
				
				РесурсPDF = Справочники.ТеорияЭлектронныхКурсов.ЕдинственныйЭлемент(Строка.СсылкаНаЭлемент);
				НеобходимыеДанныеЭлементаРесурса = Новый Структура;
				НеобходимыеДанныеЭлементаРесурса.Вставить("ЭлементРесурса", "ЕдинственныйЭлемент");
				НеобходимыеДанныеЭлементаРесурса.Вставить("ИмяФайла","ЕдинственныйЭлемент.ИмяФайла");
				ДанныеЭлементаРесурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РесурсPDF, НеобходимыеДанныеЭлементаРесурса);						
				
				ПутьКЭлементу = Справочники.ЭлектронныеРесурсы.ОтносительныйПутьКЭлементуРесурса(ДанныеЭлементаРесурса.ЭлементРесурса);
				
				СтруктураPDF = Новый Структура;
				СтруктураPDF.Вставить("path", ПутьКЭлементу);
				
				СтруктураСлайда.Вставить("pdf", СтруктураPDF);

				ДобавитьРесурсВМассивРесурсов(РесурсPDF, РесурсыКурса);				
				
			КонецЕсли;			
			
			// IMAGE
			
			Если Строка.ТипЭлемента = Перечисления.ТипыЭлементовСодержанияЭлектронногоКурса.Картинка Тогда
				
				СтруктураСлайда.Вставить("type", "IMAGE");
				
				РесурсIMAGE = Справочники.ТеорияЭлектронныхКурсов.ЕдинственныйЭлемент(Строка.СсылкаНаЭлемент);
				НеобходимыеДанныеЭлементаРесурса = Новый Структура;
				НеобходимыеДанныеЭлементаРесурса.Вставить("ЭлементРесурса", "ЕдинственныйЭлемент");
				НеобходимыеДанныеЭлементаРесурса.Вставить("ИмяФайла","ЕдинственныйЭлемент.ИмяФайла");
				ДанныеЭлементаРесурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РесурсIMAGE, НеобходимыеДанныеЭлементаРесурса);						
				
				ПутьКЭлементу = Справочники.ЭлектронныеРесурсы.ОтносительныйПутьКЭлементуРесурса(ДанныеЭлементаРесурса.ЭлементРесурса);
				
				СтруктураIMAGE = Новый Структура;
				СтруктураIMAGE.Вставить("path", ПутьКЭлементу);
				
				СтруктураСлайда.Вставить("image", СтруктураIMAGE);

				ДобавитьРесурсВМассивРесурсов(РесурсIMAGE, РесурсыКурса);				
				
			КонецЕсли;	
			
			// ARCHIVE
			
			Если Строка.ТипЭлемента = Перечисления.ТипыЭлементовСодержанияЭлектронногоКурса.Архив Тогда
				
				СтруктураСлайда.Вставить("type", "ARCHIVE");
				
				РесурсАрхива = Справочники.ТеорияЭлектронныхКурсов.ЕдинственныйЭлемент(Строка.СсылкаНаЭлемент);
				НеобходимыеДанныеЭлементаРесурса = Новый Структура;
				НеобходимыеДанныеЭлементаРесурса.Вставить("ЭлементРесурса", "ЕдинственныйЭлемент");
				НеобходимыеДанныеЭлементаРесурса.Вставить("ИмяФайла","ЕдинственныйЭлемент.ИмяФайла");
				НеобходимыеДанныеЭлементаРесурса.Вставить("Описание", "ЕдинственныйЭлемент.Описание");
				ДанныеЭлементаРесурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РесурсАрхива, НеобходимыеДанныеЭлементаРесурса);						
				
				ПутьКЭлементу = Справочники.ЭлектронныеРесурсы.ОтносительныйПутьКЭлементуРесурса(ДанныеЭлементаРесурса.ЭлементРесурса);
				
				СтруктураАрхива = Новый Структура;
				СтруктураАрхива.Вставить("path", ПутьКЭлементу);				

				ОписаниеАрхиваФорматированныйДокумент = ДанныеЭлементаРесурса.Описание.Получить();
				
				Если ОписаниеАрхиваФорматированныйДокумент <> Неопределено Тогда
					
					ОтносительныйПутьККаталогуРесурсов = ИзучениеЭлектронныхКурсовСлужебныйКлиентСервер.ОтносительныйАдресКаталогаРесурсовКурса(ЭлектронныйКурс);
					ДанныеФорматированногоДокумента = ЭлектронноеОбучениеСлужебный.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ОписаниеАрхиваФорматированныйДокумент, ДанныеЭлементаРесурса.ЭлементРесурса.УникальныйИдентификатор(), "Описание",,,ОтносительныйПутьККаталогуРесурсов);
					
					Если НЕ ЭлектронноеОбучениеСлужебный.ЭтоПустойHTMLДокумент(ДанныеФорматированногоДокумента.ПредставлениеHTML) Тогда
						
						ДанныеДокумента = Новый Структура;
						ДанныеДокумента.Вставить("encoded", Истина);
						ДанныеДокумента.Вставить("data", ЭлектронноеОбучениеСлужебный.Base64ИзСтроки(ДанныеФорматированногоДокумента.ПредставлениеHTML));
						
						СтруктураАрхива.Вставить("description", ДанныеДокумента);
						
						Если ДанныеФорматированногоДокумента.ЕстьВложения Тогда
							ДобавитьРесурсВМассивРесурсов(ДанныеЭлементаРесурса.ЭлементРесурса, РесурсыКурса, "Описание"); 
						КонецЕсли;
						
						ДобавитьЭлементПоиска(ЭлементыПоиска, СтруктураСлайда.uuid, Строка.Наименование, ДанныеФорматированногоДокумента.ТекстовыеДанные);
						
					КонецЕсли;
					
				КонецЕсли;						
				
				СтруктураСлайда.Вставить("archive", СтруктураАрхива);

				ДобавитьРесурсВМассивРесурсов(РесурсАрхива, РесурсыКурса);				
				
			КонецЕсли;			
			
			// COLLECTION
			
			Если Строка.ТипЭлемента = Перечисления.ТипыЭлементовСодержанияЭлектронногоКурса.ПрезентацияPowerPoint
				ИЛИ Строка.ТипЭлемента = Перечисления.ТипыЭлементовСодержанияЭлектронногоКурса.ПрезентацияImpress Тогда
				
				Подборка = Строка.СсылкаНаЭлемент;		
				
				РесурсПрезентации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подборка, "Презентация");
				ДобавитьРесурсВМассивРесурсов(РесурсПрезентации, РесурсыКурса);				
				
				СтруктураПодборки = Новый Структура;
				СтруктураПодборки.Вставить("uuid", Подборка.УникальныйИдентификатор());		
				СтруктураПодборки.Вставить("elements", Новый Массив);
				
				СтруктураСлайда.Вставить("type", "COLLECTION");
				СтруктураСлайда.Вставить("collection", СтруктураПодборки);			
	
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	СтраницыЭлементовЭлектронныхКурсов.ПараметрыЗапуска КАК ПараметрыЗапуска,
					|	СтраницыЭлементовЭлектронныхКурсов.Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.СтраницыЭлементовЭлектронныхКурсов КАК СтраницыЭлементовЭлектронныхКурсов
					|ГДЕ
					|	СтраницыЭлементовЭлектронныхКурсов.Владелец = &Подборка
					|	И СтраницыЭлементовЭлектронныхКурсов.ЭтоГруппа = ЛОЖЬ
					|	И СтраницыЭлементовЭлектронныхКурсов.ПометкаУдаления = ЛОЖЬ
					|
					|УПОРЯДОЧИТЬ ПО
					|	СтраницыЭлементовЭлектронныхКурсов.Код";
				
				Запрос.УстановитьПараметр("Подборка", Подборка);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

					СтруктураКартинки = Новый Структура("path");
					СтруктураКартинки.path = Строка(РесурсПрезентации.УникальныйИдентификатор()) + "/" + ВыборкаДетальныеЗаписи.ПараметрыЗапуска;					
					
					СтруктураЭлементаПодборки = Новый Структура;
					СтруктураЭлементаПодборки.Вставить("uuid", ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор());
					СтруктураЭлементаПодборки.Вставить("type", "IMAGE");
					СтруктураЭлементаПодборки.Вставить("image", СтруктураКартинки);					
					
					СтруктураПодборки.elements.Добавить(СтруктураЭлементаПодборки);
					
				КонецЦикла;
				
			КонецЕсли;
			
			МассивСлайдов.Добавить(СтруктураСлайда);
			
		КонецЦикла;
		
	КонецЕсли;
		
	// Финальный слайд
	
	Если ДанныеЭлектронногоКурса.Свойство("ФинальнаяСтраницаЭлемент") И ЗначениеЗаполнено(ДанныеЭлектронногоКурса.ФинальнаяСтраницаЭлемент) Тогда
		
		ФорматированныйДокументИзБазы = Справочники.ЭлементыЭлектронныхРесурсов.ДанныеЭлементаДляВыгрузки(ДанныеЭлектронногоКурса.ФинальнаяСтраницаЭлемент, Перечисления.ТипыЭлементовЭлектронныхРесурсов.Text);
		ОтносительныйПутьККаталогуРесурсов = ИзучениеЭлектронныхКурсовСлужебныйКлиентСервер.ОтносительныйАдресКаталогаРесурсовКурса(ЭлектронныйКурс);
		ДанныеФорматированногоДокумента = ЭлектронноеОбучениеСлужебный.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ФорматированныйДокументИзБазы, ДанныеЭлектронногоКурса.ФинальнаяСтраница.УникальныйИдентификатор(),,,,ОтносительныйПутьККаталогуРесурсов);
		
		Если НЕ ЭлектронноеОбучениеСлужебный.ЭтоПустойHTMLДокумент(ДанныеФорматированногоДокумента.ПредставлениеHTML) Тогда // Пустой слайд не делаем
			
			СтруктураСлайда = Новый Структура;
			СтруктураСлайда.Вставить("uuid", Строка(ЭлектронныйКурс.УникальныйИдентификатор())+ "-final");
			СтруктураСлайда.Вставить("type", "FINAL");		
			
			ДанныеДокумента = Новый Структура;
			ДанныеДокумента.Вставить("encoded", Истина);
			ДанныеДокумента.Вставить("data", ЭлектронноеОбучениеСлужебный.Base64ИзСтроки(ДанныеФорматированногоДокумента.ПредставлениеHTML));
			
			СтруктураСлайда.Вставить("text", ДанныеДокумента);
			
			Если ДанныеФорматированногоДокумента.ЕстьВложения Тогда
				ДобавитьРесурсВМассивРесурсов(ДанныеЭлектронногоКурса.ФинальнаяСтраница, РесурсыКурса); 
			КонецЕсли;		
			
			МассивСлайдов.Добавить(СтруктураСлайда);
			
		КонецЕсли;
			
	КонецЕсли;
	
	// Формируем иерархическое содержание для учебников
	//
	
	Если ДанныеЭлектронногоКурса.Тип = Перечисления.ТипыЭлектронныхКурсов.Учебник
		И ФрагментКурса = Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СодержаниеЭлектронныхКурсов.Ссылка КАК Ссылка,
			|	СодержаниеЭлектронныхКурсов.Наименование КАК Наименование,
			|	СодержаниеЭлектронныхКурсов.ЭтоГруппа КАК ЭтоГруппа,
			|	СодержаниеЭлектронныхКурсов.Родитель КАК Группа,
			|	СодержаниеЭлектронныхКурсов.Скрытый КАК Скрытый
			|ИЗ
			|	Справочник.СодержаниеЭлектронныхКурсов КАК СодержаниеЭлектронныхКурсов
			|ГДЕ
			|	СодержаниеЭлектронныхКурсов.Владелец = &ЭлектронныйРесурс
			|	И СодержаниеЭлектронныхКурсов.ПометкаУдаления = ЛОЖЬ
			|
			|УПОРЯДОЧИТЬ ПО
			|	СодержаниеЭлектронныхКурсов.Код ИЕРАРХИЯ,
			|	Наименование ИЕРАРХИЯ";

		Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйКурс);
		Результат = Запрос.Выполнить();
		ДеревоСодержанияВыгрузка = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		ЭлементыДереваСодержания = Новый Массив;		
		ЗаполнитьЭлементыДереваСодержания(ЭлементыДереваСодержания, ДеревоСодержанияВыгрузка.Строки, 1);
		
		ДеревоСодержанияСтруктура = Новый Структура;
		ДеревоСодержанияСтруктура.Вставить("elements", ЭлементыДереваСодержания);
		
		СтруктураКурса.Вставить("toc", ДеревоСодержанияСтруктура);		
		
	КонецЕсли;	
	
	// Добавляем глоссарий
	//	
	
	Если ЗначениеЗаполнено(ДанныеЭлектронногоКурса.Глоссарий) Тогда
		
		СтруктураКурса.Вставить("glossary", Строка(ДанныеЭлектронногоКурса.Глоссарий.УникальныйИдентификатор()));
		
		СтруктураСлайда = Новый Структура;
		СтруктураСлайда.Вставить("uuid", Строка(ДанныеЭлектронногоКурса.Глоссарий.УникальныйИдентификатор()));
		СтруктураСлайда.Вставить("type", "GLOSSARY");		
		СтруктураСлайда.Вставить("hidden", Истина); // Слайд с глоссарием всегда скрыт
		
		СтруктураГлоссария = Новый Структура;
		
		ДанныеГлоссария = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЭлектронногоКурса.Глоссарий, "СоздаватьСсылки, ПоказыватьКоманду");
		
		СтруктураГлоссария.Вставить("displayCommand", ДанныеГлоссария.ПоказыватьКоманду);
		СтруктураГлоссария.Вставить("doLinks", ДанныеГлоссария.СоздаватьСсылки);
		
		МассивТерминов = Новый Массив;
		
		ДанныеТерминов = Справочники.ЭлектронныеГлоссарии.Термины(ДанныеЭлектронногоКурса.Глоссарий, Ложь, Истина);
		
		Для каждого ДанныеТермина Из ДанныеТерминов Цикл
		
			СтруктураТермина = Новый Структура;
			СтруктураТермина.Вставить("uuid", Строка(ДанныеТермина.Термин.УникальныйИдентификатор()));
			СтруктураТермина.Вставить("title", ДанныеТермина.Наименование);
			СтруктураТермина.Вставить("letter", ДанныеТермина.БукваДляПоиска);
			
			ОтносительныйПутьККаталогуРесурсов = ИзучениеЭлектронныхКурсовСлужебныйКлиентСервер.ОтносительныйАдресКаталогаРесурсовКурса(ЭлектронныйКурс);
			ФорматированныйДокументОпределения = ДанныеТермина.Определение.Получить();
			ДанныеФорматированногоДокумента = ЭлектронноеОбучениеСлужебный.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ФорматированныйДокументОпределения, ДанныеТермина.Термин.УникальныйИдентификатор(),,,,ОтносительныйПутьККаталогуРесурсов);
			
			Если ДанныеФорматированногоДокумента.ЕстьВложения Тогда
				ДобавитьРесурсВМассивРесурсов(ДанныеТермина.Термин, РесурсыКурса); 
			КонецЕсли;
			
			ДанныеОпределения = Новый Структура;
			ДанныеОпределения.Вставить("encoded", Истина);
			ДанныеОпределения.Вставить("data", ЭлектронноеОбучениеСлужебный.Base64ИзСтроки(ДанныеФорматированногоДокумента.ПредставлениеHTML));
			
			СтруктураТермина.Вставить("description", ДанныеОпределения);
			СтруктураТермина.Вставить("makeLinks", ДанныеТермина.СоздаватьСсылки);
			СтруктураТермина.Вставить("numberLinks", ДанныеТермина.КоличествоСсылок);
			
			МассивСинонимов = Новый Массив;
			
			Для каждого ДанныеСинонима Из ДанныеТермина.Синонимы Цикл
				СтруктураСинонима = Новый Структура;
				СтруктураСинонима.Вставить("title", ДанныеСинонима.Представление);
				СтруктураСинонима.Вставить("letter", ДанныеСинонима.БукваДляПоиска);				
				МассивСинонимов.Добавить(СтруктураСинонима);
			КонецЦикла;
			
			СтруктураТермина.Вставить("synonyms", МассивСинонимов);
			
			МассивТерминов.Добавить(СтруктураТермина);
			
		КонецЦикла;
		
		СтруктураГлоссария.Вставить("terms", МассивТерминов);	
			
		СтруктураСлайда.Вставить("glossary", СтруктураГлоссария);
		
		МассивСлайдов.Добавить(СтруктураСлайда);
		
	КонецЕсли;
	
	// Формируем список ссылок
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Гиперссылки.Адрес КАК Адрес,
		|	Гиперссылки.ЭлементСодержания КАК ЭлементСодержания,
		|	Гиперссылки.Страница КАК Страница
		|ИЗ
		|	Справочник.ЭлементыЭлектронныхРесурсов.Гиперссылки КАК Гиперссылки
		|ГДЕ
		|	Гиперссылки.ЭлементСодержания.Владелец = &ЭлектронныйКурс";
	
	Запрос.УстановитьПараметр("ЭлектронныйКурс", ЭлектронныйКурс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивГиперссылок = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураГиперссылки = Новый Структура;
		СтруктураГиперссылки.Вставить("href", ВыборкаДетальныеЗаписи.Адрес);
		СтруктураГиперссылки.Вставить("slide", ВыборкаДетальныеЗаписи.ЭлементСодержания.УникальныйИдентификатор());
		СтруктураГиперссылки.Вставить("collectionElement", ВыборкаДетальныеЗаписи.Страница.УникальныйИдентификатор());
		МассивГиперссылок.Добавить(СтруктураГиперссылки);
	КонецЦикла;
	
	СтруктураКурса.Вставить("links", МассивГиперссылок);
	
	// Формируем результат для возврата
	//

	ДанныеДляВозврата = ПустаяСтруктураДанныхПубликации();	
	ДанныеДляВозврата.СтруктураКурса = "var courseData = " + ЭлектронноеОбучениеСлужебный.ДанныеВJSON(СтруктураКурса) + ";";	
	ДанныеДляВозврата.Ресурсы = Новый ФиксированныйМассив(РесурсыКурса);
	ДанныеДляВозврата.ДатаИзменения = ДатаИзменения;
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеДляВозврата);
	
КонецФункции

Процедура ДобавитьЭлементПоиска(ЭлементыПоиска, ИдентификаторСлайда, Заголовок, ТекстовыеДанные)
	
	Если ЭлементыПоиска = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементПоиска = Новый Структура;
	ЭлементПоиска.Вставить("slide", ИдентификаторСлайда); 
	ЭлементПоиска.Вставить("title", Заголовок);
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("encoded", Истина);
	ДанныеДокумента.Вставить("data", ЭлектронноеОбучениеСлужебный.Base64ИзСтроки(ТекстовыеДанные));	
	
	ЭлементПоиска.Вставить("text", ДанныеДокумента);
	
	ЭлементыПоиска.Добавить(ЭлементПоиска);
	
КонецПроцедуры

Процедура ЗаполнитьЭлементыДереваСодержания(МассивЭлементов, ТекущиеСтрокиДерева, ТекущийУровеньДерева)
	
	Для каждого Строка Из ТекущиеСтрокиДерева Цикл
	
		ЭлементСтруктура = Новый Структура;
		ЭлементСтруктура.Вставить("title", Строка.Наименование);
		ЭлементСтруктура.Вставить("uuid", Строка(Строка.Ссылка.УникальныйИдентификатор()));
		ЭлементСтруктура.Вставить("hidden", Строка.Скрытый);
		ЭлементСтруктура.Вставить("slide", Строка(Строка.Ссылка.УникальныйИдентификатор()));		
		ЭлементСтруктура.Вставить("isFolder", Строка.ЭтоГруппа);
		
		ЭлементСтруктура.Вставить("elements", Новый Массив);
		
		Если ЗначениеЗаполнено(Строка.Группа) Тогда
			ЭлементСтруктура.Вставить("parent", Строка(Строка.Группа.УникальныйИдентификатор()));
			ЭлементСтруктура.Вставить("opened", ?(ТекущийУровеньДерева > 2, Ложь, Истина));
		Иначе
			ЭлементСтруктура.Вставить("parent", "");
			ЭлементСтруктура.Вставить("opened", Ложь);
		КонецЕсли;
		
		Если Строка.ЭтоГруппа Тогда			
			ЗаполнитьЭлементыДереваСодержания(ЭлементСтруктура.elements, Строка.Строки, ТекущийУровеньДерева + 1);
		КонецЕсли;			
		
		МассивЭлементов.Добавить(ЭлементСтруктура);
		
	КонецЦикла;	
	
КонецПроцедуры

// Возвращает пустую структуру данных курса, которая используется для его просмотра и публикации.
//
// Возвращаемое значение:
//  Структура - данные курса.
//
Функция ПустаяСтруктураДанныхПубликации() Экспорт
	Возврат Новый Структура("СтруктураКурса, Ресурсы, ДатаИзменения");
КонецФункции

// Возвращает данные публикации тестовых вопросов.
// Данные вопросов могут быть использованы в тестах и подборках.
//
// Параметры:
//   МассивВопросов - Массив - массив элементов типа СправочникСсылка.ТестовыеВопросы.
//   РесурсыКурса  - Массив - будет заполнен ресурсами вопросов.
//   ЭлектронныйКурс  - СправочникСсылка.ЭлектронныеКурсы - электронный курс с вопросами.
//
// Возвращаемое значение:
//  Массив - данные для публикации вопросов.
//
Функция СтруктураТестовыхВопросовДляПросмотра(МассивВопросов, РесурсыКурса, ЭлектронныйКурс)
	
	Вопросы = Новый Массив;
	
	ДанныеВопросов = Справочники.ТестовыеВопросы.ДанныеВопросаДляПросмотра(МассивВопросов);
			
	Для каждого СтрокаТВ Из ДанныеВопросов.Вопросы Цикл
		
		// Формируем основные свойства вопроса
		
		ФорматированныйДокументЗадания = СтрокаТВ.Задание.Получить();
		ОтносительныйПутьККаталогуРесурсов = ИзучениеЭлектронныхКурсовСлужебныйКлиентСервер.ОтносительныйАдресКаталогаРесурсовКурса(ЭлектронныйКурс);
		ДанныеФорматированногоДокументаЗадания = ЭлектронноеОбучениеСлужебный.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ФорматированныйДокументЗадания, СтрокаТВ.Ссылка.УникальныйИдентификатор(),,,,ОтносительныйПутьККаталогуРесурсов);
		
		Если ДанныеФорматированногоДокументаЗадания.ЕстьВложения Тогда
			ДобавитьРесурсВМассивРесурсов(СтрокаТВ.Ссылка, РесурсыКурса);
		КонецЕсли;
		
		ЗаданиеВопроса = Новый Структура;
		ЗаданиеВопроса.Вставить("encoded", Истина);
		ЗаданиеВопроса.Вставить("data", ЭлектронноеОбучениеСлужебный.Base64ИзСтроки(ДанныеФорматированногоДокументаЗадания.ПредставлениеHTML));
		
		СтруктураВопроса = Новый Структура;
	    СтруктураВопроса.Вставить("uuid", СтрокаТВ.Ссылка.УникальныйИдентификатор());
		СтруктураВопроса.Вставить("type", Перечисления.ТипыТестовыхВопросов.ТипВопросаВСтроку(СтрокаТВ.ТипВопроса));
		СтруктураВопроса.Вставить("task", ЗаданиеВопроса);
		
		// Ищем все варианты ответов вопроса
		
		ВариантыОтветовВопроса = ДанныеВопросов.Варианты.НайтиСтроки(Новый Структура("Вопрос", СтрокаТВ.Ссылка));
		
		// Формируем картинку задания для вопроса с выбором варианта на картинке
		
		Если СтрокаТВ.ТипВопроса = Перечисления.ТипыТестовыхВопросов.ОдинИзМногихНаКартинке Тогда
			ДвоичныеДанныеКартинкиЗадания = СтрокаТВ.Картинка.Получить();
			Если ДвоичныеДанныеКартинкиЗадания <> Неопределено Тогда
				КартинкаЗадания = Новый Картинка(ДвоичныеДанныеКартинкиЗадания);
				ОписаниеКартинкиЗадания = Новый Структура();
				ОписаниеКартинкиЗадания.Вставить("path", Строка(СтруктураВопроса.uuid) + "/task"
					+ ЭлектронноеОбучениеСлужебныйКлиентСервер.РасширениеКартинки(КартинкаЗадания.Формат()));
				РазмерыКартинки = ЭлектронноеОбучениеСлужебный.РазмерыКартинки(КартинкаЗадания);	
				ОписаниеКартинкиЗадания.Вставить("width", РазмерыКартинки.Ширина); 
				ОписаниеКартинкиЗадания.Вставить("height", РазмерыКартинки.Высота);
				ОбластиКартинки = Новый Массив;
				Для каждого СтрокаТВВ Из ВариантыОтветовВопроса Цикл
					ОбластьКартинки = Новый Структура("href, shape, coords");
					ОбластьКартинки.href = СтрокаТВВ.Ссылка.УникальныйИдентификатор();
					ОбластьКартинки.coords = СтрокаТВВ.ОбластьНаКартинке;
					Если РазработкаЭлектронныхКурсовСлужебныйКлиентСервер.ЭтоОбластьНаКартинкеКруг(ОбластьКартинки.coords) Тогда
						ОбластьКартинки.shape = "circle";
					Иначе
						ОбластьКартинки.shape = "rect";
					КонецЕсли;
					ОбластиКартинки.Добавить(ОбластьКартинки);
				КонецЦикла;
				ОписаниеКартинкиЗадания.Вставить("areas", ОбластиКартинки); 
				СтруктураВопроса.Вставить("image", ОписаниеКартинкиЗадания);
				ДобавитьРесурсВМассивРесурсов(СтрокаТВ.Ссылка, РесурсыКурса);
			КонецЕсли;			
		КонецЕсли;		
		
		// Заполняем варианты ответов
		
		МассивВариантовОтветов = Новый Массив;
		
		Для каждого СтрокаТВВ Из ВариантыОтветовВопроса Цикл
			
			Если СтрокаТВВ.ЭтоЭлементСоответствия Тогда
				Продолжить;
			КонецЕсли;
			
			ТекстВарианта = Новый Структура;
			ТекстВарианта.Вставить("encoded", Истина);
			Если ТипЗнч(СтрокаТВВ.ТекстВарианта) = Тип("ХранилищеЗначения") Тогда
				ТекстВарианта.Вставить("data", ЭлектронноеОбучениеСлужебный.Base64ИзСтроки(СтрокаТВВ.ТекстВарианта.Получить()));
			Иначе
				Продолжить;
			КонецЕсли;
			
			СтруктураВарианта = Новый Структура;
			СтруктураВарианта.Вставить("uuid", СтрокаТВВ.Ссылка.УникальныйИдентификатор());
			СтруктураВарианта.Вставить("text", ТекстВарианта);
			СтруктураВарианта.Вставить("correct", СтрокаТВВ.Верный);
			
			Если СтрокаТВ.ТипВопроса = Перечисления.ТипыТестовыхВопросов.ВводСКлавиатуры Тогда
				СтруктураВарианта.Вставить("input", ЭлектронноеОбучениеСлужебныйКлиентСервер.ЧислоВСтроку(СтрокаТВВ.НомерПоляВвода));
			КонецЕсли;
			
			Картинка = СтрокаТВВ.Картинка.Получить();
			Если Картинка <> Неопределено Тогда
				Картинка = Новый Картинка(Картинка);
				ОписаниеКартинки = Новый Структура("path", Строка(СтруктураВопроса.uuid) + "/variant" + ЭлектронноеОбучениеСлужебныйКлиентСервер.ЧислоВСтроку(СтрокаТВВ.Код) + ЭлектронноеОбучениеСлужебныйКлиентСервер.РасширениеКартинки(Картинка.Формат()));				
				СтруктураВарианта.Вставить("image", ОписаниеКартинки);
				ДобавитьРесурсВМассивРесурсов(СтрокаТВ.Ссылка, РесурсыКурса);
			КонецЕсли;
			
			МассивВариантовОтветов.Добавить(СтруктураВарианта);
			
		КонецЦикла;
		
		СтруктураВопроса.Вставить("variants", МассивВариантовОтветов);

		// Заполняем элементы соответствия
		
		Если СтрокаТВ.ТипВопроса = Перечисления.ТипыТестовыхВопросов.Соответствие Тогда
			
			СтруктураЭлементовСоответствия = Новый Структура;
			
			Если ЗначениеЗаполнено(СтрокаТВ.НаименованиеКолонкиЭлементов) Тогда			
				НаименованиеКолонкиЭлементов = Новый Структура;
				НаименованиеКолонкиЭлементов.Вставить("encoded", Истина);
				НаименованиеКолонкиЭлементов.Вставить("data", ЭлектронноеОбучениеСлужебный.Base64ИзСтроки(СтрокаТВ.НаименованиеКолонкиЭлементов));
				СтруктураЭлементовСоответствия.Вставить("elementsTitle", НаименованиеКолонкиЭлементов);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТВ.НаименованиеКолонкиВариантов) Тогда			
				НаименованиеКолонкиВариантов = Новый Структура;
				НаименованиеКолонкиВариантов.Вставить("encoded", Истина);
				НаименованиеКолонкиВариантов.Вставить("data", ЭлектронноеОбучениеСлужебный.Base64ИзСтроки(СтрокаТВ.НаименованиеКолонкиВариантов));
				СтруктураЭлементовСоответствия.Вставить("variantsTitle", НаименованиеКолонкиВариантов);
			КонецЕсли;
			
			МассивЭлементовСоответствия = Новый Массив;
			
			НомерСимвола = 65;
			Для каждого СтрокаТВВ Из ВариантыОтветовВопроса Цикл
				
				Если НЕ СтрокаТВВ.ЭтоЭлементСоответствия Тогда
					Продолжить;
				КонецЕсли;
				
				ТекстВарианта = Новый Структура;
				ТекстВарианта.Вставить("encoded", Истина);
				Если ТипЗнч(СтрокаТВВ.ТекстВарианта) = Тип("ХранилищеЗначения") Тогда
					ТекстВарианта.Вставить("data", ЭлектронноеОбучениеСлужебный.Base64ИзСтроки(СтрокаТВВ.ТекстВарианта.Получить()));
				Иначе
					Продолжить;
				КонецЕсли;
				
				СтруктураВарианта = Новый Структура;
				СтруктураВарианта.Вставить("uuid", СтрокаТВВ.Ссылка.УникальныйИдентификатор());
				СтруктураВарианта.Вставить("text", ТекстВарианта);
				СтруктураВарианта.Вставить("letter", Символ(НомерСимвола));

				Картинка = СтрокаТВВ.Картинка.Получить();
				Если Картинка <> Неопределено Тогда
					Картинка = Новый Картинка(Картинка);
					ОписаниеКартинки = Новый Структура("path", Строка(СтруктураВопроса.uuid) + "/variant" + ЭлектронноеОбучениеСлужебныйКлиентСервер.ЧислоВСтроку(СтрокаТВВ.Код) + ЭлектронноеОбучениеСлужебныйКлиентСервер.РасширениеКартинки(Картинка.Формат()));				
					СтруктураВарианта.Вставить("image", ОписаниеКартинки);
					ДобавитьРесурсВМассивРесурсов(СтрокаТВ.Ссылка, РесурсыКурса);
				КонецЕсли;				
				
				МассивВариантовЭлементаСоответствия = СтрокаТВВ.ВариантыЭлементаСоответствия.ВыгрузитьКолонку("ВариантОтвета");
				СтруктураВарианта.Вставить("variants", МассивВариантовЭлементаСоответствия);

				МассивЭлементовСоответствия.Добавить(СтруктураВарианта);				
				
				НомерСимвола = НомерСимвола + 1;
				
			КонецЦикла;
			
			СтруктураЭлементовСоответствия.Вставить("elements", МассивЭлементовСоответствия); 
			
			СтруктураВопроса.Вставить("map", СтруктураЭлементовСоответствия);
			
		КонецЕсли;
			
		// Вставляем данные вопросы в общий список
		
		Вопросы.Добавить(СтруктураВопроса);
		
	КонецЦикла;
	
	Возврат Вопросы;
	
КонецФункции

// Получает пустую структуру ресурса с его файлами.
// Ресурс - это каталог с файлами элемента курса.
// Ресурсы выгружаются в локальный кэш на клиенте или на сервере.
// Структура используется для проверки необходимости выгрузки данных,
// и не содержит данные самого ресурса.
//
// В качестве ресурса могут выступать не только элементы справочника,
// ЭлектронныеРесурсы, но и, например, элементы, которые
// содержат форматированный документ с картинками.
//
Функция ПустаяСтруктураДанныхРесурса(Ссылка, КодДанных = "")
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ЭлектронныеРесурсы") Тогда
	
		ДанныеРесурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ДатаИзменения, SCO");		
		ДанныеРесурса.Вставить("Идентификатор", Строка(Ссылка.УникальныйИдентификатор()));		
		
	ИначеЕсли ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Ссылка)) Тогда
		
		ДанныеРесурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ДатаИзменения");		
		ДанныеРесурса.Вставить("Идентификатор", Строка(Ссылка.УникальныйИдентификатор()));
		ДанныеРесурса.Вставить("SCO", Ложь);

	Иначе
		
		ДанныеРесурса = Новый Структура();
		ДанныеРесурса.Вставить("ДатаИзменения", ОбновлениеИнформационнойБазыБЭО.ДатаИзмененияПоставляемыхМакетов());
		ДанныеРесурса.Вставить("Идентификатор", "");
		ДанныеРесурса.Вставить("SCO", Ложь);
		
	КонецЕсли;
	
	СтруктураРесурса = Новый Структура();
	СтруктураРесурса.Вставить("Ссылка", Ссылка);
	СтруктураРесурса.Вставить("Идентификатор", ДанныеРесурса.Идентификатор);
	СтруктураРесурса.Вставить("ДатаИзменения", ДанныеРесурса.ДатаИзменения);
	СтруктураРесурса.Вставить("КодДанных", КодДанных);
	СтруктураРесурса.Вставить("Постфикс", ПостфиксРесурсаДляВыгрузки(КодДанных));
	СтруктураРесурса.Вставить("Размер", 0); // Размер в МБ
	СтруктураРесурса.Вставить("SCO", ДанныеРесурса.SCO); // Это SCO ресурс
	
	Возврат СтруктураРесурса;
	
КонецФункции

// Добавляет ресурс (описание ресурса) в массив, если он не был добавлен в него ранее.
//
Процедура ДобавитьРесурсВМассивРесурсов(Знач Ресурс, МассивРесурсов, КодДанных = "")

	Если НЕ ЗначениеЗаполнено(Ресурс) Тогда
		Возврат;
	КонецЕсли;
	
	ДобавляемыйРесурс = Ресурс;		
	
	Для каждого Элемент Из МассивРесурсов Цикл		
		Если Элемент.Ссылка = ДобавляемыйРесурс И Элемент.КодДанных = КодДанных Тогда
			Возврат; // Ресурс уже добавлен			
		КонецЕсли;		
	КонецЦикла;
	
	СтруктураРесурса = ПустаяСтруктураДанныхРесурса(ДобавляемыйРесурс, КодДанных);
	
	МассивРесурсов.Добавить(СтруктураРесурса);	
			
КонецПроцедуры

// Получает уникальный постфикс ресурса на основе кода данных.
// Используется в том случае, когда "склеиваются" в одном объекте,
// например в вопросе, различные форматированные документы и требуется
// разнести ресурсы из разных документов в разные каталоги.
//
Функция ПостфиксРесурсаДляВыгрузки(КодДанных) Экспорт
	
	Если ЗначениеЗаполнено(КодДанных) Тогда
		Возврат "_" + ЭлектронноеОбучениеСлужебныйКлиентСервер.ЧислоВСтроку(КодСимвола(КодДанных, 1))+Строка(СтрДлина(КодДанных));	
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

// Возвращает данные макета электронного курса.
//
// Возвращаемое значение:
//  ДвоичныеДанные - архив с макетом.
//
Функция МакетЭлектронногоКурса() Экспорт
	
	// Определяем язык
	
	ЯзыкИнтерфейса = РегистрыСведений.НастройкиЭлектронныхКурсов.Значение("ЯзыкИнтерфейса");
	
	Если НЕ ЗначениеЗаполнено(ЯзыкИнтерфейса) Тогда
		
		КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
		КодОсновногоЯзыка = КодОсновногоЯзыка + ВРег(КодОсновногоЯзыка);
		
		ЯзыкИнтерфейсаОбъектМетаданных = Метаданные.Перечисления.ЯзыкиИнтерфейсаЭлектронныхКурсов.ЗначенияПеречисления.Найти(КодОсновногоЯзыка);
		
		Если ЯзыкИнтерфейсаОбъектМетаданных <> Неопределено Тогда
			ЯзыкИнтерфейса = Перечисления.ЯзыкиИнтерфейсаЭлектронныхКурсов[ЯзыкИнтерфейсаОбъектМетаданных.Имя];
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЯзыкИнтерфейса) Тогда
		ЯзыкИнтерфейса = Перечисления.ЯзыкиИнтерфейсаЭлектронныхКурсов.ruRU;
	КонецЕсли;
	
	// Определяем тему
	
	ТемаОформления = РегистрыСведений.НастройкиЭлектронныхКурсов.Значение("ТемаОформления");
	
	Если НЕ ЗначениеЗаполнено(ТемаОформления) Тогда
		ТемаОформления = Перечисления.ТемыОформленияЭлектронныхКурсов.Облако;
	КонецЕсли;
	
	// Получаем макет
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МакетыЭлектронныхКурсов.Макет КАК Макет
		|ИЗ
		|	РегистрСведений.МакетыЭлектронныхКурсов КАК МакетыЭлектронныхКурсов
		|ГДЕ
		|	МакетыЭлектронныхКурсов.Язык = &Язык
		|	И МакетыЭлектронныхКурсов.Тема = &Тема";
	
	Запрос.УстановитьПараметр("Тема", ТемаОформления);
	Запрос.УстановитьПараметр("Язык", ЯзыкИнтерфейса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение НСтр("ru = 'Макет электронного курса не найден'");
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	ВыборкаДетальныеЗаписи.Следующий();
	
	ДвоичныеДанныеАрхиваМакета = ВыборкаДетальныеЗаписи.Макет.Получить();	
	
	// Завершаем
	
	Возврат Новый ФиксированнаяСтруктура(Новый Структура("ДвоичныеДанныеМакета", ДвоичныеДанныеАрхиваМакета));
	
КонецФункции

// Функция возвращает массив файлов с двоичными данными
// для последующей выгрузки в кэш на клиенте или сервере.
//
Функция ДанныеРесурсовДляВыгрузкиВКэш(МассивРесурсов, ЭлектронныйКурс, ИдентификаторФормы = Неопределено) Экспорт
	
	МассивФайлов = Новый Массив();
	
	КоммуникацииСуществуют = ОбщегоНазначения.ПодсистемаСуществует("УправлениеОбучением.Коммуникации");
	
	Если КоммуникацииСуществуют Тогда
		МодульУправленияОбучения = ОбщегоНазначения.ОбщийМодуль("УправлениеОбучениемСУО");
	КонецЕсли;
	
	Для каждого Ресурс Из МассивРесурсов Цикл
				
		Если ТипЗнч(Ресурс.Ссылка) = Тип("СправочникСсылка.ЭлектронныеРесурсы")
			И Ресурс.КодДанных = "" Тогда
			
			ДеревоФайлов        = Справочники.ЭлектронныеРесурсы.ДеревоЭлементов(Ресурс.Ссылка);
			МассивФайловРесурса = Справочники.ЭлектронныеРесурсы.СтруктураФайловРесурса(Ресурс.Ссылка, ДеревоФайлов.Строки, 1, ЭлектронныйКурс, ИдентификаторФормы);			
				
		ИначеЕсли ТипЗнч(Ресурс.Ссылка) = Тип("Строка") Тогда	
			
			МассивФайловРесурса = Новый Массив;
		
			Файл = Справочники.ЭлектронныеРесурсы.ПустаяСтруктураФайлаДляВыгрузки();
			
			Файл.Вставить("ИмяФайла", "");
			Файл.Вставить("ЭтоКаталог", Ложь);
			Файл.Вставить("ДвоичныеДанные", ПолучитьОбщийМакет(Ресурс.Ссылка));
			Файл.Вставить("ТипФайла", ЭлектронноеОбучениеСлужебный.ИмяЗначенияПеречисления(Перечисления.ТипыЭлементовЭлектронныхРесурсов.Folder));
			Файл.Вставить("ПодчиненныеФайлы", Неопределено);
			
			МассивФайловРесурса.Добавить(Файл);			
			
		Иначе
			
			Если ТипЗнч(Ресурс.Ссылка) = Тип("СправочникСсылка.ТестовыеВопросы") Тогда
				
				ФорматированныйДокумент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ресурс.Ссылка, "Задание").Получить();
				
			ИначеЕсли ТипЗнч(Ресурс.Ссылка) = Тип("СправочникСсылка.ТерминыЭлектронныхГлоссариев") Тогда
				
				ФорматированныйДокумент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ресурс.Ссылка, "Определение").Получить();
				
			ИначеЕсли КоммуникацииСуществуют И МодульУправленияОбучения.ЭтоСообщение(Ресурс.Ссылка) Тогда
				
				ФорматированныйДокумент = МодульУправленияОбучения.ФорматированныйДокументСообщения(Ресурс.Ссылка);				
			
			Иначе // Форматированный документ
				
				Если ЗначениеЗаполнено(Ресурс.КодДанных) Тогда
					ФорматированныйДокумент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ресурс.Ссылка, Ресурс.КодДанных);
				Иначе
					ФорматированныйДокумент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ресурс.Ссылка, "ФорматированныйДокумент");
				КонецЕсли;
				
				ФорматированныйДокумент = ФорматированныйДокумент.Получить();
			
			КонецЕсли;
			
			ТекстHTML = Неопределено;
			Вложения  = Неопределено;
			
			ФорматированныйДокумент.ПолучитьHTML(ТекстHTML, Вложения);
			
			Если ТипЗнч(Ресурс.Ссылка) = Тип("СправочникСсылка.ТестовыеВопросы") Тогда // Картинки вариантов
				
				Если Вложения = Неопределено Тогда
					Вложения = Новый Структура;
				КонецЕсли;
				
				ДвоичныеДанныеКартинкиЗадания = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ресурс.Ссылка, "Картинка").Получить();
				Если ДвоичныеДанныеКартинкиЗадания <> Неопределено Тогда
					Вложения.Вставить("task", Новый Картинка(ДвоичныеДанныеКартинкиЗадания));
				КонецЕсли;
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ВариантыОтветовНаТестовыеВопросы.Картинка КАК Картинка,
					|	ВариантыОтветовНаТестовыеВопросы.Код КАК Код
					|ИЗ
					|	Справочник.ВариантыОтветовНаТестовыеВопросы КАК ВариантыОтветовНаТестовыеВопросы
					|ГДЕ
					|	ВариантыОтветовНаТестовыеВопросы.Владелец = &Вопрос";
				
				Запрос.УстановитьПараметр("Вопрос", Ресурс.Ссылка);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					Картинка = ВыборкаДетальныеЗаписи.Картинка.Получить();
					
					Если Картинка <> Неопределено Тогда
						Вложения.Вставить("variant"+ЭлектронноеОбучениеСлужебныйКлиентСервер.ЧислоВСтроку(ВыборкаДетальныеЗаписи.Код), Новый Картинка(Картинка));
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			МассивФайловРесурса = Новый Массив;
			
			Для каждого Вложение Из Вложения Цикл
				
				// Находим имя файла. Имя файла - это ключ вложения,
				// плюс расширение картинки, если это картинка.
				
				Если ТипЗнч(Вложение.Значение) = Тип("Картинка") Тогда
					Расширение = ЭлектронноеОбучениеСлужебныйКлиентСервер.РасширениеКартинки(Вложение.Значение.Формат());
					ИмяФайлаВложения = Вложение.Ключ + Расширение;
				Иначе
					ИмяФайлаВложения = Вложение.Ключ;
				КонецЕсли;
				
				Файл = Справочники.ЭлектронныеРесурсы.ПустаяСтруктураФайлаДляВыгрузки();
				
				Файл.Вставить("ИмяФайла", ИмяФайлаВложения);
				Файл.Вставить("ЭтоКаталог", Ложь);
				Файл.Вставить("ДвоичныеДанные", Вложение.Значение.ПолучитьДвоичныеДанные());
				Файл.Вставить("ТипФайла", ЭлектронноеОбучениеСлужебный.ИмяЗначенияПеречисления(Перечисления.ТипыЭлементовЭлектронныхРесурсов.Image));
				Файл.Вставить("ПодчиненныеФайлы", Неопределено);
				
				МассивФайловРесурса.Добавить(Файл);
								
			КонецЦикла;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ресурс.Идентификатор) Тогда
			
			Каталог = Справочники.ЭлектронныеРесурсы.ПустаяСтруктураФайлаДляВыгрузки();
			Каталог.Вставить("ИмяФайла", Ресурс.Идентификатор+Ресурс.ПостФикс);
			Каталог.Вставить("ЭтоКаталог", Истина);
			Каталог.Вставить("ДвоичныеДанные", Неопределено);
			Каталог.Вставить("ТипФайла", Неопределено);
			
			Каталог.Вставить("ПодчиненныеФайлы", МассивФайловРесурса); // Файлы ресурсы выгружается в каталог ресурса
			
			МассивФайлов.Добавить(Каталог);
			
		Иначе
			
			Для каждого Элемент Из МассивФайловРесурса Цикл
				МассивФайлов.Добавить(Элемент); // Файлы ресурса выгружается в корень каталога ресурсов.
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивФайлов;
	
КонецФункции

#КонецОбласти

#Область Изучение

// Возвращает путь к каталогу, где хранятся электронные курсы.
//
// Параметры:
//   ПутьКОбщемуКаталогу - Строка - путь к общему каталога, где хранятся файлы электронного обучения.
//
// Возвращаемое значение:
//  Строка - Путь к каталогу.
//
Функция ПутьККаталогуЭлектронныхКурсов(Знач ПутьКОбщемуКаталогу) Экспорт
	
	ПутьКОбщемуКаталогу = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКОбщемуКаталогу);
	ИмяОбластиДанных = "";	
	
	// На сервере к относительному пути в томе, где хранятся выгрузки электронных курсов
	// добавляется разделитель сеанса. На клиенте это не требуется.		
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		ИмяОбластиДанных = ЭлектронноеОбучениеСлужебныйКлиентСервер.ЧислоВСтроку(
			РаботаВМоделиСервиса.ЗначениеРазделителяСеанса()
		) + "\";
	КонецЕсли;	
	
	Возврат ЭлектронноеОбучениеСлужебныйКлиентСервер.ПривестиСлэши(
		ПутьКОбщемуКаталогу + ИмяОбластиДанных + ИзучениеЭлектронныхКурсовСлужебныйКлиентСервер.ИмяКаталогаЭлектронныхКурсов() + "\");
	
КонецФункции

Функция ДанныеОбИзученииЭлектронногоКурса(Знач ИзучениеЭлектронногоКурса = Неопределено, Знач ЭлектронныйКурс = Неопределено, Знач Учащийся = Неопределено, Знач Контекст = Неопределено) Экспорт
			
	УстановитьПривилегированныйРежим(Истина);	
	
	Если ЗначениеЗаполнено(ИзучениеЭлектронногоКурса) Тогда
		
		ДанныеИзучения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИзучениеЭлектронногоКурса, "ЭлектронныйКурс, Учащийся, Контекст");
		
		ЭлектронныйКурс = ДанныеИзучения.ЭлектронныйКурс;
		Учащийся = ДанныеИзучения.Учащийся;
		Контекст = ДанныеИзучения.Контекст;
		
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзученныеЭлектронныеКурсы.Завершено КАК Завершено,
		|	ИзученныеЭлектронныеКурсы.Результат КАК Результат,
		|	ИзученныеЭлектронныеКурсы.ИзученоВПроцентах КАК ИзученоВПроцентах,
		|	ИзученныеЭлектронныеКурсы.Регистратор КАК ИзучениеЭлектронногоКурса
		|ИЗ
		|	РегистрСведений.ИзученныеЭлектронныеКурсы КАК ИзученныеЭлектронныеКурсы
		|ГДЕ
		|	ИзученныеЭлектронныеКурсы.ЭлектронныйКурс = &ЭлектронныйКурс
		|	И ИзученныеЭлектронныеКурсы.Учащийся = &Учащийся
		|	И ИзученныеЭлектронныеКурсы.Контекст = &Контекст";
	
	Запрос.УстановитьПараметр("Контекст", Контекст);
	Запрос.УстановитьПараметр("Учащийся", Учащийся);
	Запрос.УстановитьПараметр("ЭлектронныйКурс", ЭлектронныйКурс);
	
	РезультатЗапроса = Запрос.Выполнить();			
	
	ДанныеОбИзучении = Новый Структура();
	
	ДанныеОбИзучении.Вставить("Начато", Ложь);
	ДанныеОбИзучении.Вставить("Завершено", Ложь);
	ДанныеОбИзучении.Вставить("ИзученоВПроцентах", 0);
	ДанныеОбИзучении.Вставить("ЗавершеноВПроцентах", 0);  // Для совместимости
	ДанныеОбИзучении.Вставить("Результат", 0);
	ДанныеОбИзучении.Вставить("Балл", 0);   // Для совместимости
	ДанныеОбИзучении.Вставить("ИзучениеЭлектронногоКурса", Неопределено);	
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ДанныеОбИзучении;
	КонецЕсли;			
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	ВыборкаДетальныеЗаписи.Следующий();	
	
	ДанныеОбИзучении.Вставить("Начато", Истина);
	ДанныеОбИзучении.Вставить("Завершено", ВыборкаДетальныеЗаписи.Завершено);
	ДанныеОбИзучении.Вставить("ИзученоВПроцентах", ВыборкаДетальныеЗаписи.ИзученоВПроцентах);
	ДанныеОбИзучении.Вставить("ЗавершеноВПроцентах", ВыборкаДетальныеЗаписи.ИзученоВПроцентах); // Для совместимости
	ДанныеОбИзучении.Вставить("Результат", ВыборкаДетальныеЗаписи.Результат);
	ДанныеОбИзучении.Вставить("Балл", ВыборкаДетальныеЗаписи.Результат);   // Для совместимости
	ДанныеОбИзучении.Вставить("ИзучениеЭлектронногоКурса", ВыборкаДетальныеЗаписи.ИзучениеЭлектронногоКурса);
	
	Возврат ДанныеОбИзучении;
	
КонецФункции

Процедура СохранитьВБазуДанныеИзучения(Знач ИзучениеЭлектронногоКурса, Знач ДанныеИзучения, Знач ДатаНачалаПопыткиИзучения, Знач ВыполняетсяЗакрытиеФормы) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИзучениеЭлектронногоКурса) Тогда		
		Возврат;		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИзучениеЭлектронногоКурсаОбъект = ИзучениеЭлектронногоКурса.ПолучитьОбъект();
	
	Если ЗначениеЗаполнено(ДанныеИзучения) Тогда
		ИзучениеЭлектронногоКурсаОбъект.ДанныеИзучения = Новый ХранилищеЗначения(ДанныеИзучения);
	КонецЕсли;
	
	ПопыткаИзученияСтрока = ИзучениеЭлектронногоКурсаОбъект.ПопыткиИзучения.Найти(ДатаНачалаПопыткиИзучения, "ДатаНачала");
	
	Если ПопыткаИзученияСтрока = Неопределено Тогда
		ПопыткаИзученияСтрока = ИзучениеЭлектронногоКурсаОбъект.ПопыткиИзучения.Добавить();
		ПопыткаИзученияСтрока.ДатаНачала = ДатаНачалаПопыткиИзучения;		
	КонецЕсли;
	
	ПопыткаИзученияСтрока.ДанныеПопытки = ИзучениеЭлектронногоКурсаОбъект.ДанныеИзучения; // Дублируем данные
	
	Если ВыполняетсяЗакрытиеФормы И НЕ ИзучениеЭлектронногоКурсаОбъект.ПометкаУдаления Тогда
		
		Если ПопыткаИзученияСтрока = Неопределено Тогда
			ВызватьИсключение НСтр("ru = 'Попытка изучения не найдена'");
		Иначе
			ПопыткаИзученияСтрока.ДатаОкончания = ТекущаяДатаСеанса();
		КонецЕсли;		
		
		ИзучениеЭлектронногоКурсаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	Иначе
		
		ИзучениеЭлектронногоКурсаОбъект.Записать(РежимЗаписиДокумента.Запись);
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	// Вызываем событие ПриЗакрытииЭлектронногоКурса переопределяемого модуля
	
	Если ВыполняетсяЗакрытиеФормы Тогда
		
		ЭлектронныйКурс = ИзучениеЭлектронногоКурсаОбъект.ЭлектронныйКурс;
		Учащийся = ИзучениеЭлектронногоКурсаОбъект.Учащийся;
		Контекст = ИзучениеЭлектронногоКурсаОбъект.Контекст;
		
		ДанныеОбИзучении = ДанныеОбИзученииЭлектронногоКурса(,ЭлектронныйКурс, Учащийся, Контекст);
		
		ИзучениеЭлектронныхКурсовПереопределяемый.ПриЗакрытииФормыИзученияЭлектронногоКурса(ЭлектронныйКурс, Контекст, Учащийся, ДанныеОбИзучении);
		
		Если ДанныеОбИзучении.Завершено Тогда
			ИзучениеЭлектронныхКурсовПереопределяемый.ПослеОкончанияИзученияЭлектронногоКурса(ЭлектронныйКурс, Контекст, Учащийся, ДанныеОбИзучении);
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ДанныеИзученияСтруктураИзСтроки(ДанныеИзученияСтрока) Экспорт
	
	СвойстваСДатами = Новый Массив;
	СвойстваСДатами.Добавить("start");
	СвойстваСДатами.Добавить("end");
	
 	Чтение = Новый ЧтениеJSON;
    Чтение.УстановитьСтроку(ДанныеИзученияСтрока);
	ДанныеИзученияСтруктура = ПрочитатьJSON(Чтение, Ложь, , ,"ВосстановлениеЧтенияJSON",ИзучениеЭлектронныхКурсовСлужебный,,СвойстваСДатами);
    Чтение.Закрыть();	
	
	Возврат ДанныеИзученияСтруктура;
	
КонецФункции

Функция ВосстановлениеЧтенияJSON(Свойство, Значение, ДополнительныеПараметры) Экспорт
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат Дата("00010101");
	Иначе		
		Возврат ПрочитатьДатуJSON(Значение, ФорматДатыJSON.ISO);
	КонецЕсли;
КонецФункции

Функция ФайлыВыгружаютсяЛокально() Экспорт
	
	Если СтандартныеПодсистемыСервер.ПараметрыКлиентаНаСервере().Получить("ЭтоВебКлиент") = Истина Тогда		
		Возврат Ложь;
	Иначе		
		Возврат НЕ РегистрыСведений.ОбщиеНастройкиЭлектронногоОбучения.Значение("ИспользоватьОбщийКаталогВТонкомКлиенте");
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти
