
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьПользователейНаСервере();
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьПользователейНаСервере()
	
	ПользователиОтбора = Новый Массив;
	Справочники.ОтборыПользователейСУО.ПользователиОтбора(Параметры.ОтборПользователей, ПользователиОтбора);
	
	ТаблицаПользователей.Очистить();
	
	Для каждого Пользователь Из ПользователиОтбора Цикл
	
		НоваяСтрока = ТаблицаПользователей.Добавить();
		НоваяСтрока.Пользователь = Пользователь;
	
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПользователей(Команда)
	ОбновитьПользователейНаСервере();
КонецПроцедуры
