

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ДобавитьУсловноеОформлениеМероприятия(НовоеМероприятие, ДанныеОМероприятии, ПравоеЗначение, ЦветТекста)
	
	НовоеОформление = УсловноеОформление.Элементы.Добавить();
	
	НовоеОформление.Использование = Истина;
	НовоеОформление.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный; 
	НовоеОформление.ПредставлениеПользовательскойНастройки = "Оформление мероприятия """ + ДанныеОМероприятии.Наименование +""""; 
	
	Отбор = НовоеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ведомость." + ПолучитьИмяРеквизитаМероприятия(НовоеМероприятие));
	Отбор.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование    = Истина;
	Отбор.Представление    = "Ведомость." + ПолучитьИмяРеквизитаМероприятия(НовоеМероприятие);
	Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	Отбор.ПравоеЗначение   = ПравоеЗначение;
	
	Отбор = НовоеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ВыделятьЦветом");
	Отбор.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование    = Истина;
	Отбор.Представление    = "ВыделятьЦветом";
	Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	Отбор.ПравоеЗначение   = Истина;
	
	ЭлементОформленияЦветФона = НовоеОформление.Оформление.Элементы.Найти("ЦветТекста");
	ЭлементОформленияЦветФона.Значение      = ЦветТекста;
	ЭлементОформленияЦветФона.Использование = Истина;
	
	// Устанавливаем поле для оформления
	
	ПолеОформления = НовоеОформление.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(ПолучитьИмяРеквизитаМероприятия(НовоеМероприятие)); 
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьВедомость()
	
	Мероприятия.Очистить();
	Ведомость.Очистить();
	УсловноеОформление.Элементы.Очистить();
	
	УдаляемыеРеквизиты        = Новый Массив();
	МассивРеквизитовВедомости = ПолучитьРеквизиты("Ведомость");
	
	Для каждого РеквизитВедомости Из МассивРеквизитовВедомости Цикл
	
		Если Найти(РеквизитВедомости.Имя, "Мероприятие_") = 1 Тогда
			УдаляемыеРеквизиты.Добавить(РеквизитВедомости.Путь + "." + РеквизитВедомости.Имя);
		КонецЕсли;
		
		Если Найти(РеквизитВедомости.Имя, "ПрохождениеМероприятие_") = 1 Тогда
			УдаляемыеРеквизиты.Добавить(РеквизитВедомости.Путь + "." + РеквизитВедомости.Имя);
		КонецЕсли;
		
		
	КонецЦикла;
	
	ИзменитьРеквизиты(,УдаляемыеРеквизиты);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяРеквизитаМероприятия(Мероприятие)
	
	Идентификатор = Строка(Мероприятие.УникальныйИдентификатор());
	Идентификатор = СтрЗаменить(Идентификатор, "-", "_");	
	
	Возврат "Мероприятие_" + Идентификатор;
	
КонецФункции

&НаСервере
Процедура ДобавитьМероприятиеВВедомость(НовоеМероприятие, ЗаполнятьВедомость=Истина)
	
	// Получаем данные
	
	ЭтоЭлектронныйРесурс = ?(ТипЗнч(НовоеМероприятие) = Тип("СправочникСсылка.СводыЗнанийСУЗ"), Истина, Ложь);
	
	Если ЭтоЭлектронныйРесурс Тогда
		ДанныеОМероприятии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НовоеМероприятие, "Наименование");
	Иначе
		ДанныеОМероприятии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НовоеМероприятие, "Наименование, Вид");
	КонецЕсли;
	
	// Ищем ранее добавленное мероприятие
	
	Для каждого Строка Из Мероприятия Цикл
	
		Если НовоеМероприятие = Строка.Мероприятие Тогда
			Возврат; // Выходим и ничего не делаем
		КонецЕсли;
	
	КонецЦикла;
	
	// Добавляем мероприятие в таблицу мероприятий
	
	НоваяСтрока = Мероприятия.Добавить();	
	
	НоваяСтрока.Мероприятие         = НовоеМероприятие;
	НоваяСтрока.ИмяКолонкиВедомости = ПолучитьИмяРеквизитаМероприятия(НовоеМероприятие);
	НоваяСтрока.ВыставляетсяОценка  = ?(ЭтоЭлектронныйРесурс, Истина, ДанныеОМероприятии.Вид.ВыставляетсяОценка);	
	
	// Добавляем реквизиты к ведомости (для каждого мероприятия своя колонка).
	
	ДобавляемыеРеквизиты = Новый Массив();

	ТипыЗначений = Новый Массив();
	ТипыЗначений.Добавить(Тип("СправочникСсылка.ЭлементыШкалыОценокСУО"));
	ТипыЗначений.Добавить(Тип("ПеречислениеСсылка.СтатусыПрохожденияОбъектовСУО"));
	
	// Реквизит для хранения оценок и статусов прохождения
	
	НовыйРеквизит = Новый РеквизитФормы(ПолучитьИмяРеквизитаМероприятия(НовоеМероприятие),
										Новый ОписаниеТипов(ТипыЗначений),
										"Ведомость",
										ДанныеОМероприятии.Наименование,
										Ложь); 
										
	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);									
	
	// Реквизит для хранения ссылки на документ прохождения мероприятия
	
	НовыйРеквизит = Новый РеквизитФормы("Прохождение" + ПолучитьИмяРеквизитаМероприятия(НовоеМероприятие),
										Новый ОписаниеТипов("ДокументСсылка.ПрохождениеОбученияСУО"),
										"Ведомость",
										"Прохождение обучения " + ДанныеОМероприятии.Наименование,
										Ложь); 
										
	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);									
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты,);

		
	// Добавляем элементы формы для отображения добавленных реквизитов.
	
	ЭлементФормы = Элементы.Добавить(ПолучитьИмяРеквизитаМероприятия(НовоеМероприятие),
									 Тип("ПолеФормы"),
									 Элементы.Ведомость); 	
	
				  
	ЭлементФормы.Вид                  = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.ПутьКДанным          = "Ведомость." + ПолучитьИмяРеквизитаМероприятия(НовоеМероприятие);
	ЭлементФормы.Заголовок            = ДанныеОМероприятии.Наименование;
	
	// Добавляем условное оформление
	
	ДобавитьУсловноеОформлениеМероприятия(НовоеМероприятие, ДанныеОМероприятии, Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил, ЦветаСтиля.ПоложительныйСтатусСУ);
	ДобавитьУсловноеОформлениеМероприятия(НовоеМероприятие, ДанныеОМероприятии, Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат, ЦветаСтиля.ПоложительныйСтатусСУ);
	ДобавитьУсловноеОформлениеМероприятия(НовоеМероприятие, ДанныеОМероприятии, Перечисления.СтатусыПрохожденияОбъектовСУО.НеЗавершил, ЦветаСтиля.ОтрицательныйСтатусСУ);
	ДобавитьУсловноеОформлениеМероприятия(НовоеМероприятие, ДанныеОМероприятии, Перечисления.СтатусыПрохожденияОбъектовСУО.НеДопущен, ЦветаСтиля.ОтрицательныйСтатусСУ);
	ДобавитьУсловноеОформлениеМероприятия(НовоеМероприятие, ДанныеОМероприятии, Перечисления.СтатусыПрохожденияОбъектовСУО.Проходит, ЦветаСтиля.НейтральныйСтатусСУ);
	ДобавитьУсловноеОформлениеМероприятия(НовоеМероприятие, ДанныеОМероприятии, Перечисления.СтатусыПрохожденияОбъектовСУО.Зачислен, ЦветаСтиля.НейтральныйСтатусДопСУ);

		
	Если ЗаполнятьВедомость Тогда
		ЗаполнитьВедомость();
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВедомость()
	
	МассивМероприятий   = Мероприятия.Выгрузить(,"Мероприятие");
	МассивПользователей = Ведомость.Выгрузить(,"Пользователь");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрохожденияОбученияСУОСрезПоследних.ШкалаОценки,
		|	ПрохожденияОбученияСУОСрезПоследних.Баллы,
		|	ПрохожденияОбученияСУОСрезПоследних.Статус,
		|	ПрохожденияОбученияСУОСрезПоследних.Пользователь,
		|	ПрохожденияОбученияСУОСрезПоследних.Сценарий КАК Мероприятие,
		|	ПрохожденияОбученияСУОСрезПоследних.Регистратор КАК ПрохождениеОбучения
		|ИЗ
		|	РегистрСведений.ПрохожденияОбученияСУО.СрезПоследних(
		|			,
		|			Сценарий В (&Мероприятие)
		|				И Пользователь В (&Пользователь)) КАК ПрохожденияОбученияСУОСрезПоследних";

	Запрос.УстановитьПараметр("Мероприятие", МассивМероприятий);
	Запрос.УстановитьПараметр("Пользователь", МассивПользователей);

	Результат = Запрос.Выполнить();

	ТаблицаРезультатов = Результат.Выгрузить();

    Для каждого СтрокаВедомость Из Ведомость Цикл
	
		Для каждого СтрокаМероприятие Из Мероприятия Цикл
			
			ПараметрыПоиска = Новый Структура("Пользователь, Мероприятие", СтрокаВедомость.Пользователь, СтрокаМероприятие.Мероприятие);
			
			Результаты = ТаблицаРезультатов.НайтиСтроки(ПараметрыПоиска);
			
			Если Результаты.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НайденнаяСтрока       = Результаты[0];
			ИмяКолонкиМероприятия = ПолучитьИмяРеквизитаМероприятия(НайденнаяСтрока.Мероприятие);
			ИмяКолонкиПрохождения = "Прохождение" + ИмяКолонкиМероприятия;
			
			СтрокаВедомость[ИмяКолонкиПрохождения] = НайденнаяСтрока.ПрохождениеОбучения;
			СтрокаВедомость[ИмяКолонкиМероприятия] = Неопределено;
			
			Если Показывать = "Статус" Тогда
				
				СтрокаВедомость[ИмяКолонкиМероприятия] = НайденнаяСтрока.Статус;
				
			ИначеЕсли Показывать = "ОценкуИлиСтатус" Тогда
				
				Если (НайденнаяСтрока.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил
					ИЛИ НайденнаяСтрока.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат)
					И СтрокаМероприятие.ВыставляетсяОценка Тогда
					СтрокаВедомость[ИмяКолонкиМероприятия] = УправлениеОбучениемСУОПовтИсп.ОценкаИзБаллов(НайденнаяСтрока.Баллы, НайденнаяСтрока.ШкалаОценки);
				Иначе
					СтрокаВедомость[ИмяКолонкиМероприятия] = НайденнаяСтрока.Статус;
				КонецЕсли;
				
			Иначе
				
				Если (НайденнаяСтрока.Статус <> Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил
					И НайденнаяСтрока.Статус <> Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат)
					ИЛИ НЕ СтрокаМероприятие.ВыставляетсяОценка Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				СтрокаВедомость[ИмяКолонкиМероприятия] = УправлениеОбучениемСУОПовтИсп.ОценкаИзБаллов(НайденнаяСтрока.Баллы, НайденнаяСтрока.ШкалаОценки);
				
			КонецЕсли;
				
		КонецЦикла;
	
	КонецЦикла;
	
	Ведомость.Сортировать("Пользователь");
	
КонецПроцедуры

&НаСервере
Функция ПоместитьСписокПользователейВХранилище()
	
	ТаблицаПользователей = Ведомость.Выгрузить(,"Пользователь");
	
	ЗаголовокФормыПодбора = НСтр("ru = 'Подбор пользователей'");
	ПараметрыРасширеннойФормыПодбора = 
		Новый Структура("ЗаголовокФормыПодбора, ВыбранныеПользователи, ПодборГруппНевозможен",
		                 ЗаголовокФормыПодбора, ТаблицаПользователей, Истина);
	АдресХранилища = ПоместитьВоВременноеХранилище(ПараметрыРасширеннойФормыПодбора, УникальныйИдентификатор);
	Возврат АдресХранилища;	
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Получаем настройки
	
	ДанныеНастроек = ХранилищеСистемныхНастроек.Загрузить(ЭтотОбъект.ИмяФормы+"/ТекущиеДанные");
	
	Если ДанныеНастроек <> Неопределено Тогда
		Показывать = ДанныеНастроек.Получить("Показывать");
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Показывать) Тогда
		Показывать = "Оценку";
	КонецЕсли;
	
	// Заполняем ведомость на основе параметров
	
	Если ЗначениеЗаполнено(Параметры.Мероприятие) Тогда
		ДобавитьМероприятиеВВедомость(Параметры.Мероприятие, Ложь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ЭлектронныйРесурс) Тогда
		ДобавитьМероприятиеВВедомость(Параметры.ЭлектронныйРесурс, Ложь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ПрограммаОбучения) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СодержаниеПрограммыОбученияСУО.Мероприятие
			|ИЗ
			|	Справочник.СодержаниеПрограммыОбученияСУО КАК СодержаниеПрограммыОбученияСУО
			|ГДЕ
			|	СодержаниеПрограммыОбученияСУО.Владелец = &ПрограммаОбучения
			|	И СодержаниеПрограммыОбученияСУО.ЭтоГруппа = ЛОЖЬ";

		Запрос.УстановитьПараметр("ПрограммаОбучения", Параметры.ПрограммаОбучения);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Мероприятие) Тогда
				ДобавитьМероприятиеВВедомость(ВыборкаДетальныеЗаписи.Мероприятие, Ложь);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.УчебнаяГруппа) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	УчебныеГруппыСУОСостав.Пользователь КАК Пользователь
			|ИЗ
			|	Справочник.УчебныеГруппыСУО.Состав КАК УчебныеГруппыСУОСостав
			|ГДЕ
			|	УчебныеГруппыСУОСостав.Ссылка = &УчебнаяГруппа";

		Запрос.УстановитьПараметр("УчебнаяГруппа", Параметры.УчебнаяГруппа);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НоваяСтрока = Ведомость.Добавить();
			НоваяСтрока.Пользователь = ВыборкаДетальныеЗаписи.Пользователь;
			
		КонецЦикла;
		
	КонецЕсли;	
	
	ПараметрОтбораСотрудников = Неопределено;
	
	Если ЗначениеЗаполнено(Параметры.Должность) Тогда
		ПараметрОтбораСотрудников    = "Должность";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Организация) Тогда
		ПараметрОтбораСотрудников    = "Организация";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ПодразделениеОрганизации) Тогда
		ПараметрОтбораСотрудников    = "ПодразделениеОрганизации";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ПодразделениеПредприятия) Тогда
		ПараметрОтбораСотрудников    = "ПодразделениеПредприятия";
	КонецЕсли;
	
	Если ПараметрОтбораСотрудников <> Неопределено Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СотрудникиСУОСрезПоследних.Пользователь КАК Пользователь
			|ИЗ
			|	РегистрСведений.СотрудникиСУО.СрезПоследних(, Уволен = ЛОЖЬ) КАК СотрудникиСУОСрезПоследних
			|ГДЕ
			|	СотрудникиСУОСрезПоследних."+ПараметрОтбораСотрудников+" = &ПараметрОтбора";

		Запрос.УстановитьПараметр("ПараметрОтбора", Параметры[ПараметрОтбораСотрудников]);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрока = Ведомость.Добавить();
			НоваяСтрока.Пользователь = ВыборкаДетальныеЗаписи.Пользователь;
		КонецЦикла;
		
	КонецЕсли;
	
	Если Параметры.МассивЭлектронныхРесурсов <> Неопределено Тогда
		
		Для каждого ЭлектронныйРесурс Из Параметры.МассивЭлектронныхРесурсов Цикл
			ДобавитьМероприятиеВВедомость(ЭлектронныйРесурс, Ложь);	
		КонецЦикла;
			
	КонецЕсли;
	
	Если Параметры.МассивПользователей <> Неопределено Тогда
		
		Для каждого Пользователь Из Параметры.МассивПользователей Цикл
			НоваяСтрока = Ведомость.Добавить();
			НоваяСтрока.Пользователь = Пользователь;
		КонецЦикла;
		
	КонецЕсли;
	
	Элементы.ДобавитьМероприятие.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьКаталогОбученийСУО");
	
	ЗаполнитьВедомость();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура ДобавитьМероприятие(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьМероприятиеПродолжение", ЭтотОбъект);		
		
	ОткрытьФорму("Справочник.КаталогМероприятийСУО.ФормаВыбора",,,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМероприятиеПродолжение(НовоеМероприятие, ДополнительныеПараметры) Экспорт
	
	Если НовоеМероприятие = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьМероприятиеВВедомость(НовоеМероприятие);
	
КонецПроцедуры	

&НаКлиенте
Процедура ДобавитьЭлектронныйРесурс(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьМероприятиеПродолжение", ЭтотОбъект);
	
	ПараметрыФормы   = Новый Структура("РежимВыбора", Истина);
	ОткрытьФорму("Справочник.СводыЗнанийСУЗ.ФормаВыбора", ПараметрыФормы,,,,,ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьВедомость();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьВедомость();
КонецПроцедуры

&НаКлиенте
Процедура ПодборПользователей(Команда)
	
	АдресСпискаВХранилище = ПоместитьСписокПользователейВХранилище();
	
	ПараметрыФормы = Новый Структура("ПараметрыРасширеннойФормыПодбора, РасширенныйПодбор", АдресСпискаВХранилище, Истина);
	ОткрытьФорму("ОбщаяФорма.ПодборПользователейСУО", ПараметрыФормы, Элементы.Ведомость);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ПоказыватьПриИзменении(Элемент)
	ЗаполнитьВедомость();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ Ведомость

&НаКлиенте
Процедура ВедомостьВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если Найти(Поле.Имя, "Мероприятие_") = 1 Тогда
		
		ПрохождениеОбучения = ТекущиеДанные["Прохождение" + Поле.Имя];

		Если ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
		
			ПоказатьЗначение(,ПрохождениеОбучения);
			
		Иначе
			
			ПоказатьЗначение(,ТекущиеДанные.Пользователь);
			
		КонецЕсли;
		
		
	Иначе
		
		ПоказатьЗначение(,ТекущиеДанные.Пользователь);
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ВедомостьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда		
		Возврат;		
	КонецЕсли;
	
	Ведомость.Очистить();
	
	Для каждого ВыбранныйПользователь Из ВыбранноеЗначение Цикл		
			
		НоваяСтрока = Ведомость.Добавить();
		НоваяСтрока.Пользователь = ВыбранныйПользователь;
		
	КонецЦикла;
	
	ЗаполнитьВедомость();

КонецПроцедуры

