
Процедура ДанныеВебКабинетаСозданиеОбъектовСУЗПриЗаписи(Источник, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ВебКабинетСУ.Используется() Тогда
		Возврат;
	КонецЕсли;	
	
	Если Источник.ДополнительныеСвойства.Свойство("ЭтоНовый")
		И Источник.ДополнительныеСвойства.ЭтоНовый Тогда		
		
		ТаблицаЭлектронныхРесурсов = Справочники.СводыЗнанийСУЗ.ТаблицаЭлектронныхРесурсовДляДанныхВебКабинета();
		
		Если ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
			
			Справочники.СводыЗнанийСУЗ.ОбновитьДанныеВебКабинетаДляВсехПользователей(ТаблицаЭлектронныхРесурсов);
			
		КонецЕсли;
		
		Если ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.Пользователи") Тогда				
				
			ПараметрыФЗ = Новый Массив;
			ПараметрыФЗ.Добавить(Источник.Ссылка);
			ПараметрыФЗ.Добавить(ТаблицаЭлектронныхРесурсов);
			
			ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных(ОбщегоНазначения.ИмяТаблицыПоСсылке(Справочники.СводыЗнанийСУЗ.ПустаяСсылка()), "ВебКабинетСУ.ОбновитьДанныеОбъекта", ПараметрыФЗ, Строка(Источник.Ссылка.УникальныйИдентификатор()), 2);
				
		КонецЕсли;		
		
	КонецЕсли;	
	
КонецПроцедуры

Функция СсылкаНаЭлектронныйРесурс(ЭлектронныйРесурс, ЭлементСодержания=Неопределено, ПрохождениеОбучения=Неопределено, Задание=Неопределено, Пользователь=Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Публикация веб-кабинета
	
	ПубликацияВебКабинета = Справочники.ПубликацииВебКабинетаСУ.ОсновнаяПубликация();
	
	Если НЕ ЗначениеЗаполнено(ПубликацияВебКабинета) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Невозможно открыть электронный курс/тест. Публикация не найдена'"));	
		Возврат "";
		
	КонецЕсли;
	
	// Публикация электронного ресурса
	
	СвойстваПубликации = ЭлектронныеРесурсыСУЗ.ПолучитьСвойстваПубликации(ЭлектронныйРесурс);
	
	Если СвойстваПубликации = Неопределено Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Невозможно открыть электронный курс/тест. Публикация не найдена'"));	
		Возврат "";
		
	КонецЕсли;
	
	// Строка поиска
	
	СтрокаПоиска = ЭлектронныеРесурсыСУЗКлиентСервер.СтрокаПоискаОбозревателя(ЭлектронныйРесурс, ЭлементСодержания, ПрохождениеОбучения, Задание,, Пользователь); 
	
	// Собираем адрес
	
	ВебСсылка =	Справочники.ПубликацииВебКабинетаСУ.АдресКаталогаЭлектронныхРесурсов(ПубликацияВебКабинета)
	+ "/"
	+ Строка(ЭлектронныйРесурс.УникальныйИдентификатор())
	+ "/"
	+ ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(СвойстваПубликации.КонтрольнаяСумма)
	+ "/index.html"
	+ СтрокаПоиска;
	
	Возврат ВебСсылка;
	
	
КонецФункции