
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	// Определяем тип объекта
	
	ТипОбъекта = ПолучитьТипОбъекта(Объект.СсылкаНаОбъектСУЗ);
	
	// Вкладка ДополнительноДляПодборок
	
	Если ТипОбъекта = Перечисления.ТипыОбъектовСУЗ.collection
		И НЕ Объект.СсылкаНаОбъектСУЗ.ЭтоТест Тогда
		
		Элементы.ДополнительноДляПодборок.Видимость = Истина;
		
		МассивПараметровВыбора = Новый Массив();
		МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец", Объект.СсылкаНаОбъектСУЗ));
		Элементы.ЭлементПодборки.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
		
	Иначе
		
		Элементы.ДополнительноДляПодборок.Видимость = Ложь;
		
	КонецЕсли;
	
	// Вкладка ДополнительноДляФайлов
	
	Если ТипОбъекта = Перечисления.ТипыОбъектовСУЗ.file Тогда
		Элементы.ДополнительноДляФайлов.Видимость = Истина;
	Иначе
		Элементы.ДополнительноДляФайлов.Видимость = Ложь;
	КонецЕсли;
	
	// СсылкаНаОбъектСУЗ
	
	Если ЗначениеЗаполнено(Объект.ВнешняяСсылка) Тогда
		Элементы.СсылкаНаОбъектСУЗ.Доступность = Ложь;
	Иначе
		Элементы.СсылкаНаОбъектСУЗ.Доступность = Истина;
	КонецЕсли;
	
	// Внешняя ссылка
	
	Если ЗначениеЗаполнено(Объект.СсылкаНаОбъектСУЗ) Тогда
		Элементы.ВнешняяСсылка.Доступность = Ложь;
	Иначе
		Элементы.ВнешняяСсылка.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция АдресСсылки(Ссылка)
	Возврат Справочники.СсылкиОбъектовСУЗ.АдресСсылки(Ссылка);	
КонецФункции

&НаСервереБезКонтекста
Функция АдресЦели(Ссылка)
	Возврат Справочники.СсылкиОбъектовСУЗ.АдресЦели(Ссылка);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТипОбъекта(СсылкаНаОбъектСУЗ)
	Возврат ОбъектыСУЗ.ПолучитьТипОбъектаСУЗ(СсылкаНаОбъектСУЗ);
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьДоступностьЭлементовФормы();
	
	//////////////////////////////////////////////////////////////////
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Объект);
	РазработкаСУЗ.УстановитьДоступностьДанныхОтПоставщика(ЭтотОбъект);
	//////////////////////////////////////////////////////////////////

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	АдресСсылки = АдресСсылки(Объект.Ссылка);
	АдресЦели   = АдресЦели(Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	АдресСсылки = АдресСсылки(Объект.Ссылка);
	АдресЦели   = АдресЦели(Объект.Ссылка);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура СсылкаНаОбъектСУЗПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВнешняяСсылкаПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры
