Процедура Перезаписать(ЭлементСодержания, Наименование = Неопределено) Экспорт

	ОбъектЭлементСодержания =  ЭлементСодержания.ПолучитьОбъект();
	// Наименование будет обновлено в обработчике ПередЗаписью модуля объекта

	Если Наименование <> Неопределено Тогда
		ОбъектЭлементСодержания.Наименование = Наименование;
	КонецЕсли;
	
	ОбъектЭлементСодержания.Записать();
			
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		
		Если Параметры.Свойство("ЗначениеКопирования") Тогда
			Возврат;
		КонецЕсли;			
		
		Ключ               = Неопределено;
		ЗначенияЗаполнения = Неопределено;
		ЭлектронныйРесурс  = Неопределено;
		СоздатьПустойЭлемент = Неопределено;
		
		Параметры.Свойство("ЗначенияЗаполнения", ЗначенияЗаполнения);
		Параметры.Свойство("Ключ", Ключ);
		Параметры.Свойство("СоздатьПустойЭлемент", СоздатьПустойЭлемент);
		
		Если ЗначенияЗаполнения <> Неопределено Тогда
			ЗначенияЗаполнения.Свойство("Владелец", ЭлектронныйРесурс);	
		КонецЕсли;
		
		Если Ключ = Неопределено И ЗначениеЗаполнено(ЭлектронныйРесурс) И СоздатьПустойЭлемент = Неопределено Тогда
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "ФормаСоздания";	
		КонецЕсли;
		
		
	КонецЕсли;
	
КонецПроцедуры
