#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ)
	
	Если ЭтоГруппа ИЛИ ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;
	
	Если НЕ РазрешитьРедактироватьНаименование И ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
		Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаЭлемент, "Наименование");
	КонецЕсли;
	
	Если ЭтоНовый()
		И ДополнительныеСвойства.Свойство("ПроверитьНаДубликат")
		И ДополнительныеСвойства.ПроверитьНаДубликат Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СодержаниеСУЗ.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.СодержаниеСУЗ КАК СодержаниеСУЗ
			|ГДЕ
			|	СодержаниеСУЗ.ПометкаУдаления = ЛОЖЬ
			|	И СодержаниеСУЗ.Владелец = &Владелец
			|	И СодержаниеСУЗ.СсылкаНаЭлемент = &СсылкаНаЭлемент";
		
		Запрос.УстановитьПараметр("Владелец", Владелец);
		Запрос.УстановитьПараметр("СсылкаНаЭлемент", СсылкаНаЭлемент);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			НаименованиеЭлемента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаЭлемент, "Наименование");
			ТекстИсключения = НСТр("ru = 'Элемент ""%1"" не может быть добавлен, так как он уже содержится в курсе'");
			ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстИсключения, НаименованиеЭлемента);			
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли