#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Функция Участники(УчебнаяГруппа) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтудентыООСрезПоследних.Пользователь,
		|	СтудентыООСрезПоследних.Пользователь.Наименование КАК Наименование
		|ИЗ
		|	РегистрСведений.СтудентыОО.СрезПоследних(, ) КАК СтудентыООСрезПоследних
		|ГДЕ
		|	СтудентыООСрезПоследних.УчебнаяГруппа = &УчебнаяГруппа";

	Запрос.УстановитьПараметр("УчебнаяГруппа", УчебнаяГруппа);

	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
	
КонецФункции

Функция УчебнаяГруппаПользователя(Знач Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтудентыООСрезПоследних.УчебнаяГруппа,
		|	СтудентыООСрезПоследних.УчебнаяГруппа.Наименование КАК НаименованиеУчебнойГруппы
		|ИЗ
		|	РегистрСведений.СтудентыОО.СрезПоследних(, ) КАК СтудентыООСрезПоследних
		|ГДЕ
		|	СтудентыООСрезПоследних.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
		ВыборкаДетальныеЗаписи.Следующий();
		
		Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.УчебнаяГруппа) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Возврат Новый Структура("УчебнаяГруппа, Наименование", ВыборкаДетальныеЗаписи.УчебнаяГруппа, ВыборкаДетальныеЗаписи.НаименованиеУчебнойГруппы);
		
	КонецЕсли;
	
КонецФункции


// Веб-кабинет

Процедура ОбновитьДанныеВебКабинета(УчебнаяГруппа, ДополнительныеДанные=Неопределено) Экспорт

	
		УстановитьПривилегированныйРежим(Истина);
	
		Справочники.УчебныеГруппыСУО.ОбновитьДанныеВебКабинета(УчебнаяГруппа, ДополнительныеДанные);

	
КонецПроцедуры

#КонецЕсли