#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ПриИзмененииНастроекРассылок" Тогда
		УстановитьДоступностьЭлементовФормы();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ДекорацияАвторРассылокОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Обработка.ПанельАдминистрированияБСП.Форма.Органайзер");
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура СоздатьРассылкуБезШаблона(Команда)
	
	// Параметр Идентификатор нужен, чтобы каждый раз открывалась новая форма
	
	ОткрытьФорму("Документ.РассылкаСообщенийСУО.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения, Идентификатор", Новый Структура("БезШаблона", Истина), Новый УникальныйИдентификатор()));
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРассылкуНаОсновеШаблона(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьРассылкуПродолжение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ШаблоныСообщенийСУО.ФормаВыбора",,,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРассылкуПродолжение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) <> Тип("СправочникСсылка.ШаблоныСообщенийСУО") Тогда
		Возврат;
	КонецЕсли;
	
	// Параметр Идентификатор нужен, чтобы каждый раз открывалась новая форма
	
	ОткрытьФорму("Документ.РассылкаСообщенийСУО.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения, Идентификатор", Новый Структура("БезШаблона, Шаблон", Ложь, РезультатЗакрытия), , Новый УникальныйИдентификатор()));
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ Пользователи.ЭтоПолноправныйПользователь() Тогда
		Элементы.ГруппаОбязательныеНастройки.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ДекорацияАвторРассылок.Видимость = НЕ ЗначениеЗаполнено(Константы.АвторАвтоматическихРассылокСУО.Получить());
	Элементы.ДекорацияУчетныеЗаписиПочты.Видимость = НЕ РаботаСПочтовымиСообщениями.ДоступнаОтправкаПисем();
	Элементы.ДекорацияРегламентноеЗаданиеПроведение.Видимость = НЕ РегламентныеЗаданияСервер.РегламентноеЗаданиеИспользуется(Метаданные.РегламентныеЗадания.ПроведениеАвтоматическихРассылокСУО);
	Элементы.ДекорацияРегламентноеЗаданиеРассылка.Видимость = НЕ РегламентныеЗаданияСервер.РегламентноеЗаданиеИспользуется(Метаданные.РегламентныеЗадания.РассылкаСообщенийНаЭлектроннуюПочтуСУО);	
	
КонецПроцедуры


#КонецОбласти
