#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем СвойстваЗаданияВПроведении;
Перем ДанныеПрохождения;

#КонецОбласти

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;		
	КонецЕсли;
	
	ДанныеПрохождения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеОбучения, "Пользователь, Сценарий, РодительскоеПрохождение, Статус, ДобавленоВремениВСекундах");
	СвойстваЗаданияВПроведении = Документы.ПрохождениеОбученияСУО.СвойстваЗаданияПрохождения(ПрохождениеОбучения, Задание);
	
	Если СвойстваЗаданияВПроведении = Неопределено Тогда
		ПроходнойБалл = 0;
	Иначе		
		ПроходнойБалл = СвойстваЗаданияВПроведении.ПроходнойБалл;
	КонецЕсли;
	
	Если СвойстваЗаданияВПроведении = Неопределено Тогда
		ДатаНачалаДоступаКЗаданию = Дата("00010101");
		ДатаОкончанияДоступаКЗаданию = Дата("00010101");					
	Иначе
		ДатаНачалаДоступаКЗаданию = Документы.ПопыткаВыполненияЗаданияСУО.ДатаДоступаКЗаданию(СвойстваЗаданияВПроведении.ДатаНачалаДоступаКЗаданию, ДанныеПрохождения.ДобавленоВремениВСекундах);
		ДатаОкончанияДоступаКЗаданию = Документы.ПопыткаВыполненияЗаданияСУО.ДатаДоступаКЗаданию(СвойстваЗаданияВПроведении.ДатаОкончанияДоступаКЗаданию, ДанныеПрохождения.ДобавленоВремениВСекундах);						
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаНачалаДоступаКЗаданию) ИЛИ ЗначениеЗаполнено(ДатаОкончанияДоступаКЗаданию) Тогда
		СкрытьВремяДоступаКЗаданию = СвойстваЗаданияВПроведении.СкрытьВремяДоступаКЗаданию;
	Иначе
		СкрытьВремяДоступаКЗаданию = Ложь;
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("ПриПрохожденииОбучения")
		ИЛИ НЕ ДополнительныеСвойства.ПриПрохожденииОбучения Тогда
		
		// Если это проведение при прохождении задания, то реквизит ВыставляетсяОценка уже заполнен.
		
		ВидОбучения = Документы.ПроведениеОбученияСУО.ВидОбучения(ПроведениеОбучения, ДанныеПрохождения.Сценарий);		
		
		ВыставляетсяОценка = Документы.ПопыткаВыполненияЗаданияСУО.ВыставляетсяОценка(
			ПроведениеОбучения, Задание, ДанныеПрохождения.Сценарий, ВидОбучения, ПрохождениеОбучения, ДанныеПрохождения.Пользователь);
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнениеОтменено = Документы.ПопыткаВыполненияЗаданияСУО.Отменено(Ссылка);
	
	Движения.ПопыткиПрохожденияЗаданийСУО.Записывать = Истина;
	Движения.БиблиотекаПользователейСУО.Записывать   = Истина;
	
	Если НЕ ВыполнениеОтменено И СвойстваЗаданияВПроведении <> Неопределено Тогда
		
		// СвойстваЗаданияВПроведении может быть неопределено, если задание было удалено из обучения
		
		Если ТипЗнч(Задание) = Тип("СправочникСсылка.ЗаданияСУО") Тогда
			ДанныеЗадания = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Задание, "НесколькоВариантов, ДобавитьВБиблиотеку, МеткаВБиблиотеке, НаОсновеЭлектронногоРесурса, ЭлектронныйРесурс, Фрагмент, НеЖдатьПроверки");
		Иначе
			ДанныеЗадания = Новый Структура("НесколькоВариантов, ДобавитьВБиблиотеку, МеткаВБиблиотеке, НаОсновеЭлектронногоРесурса, ЭлектронныйРесурс, Фрагмент, НеЖдатьПроверки");
			ДанныеЗадания.НесколькоВариантов = Ложь;
			ДанныеЗадания.ДобавитьВБиблиотеку = Ложь;
			ДанныеЗадания.МеткаВБиблиотеке = Неопределено;
			ДанныеЗадания.НаОсновеЭлектронногоРесурса = Истина;
			ДанныеЗадания.ЭлектронныйРесурс = Задание;
			ДанныеЗадания.Фрагмент = Неопределено;
			ДанныеЗадания.НеЖдатьПроверки = Ложь;
		КонецЕсли;
		
		// Попытки
		
		Движение = Движения.ПопыткиПрохожденияЗаданийСУО.Добавить();
		Движение.Период                       = Дата;
		Движение.Задание                      = Задание;
		Движение.ПрохождениеОбучения          = ПрохождениеОбучения;
		Движение.Баллы                        = Баллы;
		Движение.Выполнено                    = Документы.ПопыткаВыполненияЗаданияСУО.Выполнено(Ссылка, ПопыткаЗавершена, ПроверяетсяПреподавателем, ПроверенПреподавателем, Баллы, СвойстваЗаданияВПроведении.ПроходнойБалл, ДатаОкончанияДоступаКЗаданию);
		Движение.Пользователь                 = ДанныеПрохождения.Пользователь;
		Движение.ШкалаОценки                  = Документы.ПроведениеОбученияСУО.ШкалаОценки(ПроведениеОбучения);
		Движение.ЗавершеноВПроцентах          = ЗавершеноВПроцентах;
		Движение.ПопыткаЗавершена             = ПопыткаЗавершена;
		Движение.РодительскоеПрохождение      = ДанныеПрохождения.РодительскоеПрохождение;
		Движение.ПроверяетсяПреподавателем    = ПроверяетсяПреподавателем;
		Движение.ПроверенПреподавателем       = ПроверенПреподавателем;
		Движение.ДатаОтправкиНаПроверку       = ДатаОтправкиНаПроверку;		
		Движение.КомментарийПреподавателя     = КомментарийПреподавателя;
		Движение.ПроведениеОбучения           = ПроведениеОбучения;
		Движение.Мероприятие                  = ДанныеПрохождения.Сценарий;		
		Движение.Вариант                      = Вариант;
		Движение.НесколькоВариантов           = ДанныеЗадания.НесколькоВариантов;
		Движение.ВозвращеноНаДоработку        = ВозвращеноНаДоработку;
		Движение.ПричинаВозвратаНаДоработку   = ПричинаВозвратаНаДоработку;
		Движение.ДатаВозвратаНаДоработку      = ДатаВозвратаНаДоработку;
		Движение.ДатаПоследнейАктивности      = ДатаПоследнейАктивности;
		Движение.Наименование                 = СвойстваЗаданияВПроведении.Наименование;
		Движение.Номер                        = СвойстваЗаданияВПроведении.Номер;
		Движение.Значимость                   = СвойстваЗаданияВПроведении.Значимость;
		Движение.ПроходнойБалл                = СвойстваЗаданияВПроведении.ПроходнойБалл;
		Движение.ЗатраченоВремениВСекундах    = ЗатраченоВремениВСекундах;
		Движение.НеЖдатьПроверки              = СвойстваЗаданияВПроведении.НеЖдатьПроверки;
		Движение.ПроверившийПреподаватель     = ПроверившийПреподаватель;
		Движение.ДатаПроверки                 = ДатаПроверки;		
		Движение.ДатаНачалаДоступаКЗаданию    = ДатаНачалаДоступаКЗаданию;
		Движение.ДатаОкончанияДоступаКЗаданию = ДатаОкончанияДоступаКЗаданию;
		Движение.СкрытьВремяДоступаКЗаданию   = СкрытьВремяДоступаКЗаданию;
		Движение.ВыставляетсяОценка           = ВыставляетсяОценка;
		
		// Библиотека пользователя
		
		Если ДанныеЗадания.ДобавитьВБиблиотеку И ПопыткаЗавершена 
			И (ДанныеПрохождения.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил
			ИЛИ ДанныеПрохождения.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат) Тогда
			
			Если ДанныеЗадания.НаОсновеЭлектронногоРесурса Тогда			
				ИсточникРесурса = ?(ЗначениеЗаполнено(Вариант), Вариант, ДанныеЗадания);				
			Иначе				
				// Задание является ресурсом для добавления в библиотеку				
				ИсточникРесурса = Новый Структура("ЭлектронныйРесурс, Фрагмент", Задание, Неопределено); 				
			КонецЕсли;			
			
			Если ЗначениеЗаполнено(ИсточникРесурса.ЭлектронныйРесурс) Тогда
				
				Движение = Движения.БиблиотекаПользователейСУО.Добавить();
				
				Движение.Пользователь = ДанныеПрохождения.Пользователь;
				Движение.Ресурс       = ИсточникРесурса.ЭлектронныйРесурс;
				Движение.Фрагмент     = ИсточникРесурса.Фрагмент;
				
				Движение.Период = Дата;
				Движение.Метка  = ДанныеЗадания.МеткаВБиблиотеке;
				
				Если ЗначениеЗаполнено(Движение.Метка) Тогда
					Движение.Библиотека = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Движение.Метка, "Владелец");
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЕсли;
			
	КонецЕсли;
	
	Движения.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

