
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Объект);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.Ссылка.Пустая()
		И (НЕ ЗначениеЗаполнено(АдресШаблона) ИЛИ НЕ ЭтоАдресВременногоХранилища(АдресШаблона)) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Загрузите шаблон при помощи команды Загрузить'"),,,,Отказ);
		
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресШаблона) И ЭтоАдресВременногоХранилища(АдресШаблона) Тогда
		ТекущийОбъект.ДвоичныеДанные = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресШаблона));
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗагрузитьШаблон(Команда)
	
	ДиалогВыбораШаблона = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораШаблона.Заголовок = НСтр("ru = 'Выберите файл шаблона'");
	ДиалогВыбораШаблона.МножественныйВыбор = Ложь;
	ДиалогВыбораШаблона.Фильтр = "Шаблон Word(*.dot;*.dotm;*.dotx)|*.dot;*.dotm;*.dotx";
	ДиалогВыбораШаблона.ПредварительныйПросмотр = Истина;
	
	ОписаниеОповещенияПолученияКартинки = Новый ОписаниеОповещения("ЗагрузитьШаблонПродолжение", ЭтотОбъект);
	
	НачатьПомещениеФайлов(ОписаниеОповещенияПолученияКартинки,, ДиалогВыбораШаблона, Истина, УникальныйИдентификатор);	
	

КонецПроцедуры

// Продолжение процедуры (см. выше).
// 
&НаКлиенте
Процедура ЗагрузитьШаблонПродолжение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ПолученныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФайлШаблона = Новый Файл(ПолученныеФайлы[0].Имя);
	
	АдресШаблона = ПолученныеФайлы[0].Хранение;
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = ФайлШаблона.ИмяБезРасширения;
	КонецЕсли;
	
	Объект.ИмяФайла = ФайлШаблона.Имя;
	
	Статус = НСтр("ru = 'Файл помещен во временное хранилище'");
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьШаблон(Команда)
	
	МассивФайлов = Новый Массив;	
	
	Если ЗначениеЗаполнено(АдресШаблона) И ЭтоАдресВременногоХранилища(АдресШаблона) Тогда
		МассивФайлов.Добавить(Новый ОписаниеПередаваемогоФайла(Объект.ИмяФайла, АдресШаблона));	
	Иначе
		
		Если Объект.Ссылка.Пустая() Тогда
			
			ПоказатьПредупреждение(, НСтр("ru = 'Элемент не сохранен'"));
			
		Иначе
			
			АдресФайлаОригинала = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "ДвоичныеДанные");			
			МассивФайлов.Добавить(Новый ОписаниеПередаваемогоФайла(Объект.ИмяФайла, АдресФайлаОригинала));
			
		КонецЕсли;					
		
	КонецЕсли;	
	
	ОписаниеОповещенияПолученияФайлов = Новый ОписаниеОповещения("СохранитьПродолжение", ЭтотОбъект);
	
	ДиалогСохранения = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогСохранения.Заголовок = НСтр("ru = 'Сохранение шаблона'");
	ДиалогСохранения.МножественныйВыбор = Ложь;
	ДиалогСохранения.ПредварительныйПросмотр = Ложь;
	
	НачатьПолучениеФайлов(ОписаниеОповещенияПолученияФайлов, МассивФайлов, ДиалогСохранения, Истина);	
	
КонецПроцедуры

// Продолжение процедуры (см. выше).
// 
&НаКлиенте
Процедура СохранитьПродолжение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт
	// Обработка не требуется.
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#КонецОбласти
