#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ЕстьПрохожденияВПлеереВебКабинета(Знач ПроведениеОбучения, Знач ЭлектронныйРесурс, Знач ПлеерВебКабинета) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(ПроведениеОбучения) Тогда	
		Возврат Ложь;		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПрохожденияЭлектронныхРесурсовСУЗ.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ПрохожденияЭлектронныхРесурсовСУЗ КАК ПрохожденияЭлектронныхРесурсовСУЗ
		|ГДЕ
		|	ПрохожденияЭлектронныхРесурсовСУЗ.ЭлектронныйРесурс = &ЭлектронныйРесурс
		|	И ПрохожденияЭлектронныхРесурсовСУЗ.ПлеерВебКабинета = &ПлеерВебКабинета
		|	И ПрохожденияЭлектронныхРесурсовСУЗ.ПрохождениеОбучения.ПроведениеОбучения = &ПроведениеОбучения
		|	";
	
	Запрос.УстановитьПараметр("ПлеерВебКабинета", ПлеерВебКабинета);
	Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);
	Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли
