#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

// ПРОГРАММНЫЙ ИНТЕРФЕЙС
	
Функция СессииТестирования(Пользователь, ПрохождениеОбучения=Неопределено, Задание=Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПопыткаВыполненияПодборкиВопросовСУЗ.Ссылка,
		|	ПопыткаВыполненияПодборкиВопросовСУЗ.Дата,
		|	ПопыткаВыполненияПодборкиВопросовСУЗ.ИтоговыйРезультат,
		|	ПопыткаВыполненияПодборкиВопросовСУЗ.Подборка.Наименование КАК Наименование
		|ИЗ
		|	Документ.ПопыткаВыполненияПодборкиВопросовСУЗ КАК ПопыткаВыполненияПодборкиВопросовСУЗ
		|ГДЕ
		|	ПопыткаВыполненияПодборкиВопросовСУЗ.Проведен = ИСТИНА
		|	И ПопыткаВыполненияПодборкиВопросовСУЗ.Пользователь = &Пользователь
		|	И ПопыткаВыполненияПодборкиВопросовСУЗ.ТестЗавершен = ИСТИНА
		|   И ПопыткаВыполненияПодборкиВопросовСУЗ.Отменено = ЛОЖЬ";
		
	Если ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
		
		Запрос.Текст = Запрос.Текст + "	И ПопыткаВыполненияПодборкиВопросовСУЗ.ПрохождениеОбучения = &ПрохождениеОбучения";
		Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбучения);
		
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Задание) Тогда
		
		Запрос.Текст = Запрос.Текст + " И ПопыткаВыполненияПодборкиВопросовСУЗ.Задание = &Задание";
		Запрос.УстановитьПараметр("Задание", Задание);
		
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	Возврат Запрос.Выполнить();
	
КонецФункции

Функция СтоимостьВопросаТеста(Вопрос, Тест) Экспорт
	
	Если ТипЗнч(Тест) = Тип("ДокументСсылка.ПопыткаВыполненияПодборкиВопросовСУЗ")
		И ЗначениеЗаполнено(Тест)
		И ЗначениеЗаполнено(Вопрос) Тогда
		
		ТаблицаВопросов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Тест, "Вопросы").Выгрузить();
		
		Возврат СтоимостьВопроса(Вопрос, ТаблицаВопросов);
		
	Иначе
		
		Возврат 0;
		
	КонецЕсли;
	
КонецФункции

Функция СтоимостьВопроса(Вопрос, ВопросыТеста) Экспорт
	
	// ВопросыТеста - табличная часть Вопросы документа
	
	ВопросВСессии = ВопросыТеста.Найти(Вопрос, "Вопрос");
	
	Если ВопросВСессии = Неопределено Тогда 
		ВесВопроса = 1;
	Иначе
		ВесВопроса = ВопросВСессии.ВесВопроса;
	КонецЕсли;
	
	СуммаВсехВесов = СуммаВесовВопросов(ВопросыТеста);
	
	Если СуммаВсехВесов > 0 Тогда	
		Возврат Окр((ВесВопроса / СуммаВсехВесов) * 100, 2);
	Иначе
		Возврат 1;
	КонецЕсли;
	
	
КонецФункции

Функция СуммаВесовВопросов(ВопросыТеста) Экспорт
	
	СуммаВсехВесов = 0;
	
	Для каждого СтрокаТЧВ Из ВопросыТеста Цикл
		
		Если НЕ СтрокаТЧВ.ПсихологическийВопрос Тогда
			СуммаВсехВесов = СуммаВсехВесов + СтрокаТЧВ.ВесВопроса;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СуммаВсехВесов;
	
КонецФункции

Функция ВопросыТеста(СессияВыполненияТеста) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПопыткаВыполненияПодборкиВопросовСУЗВопросы.Вопрос КАК Вопрос,
		|	ПопыткаВыполненияПодборкиВопросовСУЗВопросы.Вопрос.Наименование КАК Наименование,
		|	ПопыткаВыполненияПодборкиВопросовСУЗВопросы.НомерСтроки КАК Номер,
		|	ПопыткаВыполненияПодборкиВопросовСУЗВопросы.ВесВопроса КАК Вес,
		|	ОтветНаВопросСУЗ.ВопросОтвечен КАК ВопросОтвечен,
		|	ОтветНаВопросСУЗ.Результат КАК Результат,
		|	ОтветНаВопросСУЗ.Ссылка КАК ОтветНаВопрос
		|ИЗ
		|	Документ.ПопыткаВыполненияПодборкиВопросовСУЗ.Вопросы КАК ПопыткаВыполненияПодборкиВопросовСУЗВопросы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтветНаВопросСУЗ КАК ОтветНаВопросСУЗ
		|		ПО ПопыткаВыполненияПодборкиВопросовСУЗВопросы.Ссылка = ОтветНаВопросСУЗ.СессияВыполненияТеста
		|			И ПопыткаВыполненияПодборкиВопросовСУЗВопросы.Вопрос = ОтветНаВопросСУЗ.Вопрос
		|			И (ОтветНаВопросСУЗ.Отменено = ЛОЖЬ)
		|ГДЕ
		|	ПопыткаВыполненияПодборкиВопросовСУЗВопросы.Ссылка = &СессияВыполненияТеста
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер";
	
	Запрос.УстановитьПараметр("СессияВыполненияТеста", СессияВыполненияТеста);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция ДанныеТестированияДляПросмотра(СессияВыполненияТеста, ГруппаПодборки=Неопределено) Экспорт

	НастройкиТестирования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СессияВыполненияТеста, "ПоказыватьНавигацию, Пользователь, Подборка, ЭлементСодержанияСводаЗнаний, СводЗнаний");
	
	ДопСвойстваСсылки = Новый Структура;
	
	Если ГруппаПодборки <> Неопределено Тогда
		
		Если ТипЗнч(ГруппаПодборки) = Тип("Число") Тогда
			ДопСвойстваСсылки.Вставить("НомерГруппыПодборки", ГруппаПодборки);
		Иначе
			ДопСвойстваСсылки.Вставить("ЭлементПодборки", ГруппаПодборки);
		КонецЕсли;
		
	КонецЕсли;
	
	ДопСвойстваСсылки.Вставить("ДокументСессии", СессияВыполненияТеста);
	ДопСвойстваСсылки.Вставить("РазрешенПереходКВопросамТеста", Истина);
	
	СсылкаНаТест = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(НастройкиТестирования.Подборка,,,ДопСвойстваСсылки);
	
	НастройкиТестирования.Вставить("СсылкаНаЭлемент", СсылкаНаТест);
	
	Возврат НастройкиТестирования;
	
КонецФункции

#КонецОбласти


#КонецЕсли
