

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервереБезКонтекста
Функция ВебСсылка(Идентификатор)
	
	Книга = Справочники.ЛитератураСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор));
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Книга, "ВебСсылка");
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = "Карточка книги """ + Параметры.Книга.Наименование + """";
	
	// Показываем файлы
	
	ФайлыКниги.Параметры.УстановитьЗначениеПараметра("Книга", Параметры.Книга);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.Ссылка
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.ВладелецФайла = &ВладелецФайла";

	Запрос.УстановитьПараметр("ВладелецФайла", Параметры.Книга);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Элементы.Файлы.Видимость = Ложь;
	КонецЕсли;
	
	// Получаем представление HTML
	
	XMLДанные = Справочники.ЛитератураСУО.КнигаОписаниеXML(Параметры.Книга, Параметры.ВыделенныйФрагмент);
	
	Преобразование = Новый ПреобразованиеXSL;
	ШаблонXSL = Справочники.ЛитератураСУО.ПолучитьМакет("ШаблонКарточки").ПолучитьТекст();
	
	Преобразование.ЗагрузитьИзСтроки(ШаблонXSL);
	Представление = Преобразование.ПреобразоватьИзСтроки(XMLДанные);
	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура ОткрытьФайл(Команда=Неопределено)
	
	Если Элементы.ФайлыКниги.ТекущаяСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(Элементы.ФайлыКниги.ТекущаяСтрока,, УникальныйИдентификатор);
	РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);

КонецПроцедуры

&НаКлиенте
Процедура СохранитьКак(Команда)
	
	ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляСохранения(Элементы.ФайлыКниги.ТекущаяСтрока, УникальныйИдентификатор);
	РаботаСФайламиСлужебныйКлиент.СохранитьКак(Неопределено, ДанныеФайла, УникальныйИдентификатор);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ ФайлыКниги

&НаКлиенте
Процедура ФайлыКнигиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФайл();

КонецПроцедуры

&НаКлиенте
Процедура ПолеHTMLДокументаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ДанныеСобытия.Свойство("Href") И ЗначениеЗаполнено(ДанныеСобытия.Href) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СтруктураСсылки = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(ДанныеСобытия.Href);
		
		Если СтруктураСсылки.Свойство("book") Тогда
			АдресДляПерехода = ВебСсылка(СтруктураСсылки.book);
		Иначе
			АдресДляПерехода = ДанныеСобытия.Href;
		КонецЕсли;	
		
		ПерейтиПоНавигационнойСсылке(АдресДляПерехода);
		
	КонецЕсли;

КонецПроцедуры