#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Функция ДанныеВопросаДляПросмотра(Вопрос) Экспорт
	
	Если ТипЗнч(Вопрос) = Тип("Массив") Тогда
		МассивВопросов = Вопрос;
	Иначе		
		МассивВопросов = Новый Массив;
		МассивВопросов.Добавить(Вопрос);
	КонецЕсли;
	
	// Формируем таблицу вопросов
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТестовыеВопросы.Задание КАК Задание,
		|	ТестовыеВопросы.ТипВопроса КАК ТипВопроса,
		|	ТестовыеВопросы.Ссылка КАК Ссылка,
		|	ТестовыеВопросы.Картинка КАК Картинка,
		|	ТестовыеВопросы.НаименованиеКолонкиЭлементов КАК НаименованиеКолонкиЭлементов,
		|	ТестовыеВопросы.НаименованиеКолонкиВариантов КАК НаименованиеКолонкиВариантов
		|ИЗ
		|	Справочник.ТестовыеВопросы КАК ТестовыеВопросы
		|ГДЕ
		|	ТестовыеВопросы.ПометкаУдаления = ЛОЖЬ
		|	И ТестовыеВопросы.ЭтоГруппа = ЛОЖЬ
		|	И ТестовыеВопросы.Ссылка В(&МассивВопросов)";
	
	Запрос.УстановитьПараметр("МассивВопросов", МассивВопросов);
	
	ТаблицаВопросов = Запрос.Выполнить().Выгрузить();
	
	// Выбираем варианты ответов	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВариантыОтветовНаТестовыеВопросы.Верный КАК Верный,
		|	ВариантыОтветовНаТестовыеВопросы.ТекстВарианта КАК ТекстВарианта,
		|	ВариантыОтветовНаТестовыеВопросы.Ссылка КАК Ссылка,
		|	ВариантыОтветовНаТестовыеВопросы.Код КАК Код,
		|	ВариантыОтветовНаТестовыеВопросы.Владелец КАК Вопрос,
		|	ВариантыОтветовНаТестовыеВопросы.Картинка КАК Картинка,
		|	ВариантыОтветовНаТестовыеВопросы.ОбластьНаКартинке КАК ОбластьНаКартинке,
		|	ВариантыОтветовНаТестовыеВопросы.НомерПоляВвода КАК НомерПоляВвода,
		|	ВариантыОтветовНаТестовыеВопросы.ЭтоЭлементСоответствия КАК ЭтоЭлементСоответствия,
		|	ВариантыОтветовНаТестовыеВопросы.ВариантыЭлементаСоответствия.(
		|		ВариантОтвета КАК ВариантОтвета
		|	) КАК ВариантыЭлементаСоответствия
		|ИЗ
		|	Справочник.ВариантыОтветовНаТестовыеВопросы КАК ВариантыОтветовНаТестовыеВопросы
		|ГДЕ
		|	ВариантыОтветовНаТестовыеВопросы.ПометкаУдаления = ЛОЖЬ
		|	И ВариантыОтветовНаТестовыеВопросы.Владелец В(&МассивВопросов)";
	
	Запрос.УстановитьПараметр("МассивВопросов", МассивВопросов);
	
	ТаблицаВариантов = Запрос.Выполнить().Выгрузить();
	
	// Завершаем
	
	Возврат Новый Структура("Вопросы, Варианты", ТаблицаВопросов, ТаблицаВариантов);
	
КонецФункции

#КонецОбласти

#КонецЕсли




