#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЭтоГруппа Тогда
		
		Если ЗначениеЗаполнено(Ссылка) И ИдентичныйРесурс = Ссылка Тогда
			Текст = НСтр("ru = 'Ресурс не может быть идентичен сам себе'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		КонецЕсли;
		
		ИдентичныйРесурсИдентичногоРесурса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИдентичныйРесурс, "ИдентичныйРесурс");
		
		Если ЗначениеЗаполнено(ИдентичныйРесурсИдентичногоРесурса) Тогда
			Текст = НСтр("ru = 'Идентичный ресурс не должен быть идентичен другому ресурсу'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ДополнительныеСвойства.Вставить("ОбъектКопирования", ОбъектКопирования);
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоГруппа Тогда
		ТипОбъектаСУЗ = Перечисления.ТипыОбъектовСУЗ.res;
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

#КонецЕсли
