
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ЗаполнитьВопросыНаПроверку()	
	
	ВопросыНаПроверку.Сортировать("ДатаОтвета");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНастройкиТестирования(СессияВыполненияТеста, НомерГруппыПодборки=Неопределено)
	Возврат Документы.ПопыткаВыполненияПодборкиВопросовСУЗ.ДанныеТестированияДляПросмотра(СессияВыполненияТеста, НомерГруппыПодборки);
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Параметры.ПроведениеОбучения) Тогда
		
		Отказ = Истина;
		Текст = НСтр("ru = 'Контекст открытия формы не определен'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
		
	КонецЕсли;	
	
	ЗаполнитьВопросыНаПроверку();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ЗаполнитьВопросыНаПроверку();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ ВопросыНаПроверку

&НаКлиенте
Процедура ВопросыНаПроверкуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = ВопросыНаПроверку.НайтиПоИдентификатору(ВыбраннаяСтрока);	
		
	НастройкиТестирования = ПолучитьНастройкиТестирования(ТекущаяСтрока.СессияТестирования, ТекущаяСтрока.НомерГруппыПодборки);
	
	ОбъектыСУЗКлиент.ОткрытьОбозреватель(НастройкиТестирования.СводЗнаний,
										 НастройкиТестирования.СсылкаНаЭлемент,
										 Истина,
										 НастройкиТестирования.ЭлементСодержанияСводаЗнаний,
										 ТекущаяСтрока.ПрохождениеОбучения,
										 ТекущаяСтрока.Задание);

КонецПроцедуры
