#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДоступныеЗначения") И Параметры.ДоступныеЗначения.Количество() > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		
		Для каждого ЗначениеВыбора Из Параметры.ДоступныеЗначения Цикл			
			ДанныеВыбора.Добавить(ЗначениеВыбора);			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ПростойКодИзСоставного(Язык) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Язык)
		ИЛИ Язык = Перечисления.ЯзыкиВебКабинетаСУ.Авто Тогда
		СоставнойКод = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(Перечисления.ЯзыкиВебКабинетаСУ.ruRU);
	Иначе
		СоставнойКод = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(Язык);
	КонецЕсли;
	
	Возврат Прав(СоставнойКод, 2);
	
КонецФункции


#КонецОбласти


#КонецЕсли