
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Устанавливает уникальное имя файла в ресурсе
//
Процедура УстановитьУникальноеИмяФайла() Экспорт
	
	ДеревоФайловРесурса = Справочники.РесурсыСУЗ.ДеревоФайлов(Владелец);
	
	Если НЕ ЗначениеЗаполнено(Родитель) Тогда
		
		ФайлыТекущегоУровня = ДеревоФайловРесурса.Строки;
		
	Иначе
		
		РодительВДереве = ДеревоФайловРесурса.Строки.Найти(Родитель, "Ссылка", Истина);
		
		Если РодительВДереве <> Неопределено Тогда
			ФайлыТекущегоУровня = РодительВДереве.Строки;
		Иначе
			ФайлыТекущегоУровня = ДеревоФайловРесурса.Строки;
		КонецЕсли;
		
	КонецЕсли;
	
	Для каждого Строка Из ФайлыТекущегоУровня Цикл
	
		Если Ссылка <> Строка.Ссылка И ИмяФайла = Строка.ИмяФайла Тогда
			ИмяФайла = "Copy_" + ИмяФайла;
			УстановитьУникальноеИмяФайла();
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЗначениеЗаполнено(ИмяФайла) Тогда
		Текст = НСтр("ru = 'Задайте имя файла'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
	
		Если НЕ ЗначениеЗаполнено(Наименование) Тогда
			Текст = НСтр("ru = 'Задайте наименование файла'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		КонецЕсли;
			
		Если НЕ ЗначениеЗаполнено(ТипФайла) Тогда
			Текст = НСтр("ru = 'Задайте тип файла'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		КонецЕсли;
		
		Если ТипФайла = Перечисления.ТипыФайловСУЗ.Media И (НЕ ЗначениеЗаполнено(Ширина) ИЛИ НЕ ЗначениеЗаполнено(Высота)) Тогда
			Текст = НСтр("ru = 'Укажите размеры медиаобъекта'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	// Делаем проверки
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;
	КонецЕсли;
	
	// Устанавливаем обязательные реквизиты
	
	Если НЕ ЭтоГруппа Тогда
		ТипОбъектаСУЗ = Перечисления.ТипыОбъектовСУЗ.file;
	КонецЕсли;	
	
	Если ТипФайла = Перечисления.ТипыФайловСУЗ.DataProcessor Тогда
		ОткрыватьВнешнимПриложением = Истина;
	КонецЕсли;	
	
	// Проверяем имя файла
	
	Если ИмяФайла = "page_scripts.js" Тогда
		Текст = НСтр("ru = 'Имя файла ""page_scripts.js"" зарезервировано для служебных нужд'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("ПропуститьКонтрольУникальностиИмениФайла") Тогда
		УстановитьУникальноеИмяФайла();
	КонецЕсли;	
	
	// Проверяем расширение
	
	Если ЭтоНовый() И НЕ ЭтоГруппа Тогда 
		
		МассивРазрешенныхРасширений = РазработкаСУЗПовтИсп.ПолучитьМассивРазрешенныхРасширенийФайлов();
		
		Если МассивРазрешенныхРасширений.Количество() > 0 Тогда
			
			ФайлТип = Новый Файл(ИмяФайла);
			РасширениеФайла = НРег(СтрЗаменить(ФайлТип.Расширение, ".", ""));
			
			Если ЗначениеЗаполнено(РасширениеФайла) И МассивРазрешенныхРасширений.Найти(РасширениеФайла) = Неопределено Тогда
				Текст = НСтр("ru = 'Файл с расширением "".%1"" запрещено загружать'");
				Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, РасширениеФайла);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;		
		
	// Создаем владельца, если он не задан	
	
	Если НЕ ЗначениеЗаполнено(Владелец) Тогда
	
		ВладелецОбъект = Справочники.РесурсыСУЗ.СоздатьЭлемент();
		ВладелецОбъект.Наименование = Наименование;
		
		Если ДополнительныеСвойства.Свойство("РодительРесурса") Тогда
			ВладелецОбъект.Родитель = ДополнительныеСвойства.РодительРесурса;	
		КонецЕсли;
		
		РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ВладелецОбъект);
		
		ВладелецОбъект.Записать();
		
		Владелец = ВладелецОбъект.Ссылка;
		
	КонецЕсли;	
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// Делаем проверки
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;
	КонецЕсли;
	
	// Обновляем владельца
	
	ВладелецОбъект = Владелец.ПолучитьОбъект();
	
	Если ТипФайла = Перечисления.ТипыФайловСУЗ.Document Тогда
		
		ВладелецОбъект.ФайлЗапуска = Ссылка;
		ВладелецОбъект.ПодключитьAPI = Истина;		
		
	КонецЕсли;	
		
	ЕдинственныйФайлРесурса = Справочники.РесурсыСУЗ.ЕдинственныйФайлРесурса(Владелец);
	
	Если ЗначениеЗаполнено(ЕдинственныйФайлРесурса) Тогда
		ВладелецОбъект.ЕдинственныйФайл = ЕдинственныйФайлРесурса;
	Иначе
		ВладелецОбъект.ЕдинственныйФайл = Неопределено;
	КонецЕсли;
	
	Если ЕдинственныйФайлРесурса = Ссылка И НЕ ПометкаУдаления Тогда		
		ВладелецОбъект.Наименование = Наименование;		
	КонецЕсли;		
	
	ВладелецОбъект.Записать(); // Плюс всегда будет обновлена дата ресурса
	
	// Обновляем даты тех ресурсов, к которым ресурс-владелец файла подключается

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗависимыеРесурсыСУЗ.Владелец КАК РесурсВладелец
		|ИЗ
		|	Справочник.ЗависимыеРесурсыСУЗ КАК ЗависимыеРесурсыСУЗ
		|ГДЕ
		|	ЗависимыеРесурсыСУЗ.ПометкаУдаления = ЛОЖЬ
		|	И ЗависимыеРесурсыСУЗ.Ресурс = &Ресурс
		|	И ЗависимыеРесурсыСУЗ.ДополняетAPI = ИСТИНА";

	Запрос.УстановитьПараметр("Ресурс", Владелец);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РесурсОбъект = ВыборкаДетальныеЗаписи.РесурсВладелец.ПолучитьОбъект();
		РесурсОбъект.Записать(); // Обновляем дату изменения
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ОбъектКопирования", ОбъектКопирования);
КонецПроцедуры

