
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	ПросроченныеМероприятия.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	ЗакрытьВыделенныеПрохождения(Элементы.ПросроченныеМероприятия.ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	ПросроченныеМероприятия.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
КонецПроцедуры

#КонецОбласти



#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗакрытьВыделенныеПрохождения(Знач МассивСтрок)
	
	Для каждого Элемент Из МассивСтрок Цикл

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	УчастникиОбученияСУО.Регистратор КАК ПрохождениеОбучения
			|ИЗ
			|	РегистрСведений.УчастникиОбученияСУО КАК УчастникиОбученияСУО
			|ГДЕ
			|	УчастникиОбученияСУО.ПроведениеОбучения = &ПроведениеОбучения
			|	И УчастникиОбученияСУО.Пользователь = &Пользователь
			|	И УчастникиОбученияСУО.Сценарий = &Сценарий";

		Запрос.УстановитьПараметр("Сценарий", Элемент.Сценарий);
		Запрос.УстановитьПараметр("Пользователь", Элемент.Пользователь);
		Запрос.УстановитьПараметр("ПроведениеОбучения", Элемент.ПроведениеОбучения);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Если ВыборкаДетальныеЗаписи.Следующий() Тогда			
			ОбучениеСУО.ПриПрохожденииМероприятия(ВыборкаДетальныеЗаписи.ПрохождениеОбучения, Перечисления.СтатусыПрохожденияОбъектовСУО.НеЗавершил);			
		КонецЕсли;
	
	КонецЦикла;
	
	ПросроченныеМероприятия.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	
КонецПроцедуры

#КонецОбласти

