///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет виды доступа, используемые в ограничениях прав доступа.
// Примечание: виды доступа Пользователи и ВнешниеПользователи предопределены,
// но их можно удалить из списка ВидыДоступа, если они не требуются для ограничения прав доступа.
//
// Параметры:
//  ВидыДоступа - ТаблицаЗначений - с колонками:
//   * Имя                    - Строка - имя, используемое в описании поставляемых
//                                       профилей групп доступа и текстах ОДД.
//   * Представление          - Строка - представляет вид доступа в профилях и группах доступа.
//   * ТипЗначений            - Тип    - тип ссылки значений доступа,
//                                       например Тип("СправочникСсылка.Номенклатура").
//   * ТипГруппЗначений       - Тип    - тип ссылки групп значений доступа,
//                                       например Тип("СправочникСсылка.ГруппыДоступаНоменклатуры").
//   * НесколькоГруппЗначений - Булево - Истина указывает, что для значения доступа (Номенклатуры) можно
//                                       выбрать несколько групп значений (Групп доступа номенклатуры).
//
// Пример:
//  1. Для настройки прав доступа в разрезе организаций:
//  ВидДоступа = ВидыДоступа.Добавить();
//  ВидДоступа.Имя = "Организации";
//  ВидДоступа.Представление = НСтр("ru = 'Организации'");
//  ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Организации");
//
//  2. Для настройки прав доступа в разрезе групп партнеров:
//  ВидДоступа = ВидыДоступа.Добавить();
//  ВидДоступа.Имя = "ГруппыПартнеров";
//  ВидДоступа.Представление    = НСтр("ru = 'Группы партнеров'");
//  ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Партнеры");
//  ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаПартнеров");
//
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ЭлектронныеРесурсы";
	ВидДоступа.Представление    = НСтр("ru = 'Электронные ресурсы'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.СводыЗнанийСУЗ");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Организаторы";
	ВидДоступа.Представление    = НСтр("ru = 'Организаторы'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.ОрганизаторыСУО");		
	
КонецПроцедуры

// Позволяет указать списки, у которых объекты метаданных содержат описание логики ограничения
// доступа в модулях менеджеров или переопределяемом модуле.
//
// В модулях менеджеров указанных списков должна быть размещена процедура обработчика,
// в которую передаются следующие параметры.
// 
//  Ограничение - Структура - со свойствами:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                            Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                            Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                            если Истина, тогда не записывать ключи доступа,
//                                            а использовать ключи доступа владельца (требуется,
//                                            чтобы ограничение было строго по объекту-владельцу).
///   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - см.
//                                            описание предыдущего параметра.
//
// Далее пример процедуры для модуля менеджера.
//
//// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
//	
//	Ограничение.Текст =
//	"РазрешитьЧтениеИзменение
//	|ГДЕ
//	|	ЗначениеРазрешено(Организация)
//	|	И ЗначениеРазрешено(Контрагент)";
//	
//КонецПроцедуры
//
// Параметры:
//  Списки - Соответствие - списки с ограничением доступа:
//             * Ключ     - ОбъектМетаданных - список с ограничением доступа.
//             * Значение - Булево - Истина - текст ограничения в модуле менеджера.
//                                 - Ложь   - текст ограничения в этом переопределяемом
//                модуле в процедуре ПриЗаполненииОграниченияДоступа.
//
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
КонецПроцедуры

// Заполняет описания поставляемых профилей групп доступа и
// переопределяет параметры обновления профилей и групп доступа.
//
// Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  ОписанияПрофилей    - Массив - добавить описания профилей групп доступа (Структура).
//                        Состав свойств структуры см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа.
//
//  ПараметрыОбновления - Структура - содержит свойства:
//   * ОбновлятьИзмененныеПрофили - Булево - начальное значение Истина.
//   * ЗапретитьИзменениеПрофилей - Булево - начальное значение Истина.
//       Если установить Ложь, тогда поставляемые профили можно не только просматривать, но и редактировать.
//   * ОбновлятьГруппыДоступа     - Булево - начальное значение Истина.
//   * ОбновлятьГруппыДоступаСУстаревшимиНастройками - Булево - начальное значение Ложь.
//       Если установить Истина, то настройки значений, выполненные администратором для
//       вида доступа, который был удален из профиля, будут также удалены из групп доступа.
//
// Пример:
//  ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
//  ОписаниеПрофиля.Имя           = "Менеджер";
//  ОписаниеПрофиля.Идентификатор = "75fa0ecb-98aa-11df-b54f-e0cb4ed5f655";
//  ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по продажам'", ОбщегоНазначения.КодОсновногоЯзыка());
//  ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
//  ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
//  ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
//  ОписаниеПрофиля.Роли.Добавить("Подсистема_Продажи");
//  ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПокупателей");
//  ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаКнигаПокупок");
//  ОписанияПрофилей.Добавить(ОписаниеПрофиля);
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
	// Получаем переменные
	
	ЭтоОО = ?(Найти(Метаданные.Имя, "ОбразовательнаяОрганизация") = 1, Истина, Ложь);
	ЭтоЭР = ?(Найти(Метаданные.Имя, "Экзаменатор") = 1, Истина, Ложь);
	ЭтоКУ = ?(НЕ ЭтоОО И НЕ ЭтоЭР, Истина, Ложь);
	
	// Профиль "Внешний доступ из веб-кабинета".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ВебКабинетСлужебныйПользователь";
	ОписаниеПрофиля.Идентификатор = "3968e7c4-03ab-11e5-be5c-f0def149b112";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Служебный пользователь веб-кабинета'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = ''");
	ОписаниеПрофиля.Роли.Добавить("ВебКабинетСлужебныйПользовательСУ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Менеджер по обучению".
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "МенеджерПоОбучению";
	ОписаниеПрофиля.Идентификатор = "06100792-4d41-45aa-9a9a-739afb00b846";
	ОписаниеПрофиля.Описание      = НСтр("ru = ''");
	
	Если ЭтоОО Тогда
		ОписаниеПрофиля.Наименование = НСтр("ru = 'Организатор учебного процесса'");
	Иначе
		ОписаниеПрофиля.Наименование = НСтр("ru = 'Менеджер по обучению'");
	КонецЕсли;
		
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");	
	
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");
	

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
	
	Если ЭтоКУ Тогда
		
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОпросов");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтветовНаВопросыАнкет");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновАнкет");
		
		

	КонецЕсли;
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхШаблоновСообщений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновСообщений");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиТекущиеДела");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеУниверсальногоОтчета");
	ОписаниеПрофиля.Роли.Добавить("ОтправкаSMS");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРассылокОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновСообщений");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРассылокОтчетов");		
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");	
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеМакетовПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеУчастниковГруппДоступа");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");	
	
	ОписаниеПрофиля.Роли.Добавить("ВебКабинетУправлениеПользователямиСУО");
	
	ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетБазовыеПраваСУО");
	ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетИнформационнаяЛентаСУО");
	ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетКаталогПользователейСУО");
	ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетПреподавательОбученияСУО");
	ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетПрохождениеОбученияСУО");
	
	Если ЭтоКУ ИЛИ ЭтоОО Тогда
	
		ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетСообщенияСУО");
		ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетУниверсальныйСервисОбщенияСУО");		
		ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетУчастиеВФорумеСУО");
	
	КонецЕсли;
	
	ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетПерсональныеНастройкиСУО");
	
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");	
	
	Если ЭтоКУ Тогда		
		ОписаниеПрофиля.Роли.Добавить("УправлениеБиблиотекойПользователейСУО");	
		ОписаниеПрофиля.Роли.Добавить("УправлениеЛитературойСУО");
	КонецЕсли;
	
	Если ЭтоКУ ИЛИ ЭтоОО Тогда 	
		ОписаниеПрофиля.Роли.Добавить("УправлениеКоммуникациямиСУО");	
	КонецЕсли;
	
	ОписаниеПрофиля.Роли.Добавить("УправлениеНовостямиСУО");
	ОписаниеПрофиля.Роли.Добавить("УправлениеПроведениемОбученияСУО");
	ОписаниеПрофиля.Роли.Добавить("УправлениеРассылкамиСУО");
	ОписаниеПрофиля.Роли.Добавить("УправлениеСтруктуройОрганизацииОО");
	ОписаниеПрофиля.Роли.Добавить("УправлениеУчастникамиОбученияСУО");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВнешнегоСоединения");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииОВерсияхОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтветовНаВопросыАнкет");
	
	ОписаниеПрофиля.Роли.Добавить("ЭлектронныеРесурсыАдминистрированиеСУО");
	ОписаниеПрофиля.Роли.Добавить("ЭлектронныеРесурсыПросмотрКаталогаСУО");
	ОписаниеПрофиля.Роли.Добавить("ЭлектронныеРесурсыПросмотрСУО");
	ОписаниеПрофиля.Роли.Добавить("ЭлектронныеРесурсыРазработкаСУО");
	ОписаниеПрофиля.Роли.Добавить("ЭлектронныеРесурсыУчебнаяБазаСУЗ");	
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	
	// Профиль "Методист".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Методист";
	ОписаниеПрофиля.Идентификатор = "e4d7e2de-ff80-40f0-9f9a-e13074abe599";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Методист'");
	
	ОписаниеПрофиля.Описание = НСтр("ru = 'Методист-разработчик электронных курсов и тестов'");	
	
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");		
	
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");	
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеМакетовПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	
	ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетБазовыеПраваСУО");
	ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетИнформационнаяЛентаСУО");
	ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетПерсональныеНастройкиСУО");
	
	Если ЭтоКУ ИЛИ ЭтоОО Тогда
	
		ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетСообщенияСУО");
		ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетУниверсальныйСервисОбщенияСУО");		
		ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетУчастиеВФорумеСУО");
	
	КонецЕсли;
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	
	Если ЭтоКУ Тогда
		ОписаниеПрофиля.Роли.Добавить("УправлениеЛитературойСУО");
		ОписаниеПрофиля.Роли.Добавить("УправлениеЗаданиямиНаПроверкуСУО");
	КонецЕсли;
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииОВерсияхОбъектов");
	
	ОписаниеПрофиля.Роли.Добавить("ЭлектронныеРесурсыАдминистрированиеСУО");
	ОписаниеПрофиля.Роли.Добавить("ЭлектронныеРесурсыПросмотрКаталогаСУО");
	ОписаниеПрофиля.Роли.Добавить("ЭлектронныеРесурсыПросмотрСУО");
	ОписаниеПрофиля.Роли.Добавить("ЭлектронныеРесурсыРазработкаСУО");
	ОписаниеПрофиля.Роли.Добавить("ЭлектронныеРесурсыУчебнаяБазаСУЗ");	
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Преподаватель".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Преподаватель";
	ОписаниеПрофиля.Идентификатор = "6148c944-7e4e-4ace-96fd-3188b101609e";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Преподаватель'");
	ОписаниеПрофиля.Описание      = НСтр("ru = ''");
	
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");		
	
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");

	
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");	
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеМакетовПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");

	ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетБазовыеПраваСУО");
	
	Если ЭтоКУ Тогда
		ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетБиблиотекаСУО");
	КонецЕсли;
	
	ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетИнформационнаяЛентаСУО");
	ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетПреподавательОбученияСУО");
	ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетПерсональныеНастройкиСУО");
	ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетСообщенияСУО");
	
	Если ЭтоКУ ИЛИ ЭтоОО Тогда
	
		
		ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетУниверсальныйСервисОбщенияСУО");		
		ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетУчастиеВФорумеСУО");
	
	КонецЕсли;
	
	ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетКаталогПользователейСУО");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииОВерсияхОбъектов");
	
	ОписаниеПрофиля.Роли.Добавить("ЭлектронныеРесурсыПросмотрКаталогаСУО");
	ОписаниеПрофиля.Роли.Добавить("ЭлектронныеРесурсыПросмотрСУО");
	ОписаниеПрофиля.Роли.Добавить("УправлениеНовостямиСУО");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	

	// Профиль "Учащийся".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Учащийся";
	ОписаниеПрофиля.Идентификатор = "825f1cde-de85-4b67-a4eb-55f17fa1e5cd";
	ОписаниеПрофиля.Описание      = "";
	
	Если ЭтоОО Тогда
		ОписаниеПрофиля.Наименование = НСтр("ru = 'Студент'");
	Иначе
		ОписаниеПрофиля.Наименование = НСтр("ru = 'Обучающийся'");
	КонецЕсли;	
	
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");		
	
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");	
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");

	ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетБазовыеПраваСУО");
	
	Если ЭтоКУ Тогда
		ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетБиблиотекаСУО");
		ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетЗаполнениеАнкетСУО");
	КонецЕсли;	
	
	ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетИнформационнаяЛентаСУО");
	ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетПерсональныеНастройкиСУО");
	ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетПрохождениеОбученияСУО");
	
	ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетСообщенияСУО");
	
	Если ЭтоКУ ИЛИ ЭтоОО Тогда
		
		ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетУниверсальныйСервисОбщенияСУО");		
		ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетУчастиеВФорумеСУО");
	
	КонецЕсли;
	
	ОписаниеПрофиля.Роли.Добавить("ЛичныйКабинетУчебныеГруппыСУО");	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");	
	ОписаниеПрофиля.Роли.Добавить("ЭлектронныеРесурсыПросмотрСУО");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	
	
КонецПроцедуры

// Заполняет зависимости прав доступа "подчиненного" объекта (например, задачи ЗадачаИсполнителя),
// от "ведущего" объекта (например,  бизнес-процесса Задание), которые отличаются от стандартных.
//
// Зависимости прав используются в стандартном шаблоне ограничения доступа для вида доступа "Объект".
// 1. Стандартно при чтении "подчиненного" объекта
//    проверяется наличие права чтения "ведущего" объекта и
//    проверяется отсутствие ограничения чтения "ведущего" объекта.
// 2. Стандартно при добавлении, изменении, удалении "подчиненного" объекта
//    проверяется наличие права изменения "ведущего" объекта и
//    проверяется отсутствие ограничения изменения "ведущего" объекта.
//
// Допускается только одно переназначение по сравнению со стандартным -
// в пункте 2 вместо проверки права изменения "ведущего" объекта установить
// проверку права чтения "ведущего" объекта.
//
// Параметры:
//  ЗависимостиПрав - ТаблицаЗначений - с колонками:
//   * ВедущаяТаблица     - Строка - например Метаданные.БизнесПроцессы.Задание.ПолноеИмя().
//   * ПодчиненнаяТаблица - Строка - например Метаданные.Задачи.ЗадачаИсполнителя.ПолноеИмя().
//
Процедура ПриЗаполненииЗависимостейПравДоступа(ЗависимостиПрав) Экспорт
	
	
	
КонецПроцедуры

// Заполняет описания возможных прав, назначаемых для объектов указанных типов.
// 
// Параметры:
//  ВозможныеПрава - ТаблицаЗначений - с колонками:
//   ВладелецПрав - Строка - полное имя таблицы значения доступа.
//
//   Имя          - Строка - идентификатор права, например ИзменениеПапок. Право с именем УправлениеПравами
//                  должно быть обязательно определено для общей формы настройки прав "Права доступа".
//                  УправлениеПравами - это право на изменение прав по владельцу прав, которое проверяется
//                  при открытии ОбщаяФорма.НастройкиПравОбъектов.
//
//   Заголовок    - Строка - заголовок права, например в форме НастройкиПравОбъектов:
//                  "Изменение.
//                  |папок".
//
//   Подсказка    - Строка - подсказка к заголовку права,
//                  например "Добавление, изменение и пометка удаления папок".
//
//   НачальноеЗначение - Булево - начальное значение флажка права при добавлении новой строки
//                  в форме "Права доступа".
//
//   ТребуемыеПрава - Массив строк - имена прав, требуемых для этого права -
//                  например, право "ДобавлениеФайлов" требует права "ИзменениеФайлов".
//
//   ЧтениеВТаблицах - Массив строк - полные имена таблиц, для которых это право обозначает право Чтение.
//                  Возможно использование символа "*", который обозначает "для всех остальных таблиц",
//                  т.к. право Чтение может зависеть только от права Чтение, то имеет смысл только символ "*"
//                  (требуется для работы шаблонов ограничения доступа).
//
//   ИзменениеВТаблицах - Массив строк - полные имена таблиц, для которых это право обозначает право Изменение.
//                  Возможно использование символа "*", который обозначает "для всех остальных таблиц"
//                  (требуется для работы шаблонов ограничения доступа).
//
Процедура ПриЗаполненииВозможныхПравДляНастройкиПравОбъектов(ВозможныеПрава) Экспорт
	
КонецПроцедуры

// Определяет вид используемого интерфейса пользователя для настройки доступа.
//
// Параметры:
//  УпрощенныйИнтерфейс - Булево - начальное значение Ложь.
//
Процедура ПриОпределенииИнтерфейсаНастройкиДоступа(УпрощенныйИнтерфейс) Экспорт
	
КонецПроцедуры

// Заполняет использование видов доступа в зависимости от функциональных опций конфигурации,
// например, ИспользоватьГруппыДоступаНоменклатуры.
//
// Параметры:
//  ВидДоступа    - Строка - имя вида доступа, заданное в процедуре ПриЗаполненииВидовДоступа.
//  Использование - Булево - начальное значение Истина.
// 
Процедура ПриЗаполненииИспользованияВидаДоступа(ВидДоступа, Использование) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ВидДоступа = "ЭлектронныеРесурсы" Тогда
		Использование = Истина;
	КонецЕсли;		
	
КонецПроцедуры

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Список - ОбъектМетаданных - список, для которого нужно вернуть текст ограничения.
//                              В процедуре ПриЗаполненииСписковСОграничениемДоступа нужно
//                              указать для списка значение Ложь, иначе вызова не будет.
//
//  Ограничение - Структура - со свойствами, как для процедур в модулях менеджеров. См. свойства
//                            в комментарии к процедуре ПриЗаполненииСписковСОграничениемДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Список, Ограничение) Экспорт
	
	
	
КонецПроцедуры

// Заполняет состав видов доступа, используемых при ограничении прав объектов метаданных.
// Если состав видов доступа не заполнен, отчет "Права доступа" покажет некорректные сведения.
//
// Обязательно требуется заполнить только виды доступа, используемые в шаблонах ограничения доступа
// явно, а виды доступа, используемые в наборах значений доступа, могут быть получены из текущего
// состояния регистра сведений НаборыЗначенийДоступа.
//
//  Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  Описание     - Строка - многострочная строка формата <Таблица>.<Право>.<ВидДоступа>[.Таблица объекта],
//                 например, "Документ.ПриходнаяНакладная.Чтение.Организации",
//                           "Документ.ПриходнаяНакладная.Чтение.Контрагенты",
//                           "Документ.ПриходнаяНакладная.Изменение.Организации",
//                           "Документ.ПриходнаяНакладная.Изменение.Контрагенты",
//                           "Документ.ЭлектронныеПисьма.Чтение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.ЭлектронныеПисьма.Изменение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.Файлы.Чтение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Чтение.Объект.Документ.ЭлектронноеПисьмо",
//                           "Документ.Файлы.Изменение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Изменение.Объект.Документ.ЭлектронноеПисьмо".
//                 Вид доступа Объект предопределен как литерал. Этот вид доступа используется в
//                 шаблонах ограничений доступа как "ссылка" на другой объект, по которому
//                 ограничивается текущий объект таблицы.
//                 Когда вид доступа "Объект" задан, также требуется задать типы таблиц,
//                 которые используются для этого вида доступа. Т.е. перечислить типы,
//                 которые соответствуют полю, использованному в шаблоне ограничения доступа
//                 в паре с видом доступа "Объект". При перечислении типов по виду доступа "Объект"
//                 нужно перечислить только те типы поля, которые есть
//                 у поля РегистрыСведений.НаборыЗначенийДоступа.Объект, остальные типы лишние.
// 
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = "Справочник.КаталогМероприятийСУО.Изменение.Организаторы
	|Справочник.КаталогПрограммОбученияСУО.Изменение.Организаторы
	|Справочник.ОрганизаторыСУО.Чтение.Организаторы
	|Справочник.ОрганизаторыСУО.Изменение.Организаторы
	|Справочник.СводыЗнанийСУЗ.Чтение.ЭлектронныеРесурсы
	|Справочник.СерииПинКодовСУО.Чтение.Организаторы
	|Справочник.СодержаниеСУЗ.Чтение.ЭлектронныеРесурсы
	|Справочник.УчебныеГруппыСУО.Изменение.Организаторы
	|Справочник.ШаблоныСообщенийСУО.Изменение.Организаторы
	|Документ.ЗаявкаНаОбучениеСУО.Чтение.Организаторы
	|Документ.НаполнениеБиблиотекиПользователейСУО.Чтение.Организаторы
	|Документ.ПопыткаВыполненияЗаданияСУО.Чтение.Организаторы
	|Документ.ПроведениеОбученияСУО.Чтение.Организаторы
	|Документ.ПроведениеОбученияСУО.Изменение.Организаторы
	|Документ.ПроведениеПреподавателемОбученияСУО.Чтение.Организаторы
	|Документ.ПроведениеПрограммыОбученияСУО.Чтение.Организаторы
	|Документ.ПрохождениеОбученияСУО.Чтение.Организаторы
	|Документ.РассылкаСообщенийСУО.Чтение.Организаторы
	|Документ.СертификатСУО.Чтение.Организаторы
	|Документ.СертификатСУО.Изменение.Организаторы
	|Документ.СообщениеСУО.Чтение.Организаторы
	|РегистрСведений.АвтоматическиеРассылкиСУО.Чтение.Организаторы
	|РегистрСведений.ВремяДоступаПользователейСУО.Изменение.Пользователи
	|РегистрСведений.ВыданныеПинКодыСУО.Чтение.Организаторы
	|РегистрСведений.ЗаявкиНаОбучениеСУО.Чтение.Организаторы
	|РегистрСведений.НовыеЗачисленияНаОбучениеСУО.Чтение.Организаторы
	|РегистрСведений.ОткрытоеОбучениеСУО.Чтение.Организаторы
	|РегистрСведений.ПопыткиПрохожденияЗаданийСУО.Чтение.Организаторы
	|РегистрСведений.ПреподавателиОбученияСУО.Чтение.Организаторы
	|РегистрСведений.ПроведениеОбученияСУО.Чтение.Организаторы
	|РегистрСведений.ПроведениеПодчиненныхМероприятийСУО.Чтение.Организаторы
	|РегистрСведений.ПроведениеПреподавателямиОбученияСУО.Чтение.Организаторы
	|РегистрСведений.ПрохожденияОбученияСУО.Чтение.Организаторы
	|РегистрСведений.РасписаниеОбученияСУО.Чтение.Организаторы
	|РегистрСведений.РасписаниеПреподавателейСУО.Чтение.Организаторы
	|РегистрСведений.УчастникиОбученияСУО.Чтение.Организаторы
	|Справочник.Файлы.Чтение.ВнешниеПользователи
	|Справочник.Файлы.Чтение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.Файлы.Чтение.Объект.Документ.ЗаявкаНаОбучениеСУО
	|Справочник.Файлы.Чтение.Объект.Документ.ПопыткаВыполненияЗаданияСУО
	|Справочник.Файлы.Чтение.Объект.Справочник.ВариантыЗаданийСУО
	|Справочник.Файлы.Чтение.Объект.Справочник.ЗаданияСУО
	|Справочник.Файлы.Чтение.Объект.Справочник.ЛитератураСУО
	|Справочник.Файлы.Чтение.Объект.Справочник.ПапкиФайлов
	|Справочник.Файлы.Изменение.ВнешниеПользователи
	|Справочник.Файлы.Изменение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.Файлы.Изменение.Объект.Документ.ЗаявкаНаОбучениеСУО
	|Справочник.Файлы.Изменение.Объект.Документ.ПопыткаВыполненияЗаданияСУО
	|Справочник.Файлы.Изменение.Объект.Справочник.ВариантыЗаданийСУО
	|Справочник.Файлы.Изменение.Объект.Справочник.ЗаданияСУО
	|Справочник.Файлы.Изменение.Объект.Справочник.ЛитератураСУО
	|Справочник.Файлы.Изменение.Объект.Справочник.ПапкиФайлов
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Чтение.Пользователи
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Чтение.УчетныеЗаписиЭлектроннойПочты
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Изменение.Пользователи
	|Справочник.Пользователи.Чтение.Пользователи
	|Справочник.Пользователи.Изменение.Пользователи
	|РегистрСведений.ДополнительныеСведения.Чтение.ДополнительныеСведения
	|РегистрСведений.ДополнительныеСведения.Изменение.ДополнительныеСведения
	|РегистрСведений.СоставыГруппПользователей.Чтение.ВнешниеПользователи
	|РегистрСведений.СоставыГруппПользователей.Чтение.Пользователи
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.ЗаявкаНаОбучениеСУО
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.ПопыткаВыполненияЗаданияСУО
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.ВариантыЗаданийСУО
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.ЗаданияСУО
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.ЛитератураСУО
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.ПапкиФайлов
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ЗаявкаНаОбучениеСУО
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ПопыткаВыполненияЗаданияСУО
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ВариантыЗаданийСУО
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ЗаданияСУО
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ЛитератураСУО
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ПапкиФайлов
	|Справочник.ВнешниеПользователи.Чтение.ВнешниеПользователи
	|Справочник.ВнешниеПользователи.Изменение.ВнешниеПользователи
	|Справочник.ГруппыВнешнихПользователей.Чтение.ВнешниеПользователи
	|Справочник.ГруппыПользователей.Чтение.Пользователи
	|Справочник.ДополнительныеОтчетыИОбработки.Чтение.ДополнительныеОтчетыИОбработки
	|Справочник.ЗначенияСвойствОбъектов.Чтение.ДополнительныеСведения
	|Справочник.ЗначенияСвойствОбъектовИерархия.Чтение.ДополнительныеСведения
	|Справочник.ПапкиФайлов.Чтение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.ПапкиФайлов.Изменение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.ШаблоныСообщенийПрисоединенныеФайлы.Чтение.Пользователи
	|Справочник.ШаблоныСообщенийПрисоединенныеФайлы.Изменение.Пользователи
	|Справочник.ШаблоныСообщений.Чтение.Пользователи
	|Справочник.ШаблоныСообщений.Изменение.Пользователи
	|ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Чтение.ДополнительныеСведения";	
	
	
КонецПроцедуры

// Позволяет реализовать перезапись зависимых наборов значений доступа других объектов.
//
// Вызывается из процедур
//  УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа,
//  УправлениеДоступомСлужебный.ЗаписатьЗависимыеНаборыЗначенийДоступа.
//
// Параметры:
//  Ссылка       - СправочникСсылка, ДокументСсылка, ... - ссылка на объект, для которого
//                 записаны наборы значений доступа.
//
//  СсылкиНаЗависимыеОбъекты - Массив - массив элементов типа СправочникСсылка, ДокументСсылка и т. п.
//                 Содержит ссылки на объекты с зависимыми наборами значений доступа.
//                 Начальное значение - пустой массив.
//
Процедура ПриИзмененииНаборовЗначенийДоступа(Ссылка, СсылкиНаЗависимыеОбъекты) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
