#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Ссылка");
	Поля.Добавить("Владелец");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	ДанныеВарианта = ОбъектыСУЗ.ПолучитьДанные(Данные.Владелец, Данные.Ссылка, Истина); 
	
	Если ЗначениеЗаполнено(ДанныеВарианта) Тогда	
		СтандартнаяОбработка = Ложь;	
		Представление = ДанныеВарианта;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
