#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)	
	ОбщегоНазначенияСУ.ИсключитьЗначенияПеречисленияИзСпискаВыбора(Параметры, ДанныеВыбора, "ТипыВопросовСУЗ", СтандартнаяОбработка);			
КонецПроцедуры

Функция ТипВопросаПлеераВебКабинетаВСтроку(ТипВопроса) Экспорт
	
	Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.ОдинИзМногих Тогда
		Возврат "SINGLE";
	КонецЕсли;
	
	Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.МногиеИзМногих Тогда
		Возврат "MULTIPLE";
	КонецЕсли;
	
	Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.Последовательность Тогда
		Возврат "SEQUENCE";
	КонецЕсли;	
	
	Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.ПоШаблону Тогда
		Возврат "INPUT";
	КонецЕсли;		
		
	ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Тип вопроса %1 не поддерживается плеером веб-кабинета'"), Строка(ТипВопроса));
	
	ВызватьИсключение ТекстОшибки;
	
КонецФункции


#КонецОбласти

#КонецЕсли