

#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор <> Неопределено
		И Параметры.Отбор.Свойство("Серия")
		И ЗначениеЗаполнено(Параметры.Отбор.Серия) Тогда
		
		Серия = Параметры.Отбор.Серия;
		
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(ЭтотОбъект, "Серия", Ложь);
		
	Иначе
		
		Элементы.ФормаСформировать.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Сформировать(Команда)
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	
	КЧ = Новый КвалификаторыЧисла(12,0, ДопустимыйЗнак.Неотрицательный);
	ОписаниеТипов = Новый ОписаниеТипов(Массив, КЧ);
	
	Оповещение =  Новый ОписаниеОповещения("ПослеВводаЗначения", ЭтотОбъект);
		
	ПоказатьВводЗначения(Оповещение, 1000, НСтр("ru = 'Количество кодов для создания'"), ОписаниеТипов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначения(КоличествоКодов, Параметры) Экспорт
    Если КоличествоКодов <> Неопределено Тогда
		СформироватьНаСервере(КоличествоКодов);
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере(КоличествоКодов)
	
	РегистрыСведений.ВыданныеПинКодыСУО.СоздатьКодыСерии(Серия, КоличествоКодов);	
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьКакВыданныйНаСервере()
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ТипЗнч(ВыделенныеСтроки) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Для каждого Строка Из ВыделенныеСтроки Цикл
		РегистрыСведений.ВыданныеПинКодыСУО.УстановитьСнятьОтметкуВыдан(Строка.Серия, Строка.Код);
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьКакВыданный(Команда)
	ОтметитьКакВыданныйНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаблокироватьПинКодНаСервере()

	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ТипЗнч(ВыделенныеСтроки) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Для каждого Строка Из ВыделенныеСтроки Цикл
		РегистрыСведений.ВыданныеПинКодыСУО.УстановтьСнятьОтметкуЗаблокирован(Строка.Серия, Строка.Код);
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	Элементы.Список.Обновить();	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаблокироватьПинКод(Команда)
	ЗаблокироватьПинКодНаСервере();
КонецПроцедуры

#КонецОбласти


