#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ОбъектКопирования", ОбъектКопирования);
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		ТипОбъектаСУЗ = Перечисления.ТипыОбъектовСУЗ.question;			
	КонецЕсли;
	
	Если НЕ ОбменДанными.Загрузка И НЕ ЭтоГруппа Тогда
		
		// МетодРасчетаРезультата
		
		Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.ЭлементActiveX
		 ИЛИ ТипВопроса = Перечисления.ТипыВопросовСУЗ.Открытый
		 ИЛИ ТипВопроса = Перечисления.ТипыВопросовСУЗ.РаботаВПрограмме Тогда
			МетодРасчетаРезультата = Перечисления.МетодыРасчетаРезультатаВопросаСУЗ.ПустаяСсылка();
		КонецЕсли;
		
		Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.ОдинИзМногих
		 ИЛИ ТипВопроса = Перечисления.ТипыВопросовСУЗ.ПоШаблону Тогда
			МетодРасчетаРезультата = Перечисления.МетодыРасчетаРезультатаВопросаСУЗ.ТочноеСовпадение;
		КонецЕсли;
			
		// РазрешенРазвернутыйОтвет
		
		Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.Открытый Тогда
			РазрешенРазвернутыйОтвет = Истина;
		КонецЕсли;
		
		Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.ЭлементActiveX Тогда
			РазрешенРазвернутыйОтвет = Ложь;
		КонецЕсли;
		
		// Устанавливаем реквизит "ФасетныйВопрос".
		
		Если ТипВопроса <> Перечисления.ТипыВопросовСУЗ.ОдинИзМногих
		   И ТипВопроса <> Перечисления.ТипыВопросовСУЗ.МногиеИзМногих
		   И ТипВопроса <> Перечисления.ТипыВопросовСУЗ.ПоШаблону Тогда
			ФасетныйВопрос = Ложь;
		КонецЕсли;
		
		// ПоследовательныйВыводВариантов
		
		Если ТипВопроса <> Перечисления.ТипыВопросовСУЗ.Таблица
		 И ТипВопроса <> Перечисления.ТипыВопросовСУЗ.Соответствие Тогда
			ПоследовательныйВыводВариантов = Ложь;
		КонецЕсли;
		
		// Очищаем значения параметров, заполняемых программой
		
		Для каждого СтрокаТЧ Из Параметры Цикл
		
			Если СтрокаТЧ.ЗаполняетсяПрограммой Тогда
				СтрокаТЧ.Значение = Неопределено;
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
	

