

// Позволяет переопределить настройки тестирования
//
// Параметры:
//   * НастройкиТестированияXDTO - ФабрикаXDTO - http://v8.1c.ru/kms/1/Collection
//   * КонтекстВыполнения        - Структура - Список свойств структуры см. процедуру
//                                 ЗаполнитьКонтекстВыполненияОбъекта модуля ОбъектыСУЗ
//
Процедура ПриЗаполненииНастроекТестирования(НастройкиТестированияXDTO, КонтекстВыполнения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	// Если тест проходится в рамках прохождения мероприятия, а пользователь
	// Мероприятия не совпадает с текущим, то тест будет в режиме ТолькоПросмотр.
	// А так же если мероприятие завершено или не завершено.	
	
	Если КонтекстВыполнения.Свойство("ПрохождениеОбучения")
		И ЗначениеЗаполнено(КонтекстВыполнения.ПрохождениеОбучения)
		И (КонтекстВыполнения.ПрохождениеОбучения.Пользователь <> ОбъектыСУЗ.ТекущийПользователь(КонтекстВыполнения)
		ИЛИ КонтекстВыполнения.ПрохождениеОбучения.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил
		ИЛИ КонтекстВыполнения.ПрохождениеОбучения.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат
		ИЛИ  КонтекстВыполнения.ПрохождениеОбучения.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.НеЗавершил) Тогда
			
			НастройкиТестированияXDTO.ТолькоПросмотр = Истина; 
	
	КонецЕсли;
	
	//----------------------------------//
	
	НастройкиТестированияXDTO.ЕстьПравоДобавитьПопытку = (Пользователи.ЭтоПолноправныйПользователь(,,Ложь) ИЛИ РольДоступна(Метаданные.Роли.ЭлектронныеРесурсыАдминистрированиеСУО)); //--# КОНСТРУКТОР КУРСОВ ЗАМЕНИТЬ РОЛЬ 
	
КонецПроцедуры

Процедура ПриПросмотреЭлектронногоРесурса(ЭлектронныйРесурс, ПрохождениеОбучения, Задание) Экспорт
	
	
КонецПроцедуры

Процедура ПослеПрохожденияТестирования(НомерДокументаТестирования, ПрохождениеОбучения, Задание) Экспорт
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	Если ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
			
		Если ЗначениеЗаполнено(Задание) Тогда
			ОбучениеСУО.ПриПрохожденииЗадания(ПрохождениеОбучения, Задание);
		Иначе
			ОбучениеСУО.ПриПрохожденииМероприятия(ПрохождениеОбучения);
		КонецЕсли;
		
	КонецЕсли;	
	
	//----------------------------------//
	
КонецПроцедуры

Процедура ПриЗакрытииЭлектронногоРесурса(ЭлектронныйРесурс, ПрохождениеОбучения, Задание) Экспорт	
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	Если ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
		
		Если ЗначениеЗаполнено(Задание) Тогда
			ОбучениеСУО.ПриПрохожденииЗадания(ПрохождениеОбучения, Задание);
		Иначе
			ОбучениеСУО.ПриПрохожденииМероприятия(ПрохождениеОбучения);
		КонецЕсли;
		
	КонецЕсли;
	
	//----------------------------------//
	
КонецПроцедуры

Процедура ПередДобавлениемПопыткиТестирования(Пользователь, ЭлектронныйРесурс, Тест, ПрохождениеОбучения, Задание) Экспорт
	
	Пользователь = ?(ЗначениеЗаполнено(ПрохождениеОбучения), ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПрохождениеОбучения, "Пользователь"), Пользователь);
	
КонецПроцедуры

Процедура ПослеДобавленияПопыткиТестирования(Пользователь, ЭлектронныйРесурс, Тест, ПрохождениеОбучения, Задание) Экспорт
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//

	Если ЗначениеЗаполнено(ПрохождениеОбучения) Тогда		
		ОбучениеСУО.ПриПрохожденииМероприятия(ПрохождениеОбучения, Перечисления.СтатусыПрохожденияОбъектовСУО.Проходит,,,Истина);
	КонецЕсли;	
	
	//----------------------------------//
	
КонецПроцедуры

Процедура ПослеСохраненияДанныхПрохожденияПубликации(ЭлектронныйРесурс, ПрохождениеОбучения, Задание, Пользователь, Синхронно = Ложь) Экспорт	
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	Если ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
		
		ВремяОжидания = ?(Синхронно, 15, 6);
		
		Отбор = Новый Структура;
		Отбор.Вставить("ИмяМетода", "ОбучениеСУО.ПриПрохожденииЭлектронногоРесурса");
		Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
		Отбор.Вставить("Ключ", Строка(Пользователь.УникальныйИдентификатор()));
		ФоновыеЗаданияОбновления = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
		
		Если ФоновыеЗаданияОбновления.Количество() > 0 Тогда
			
			Попытка
				ФоновыеЗадания.ОжидатьЗавершения(ФоновыеЗаданияОбновления, ВремяОжидания);
			Исключение
				
				ЗаписьЖурналаРегистрации(
					НСТр("ru = 'Веб-кабинет.Обновление данных'"),
					УровеньЖурналаРегистрации.Предупреждение,
					,
					ПрохождениеОбучения,
					НСТр("ru = 'Фоновое обновление данных при изучении электронного курса выполняется слишком долго. Время ожидания:'") + Строка(ВремяОжидания) + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					
				Если НЕ Синхронно Тогда		
					Возврат; // Не дождались
				КонецЕсли;
				
			КонецПопытки;				
			
		КонецЕсли;
		
		Если Синхронно Тогда
			
			Попытка
				ОбучениеСУО.ПриПрохожденииЭлектронногоРесурса(ПрохождениеОбучения, Задание);
			Исключение
				
				ЗаписьЖурналаРегистрации(
					НСТр("ru = 'Веб-кабинет.Обновление данных'"),
					УровеньЖурналаРегистрации.Ошибка,
					,
					ПрохождениеОбучения,
					НСТр("ru = 'Синхронная операция обновления данных обучения завершилась с ошибкой'")  + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					
				Синхронно = Ложь;
				
			КонецПопытки;			
			
		КонецЕсли;
		
		Если НЕ Синхронно Тогда
			
			МассивПараметровФЗ = Новый Массив;
			МассивПараметровФЗ.Добавить(ПрохождениеОбучения);
			МассивПараметровФЗ.Добавить(Задание);
			
			Попытка
				ФоновыеЗадания.Выполнить("ОбучениеСУО.ПриПрохожденииЭлектронногоРесурса", МассивПараметровФЗ, Строка(Пользователь.УникальныйИдентификатор()));
			Исключение
				
				ЗаписьЖурналаРегистрации(
				НСТр("ru = 'Веб-кабинет.Обновление данных'"),
				УровеньЖурналаРегистрации.Ошибка,
				,
				ПрохождениеОбучения,
				НСТр("ru = 'Запуск фонового задания при изучении электронного курса не удался.'")  + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				Возврат;
				
			КонецПопытки;				
			
		КонецЕсли;
		
		
	КонецЕсли;		
	
	//----------------------------------//
	
КонецПроцедуры

Процедура ПриОпределенииПраваПросмотраПрохожденийДругихПользователей(ЕстьПраво) Экспорт
	
	ЕстьПраво = ОбучениеСУОПовтИсп.ЕстьПравоПросматриватьВыполненныеЗадания(); //--# ЗАМЕНИТЬ НА: КонструкторКурсов.ЕстьПравоПросмотраСессий()
	
КонецПроцедуры

Процедура ПриОпределенииТипПубликацииПоУмолчанию(ТипПубликации) Экспорт	
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	Если ВебКабинетСУ.Используется() Тогда
		
		ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.WS;
		
	Иначе
		
	//----------------------------------//
		
		ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.HTML;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриОпределенииДоступныхТиповПубликации(ТипыПубликацииДляИсключения) Экспорт
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	Если ВебКабинетСУ.Используется() Тогда
		
		ИндексТипа = ТипыПубликацииДляИсключения.Найти(Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.WS);
		
		Если ИндексТипа <> Неопределено Тогда
			ТипыПубликацииДляИсключения.Удалить(ИндексТипа); // Убираем публикацю для ВК из исключенных
		КонецЕсли;		

	КонецЕсли;	
	
	//----------------------------------//
	
КонецПроцедуры

Процедура ПослеЗагрузкиЭлектронногоРесурса() Экспорт
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	Справочники.СводыЗнанийСУЗ.ОбновитьДанныеВебКабинетаДляВсехПользователей();
	
	//----------------------------------//

	
КонецПроцедуры

Функция ИмяПодсистемы() Экспорт
	
	Возврат Метаданные.Имя;
	
КонецФункции

Процедура ПроведениеОбучения(ПроведениеОбучения, ПрохождениеОбучения) Экспорт
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	Если ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
		ПроведениеОбучения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПрохождениеОбучения, "ПроведениеОбучения");
	КонецЕсли;
	
	//----------------------------------//
	
КонецПроцедуры

Процедура ПользовательОбучения(Пользователь, ПрохождениеОбучения) Экспорт
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//

	Если ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
		Пользователь = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПрохождениеОбучения, "Пользователь");
	КонецЕсли;
	
	//----------------------------------//
	
КонецПроцедуры

Функция ОбучениеОтменено(Знач ИзучениеОтменено, Знач ПрохождениеОбучения, Знач Задание) Экспорт
	
	Отменено = ИзучениеОтменено;
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	Если НЕ Отменено Тогда
	
		ПопыткаВыполненияЗадания = ОбучениеСУО.ПоследнееПрохождениеЗадания(ПрохождениеОбучения, Задание);
		Если ЗначениеЗаполнено(ПопыткаВыполненияЗадания) Тогда
			Отменено = Документы.ПопыткаВыполненияЗаданияСУО.Отменено(ПопыткаВыполненияЗадания);
		ИначеЕсли ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
			Отменено = Документы.ПрохождениеОбученияСУО.Отменено(ПрохождениеОбучения);
		КонецЕсли;
		
	КонецЕсли;
		
	//----------------------------------//
	
	Возврат Отменено;
	
КонецФункции