#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;			
	
	Если ЭтоЕдинственнаяПубликацияВОбщемКаталоге Тогда
		
		// Проверяем соединение с базой
		
		ОшибкаСоединения = ОбщегоНазначенияСУ.ПроверитьСоединениеСБазой();
		Если ЗначениеЗаполнено(ОшибкаСоединения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОшибкаСоединения);
		КонецЕсли;
		
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Редакция) Тогда
		Редакция = ВебКабинетСУ.Редакция();
	КонецЕсли;
	
	Если Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция20 Тогда
		АдресКаталогаКартинок = "";
	КонецЕсли;
	
	Если НЕ СлужебныйПользовательУказанВПубликацииИнформационнойБазы Тогда
		ПодключитьОтчеты = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;			
	
	Если ДополнительныеСвойства.Свойство("ИспользоватьПоУмолчанию")
		И ДополнительныеСвойства.ИспользоватьПоУмолчанию Тогда
		
		ВебКабинетСУ.УстановитьОсновнуюПубликацию(Ссылка);
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого Строка Из ПоляРегистрации Цикл
	
		Если ТипЗнч(Строка.Имя) = Тип("Строка")
			И НЕ ЗначениеЗаполнено(Строка.КонтактнаяИнформация)
			И НЕ ЗначениеЗаполнено(Строка.Реквизит) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Если поле регистрации определено строкой,
				|то необходимо указать реквизит или вид контактной информации,
				|в которое будет помещено значение поля.'"),
				,
				"Объект.ПоляРегистрации[" + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(Строка.НомерСтроки - 1) + "].Имя",
				,
				Отказ
			);
				
		КонецЕсли;
		
		Если ТипЗнч(Строка.Имя) = Тип("ПеречислениеСсылка.ВидыПолейРегистрацииВебКабинетаСУО")
			И (ЗначениеЗаполнено(Строка.КонтактнаяИнформация)
			ИЛИ ЗначениеЗаполнено(Строка.Реквизит)) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Если поле регистрации определено типом,
				|то нельзя указывать реквизит или вид контактной информации'"),
				,
				"Объект.ПоляРегистрации[" + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(Строка.НомерСтроки - 1) + "].Имя",
				,
				Отказ
			);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.КонтактнаяИнформация)
			И ЗначениеЗаполнено(Строка.Реквизит) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Нельзя указывать реквизит и вид контактной информации одновременно'"),
				,
				"Объект.ПоляРегистрации[" + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(Строка.НомерСтроки - 1) + "].КонтактнаяИнформация",
				,
				Отказ
			);
			
		КонецЕсли;
		
		Если Строка.ДобавлятьПолеПодтверждения
			И НЕ ЗначениеЗаполнено(Строка.НаименованиеПодтверждения) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Укажите наименование поля подтверждения'"),
				,
				"Объект.ПоляРегистрации[" + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(Строка.НомерСтроки - 1) + "].НаименованиеПодтверждения",
				,
				Отказ
			);
			
		КонецЕсли;
		
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ЗаполнитьАвтоматическуюПубликацию() Экспорт
	
	// Получаем переменные
	
	АдресБазы = ОбщегоНазначенияСУ.АдресИнформационнойБазы();
	СтруктураАдресаБазы = ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресБазы);	
	
	АдресОбщегоКаталога =  ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(Константы.АдресОбщегоКаталогаСУ.Получить());
	СтруктураАдресаОбщегоКаталога = ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресОбщегоКаталога);	
	
	Если СтруктураАдресаБазы.Схема <> СтруктураАдресаОбщегоКаталога.Схема Тогда		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Различаются схемы общего каталога и адреса базы: %1 не равно %2'"), СтруктураАдресаБазы.Схема, СтруктураАдресаОбщегоКаталога.Схема);		
	КонецЕсли;		
	
	Если СтруктураАдресаБазы.ИмяСервера <> СтруктураАдресаОбщегоКаталога.ИмяСервера Тогда		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Различаются имена сервера общего каталога и адреса базы: %1 не равно %2'"), СтруктураАдресаБазы.ИмяСервера, СтруктураАдресаОбщегоКаталога.ИмяСервера);		
	КонецЕсли;	
	
	Если Найти(АдресОбщегоКаталога, "?") > 0 ИЛИ Найти(АдресОбщегоКаталога, "#") > 0 Тогда
		ВызватьИсключение НСтр("ru = 'Адрес общего каталога не должен содержать знаков ? или #'");
	КонецЕсли;
	
	Если Найти(АдресБазы, "?") > 0 ИЛИ Найти(АдресБазы, "#") > 0 Тогда
		ВызватьИсключение НСтр("ru = 'Адрес базы не должен содержать знаков ? или #'");
	КонецЕсли;	
	
	// Заполняем реквизиты
	
	Если ЭтоНовый() Тогда
		
		Если Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция20 Тогда
			Наименование = НСтр("ru = 'Основная публикация'");
		Иначе
			Наименование = НСтр("ru = 'Электронное обучение'");
		КонецЕсли;
		
		ЭтоЕдинственнаяПубликацияВОбщемКаталоге = Истина;
		
		МассивАвтоРеквизитов = Новый Массив;
		МассивАвтоРеквизитов.Добавить("СкрыватьНовостиСтарее");
		МассивАвтоРеквизитов.Добавить("ДоступнаСвободнаяРегистрация");
		МассивАвтоРеквизитов.Добавить("ДоступноВосстановлениеПароля");
		МассивАвтоРеквизитов.Добавить("ДоступнаСтандартнаяАутентификация");
		МассивАвтоРеквизитов.Добавить("ДоступенСписокОбучения");
		МассивАвтоРеквизитов.Добавить("ДоступенКалендарьОбучения");
		МассивАвтоРеквизитов.Добавить("ДоступноОткрытоеОбучение");
		МассивАвтоРеквизитов.Добавить("ДоступныРезультатыОбучения");
		МассивАвтоРеквизитов.Добавить("ДоступныСертификатыОбучения");
		МассивАвтоРеквизитов.Добавить("ПоказыватьСтатусОбучения");
		МассивАвтоРеквизитов.Добавить("ДоступнаКарточкаОбучения");
		МассивАвтоРеквизитов.Добавить("ВариантКалендаря");
		МассивАвтоРеквизитов.Добавить("ДоступнаОтправкаЛичныхСообщенийИзКарточкиПользователя");
		МассивАвтоРеквизитов.Добавить("ОткрыватьЭлектронныеРесурсыОбученияВНовомОкне");
		МассивАвтоРеквизитов.Добавить("ОткрыватьЭлементыБиблиотекиВНовомОкне");
		МассивАвтоРеквизитов.Добавить("ПоказыватьКоличествоЭлементовРазделаБиблиотеки");
		МассивАвтоРеквизитов.Добавить("СтартоваяСтраница");
		МассивАвтоРеквизитов.Добавить("ПоказыватьРолиПреподавателей");
		МассивАвтоРеквизитов.Добавить("ПоказыватьПользователейОнлайн");
		МассивАвтоРеквизитов.Добавить("ПоказыватьПользователейОнлайнВМеню");
		МассивАвтоРеквизитов.Добавить("ИспользоватьПинКодыДляРегистрации");
		МассивАвтоРеквизитов.Добавить("Язык");
		МассивАвтоРеквизитов.Добавить("ДоступенРазделПроверкиЗаданий");
		МассивАвтоРеквизитов.Добавить("ДоступенПолныйКаталогПользователей");
			
		ЗаполнитьРеквизитыЗначениемЗаполнения(МассивАвтоРеквизитов);
			
		Справочники.ПубликацииВебКабинетаСУ.ЗаполнитьОбъектНачальнымиДанными(ЭтотОбъект);		
		
	КонецЕсли;
	
	АдресВебСервера = СтруктураАдресаБазы.Схема + "://" + СтруктураАдресаБазы.ИмяСервера;
	АдресПубликации = "/" + ОбщегоНазначенияСУКлиентСервер.УбратьКонечныйРазделительПути(СтруктураАдресаОбщегоКаталога.ПутьНаСервере);
	АдресПубликацииИБ = "/" + ОбщегоНазначенияСУКлиентСервер.УбратьКонечныйРазделительПути(СтруктураАдресаБазы.ПутьНаСервере);
	АдресПубликацийРесурсов = АдресПубликации + "/" + ЭлектронныеРесурсыСУЗКлиентСервер.ИмяКаталогаЭлектронныхРесурсов();
	АдресКаталогаКабинета =  ОбщегоНазначенияСУКлиентСервер.УбратьКонечныйРазделительПути(ВебКабинетСУ.ПутьККаталогуУстановки(АдресПубликации));
	
	Если Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция30 Тогда
		АдресКаталогаКартинок = ОбщегоНазначенияСУКлиентСервер.УбратьКонечныйРазделительПути(ВебКабинетСУ.ПутьККаталогуКартинок(АдресПубликации));
	Иначе
		АдресКаталогаКартинок = "";
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		АдресКаталогаФайлов = "";
	КонецЕсли;
	
	АдресСервисаОбучения =  АдресПубликацииИБ + "/hs/cabinet";
	АдресСервисаПользователи = АдресПубликацииИБ + "/hs/users";
	АдресСервисаЭР = АдресПубликацииИБ + "/hs/res";
	АдресСервисаЭлектронныхКурсов = АдресПубликацииИБ + "/hs/courses";
	АдресВебСервисаЭР = АдресПубликацииИБ + "/ws/res.1cws";
	
	СлужебныйПользовательУказанВПубликацииИнформационнойБазы = Константы.СлужебныйПользовательУказанВПубликацииСУ.Получить();
	Если СлужебныйПользовательУказанВПубликацииИнформационнойБазы Тогда
		ЛогинСлужебногоПользователя = "";
		ПарольСлужебногоПользователя = "";
	Иначе
		ЛогинСлужебногоПользователя = ОбщегоНазначенияСУ.ЛогинИПарольСлужебногоПользователяДляСоединенияСБазой();
		ПарольСлужебногоПользователя = ОбщегоНазначенияСУ.ЛогинИПарольСлужебногоПользователяДляСоединенияСБазой();		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыЗначениемЗаполнения(МассивРеквизитов)
	
	РеквизитыСправочника = Метаданные.Справочники.ПубликацииВебКабинетаСУ.Реквизиты;
	
	Для каждого ИмяРеквизитаСтрока Из МассивРеквизитов Цикл
		ЭтотОбъект[ИмяРеквизитаСтрока] = РеквизитыСправочника[ИмяРеквизитаСтрока].ЗначениеЗаполнения;
	КонецЦикла;	
	
КонецПроцедуры

Функция НастройкиДействующиеТолькоВРедакции30()
	
	МассивНастроек = Новый Массив;
	МассивНастроек.Добавить("РазрешенноеЧислоМинутНеактивности");
	МассивНастроек.Добавить("ЧастотаСбораСтатистики");
	МассивНастроек.Добавить("ВыводитьСведенияВКонсоль");
	
	Возврат МассивНастроек;
	
КонецФункции

Процедура ЗаписатьФайлНастроек() Экспорт
	
	// Процедуру следует запускать в одной транзакции с записью публикации,
	// но не в обработчиках, так как в этом случае ошибка после записи в транзакции
	// файла настроек не приведет к откату уже записанного файла, но приведет к откату
	// записи настроек публикации.
	
	Если НЕ ЭтоЕдинственнаяПубликацияВОбщемКаталоге Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиТолькоВРедакции30 = НастройкиДействующиеТолькоВРедакции30();
	
	Если Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция20 Тогда
		
		Публикация30 = Справочники.ПубликацииВебКабинетаСУ.ОсновнаяПубликация(Перечисления.РедакцииВебКабинетаСУ.Редакция30);
		
		Если ЗначениеЗаполнено(Публикация30) Тогда
			Для каждого ИмяНастройки30 Из НастройкиТолькоВРедакции30 Цикл
				ЭтотОбъект[ИмяНастройки30] = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Публикация30, ИмяНастройки30);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	ПутьДляЗаписиФайлаНастроек = Константы.ПутьКОбщемуКаталогуСУ.Получить();
	ПутьДляЗаписиФайлаНастроек = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьДляЗаписиФайлаНастроек);
	ПутьДляЗаписиФайлаНастроек = ПутьДляЗаписиФайлаНастроек + ВебКабинетСУ.ИмяФайлаНастроек();
	
	Справочники.ПубликацииВебКабинетаСУ.СформироватьФайлНастроек(ЭтотОбъект,,ПутьДляЗаписиФайлаНастроек);	
	
	Если Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция30
		И НЕ Справочники.ПубликацииВебКабинетаСУ.ЕстьПубликацииРедакции(Перечисления.РедакцииВебКабинетаСУ.Редакция20) Тогда
		
		// Файл настроек старой версии нужен для просмотра электронных курсов,
		// поэтому если его нет, то создаем.
		
		ПутьДляЗаписиФайлаНастроек = Константы.ПутьКОбщемуКаталогуСУ.Получить();
		ПутьДляЗаписиФайлаНастроек = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьДляЗаписиФайлаНастроек);
		ПутьДляЗаписиФайлаНастроек = ПутьДляЗаписиФайлаНастроек + ВебКабинетСУ.ИмяФайлаНастроек(Перечисления.РедакцииВебКабинетаСУ.Редакция20);		
		
		ЭтотОбъект.Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция20;
		Справочники.ПубликацииВебКабинетаСУ.СформироватьФайлНастроек(ЭтотОбъект,,ПутьДляЗаписиФайлаНастроек);
		ЭтотОбъект.Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция30;
		
	КонецЕсли;
	
	Если Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция20 Тогда
		
		// Обновляем файл настроек третьей редакции, так как ее настройки зависят от второй.
		
		Публикация30 = Справочники.ПубликацииВебКабинетаСУ.ОсновнаяПубликация(Перечисления.РедакцииВебКабинетаСУ.Редакция30);
		
		Если ЗначениеЗаполнено(Публикация30) Тогда
			ПутьДляЗаписиФайлаНастроек = Константы.ПутьКОбщемуКаталогуСУ.Получить();
			ПутьДляЗаписиФайлаНастроек = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьДляЗаписиФайлаНастроек);
			ПутьДляЗаписиФайлаНастроек = ПутьДляЗаписиФайлаНастроек + ВебКабинетСУ.ИмяФайлаНастроек(Перечисления.РедакцииВебКабинетаСУ.Редакция30);		
			Публикация30Объект = Публикация30.ПолучитьОбъект();
			Справочники.ПубликацииВебКабинетаСУ.СформироватьФайлНастроек(Публикация30Объект,,ПутьДляЗаписиФайлаНастроек);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция30 Тогда
		
		// Обновляем файл настроек второй редакции, так как ее настройки зависят от третьей.
		
		Публикация20 = Справочники.ПубликацииВебКабинетаСУ.ОсновнаяПубликация(Перечисления.РедакцииВебКабинетаСУ.Редакция20);
		
		Если ЗначениеЗаполнено(Публикация20) Тогда
			
			ПутьДляЗаписиФайлаНастроек = Константы.ПутьКОбщемуКаталогуСУ.Получить();
			ПутьДляЗаписиФайлаНастроек = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьДляЗаписиФайлаНастроек);
			ПутьДляЗаписиФайлаНастроек = ПутьДляЗаписиФайлаНастроек + ВебКабинетСУ.ИмяФайлаНастроек(Перечисления.РедакцииВебКабинетаСУ.Редакция20);		
			
			Публикация20Объект = Публикация20.ПолучитьОбъект();
			Для каждого ИмяНастройки30 Из НастройкиТолькоВРедакции30 Цикл
				Публикация20Объект[ИмяНастройки30] = ЭтотОбъект[ИмяНастройки30];
			КонецЦикла;
			
			Справочники.ПубликацииВебКабинетаСУ.СформироватьФайлНастроек(Публикация20Объект,,ПутьДляЗаписиФайлаНастроек);
			
		КонецЕсли;
		
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

