
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пользователь = ?(ЗначениеЗаполнено(Параметры.Пользователь), Параметры.Пользователь, Пользователи.ТекущийПользователь());
	
	ЗаполнитьТаблицуактивированныхПинКодов();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура АктивироватьПинКод(Команда)
	
	АктивироватьПинКодНаСервере()
	
КонецПроцедуры

&НаСервере
Процедура АктивироватьПинКодНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеПинКода = РегистрыСведений.ВыданныеПинКодыСУО.КодДоступенДляАктивации(ПинКод, Опция);	
	
	Если ДанныеПинКода.ДоступенДляАктивации Тогда		
		
		РегистрыСведений.ВыданныеПинКодыСУО.АктивироватьКод(ДанныеПинКода.Серия, ДанныеПинКода.Код, Пользователь,,ДанныеПинКода.Опция,Истина);

		ТекстУведомления = РегистрыСведений.ВыданныеПинКодыСУО.ПолучитьТекстУведомленияИЗапомнить(Пользователь);

		Если ЗначениеЗаполнено(ТекстУведомления) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстУведомления);
		КонецЕсли;

		ЗаполнитьТаблицуактивированныхПинКодов();
		
		
	ИначеЕсли ДанныеПинКода.ТребуетсяОпция Тогда
		
		Элементы.Опция.Видимость = Истина;
		
		ДоступныеОпции = Справочники.СерииПинКодовСУО.СтруктураОпцийДляВебКабинета(ДанныеПинКода.Серия);
		
		Элементы.Опция.СписокВыбора.Очистить();
		
		Для каждого Вариант Из ДоступныеОпции.Варианты Цикл		
			Элементы.Опция.СписокВыбора.Добавить(Вариант.Значение, Вариант.Наименование);		
		КонецЦикла;
				
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ДанныеПинКода.ТекстОшибки);

	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуактивированныхПинКодов()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПинКод = "";
	Опция = "";
	
	Элементы.Опция.Видимость = Ложь;
	
	ПинКоды.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыданныеПинКодыСУО.Серия.Описание КАК Описание,
		|	ВыданныеПинКодыСУО.ДатаИспользования КАК ДатаАктивации,
		|	0 КАК Картинка,
		|	ВыданныеПинКодыСУО.Опция.Наименование КАК Опция
		|ИЗ
		|	РегистрСведений.ВыданныеПинКодыСУО КАК ВыданныеПинКодыСУО
		|ГДЕ
		|	ВыданныеПинКодыСУО.Пользователь = &Пользователь
		|	И ВыданныеПинКодыСУО.Заблокирован = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	ТаблицаПинКодов = Запрос.Выполнить().Выгрузить();
	
	ЗначениеВРеквизитФормы(ТаблицаПинКодов, "ПинКоды");
	
	ПинКоды.Сортировать("ДатаАктивации");
	
КонецПроцедуры


#КонецОбласти

