#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Записывать = Истина;
	
	Если ЭлектронныеРесурсыПереопределяемый.ОбучениеОтменено(Отменено, ПрохождениеОбучения, Задание) Тогда
		Возврат;
	КонецЕсли;
	
	Движение = Движения.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Добавить();
	
	Движение.Период                 = Дата;
	Движение.Пользователь           = Пользователь;
	Движение.ЭлементСодержания      = ЭлементСодержанияСводаЗнаний;
	Движение.ПрохождениеОбучения    = ПрохождениеОбучения;
	Движение.Задание                = ОбъектыСУЗ.ЗаданиеПопытки(ПрохождениеОбучения, СводЗнаний, Задание);
	
	Если ПопыткаЗавершена Тогда
		Движение.Результат = 100;
	Иначе
		Движение.Результат = 0;
	КонецЕсли;
	
	Движение.ВремяПрохожденияВСекундах = ВремяВыполненияВСекундах;
	
	Движение.ЭлектронныйРесурс         = СводЗнаний;
	Движение.СсылкаНаОбъектСУЗ         = СсылкаНаОбъектСУЗ;
	Движение.ПопыткаЗавершена          = ПопыткаЗавершена;
	Движение.ДатаНачалаПрохождения     = ДатаНачалаВыполнения;
	Движение.ДатаОкончанияПрохождения  = ДатаОкончанияВыполнения;
	Движение.ЭтоТест                   = Ложь;
	Движение.НомерРегистратора         = Номер;
	Движение.ВыставляетсяОценка        = Ложь;
	Движение.ЗавершеноВПроцентах       = ?(ПопыткаЗавершена, 100, 0);
	
	ЭлектронныеРесурсыПереопределяемый.ПроведениеОбучения(Движение.ПроведениеОбучения, ПрохождениеОбучения);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
