#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ТаблицаПодсказок() Экспорт
	
	ТаблицаПодсказок = Новый ТаблицаЗначений;
	ТаблицаПодсказок.Колонки.Добавить("Переменная");
	ТаблицаПодсказок.Колонки.Добавить("Подсказка");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.АдресДляПерехода;
	НоваяСтрока.Подсказка = НСтр("ru = 'Гиперссылка, пройдя по которой, можно установить новый пароль. Сервис восстановления пароля доступен только в веб-кабинете'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаДоступаПользователяКБазе;
	НоваяСтрока.Подсказка = НСтр("ru = 'Дата регистрации пользователя в информационной базе'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаПроведенияМероприятия;
	НоваяСтрока.Подсказка = НСтр("ru = 'Дата, указанная в настройках проведения обучения в поле ""Обучение с...""'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаПроведенияПрограммыОбучения;
	НоваяСтрока.Подсказка = НСтр("ru = 'Самая ранняя из дат, указанных в поле ""Обучение с..."" настроек всех проведений обучения, входящих в программу обучения'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаПрохожденияМероприятия;
	НоваяСтрока.Подсказка = НСтр("ru = 'Дата, когда обучающийся впервые открыл электронные курс, тест или файлы назначенного ему проведения обучения'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияДоступаПользователяКБазе;
	НоваяСтрока.Подсказка = НСтр("ru = 'Дата, указанная в поле ""Доступ по..."" на форме ""Пользователь"", команда ""Время доступа""'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияПроведенияМероприятия;
	НоваяСтрока.Подсказка = НСтр("ru = 'Дата, указанная в настройках проведения обучения в поле ""Обучение по...""'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияПроведенияПрограммыОбучения;
	НоваяСтрока.Подсказка = НСтр("ru = 'Самая поздняя из дат, указанных в поле ""Обучение по..."" настроек всех проведений обучения, входящих в данную программу обучения'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияПрохожденияМероприятия;
	НоваяСтрока.Подсказка = НСтр("ru = 'Дата, когда участнику проведения обучения был автоматически или вручную установлен статус ""Завершил""'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ЗавершеноВПроцентах;
	НоваяСтрока.Подсказка = НСтр("ru = 'Процент изученных элементов электронного курса'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Книга;
	НоваяСтрока.Подсказка = НСтр("ru = 'Книга, которую необходимо вернуть'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КодПодтверждения;
	НоваяСтрока.Подсказка = НСтр("ru = 'Код подтверждения, который потребуется указать при восстановлении пароля через веб-кабинет, если пользователь забыл пароль'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоЗавершенныхМероприятий;
	НоваяСтрока.Подсказка = НСтр("ru = 'Количество завершенных подчиненных обучений. Используется только для обучений, содержащих подчиненные'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоЗавершенныхТестов;
	НоваяСтрока.Подсказка = НСтр("ru = 'Количество завершенных тестов (в составе электронного курса или отдельно), выполненных обучающимся в ходе электронного обучения'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоЗавершенныхЭлектронныхКурсов;
	НоваяСтрока.Подсказка = НСтр("ru = 'Количество электронных курсов, пройденных обучающимся в ходе электронного обучения'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоОтправленныхНаПроверкуЗаданий;
	НоваяСтрока.Подсказка = НСтр("ru = 'Количество заданий, включая тесты с открытыми ответами, которые отправил на проверку обучающийся с начала обучения'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ОценкаЗаЗадание;
	НоваяСтрока.Подсказка = НСтр("ru = 'Оценка пользователя за выполненное им задание'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ОценкаЗаОбучение;
	НоваяСтрока.Подсказка = НСтр("ru = 'Оценка пользователя за пройденное обучение'");	
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоПроверенныхЗаданий;
	НоваяСтрока.Подсказка = НСтр("ru = 'Количество заданий, включая тесты с открытыми ответами, которые проверил преподаватель с начала обучения'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоСообщений;
	НоваяСтрока.Подсказка = НСтр("ru = 'Количество непрочитанных личных сообщений или непрочитанных сообщений в теме форума'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ЛогинПользователя;
	НоваяСтрока.Подсказка = НСтр("ru = 'Логин пользователя для входа в программу или веб-кабинет'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Мероприятие;
	НоваяСтрока.Подсказка = НСтр("ru = 'Наименование мероприятия'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Месторасположение;
	НоваяСтрока.Подсказка = НСтр("ru = 'Месторасположение аудитории, в которой проходит обучение'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеОбучения;
	НоваяСтрока.Подсказка = НСтр("ru = 'Наименование проведения обучения'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеЗадания;
	НоваяСтрока.Подсказка = НСтр("ru = 'Наименование электронного задания'");	
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеПрограммыОбучения;
	НоваяСтрока.Подсказка = НСтр("ru = 'Наименование проведения программы обучения'");	
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НовыйПароль;
	НоваяСтрока.Подсказка = НСтр("ru = 'Новый случайный пароль, который сообщается пользователю при настройке доступа в программу через форму ""Управление доступом""'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ОбъединенныеЛогины;
	НоваяСтрока.Подсказка = НСтр("ru = 'Список логинов учетных записей пользователя, которые были объединены в одну учетную запись'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПинКод;
	НоваяСтрока.Подсказка = НСтр("ru = 'Пин-код обучающегося'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь;
	НоваяСтрока.Подсказка = НСтр("ru = 'Полное имя пользователя, указанное в одноименном поле формы ""Пользователь""'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПрограммаОбучения;
	НоваяСтрока.Подсказка = НСтр("ru = 'Наименование программы обучения'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПродолжительностьОбучения;
	НоваяСтрока.Подсказка = НСтр("ru = 'Продолжительность обучения, заданная в настройках Проведения обучения ""С начала обучения"", ""С зачисления"" или вычисленная для фиксированных С... По...'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПродолжительностьПрограммыОбучения;
	НоваяСтрока.Подсказка = НСтр("ru = 'Длительность программы обучения'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа;
	НоваяСтрока.Подсказка = НСтр("ru = 'Учебная группа пользователя. Если групп несколько, то перечисляются через запятую'");
	
	НоваяСтрока = ТаблицаПодсказок.Добавить();
	НоваяСтрока.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.АдресСертификата;
	НоваяСтрока.Подсказка = НСтр("ru = 'Адрес (URL) выданного сертификата за пройденное обучение. Доступно только в веб-кабинете'");
	
	
	Возврат ТаблицаПодсказок;
	
КонецФункции

Функция ПодсказкаКПеременной(Переменная, ТаблицаПодсказок = Неопределено) Экспорт
	
	Если ТаблицаПодсказок = Неопределено Тогда
		ТаблицаПодсказок = ТаблицаПодсказок();
	КонецЕсли;
	
	НайденнаяСтрока = ТаблицаПодсказок.Найти(Переменная, "Переменная");
	
	Если НайденнаяСтрока = Неопределено Тогда
		Возврат "";
	Иначе
		Возврат НайденнаяСтрока.Подсказка;
	КонецЕсли;
	
КонецФункции

Функция КодПеременной(Переменная) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Переменная, "Код");
КонецФункции

Функция ТаблицаПеременныхАвтоматическойРассылки(ТипАвтоматическойРассылки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеременныеШаблоновСообщенийСУО.Ссылка КАК Переменная,
		|	ПеременныеШаблоновСообщенийСУО.Код
		|ИЗ
		|	ПланВидовХарактеристик.ПеременныеШаблоновСообщенийСУО КАК ПеременныеШаблоновСообщенийСУО";
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	ТаблицаПодсказок = ТаблицаПодсказок();
	
	ТаблицаПеременных = Новый ТаблицаЗначений;
	ТаблицаПеременных.Колонки.Добавить("Переменная");
	ТаблицаПеременных.Колонки.Добавить("Код");
	ТаблицаПеременных.Колонки.Добавить("Подсказка");	
	
	РасширеннаяФункциональность = ПолучитьФункциональнуюОпцию("РасширеннаяФункциональностьСУО");
	ПолныйИнтерфейс = ПолучитьФункциональнуюОпцию("ПолныйИнтерфейсСУО");
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ВажнаяНовость Тогда
		// Не требуется
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ВосстановлениеПароля Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.АдресДляПерехода, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КодПодтверждения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.КонтрольНепрочитанныхЛичныхСообщений Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);				
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоСообщений, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.КонтрольНепрочитанныхТемФорума Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПередОкончаниемДоступаКБазе Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаДоступаПользователяКБазе, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияДоступаПользователяКБазе, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеВозвратаНаДоработкуЗадания
		ИЛИ ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеПроверкиЗаданияПреподавателем
		ИЛИ ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриОтправкеЗаданияНаПроверку Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоЗавершенныхТестов, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоЗавершенныхЭлектронныхКурсов, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоОтправленныхНаПроверкуЗаданий, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоПроверенныхЗаданий, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеЗадания, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеПроверкиЗаданияПреподавателем Тогда
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ОценкаЗаЗадание, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);	
		КонецЕсли;		
	КонецЕсли;	
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеПрохожденияМероприятия Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаПроведенияМероприятия, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);				
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияПроведенияМероприятия, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПродолжительностьОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ОценкаЗаОбучение, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		Если ПолныйИнтерфейс Тогда
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.АдресСертификата, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		КонецЕсли;										
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеПрохожденияПрограммыОбучения Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		Если РасширеннаяФункциональность Тогда
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаПроведенияПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);				
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияПроведенияПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);									
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПродолжительностьПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);								
		КонецЕсли;
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриглашениеНаОткрытоеМероприятие Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаПроведенияМероприятия, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);				
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияПроведенияМероприятия, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);						
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПродолжительностьОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);										
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриглашениеНаОткрытуюПрограммуОбучения Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		Если РасширеннаяФункциональность Тогда
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаПроведенияПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);				
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияПроведенияПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);									
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПродолжительностьПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);								
		КонецЕсли;
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриЗачисленииНаМероприятие Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаДоступаПользователяКБазе, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияДоступаПользователяКБазе, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаПроведенияМероприятия, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);				
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияПроведенияМероприятия, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);						
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПродолжительностьОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);								
		Если ПолныйИнтерфейс Тогда
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Месторасположение, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);				
		КонецЕсли;
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриЗачисленииНаПрограммуОбучения Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаДоступаПользователяКБазе, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияДоступаПользователяКБазе, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		Если РасширеннаяФункциональность Тогда
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаПроведенияПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);				
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияПроведенияПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);									
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПродолжительностьПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);								
		КонецЕсли;
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриНазначенииПреподавателяНаМероприятие Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаПроведенияМероприятия, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);				
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияПроведенияМероприятия, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);						
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПродолжительностьОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);								
		Если ПолныйИнтерфейс Тогда
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Месторасположение, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);				
		КонецЕсли;
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриНачалеПрохожденияМероприятия Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаПроведенияМероприятия, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);				
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияПроведенияМероприятия, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);						
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПрограммаОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПродолжительностьОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		Если ПолныйИнтерфейс Тогда
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Месторасположение, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);				
		КонецЕсли;
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриНачалеПрохожденияПрограммыОбучения Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НаименованиеПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		Если РасширеннаяФункциональность Тогда
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаПроведенияПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);				
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияПроведенияПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);						
			ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПродолжительностьПрограммыОбучения, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);								
		КонецЕсли;
	КонецЕсли;
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриОбновленииОтбораПользователей Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);		
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаДоступаПользователяКБазе, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияДоступаПользователяКБазе, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);						
	КонецЕсли;	
	
	Если ТипАвтоматическойРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.РегистрацияНовогоПользователя Тогда
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
		ЗаполнитьСтрокуТаблицыПеременных(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ЛогинПользователя, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок);
	КонецЕсли;
		
	Возврат ТаблицаПеременных;
	
КонецФункции

Процедура ЗаполнитьСтрокуТаблицыПеременных(Переменная, ТаблицаПеременных, ТаблицаДанных, ТаблицаПодсказок)
	
	НоваяСтрока = ТаблицаПеременных.Добавить();
	НоваяСтрока.Переменная = Переменная;
	НоваяСтрока.Код = ТаблицаДанных.Найти(НоваяСтрока.Переменная, "Переменная").Код;
	НоваяСтрока.Подсказка = ПодсказкаКПеременной(НоваяСтрока.Переменная, ТаблицаПодсказок);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

