Процедура ВыполнитьПодключение(ДанныеДляОбработкиXML) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(ДанныеДляОбработкиXML) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДляОбработки = ОбщегоНазначения.ЗначениеИзСтрокиXML(ДанныеДляОбработкиXML);
	
	// Получаем обработку
	//
	
	Обработка = ДанныеДляОбработки.Обработка;
	
	Если ЗначениеЗаполнено(Обработка.Данные) Тогда
	
		ОбработкаДвоичныеДанные   = Base64Значение(Обработка.Данные); 
		АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ОбработкаДвоичныеДанные);
		ИмяОбработки              = ВнешниеОбработки.Подключить(АдресВоВременномХранилище,, Обработка.Безопасно);
		ОбработкаОбъект           = ВнешниеОбработки.Создать(ИмяОбработки);
		
	Иначе
		
		ОбработкаОбъект = Обработки[Обработка.Имя].Создать();
		
	КонецЕсли;
	
	ДанныеДляОбработки.Удалить("Обработка"); // Возвращать обратно данные обработки не требуется
	
	// Запускаем обработку
	//

	ОбработкаОбъект.ПроверитьЗадание(ДанныеДляОбработки.Этапы, ДанныеДляОбработки.Параметры, ДанныеДляОбработки.НастройкиПодключения);
	
	ДанныеДляОбработкиXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ДанныеДляОбработки); // Возвращаем результат проверки
	
КонецПроцедуры
