#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Процедура ЗаписатьНастройки(Тема, ИмяРеквизита = Неопределено, Значение = Неопределено, Пользователь = Неопределено, ТекущаяДата = Неопределено, НеОбновлятьДанныеВебКабинета = Ложь) Экспорт		
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	ДанныеТемы   = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Тема, "Кому, Контекст");
	
	Если ТекущаяДата = Неопределено Тогда
		ТекущаяДата  = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Записываем настройки темы форума
	
	НаборЗаписей = РегистрыСведений.НастройкиТемФорумаСУО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Тема.Установить(Тема);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);

	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		// Запоминаем данные пользователя о теме форума
		
		Запись = НаборЗаписей.Добавить();
		
		Запись.Пользователь = Пользователь;
		Запись.Тема = Тема;
		Запись.РазделФорума = ДанныеТемы.Контекст;
		
	Иначе
		
		Запись = НаборЗаписей[0];
		
	КонецЕсли;
	
	Если ИмяРеквизита <> Неопределено Тогда
		
		Если Значение = Неопределено Тогда
			Запись[ИмяРеквизита] = НЕ Запись[ИмяРеквизита];
		Иначе
		    Запись[ИмяРеквизита] = Значение;
		КонецЕсли;
		
	КонецЕсли;

	Запись.ДатаПросмотра = ТекущаяДата;
	
	НаборЗаписей.ДополнительныеСвойства.Вставить("НеОбновлятьДанныеВебКабинета", НеОбновлятьДанныеВебКабинета);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ОбновитьДанныеВебКабинета(Отбор) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Отбор.Найти("Пользователь") = Неопределено Тогда
		Пользователь = Неопределено;
	Иначе
		Пользователь = Отбор.Пользователь.Значение;
	КонецЕсли;
	
	Если Отбор.Найти("Тема") = Неопределено Тогда
		Тема = Неопределено;
	Иначе
		Тема = Отбор.Тема.Значение;
	КонецЕсли;
	
	ОбновитьДанныеВебКабинетаЗаписи(Пользователь, Тема);	
	
КонецПроцедуры

Процедура ОбновитьДанныеВебКабинетаЗаписи(Пользователь, Тема) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.НастройкиТемФорумаСУО.СоздатьНаборЗаписей();
	
	Если ЗначениеЗаполнено(Пользователь) И ЗначениеЗаполнено(Тема) Тогда
		
		НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
		НаборЗаписей.Отбор.Тема.Установить(Тема);
		
	КонецЕсли;
	
	НаборЗаписей.Прочитать();
	
	Для каждого Запись Из НаборЗаписей Цикл
		
		РегистрыСведений.ДанныеВебКабинетаСУО_ПН.УдалитьДанные(Тема, Перечисления.ТипыДанныхВебКабинетаСУО.ТемаОбщенияОписание, Запись.Пользователь);
		
		ПользовательскоеОписаниеJSON = Справочники.ТемыСообщенийСУО.ТемаФорумаОписаниеПользовательскоеJSON(Запись.Тема, Запись.Пользователь);
		РегистрыСведений.ДанныеВебКабинетаСУО_ПН.ДобавитьДанные(Запись.Пользователь, Перечисления.ТипыДанныхВебКабинетаСУО.ТемаОбщенияОписание, Запись.Тема, ПользовательскоеОписаниеJSON, Перечисления.ФорматыВебДанныхСУ.json);
			
		ДанныеОТеме = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись.Тема, "Контекст, Кому");
		
		ЭтоГрупповоеОбсуждение = Документы.СообщениеСУО.ЭтоГрупповоеОбсуждение(ДанныеОТеме.Кому);
		
		Если ЭтоГрупповоеОбсуждение Тогда
			
			ПользовательскоеОписаниеJSON = Справочники.РазделыФорумаСУО.РазделОписаниеПользовательскоеJSON(ДанныеОТеме.Контекст, Запись.Пользователь);
			РегистрыСведений.ДанныеВебКабинетаСУО_ПН.ДобавитьДанные(Запись.Пользователь, Перечисления.ТипыДанныхВебКабинетаСУО.РазделФорумаОписание, ДанныеОТеме.Контекст, ПользовательскоеОписаниеJSON, Перечисления.ФорматыВебДанныхСУ.json);
			
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры


#КонецЕсли
