#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// ОБЩЕЕ

Функция ВыдатьСертификат(ПрохождениеОбучения, НеОбновлятьДанныеВебКабинета = Неопределено, ПрохождениеОбученияСвойства = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Задаем переменные
	
	АвтоОснование = Неопределено;
	КомуВыдан = Неопределено;
	МожноВыдать = Истина;	
	
	// Получаем массив всех возможных оснований (порядок важен)
	
	МассивОснований = Новый Массив;
	
	Если ТипЗнч(ПрохождениеОбучения) = Тип("ДокументСсылка.ПрохождениеОбученияСУО") Тогда
		
		Если ПрохождениеОбученияСвойства = Неопределено Тогда
			ПрохождениеОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеОбучения, "Сценарий, ПроведениеОбучения, Пользователь");
		КонецЕсли;
		
		СтатусОбучения = Документы.ПрохождениеОбученияСУО.СтатусПроцессаОбучения(ПрохождениеОбучения);
		
		Если СтатусОбучения <> Перечисления.СтатусыПроцессаОбученияСУО.Окончено
			И СтатусОбучения <> Перечисления.СтатусыПроцессаОбученияСУО.ОконченоАвтоматом Тогда
			МожноВыдать = Ложь;
		КонецЕсли;
		
		КомуВыдан = ПрохождениеОбученияСвойства.Пользователь; 
		
		Если ЗначениеЗаполнено(ПрохождениеОбученияСвойства.Сценарий) Тогда
			Сценарий = ПрохождениеОбученияСвойства.Сценарий;
		Иначе
			Сценарий = Документы.ПрохождениеОбученияСУО.СценарийОбучения(ПрохождениеОбучения);
		КонецЕсли;
		
		ВидОбучения = Документы.ПроведениеОбученияСУО.ВидОбучения(ПрохождениеОбученияСвойства.ПроведениеОбучения, Сценарий);
		
		МассивОснований.Добавить(ВидОбучения);
		МассивОснований.Добавить(Сценарий);
		МассивОснований.Добавить(ПрохождениеОбученияСвойства.ПроведениеОбучения);
		
	КонецЕсли;
	
	Если ТипЗнч(ПрохождениеОбучения) = Тип("ДокументСсылка.ПрохождениеПрограммыОбученияСУО") Тогда
		
		ПрохождениеПрограммыОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеОбучения, "Сценарий, ПроведениеПрограммыОбучения, Пользователь, Статус");
		
		Если ПрохождениеПрограммыОбученияСвойства.Статус <> Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил
			И ПрохождениеПрограммыОбученияСвойства.Статус <> Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат Тогда
			МожноВыдать = Ложь;
		КонецЕсли;
		
		КомуВыдан = ПрохождениеПрограммыОбученияСвойства.Пользователь; 
		
		Если ЗначениеЗаполнено(ПрохождениеПрограммыОбученияСвойства.Сценарий) Тогда
			МассивОснований.Добавить(ПрохождениеПрограммыОбученияСвойства.Сценарий);
		КонецЕсли;
		
		МассивОснований.Добавить(ПрохождениеПрограммыОбученияСвойства.ПроведениеПрограммыОбучения);
		
	КонецЕсли;
	
	Если НЕ МожноВыдать Тогда
		Возврат Неопределено; // Нельзя еще выдавать
	КонецЕсли;	
	
	// Получаем все правила для всех оснований
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтоматическиеПравилаВыдачиСертификатовСУО.Основание КАК Основание,
		|	АвтоматическиеПравилаВыдачиСертификатовСУО.ОтборПользователей,
		|	АвтоматическиеПравилаВыдачиСертификатовСУО.Шаблон,
		|	АвтоматическиеПравилаВыдачиСертификатовСУО.СрокДействия
		|ИЗ
		|	РегистрСведений.АвтоматическиеПравилаВыдачиСертификатовСУО КАК АвтоматическиеПравилаВыдачиСертификатовСУО
		|ГДЕ
		|	АвтоматическиеПравилаВыдачиСертификатовСУО.Основание В(&МассивОснований)";
	
	Запрос.УстановитьПараметр("МассивОснований", МассивОснований);
	
	РезультатЗапросаПравилВыдачи = Запрос.Выполнить();
	
	Если РезультатЗапросаПравилВыдачи.Пустой() Тогда
		Возврат Неопределено; // Нет правил
	КонецЕсли;		
	
	ВыборкаПравилВыдачи = РезультатЗапросаПравилВыдачи.Выбрать();
	
	Для каждого Основание Из МассивОснований Цикл
	
		ВыборкаПравилВыдачи.Сбросить();
		
		Пока ВыборкаПравилВыдачи.НайтиСледующий(Основание, "Основание") Цикл			
			АвтоОснование = Новый Структура("Ссылка, Шаблон, Отбор, СрокДействия", ВыборкаПравилВыдачи.Основание, ВыборкаПравилВыдачи.Шаблон, ВыборкаПравилВыдачи.ОтборПользователей, ВыборкаПравилВыдачи.СрокДействия);
			Прервать;
		КонецЦикла;
	
	КонецЦикла;
	
	// Создаем сертификат
	
	СозданныйСертификат = Неопределено;
	
	Если АвтоОснование <> Неопределено
		И КомуВыдан <> Неопределено Тогда
		
		МожноВыдать = (НЕ ЗначениеЗаполнено(АвтоОснование.Отбор)
			ИЛИ Справочники.ОтборыПользователейСУО.ПользовательВходитВОтбор(АвтоОснование.Отбор, КомуВыдан));

		Если МожноВыдать Тогда			
			СозданныйСертификат = СоздатьСертификат(КомуВыдан, АвтоОснование.Ссылка, ПрохождениеОбучения, АвтоОснование.Шаблон, АвтоОснование.СрокДействия, НеОбновлятьДанныеВебКабинета);
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат СозданныйСертификат; 
	
КонецФункции

Функция ПредставлениеHTML(Знач Сертификат) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстМакета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сертификат.Шаблон, "Текст");
	
	Возврат ПредставлениеМакета(Сертификат, ТекстМакета);
	
КонецФункции

Функция ПредставлениеPDF(Знач Сертификат) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	ТабличныйМакет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сертификат.Шаблон, "ТабличныйМакет").Получить();
	
	ТабличныйМакет = ПредставлениеМакета(Сертификат, ТабличныйМакет);
	
	ПутьКВременномуФайлу = ПолучитьИмяВременногоФайла(".pdf");
	ТабличныйМакет.Записать(ПутьКВременномуФайлу, ТипФайлаТабличногоДокумента.PDF);
	
	ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ПутьКВременномуФайлу);
	
	Попытка
		УдалитьФайлы(ПутьКВременномуФайлу);
	Исключение
	КонецПопытки;
	
	Возврат ДвоичныеДанныеФайла;
	
КонецФункции

Функция ПредставлениеМакета(Знач Сертификат, Макет)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Простые переменные
	
	Для каждого Переменная Из Перечисления.ПеременныеШаблонаСертификатаСУО Цикл
	
		ИмяПеременной = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(Переменная);
		
		ЗначениеПеременной = "";
		
		Если Переменная = Перечисления.ПеременныеШаблонаСертификатаСУО.ЗаЧтоВыдан Тогда			
			ЗначениеПеременной = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сертификат.ЗаЧтоВыдан, "Наименование");
		КонецЕсли;
		
		Если Переменная = Перечисления.ПеременныеШаблонаСертификатаСУО.КогдаВыдан Тогда
			ЗначениеПеременной = Формат(Сертификат.Дата, "ДЛФ=DD");
		КонецЕсли;
		
		Если Переменная = Перечисления.ПеременныеШаблонаСертификатаСУО.КомуВыдан Тогда
			ЗначениеПеременной = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сертификат.КомуВыдан, "Наименование");
		КонецЕсли;		
		
		Если Переменная = Перечисления.ПеременныеШаблонаСертификатаСУО.Номер Тогда
			ЗначениеПеременной = Строка(Сертификат.Номер);
		КонецЕсли;
		
		Если Переменная = Перечисления.ПеременныеШаблонаСертификатаСУО.ДействуетДо Тогда
			Если ЗначениеЗаполнено(Сертификат.ДействуетДо) Тогда
				ЗначениеПеременной = Формат(Сертификат.ДействуетДо, "ДЛФ=DD");
			Иначе
				ЗначениеПеременной = "";
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЗнч(Макет) = Тип("Строка") Тогда
			Макет = СтрЗаменить(Макет, "{{"+ИмяПеременной+"}}", ЗначениеПеременной);
		Иначе
			ЗаменитьПеременныеВТабличномМакете(Макет, ИмяПеременной, ЗначениеПеременной)
		КонецЕсли;
	
	КонецЦикла;	
	
	// Дополнительные переменные
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныСертификатовСУОДополнительныеПеременные.Переменная,
		|	ШаблоныСертификатовСУОДополнительныеПеременные.ИмяПеременной
		|ИЗ
		|	Справочник.ШаблоныСертификатовСУО.ДополнительныеПеременные КАК ШаблоныСертификатовСУОДополнительныеПеременные
		|ГДЕ
		|	ШаблоныСертификатовСУОДополнительныеПеременные.Ссылка = &Шаблон";
	
	Запрос.УстановитьПараметр("Шаблон", Сертификат.Шаблон);
	
	ТаблицаПеременных = Запрос.Выполнить().Выгрузить();
	
	ТаблицаЗначенийДопПеременных = УправлениеОбучениемСУО.ТаблицаЗначенийДополнительныхПеременных(ТаблицаПеременных, Сертификат.КомуВыдан);
	
	Для каждого СтрокаТЗ Из ТаблицаЗначенийДопПеременных Цикл
	
		Если ТипЗнч(Макет) = Тип("Строка") Тогда
			Макет = СтрЗаменить(Макет, "{{"+СтрокаТЗ.ИмяПеременной+"}}", СтрокаТЗ.Значение);
		Иначе
			ЗаменитьПеременныеВТабличномМакете(Макет, СтрокаТЗ.ИмяПеременной, СтрокаТЗ.Значение)
		КонецЕсли;			
	
	КонецЦикла;
	
	Возврат Макет;
	
КонецФункции

Функция ЗаменитьПеременныеВТабличномМакете(ТабличныйМакет, ИмяПеременной, ЗначениеПеременной)
	
	Для каждого РисунокТД Из ТабличныйМакет.Рисунки Цикл
	
		Если РисунокТД.ТипРисунка = ТипРисункаТабличногоДокумента.Текст Тогда
			РисунокТД.Текст = СтрЗаменить(РисунокТД.Текст, "{{"+ИмяПеременной+"}}", ЗначениеПеременной);
		КонецЕсли;
	
	КонецЦикла;
	
КонецФункции

Функция СоздатьСертификат(КомуВыдан, Основание, ПрохождениеОбучения, Шаблон, СрокДействия, НеОбновлятьДанныеВебКабинета = Неопределено) Экспорт
		
	УстановитьПривилегированныйРежим(Истина);
	
	// Ищем, не создан ли уже сертификат		
	
	СуществующийСертификат = НайтиСертификат(ПрохождениеОбучения, Ложь);
	
	Если ЗначениеЗаполнено(СуществующийСертификат) Тогда
		Возврат СуществующийСертификат; // Уже создан
	КонецЕсли;	
	
	СертификатОбъект = Документы.СертификатСУО.СоздатьДокумент();
		
	СертификатОбъект.Дата = ТекущаяДатаСеанса();
	СертификатОбъект.КомуВыдан = КомуВыдан;
	СертификатОбъект.Основание = Основание;
	СертификатОбъект.ПрохождениеОбучения = ПрохождениеОбучения;
	СертификатОбъект.Шаблон = Шаблон;
	СертификатОбъект.ЗаЧтоВыдан = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ПрохождениеОбучения).СценарийОбучения(ПрохождениеОбучения);
	
	Если СрокДействия > 0 Тогда
		СертификатОбъект.ДействуетДо = КонецДня(ДобавитьМесяц(СертификатОбъект.Дата, СрокДействия));
	КонецЕсли;
	
	Если НеОбновлятьДанныеВебКабинета <> Неопределено Тогда
		СертификатОбъект.ДополнительныеСвойства.Вставить("НеОбновлятьДанныеВебКабинета", НеОбновлятьДанныеВебКабинета);
	КонецЕсли;
	
	СертификатОбъект.Записать(РежимЗаписиДокумента.Проведение);

	Возврат СертификатОбъект.Ссылка;
	
КонецФункции

Функция НайтиСертификат(ПрохождениеОбучения, ТолькоАктуальные = Истина) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СертификатСУО.Ссылка
		|ИЗ
		|	Документ.СертификатСУО КАК СертификатСУО
		|ГДЕ
		|	СертификатСУО.ПрохождениеОбучения = &ПрохождениеОбучения";
		
	Если НЕ ТолькоАктуальные Тогда
		Запрос.Текст = Запрос.Текст + " И СертификатСУО.Проведен = Истина И СертификатСУО.Аннулирован = Ложь И СертификатСУО.Отменен = Ложь";
	КонецЕсли;
		
	Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
		
	КонецЕсли;	
	
КонецФункции

Функция СертификатАктивен(Знач Сертификат) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ДанныеСертификата = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сертификат, "Проведен, Аннулирован, Отменен");
	Возврат (ДанныеСертификата.Проведен И НЕ ДанныеСертификата.Аннулирован И НЕ ДанныеСертификата.Отменен);
КонецФункции

Функция ДанныеСертификатаДляСкачивания(Знач Сертификат, УникальныйИдентификаторФормы = Неопределено) Экспорт
	ДанныеСертификата = Новый Структура("ИмяФайла, АдресХранения");		
	ДвоичныеДанныеСертификата = ПредставлениеPDF(Сертификат);
	ДанныеСертификата.АдресХранения = ПоместитьВоВременноеХранилище(ДвоичныеДанныеСертификата, УникальныйИдентификаторФормы);
	ДанныеСертификата.ИмяФайла = ИмяФайлаСертификата(Сертификат);
	Возврат ДанныеСертификата;
КонецФункции

Функция ИмяФайлаСертификата(Знач Сертификат)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТребуемыеДанныеСертификата = Новый Структура("КомуВыдан, ЗаЧтоВыдан", "КомуВыдан.Наименование", "ЗаЧтоВыдан.Наименование");
	ДанныеСертификата = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сертификат, ТребуемыеДанныеСертификата);
	
	ИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ДанныеСертификата.КомуВыдан);
	ИмяФайла = ИмяФайла + " - ";
	ИмяФайла = ИмяФайла + ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ДанныеСертификата.ЗаЧтоВыдан);
	
	Возврат ИмяФайла + ".pdf";
	
КонецФункции

// ВЕБ-КАБИНЕТ

Процедура ОбновитьДанныеВебКабинета(Сертификат, ДополнительныеДанные = Неопределено) Экспорт	
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Удаляем старые данные
	
	РегистрыСведений.ДанныеВебКабинетаСУО_ПН.УдалитьДанные(Сертификат);

	// Добавляем новые данные
	
	Если СертификатАктивен(Сертификат) Тогда
		
		Выполнить(Строка("Лиц"+"ензи"+"рованиеВеб"+"КабинетаСУ.Прове"+"ритьРег"+"истрац"+"ионныеНом"+"ера();"));
		
		// Данные сертификата
		
		ДанныеСертификата = СертификатJSON(Сертификат);
		
		РегистрыСведений.ДанныеВебКабинетаСУО_ПН.ДобавитьДанные(Сертификат.КомуВыдан, Перечисления.ТипыДанныхВебКабинетаСУО.Сертификат, Сертификат, ДанныеСертификата, Перечисления.ФорматыВебДанныхСУ.json); 
		
		// Зависимости
		
		Зависимости = Новый Массив;		
		Зависимости.Добавить(Сертификат.ЗаЧтоВыдан);
		Зависимости.Добавить(Сертификат.Шаблон);
		Зависимости.Добавить(Сертификат.КомуВыдан);
			
		РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.ДобавитьДанные(Сертификат, "Документ.СертификатСУО", Зависимости);		
		
	КонецЕсли;	
	
	// Обновляем данные прохождения
	
	ОбщегоНазначения.МенеджерОбъектаПоСсылке(Сертификат.ПрохождениеОбучения).ОбновитьДанныеВебКабинета(Сертификат.ПрохождениеОбучения);
		
КонецПроцедуры

Функция СертификатJSON(Сертификат) Экспорт
	
	Возврат ОбщегоНазначенияСУ.ДанныеВJSON(СертификатСтруктура(Сертификат));	
	
КонецФункции

Функция СертификатСтруктура(Сертификат) Экспорт
	
	ДанныеШаблона = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сертификат.Шаблон, "ФорматHTML, ФорматPDF");	
	
	СтруктураСертификата = Новый Структура();
	СтруктураСертификата.Вставить("Идентификатор", Строка(Сертификат.УникальныйИдентификатор()));
	СтруктураСертификата.Вставить("КогдаВыдан", Сертификат.Дата);
	СтруктураСертификата.Вставить("ЗаЧтоВыдан", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сертификат.ЗаЧтоВыдан, "Наименование"));
	СтруктураСертификата.Вставить("ФорматHTML", ДанныеШаблона.ФорматHTML);
	СтруктураСертификата.Вставить("ФорматPDF", ДанныеШаблона.ФорматPDF);
	
	Возврат СтруктураСертификата;
	
КонецФункции

Функция АдресВВебКабинете(Знач Сертификат, Знач ЕстьФорматHTML = Неопределено, ПричинаОшибкиПолученияАдресаСертификата = Неопределено) Экспорт
	
	Если НЕ ВебКабинетСУ.Используется() Тогда
		ПричинаОшибкиПолученияАдресаСертификата = НСтр("ru = 'Веб-кабинет не подключен'");
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Сертификат) Тогда
		ПричинаОшибкиПолученияАдресаСертификата = НСтр("ru = 'Сертификат не найден'");
		Возврат Неопределено;		
	КонецЕсли;
	
	Если ЕстьФорматHTML = Неопределено Тогда
		ЕстьФорматHTML = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сертификат, "Шаблон.ФорматHTML");
	КонецЕсли;
	
	Если НЕ ЕстьФорматHTML Тогда
		ПричинаОшибкиПолученияАдресаСертификата = НСтр("ru = 'Шаблон сертификата не имеет формата HTML'");
		Возврат Неопределено;
	КонецЕсли;
	
	АдресВебКабинета = Справочники.ПубликацииВебКабинетаСУ.АдресВебКабинета();
	Если НЕ ЗначениеЗаполнено(АдресВебКабинета) Тогда
		ПричинаОшибкиПолученияАдресаСертификата = НСтр("ru = 'Адрес веб-кабинета не определен'");
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат АдресВебКабинета + "/certificate.html?certificate=" + Строка(Сертификат.УникальныйИдентификатор());
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Дата");
	Поля.Добавить("КомуВыдан");
	Поля.Добавить("ЗаЧтоВыдан");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные.ЗаЧтоВыдан, "Наименование");
	Пользователь = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные.КомуВыдан, "Наименование");
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 / %2 / %3'"), Наименование, Пользователь, Формат(Данные.Дата, "ДЛФ=D"));
КонецПроцедуры

#КонецОбласти


#КонецЕсли