#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДатаИзменения = ТекущаяДатаСеанса();
	Отменен = Документы.ПрохождениеОбученияСУО.Отменено(ПрохождениеОбучения);
		
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение  Тогда
		ДокументПрохожденияОбученияПроведен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПрохождениеОбучения, "Проведен");
		Если НЕ ДокументПрохожденияОбученияПроведен Тогда
			Текст = НСтр("ru = 'Проведите документ прохождения обучения ""%1""'");
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, ПрохождениеОбучения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,ПрохождениеОбучения,,,Отказ);
		КонецЕсли;		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли