#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	

#Область ПрограммныйИнтерфейс

// СВОЙСТВА ПОДБОРКИ

Функция ТипОбъектаСУЗ() Экспорт
	
	Возврат Перечисления.ТипыОбъектовСУЗ.collection;
	
КонецФункции

// Позволяет получить XML данные объекта.
//
// Параметры
//  ОбъектСУЗ          - экземпляр обработки ОбъектСУЗ.
//  ПараметрыСсылки    – Структура, содержит параметры ссылки по которой вызывается вопрос.
//  КонтекстВыполнения - Структура, содержит параметры контекста выполнения объекта.
//
// Возвращаемое значение:
//   Строка – содержит XML представление объекта СУЗ.
//
Функция ПолучитьXMLПредставление(Подборка, ПараметрыСсылки, КонтекстВыполнения) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		УстановитьПривилегированныйРежим(Истина);
		
		ОбъектСУЗXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/KnowledgeSources", "ОбъектСУЗ");
		
		//0. Подборка
		
		ИмяОбъектаСУЗ  = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ТипОбъектаСУЗ());
		
		ПодборкаXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Collection", "Подборка");
		ПодборкаXDTO     = ФабрикаXDTO.Создать(ПодборкаXDTOТип);
		
		ПодборкаXDTO.id                = Подборка.УникальныйИдентификатор();
		ПодборкаXDTO.object            = ИмяОбъектаСУЗ;
		ПодборкаXDTO.Наименование      = Подборка.Наименование;
		
		// Определяем номер документа сессии.
		
		НомерДокумента = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "numDocument");
		НомерСтраницы  = НомерСтраницы(ПараметрыСсылки, Подборка);
		
		Попытка
			НомерДокумента = Число(НомерДокумента);
		Исключение
			НомерДокумента = Неопределено;
		КонецПопытки;
		
		// Получаем данные о сессии
				
		Если ЗначениеЗаполнено(НомерДокумента) И (НомерСтраницы > 0 ИЛИ НомерСтраницы = 0) Тогда
			
			ДокументСессии = ОбъектыСУЗ.ДокументСессииТестирования(НомерДокумента, КонтекстВыполнения);
			ГруппыЭлементовПодборки = ДокументСессии.ПолучитьГруппыЭлементовПодборки(); // Группы, что образуют страницы подборки.
			
			// Для совокупности указанных условий всегда переходим на ту страницу,
			// Где есть неотвеченный вопрос или в конец.
			Если (ДокументСессии.ПереходитьВпередАвтоматически
				И НЕ ДокументСессии.ПоказыватьНавигацию
				И ДокументСессии.Пользователь = ОбъектыСУЗ.ТекущийПользователь(КонтекстВыполнения))
				ИЛИ НомерСтраницы = 0 Тогда
				
				НомерСтраницы = -1;
				
				// Если тест завершен, то переходим в конец.
				Если НЕ ДокументСессии.ТестЗавершен Тогда 
					Для каждого иГруппа Из ГруппыЭлементовПодборки Цикл
						Если НЕ иГруппа.ВсеВопросыОтвечены Тогда
							НомерСтраницы = иГруппа.НомерСтроки;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				ПараметрыСсылки.Вставить("numGroup", НомерСтраницы); // Заменяем в параметрах ссылки новый номер страницы, чтобы при передачи параметров во вложенные вопросы он был у них верный.
				
			КонецЕсли;
			
			Если НЕ ДокументСессии.ТестЗавершен Тогда
				
				Если НЕ ЗначениеЗаполнено(ДокументСессии.НазначениеТестирования)
					ИЛИ ДокументСессии.НазначениеТестирования = Перечисления.НазначенияТестированийСУЗ.Аттестация Тогда
					
					КонтекстВыполнения.Вставить("ВыполняетсяТестирование", Истина);
					КонтекстВыполнения.Вставить("СессияТестирования", ДокументСессии.Номер);
					КонтекстВыполнения.Вставить("ВсеВопросыТестированияОтвечены", ДокументСессии.ВсеВопросыТестаОтвечены());
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ГруппыЭлементовПодборки.Количество() = 0 Тогда
				НомерСтраницы = -1;
			КонецЕсли;
			
		Иначе
			
			ГруппыЭлементовПодборки = ПолучитьГруппыЭлементовПодборки(Подборка);
			
		КонецЕсли;
		
		// 1. Стартовая страница подборки.
		
		Если НомерСтраницы = 0 Тогда
			
			Если Подборка.ПоказыватьСтартовуюСтраницу Тогда // Если нужна стартовая страница.
				
				СтартоваяСтраницаXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Collection", "СтартоваяСтраница");
				СтартоваяСтраницаXDTO     = ФабрикаXDTO.Создать(СтартоваяСтраницаXDTOТип);
				
				// 1. Заголовок
				СтартоваяСтраницаXDTO.Заголовок = Подборка.Наименование;
				
				// 2. Настройки тестирования
				Если Подборка.ЭтоТест Тогда
					
					НастройкиТестированияXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Collection", "НастройкиТестирования");
					НастройкиТестированияXDTO     = ФабрикаXDTO.Создать(НастройкиТестированияXDTOТип);
					
					Если НЕ ЗначениеЗаполнено(Подборка.НазначениеТестирования) Тогда
						НазначениеТестирования = Перечисления.НазначенияТестированийСУЗ.Аттестация;
					Иначе
						НазначениеТестирования = Подборка.НазначениеТестирования;
					КонецЕсли;
					
					НастройкиТестированияXDTO.ЕстьПравоДобавитьПопытку = Пользователи.ЭтоПолноправныйПользователь(,,Ложь); // Переопределяется в КУ
					НастройкиТестированияXDTO.НазначениеТестирования   = НазначениеТестирования;
					
					ТаблицаПопытокТестирования = ПолучитьПопыткиПрохожденияТестов(Подборка, КонтекстВыполнения); 
					
					// В этой процедуре добавляются объекты "РежимТестирования", а
					// Так же количество сделанных попыток и итоговый результат.
					ДобавитьXDTOРежимовТестирования(Подборка, ТаблицаПопытокТестирования, НастройкиТестированияXDTO, КонтекстВыполнения); 
					
					// ТребуетсяПодробноеОписаниеПопыток = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "detailedTestResults");	
					ТребуетсяПодробноеОписаниеПопыток = "true";
					
					// Добавляем подробное описание каждой попытки, если требуется.
					
					Если ТребуетсяПодробноеОписаниеПопыток = "true" Тогда
						
						СессияВыполненияТестаXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Collection", "СессияВыполненияТеста");
						
						Для каждого Строка Из ТаблицаПопытокТестирования Цикл
							
							СессияВыполненияТестаXDTO = ФабрикаXDTO.Создать(СессияВыполненияТестаXDTOТип);
							
							СессияВыполненияТестаXDTO.ДатаНачалаВыполненияТеста = Формат(Строка.ДатаНачалаПрохождения, "");
							СессияВыполненияТестаXDTO.ИтоговыйРезультат = Строка.Результат;
							СессияВыполненияТестаXDTO.ПроверяетсяПреподавателем = Строка.ПроверяетсяПреподавателем;
							СессияВыполненияТестаXDTO.ПроверенПреподавателем = Строка.ПроверенПреподавателем;
							СессияВыполненияТестаXDTO.НомерСессии = Строка.Номер;
							СессияВыполненияТестаXDTO.ДатаОкончанияВыполненияТеста = Формат(Строка.ДатаОкончанияПрохождения, "");
							СессияВыполненияТестаXDTO.ВремяВыполненияТеста = Формат(ОбъектыSCORM.ПолучитьДатуИзКоличестваСекунд(Строка.ВремяПрохожденияВСекундах), "ДЛФ=T; ДП=-");
							СессияВыполненияТестаXDTO.ТестЗавершен = Строка.ПопыткаЗавершена;
							
							Если ЗначениеЗаполнено(Строка.Сложность) Тогда
								СессияВыполненияТестаXDTO.Сложность = Строка.Сложность;
							ИначеЕсли ЗначениеЗаполнено(Подборка.НаименованиеСложностиПоУмолчанию) Тогда
								СессияВыполненияТестаXDTO.Сложность	= Подборка.НаименованиеСложностиПоУмолчанию;
							Иначе
								СессияВыполненияТестаXDTO.Сложность	= "По умолчанию";
							КонецЕсли;
							
							НастройкиТестированияXDTO.ПодробноеОписаниеПопытки.Добавить(СессияВыполненияТестаXDTO);
							
						КонецЦикла;
						
					КонецЕсли;
					
					СтартоваяСтраницаXDTO.НастройкиТестирования = НастройкиТестированияXDTO;
					
					Если КонтекстВыполнения.Симуляция Тогда
						КонтекстВыполнения.АдресОбъекта = "?action=newDocument&id="+Строка(ПодборкаXDTO.id)+"&level=default&numGroup=1&object=collection&window=this"; 
					КонецЕсли;
					
				Иначе
					
					Если КонтекстВыполнения.Симуляция Тогда
						КонтекстВыполнения.АдресОбъекта = "?id="+Строка(ПодборкаXDTO.id)+"&numGroup=1&object=collection&window=this"; 
					КонецЕсли;
					
				КонецЕсли;			
				
				//3. Стартовый ресурс
				Если ЗначениеЗаполнено(Подборка.СтартовыйРесурс) Тогда
					
					СтруктураСтартовогоРесурса = ОбъектыСУЗ.ПолучитьПредставление(Подборка.СтартовыйРесурс, ПараметрыСсылки, КонтекстВыполнения);
					
					ОбъектСУЗXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/KnowledgeSources", "ОбъектСУЗ");
					СтартовыйРесурсXDTO = ФабрикаXDTO.Создать(ОбъектСУЗXDTOТип);
					СтартовыйРесурсXDTO.Представление = СтруктураСтартовогоРесурса.Представление;
					СтартовыйРесурсXDTO.Скрипт = СтруктураСтартовогоРесурса.Скрипт;
					
					СтартоваяСтраницаXDTO.СтартовыйРесурс = СтартовыйРесурсXDTO;
					
					Если ЗначениеЗаполнено(Подборка.ВыравниваниеСтартовогоРесурса) Тогда
						СтартоваяСтраницаXDTO.ВыравниваниеСтартовогоРесурса = Подборка.ВыравниваниеСтартовогоРесурса;
					Иначе
						СтартоваяСтраницаXDTO.ВыравниваниеСтартовогоРесурса = Перечисления.СпособыВыравниванияСУЗ.left;
					КонецЕсли;
					
				КонецЕсли;
				
				
				//
				ПодборкаXDTO.СтартоваяСтраница = СтартоваяСтраницаXDTO;
				//
				
			Иначе // Если не нужна, то формируем первую страницу подборки. Для этого определяем переменную НомерГруппы.
				
				НомерСтраницы = 1;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// 2. Текущая страница
		
		
		Если НомерСтраницы > 0 Тогда
			
			ТекущаяСтраницаXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Collection", "ТекущаяСтраница");
			ТекущаяСтраницаXDTO     = ФабрикаXDTO.Создать(ТекущаяСтраницаXDTOТип);
			
			ТекущаяСтраницаXDTO.numGroup = Формат(НомерСтраницы, "ЧГ=0");
			
			ПредставлениеЭлементовПН = ОбъектыСУЗ.ПолучитьПользовательскуюНастройкуОбъекта("ГруппироватьЭлементыТеории", КонтекстВыполнения.ЗначенияНастроекЭР, КонтекстВыполнения.ЭлементСодержания); 
			
			Если ЗначениеЗаполнено(ПредставлениеЭлементовПН) Тогда
				ТекущаяСтраницаXDTO.ПредставлениеЭлементов = ПредставлениеЭлементовПН;
			ИначеЕсли ЗначениеЗаполнено(Подборка.ПредставлениеЭлементов) Тогда
				ТекущаяСтраницаXDTO.ПредставлениеЭлементов = Подборка.ПредставлениеЭлементов;
			Иначе
				ТекущаяСтраницаXDTO.ПредставлениеЭлементов = Перечисления.ВариантыПредставленияЭлементовПодборкиСУЗ.Последовательно;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НомерДокумента) Тогда
				ТекущаяСтраницаXDTO.numDocument = Формат(НомерДокумента, "ЧГ=0");
			КонецЕсли;
			
			СвернутьРазделыПН = ОбъектыСУЗ.ПолучитьПользовательскуюНастройкуОбъекта("СворачиватьПодразделыТеории", КонтекстВыполнения.ЗначенияНастроекЭР, КонтекстВыполнения.ЭлементСодержания); 
			
			Если ЗначениеЗаполнено(СвернутьРазделыПН) Тогда
				ТекущаяСтраницаXDTO.СвернутьРазделы = СвернутьРазделыПН;
			Иначе
				ТекущаяСтраницаXDTO.СвернутьРазделы = Подборка.СвернутьРазделы;
			КонецЕсли;
			
			ТекущаяСтраницаXDTO.ПоказыватьКлассификатор = Подборка.ПоказыватьКлассификатор;
			
			Если ЗначениеЗаполнено(НомерДокумента) Тогда
				ТекущаяСтраницаXDTO.РежимПроверки = ?(ДокументСессии.Пользователь = ОбъектыСУЗ.ТекущийПользователь(КонтекстВыполнения), Ложь, Истина);
			Иначе
				ТекущаяСтраницаXDTO.РежимПроверки = Ложь;
			КонецЕсли;
			
			ТекущаяСтраницаXDTO.РежимЭкспорта = ?(КонтекстВыполнения.ПараметрыЭкспорта = Неопределено, Ложь, Истина);
			
			// 2.1. Навигация
			
			НавигацияXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Collection", "Навигация");
			НавигацияXDTO     = ФабрикаXDTO.Создать(НавигацияXDTOТип);
			
			// Навигация
			
			НавигацияПН = ОбъектыСУЗ.ПолучитьПользовательскуюНастройкуОбъекта("ТипНавигацииТеории", КонтекстВыполнения.ЗначенияНастроекЭР, КонтекстВыполнения.ЭлементСодержания); 
			
			Если ДокументСессии <> Неопределено Тогда 
				ТипНавигации = Перечисления.ТипыНавигацииПодборкиСУЗ.Последовательно; // Для тестов всегда последовательная навигация
			ИначеЕсли ЗначениеЗаполнено(НавигацияПН) Тогда
				ТипНавигации = НавигацияПН;
			ИначеЕсли ЗначениеЗаполнено(Подборка.ТипНавигации) Тогда
				ТипНавигации = Подборка.ТипНавигации;
			Иначе
				ТипНавигации = Перечисления.ТипыНавигацииПодборкиСУЗ.Последовательно;
			КонецЕсли;	
			
			НавигацияXDTO.ТипНавигации = ТипНавигации;
			
			Если ТипНавигации = Перечисления.ТипыНавигацииПодборкиСУЗ.НаОднойСтранице
				ИЛИ ТипНавигации = Перечисления.ТипыНавигацииПодборкиСУЗ.БезНавигации
				ИЛИ ТипНавигации = Перечисления.ТипыНавигацииПодборкиСУЗ.Слайды Тогда // Все группы на одной странице.
				НавигацияXDTO.КоличествоСтраниц = 1;
			Иначе
				НавигацияXDTO.КоличествоСтраниц = ГруппыЭлементовПодборки.Количество();
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Подборка.НазначениеТестирования) Тогда
				НавигацияXDTO.НазначениеТестирования = Подборка.НазначениеТестирования;
			Иначе
				НавигацияXDTO.НазначениеТестирования = Перечисления.НазначенияТестированийСУЗ.Аттестация;
			КонецЕсли;
			
			// Карта
			
			Если ЗначениеЗаполнено(Подборка.Карта)
				И КонтекстВыполнения.ПараметрыЭкспорта = Неопределено Тогда
				
				КартаXDTO        = ФабрикаXDTO.Создать(ОбъектСУЗXDTOТип);
				КартаXDTO.object = "map";
				КартаXDTO.id     = Подборка.Карта.УникальныйИдентификатор();
				
				НавигацияXDTO.Карта = КартаXDTO;
				
			КонецЕсли;
			
			// Определяем показывать ли навигацию
			
			ПоказыватьНавигацию = Подборка.ПоказыватьНавигацию;
			
			Если ДокументСессии <> Неопределено Тогда
				ПоказыватьНавигацию = ДокументСессии.ПоказыватьНавигацию;
			КонецЕсли;
			
			Если ДокументСессии <> Неопределено
				И ДокументСессии.Пользователь <> ОбъектыСУЗ.ТекущийПользователь(КонтекстВыполнения) Тогда
				ПоказыватьНавигацию = Истина;
			КонецЕсли;
			
			НавигацияXDTO.ПоказыватьНавигацию = ПоказыватьНавигацию;
			НавигацияXDTO.НумероватьСтраницы  = Подборка.НумероватьСтраницы;
			
			// ПереходитьВпередАвтоматически
			
			НавигацияXDTO.ПереходитьВпередАвтоматически = Подборка.ПереходитьВпередАвтоматически;
			
			Если ПоказыватьНавигацию Тогда
				
				ГруппаЭлементовXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Collection", "ГруппаЭлементов");
				
				Н = 1;
				Для Каждого ГруппаПодборки Из ГруппыЭлементовПодборки Цикл
					
					ГруппаЭлементовXDTO = ФабрикаXDTO.Создать(ГруппаЭлементовXDTOТип);
					ГруппаЭлементовXDTO.Номер = Н;
					ГруппаЭлементовXDTO.Наименование = ГруппаПодборки.Наименование;
					
					Если ДокументСессии <> Неопределено Тогда
						ГруппаЭлементовXDTO.ВсеВопросыОтвечены = ГруппаПодборки.ВсеВопросыОтвечены;
						ГруппаЭлементовXDTO.ЕстьВопросыНаПроверку = (ТекущаяСтраницаXDTO.РежимПроверки И ГруппаПодборки.ЕстьВопросыНаПроверку);
					КонецЕсли;
					
					НавигацияXDTO.ГруппаЭлементов.Добавить(ГруппаЭлементовXDTO);
					
					Н = Н + 1;
					
				КонецЦикла;
				
			КонецЕсли;
			
			КоличествоЗавершенныхСтраницВопросов = 0;
			
			Если ДокументСессии <> Неопределено Тогда
				
				Для каждого СтрокаТЧ Из ДокументСессии.ГруппыПодборки Цикл
					Если СтрокаТЧ.ВсеВопросыОтвечены Тогда
						КоличествоЗавершенныхСтраницВопросов = КоличествоЗавершенныхСтраницВопросов + 1;
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
			НавигацияXDTO.КоличествоЗавершенныхСтраницВопросов = КоличествоЗавершенныхСтраницВопросов;
			
			//
			ТекущаяСтраницаXDTO.Навигация = НавигацияXDTO;
			//
			
			// 2.2. Элементы страницы
			
			Если ГруппыЭлементовПодборки.Количество() > 0 Тогда // Размещаем контент подборки (группы элементов)
				
				ГруппыНаТекущейСтранице = Новый Массив();
				
				Если ТипНавигации = Перечисления.ТипыНавигацииПодборкиСУЗ.НаОднойСтранице
					ИЛИ ТипНавигации = Перечисления.ТипыНавигацииПодборкиСУЗ.БезНавигации
					ИЛИ ТипНавигации = Перечисления.ТипыНавигацииПодборкиСУЗ.Слайды Тогда // Все группы на одной странице.
					
					ГруппыНаТекущейСтранице = ГруппыЭлементовПодборки; 
					
				Иначе // На текущей странице размещается группа соответствующая номеру текущей страницы.
					
					Попытка
						ТекущаяГруппа = ГруппыЭлементовПодборки[НомерСтраницы-1];
					Исключение
						ТекущаяГруппа = ГруппыЭлементовПодборки[0];
					КонецПопытки;
					
					ГруппыНаТекущейСтранице.Добавить(ТекущаяГруппа);
					
				КонецЕсли;
				
				ТаблицаКлассов = Новый ТаблицаЗначений(); 
				
				ТаблицаКлассов.Колонки.Добавить("Ссылка");
				ТаблицаКлассов.Колонки.Добавить("Код");
				ТаблицаКлассов.Колонки.Добавить("ПорядковыйНомер");
				ТаблицаКлассов.Колонки.Добавить("Наименование");
				ТаблицаКлассов.Колонки.Добавить("Представление");
				ТаблицаКлассов.Колонки.Добавить("Скрипт");
				
				// Группа элементов - это группа верхнего уровня. Содержит элементы и подгруппы со своими элементами.
				// Группа может быть представлена не только в виде группы справочника "ЭлементыПодборкиСУЗ", но и в виде одного элемента.
				
				НомерГруппы = 1;
				Для каждого ГруппаЭлементов Из ГруппыНаТекущейСтранице Цикл
					ГруппаЭлементовXDTO = ПолучитьXDTOГруппыЭлементовПодборки(Подборка, ДокументСессии, ГруппаЭлементов, ТаблицаКлассов, ПараметрыСсылки, ГруппыНаТекущейСтранице.Количество(), Ложь, КонтекстВыполнения);
					ГруппаЭлементовXDTO.Номер = НомерГруппы;
					ТекущаяСтраницаXDTO.ГруппаЭлементов.Добавить(ГруппаЭлементовXDTO);
					НомерГруппы = НомерГруппы + 1;
				КонецЦикла;
				
				// Таблица классификаторов должна включать дополнительно к реально используемым те ГруппаКлассов,
				// Которые есть в КлассификационнойГруппировке.
				Если ЗначениеЗаполнено(Подборка.КлассификационнаяГруппировка) Тогда
					Для каждого СтрокаТабличнойЧасти Из Подборка.КлассификационнаяГруппировка.ГруппаКлассов Цикл
						ДобавитьКлассВТаблицуКлассов(Подборка, СтрокаТабличнойЧасти.Класс, ТаблицаКлассов, ПараметрыСсылки, КонтекстВыполнения);
					КонецЦикла;
				КонецЕсли;
				
				ТаблицаКлассовXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Collection", "ТаблицаКлассов");
				ТаблицаКлассовXDTO    = ФабрикаXDTO.Создать(ТаблицаКлассовXDTOТип);
				
				Если Подборка.ПоказыватьКлассификатор Тогда
					
					Для каждого КлассификаторСтрока Из ТаблицаКлассов Цикл
						КлассXDTO = ПолучитьXDTOКласса(КлассификаторСтрока);
						ТаблицаКлассовXDTO.Класс.Добавить(КлассXDTO);
					КонецЦикла;
					
					//
					ТекущаяСтраницаXDTO.ТаблицаКлассов = ТаблицаКлассовXDTO;
					//
					
				КонецЕсли;
				
			КонецЕсли;
			
			ТекущаяСтраницаXDTO.ВозможноПоказатьОдинФайл = ?(КонтекстВыполнения.Свойство("ВозможноПоказатьОдинФайл") И КонтекстВыполнения.ВозможноПоказатьОдинФайл, Истина, Ложь);
			ТекущаяСтраницаXDTO.ЭтоВстроенныйWeKit = ?(ТипЗнч(КонтекстВыполнения.ЭтоВстроенныйWeKit) = Тип("Булево"), КонтекстВыполнения.ЭтоВстроенныйWeKit, Ложь);
			
			// 2.3 Таймер
			
			Если ДокументСессии <> Неопределено
				И НЕ ДокументСессии.ТестЗавершен
				И Подборка.ПоказыватьТаймер
				И ДокументСессии.ВремяТеста <> Дата("00010101") Тогда
				
				// Определяем формат таймера
				
				Если НЕ ЗначениеЗаполнено(Подборка.ФорматТаймера)
					ИЛИ Подборка.ФорматТаймера = Перечисления.ФорматыТаймераСУЗ.Минуты Тогда
					
					ФорматТаймера = "M";
					
				Иначе
					
					ФорматТаймера = "MS";
					
				КонецЕсли;
				
				// Определяем значение таймера
				
				// Определяем сколько можно выполнять тест в секундах
				ЗаданоВремяТеста = ДокументСессии.ВремяТеста;
				ВремяТестаВСекундах = Секунда(ЗаданоВремяТеста) + Минута(ЗаданоВремяТеста)*60 + Час(ЗаданоВремяТеста)*3600;			
				
				// Определяем время, сколько уже выполняется тест
				МаксимальнаяДатаЗавершенияТеста = ДокументСессии.ДатаНачалаВыполненияТеста + ВремяТестаВСекундах;
				
				ЗначениеТаймера = МаксимальнаяДатаЗавершенияТеста - ТекущаяДата();
				
				Если ЗначениеТаймера < 0 Тогда
					ЗначениеТаймера = 0;
				КонецЕсли;
				
				// Формируем объект XDTO таймера
				
				ТаймерXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Collection", "Таймер");
				ТаймерXDTO    = ФабрикаXDTO.Создать(ТаймерXDTOТип);
				
				ТаймерXDTO.ОтносительноеЗначение = ЗначениеТаймера;
				ТаймерXDTO.Формат = ФорматТаймера;
				
				ТекущаяСтраницаXDTO.Таймер = ТаймерXDTO;
				
			КонецЕсли;
			
			//
			ПодборкаXDTO.ТекущаяСтраница = ТекущаяСтраницаXDTO;
			//
			
			Если КонтекстВыполнения.Симуляция Тогда
				
				Если НЕ ЗначениеЗаполнено(НомерДокумента)
					И НомерСтраницы < ГруппыЭлементовПодборки.Количество() Тогда
					
					КонтекстВыполнения.АдресОбъекта = "?id="+Строка(ПодборкаXDTO.id)+"&numGroup="+ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(НомерСтраницы + 1)+"&object=collection&window=this"; 
					
				КонецЕсли;
				
				// Примечание: в тестах при симуляции переход далее происходит автоматически после ответа на вопрос.
				
			КонецЕсли;
			
		КонецЕсли;
		
		
		//3. Финальная страница подборки.
		
		Если НомерСтраницы < 0 Тогда
			
			ФинальнаяСтраницаXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Collection", "ФинальнаяСтраница");
			ФинальнаяСтраницаXDTO    = ФабрикаXDTO.Создать(ФинальнаяСтраницаXDTOТип);
			
			Если ЗначениеЗаполнено(НомерДокумента) Тогда
				
				ДокументСессии = ОбъектыСУЗ.ДокументСессииТестирования(НомерДокумента, КонтекстВыполнения);
				
				Если НЕ ДокументСессии.ТестЗавершен Тогда
					
					ДокументСессии.ЗакрытьСессию(Истина);
					
					ДокументСессии.Записать(РежимЗаписиДокумента.Проведение);
					
					Если НЕ ЗначениеЗаполнено(ДокументСессии.НазначениеТестирования)
						ИЛИ ДокументСессии.НазначениеТестирования = Перечисления.НазначенияТестированийСУЗ.Аттестация Тогда
						
						КонтекстВыполнения.Вставить("ВыполняетсяТестирование", Ложь);
						КонтекстВыполнения.Вставить("СессияТестирования", 0); // Очищаем информацию о сессии на клиенте
						
					КонецЕсли;
					
				КонецЕсли;
				
				ФинальнаяСтраницаXDTO.РезультатТестирования = ДокументСессии.ИтоговыйРезультат;
				
				ФинальнаяСтраницаXDTO.ПроверяетсяПреподавателем = ДокументСессии.ПроверяетсяПреподавателем;
				ФинальнаяСтраницаXDTO.ПроверенПреподавателем = ДокументСессии.ПроверенПреподавателем;
				ФинальнаяСтраницаXDTO.ИнформацияНаФинальнойСтранице = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(Подборка.ИнформацияНаФинальнойСтранице);
				
				Если ЗначениеЗаполнено(Подборка.НазначениеТестирования) Тогда
					ФинальнаяСтраницаXDTO.НазначениеТестирования = Подборка.НазначениеТестирования;
				Иначе
					ФинальнаяСтраницаXDTO.НазначениеТестирования = Перечисления.НазначенияТестированийСУЗ.Аттестация;
				КонецЕсли;
				
				// Общий комментарий
				
				Если ЗначениеЗаполнено(Подборка.ОбщийФинальныйКомментарий) Тогда
					
					ФинальнаяСтраницаXDTO.ОбщийКомментарий = Подборка.ОбщийФинальныйКомментарий; 
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Подборка.ОбщийФинальныйРесурс) Тогда
					
					СтруктураРесурса = ОбъектыСУЗ.ПолучитьПредставление(Подборка.ОбщийФинальныйРесурс, ПараметрыСсылки, КонтекстВыполнения);
					
					ОбъектСУЗXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/KnowledgeSources", "ОбъектСУЗ");
					РесурсXDTO = ФабрикаXDTO.Создать(ОбъектСУЗXDTOТип);
					РесурсXDTO.Представление = СтруктураРесурса.Представление;
					РесурсXDTO.Скрипт = СтруктураРесурса.Скрипт;
					
					ФинальнаяСтраницаXDTO.РесурсОбщийФинальный = РесурсXDTO;
					
				КонецЕсли;
				
				// Вставляем финальный комментарий
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	КомментарииКТестамСУЗ.НачалоДиапазонаБаллов,
				|	КомментарииКТестамСУЗ.КонецДиапазонаБаллов,
				|	КомментарииКТестамСУЗ.НачалоДиапазонаПопыток,
				|	КомментарииКТестамСУЗ.КонецДиапазонаПопыток,
				|	КомментарииКТестамСУЗ.Комментарий,
				|	КомментарииКТестамСУЗ.Поставщик,
				|	КомментарииКТестамСУЗ.Ресурс
				|ИЗ
				|	Справочник.КомментарииКТестамСУЗ КАК КомментарииКТестамСУЗ
				|ГДЕ
				|	КомментарииКТестамСУЗ.Владелец = &Подборка
				|	И КомментарииКТестамСУЗ.ПометкаУдаления = ЛОЖЬ";
				
				Запрос.УстановитьПараметр("Подборка", Подборка);
				
				Результат = Запрос.Выполнить();
				
				ТаблицаДиапазонов = Результат.Выгрузить(); // Выбираем все комментарии
				
				ЕстьДиапазоныПопыток = Ложь;
				
				Для каждого Строка Из ТаблицаДиапазонов Цикл
					
					Если Строка.НачалоДиапазонаПопыток > 0
						ИЛИ Строка.КонецДиапазонаПопыток > 0 Тогда
						
						ЕстьДиапазоныПопыток = Истина;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если ЕстьДиапазоныПопыток Тогда
					КоличествоПопыток = ПолучитьПопыткиПрохожденияТестов(Подборка, КонтекстВыполнения).Количество();
				Иначе
					КоличествоПопыток = 0;
				КонецЕсли;
				
				ПодходящаяСтрока = Неопределено;
				
				ПоказыватьПоследнююВерсию = Константы.ПоказыватьПоследнююВерсиюСУЗ.Получить();
				
				Если ПоказыватьПоследнююВерсию Тогда
					ПредпочитаемыйПоставщик = Константы.ПредпочитатьПоставщикаСУЗ.Получить();
				Иначе
					ПредпочитаемыйПоставщик = Неопределено;
				КонецЕсли;
				
				Для каждого Строка Из ТаблицаДиапазонов Цикл
					
					СтрокаПодходитПоРезультату = Ложь;
					СтрокаПодходитПоПопыткам = Ложь;
					
					Если (ДокументСессии.ИтоговыйРезультат >= Строка.НачалоДиапазонаБаллов
						И ДокументСессии.ИтоговыйРезультат <= Строка.КонецДиапазонаБаллов)
						ИЛИ (Строка.НачалоДиапазонаБаллов = 0 И Строка.КонецДиапазонаБаллов = 0) Тогда
						
						СтрокаПодходитПоРезультату = Истина;
						
					КонецЕсли;
					
					Если (КоличествоПопыток >= Строка.НачалоДиапазонаПопыток
						И КоличествоПопыток <= Строка.КонецДиапазонаПопыток)
						ИЛИ (Строка.НачалоДиапазонаПопыток = 0 И Строка.КонецДиапазонаПопыток = 0) Тогда
						
						СтрокаПодходитПоПопыткам = Истина;
						
					КонецЕсли;
					
					Если СтрокаПодходитПоРезультату И СтрокаПодходитПоПопыткам Тогда
						
						Если ПодходящаяСтрока = Неопределено Тогда
							
							ПодходящаяСтрока = Строка;
							
						Иначе
							
							Если Строка.Поставщик = ПредпочитаемыйПоставщик Тогда // Предпочитаемый поставщик имеет больший приоритет.
								ПодходящаяСтрока = Строка;
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если ПодходящаяСтрока <> Неопределено Тогда
					
					ФинальнаяСтраницаXDTO.Комментарий = ПодходящаяСтрока.Комментарий;
					
					Если ЗначениеЗаполнено(ПодходящаяСтрока.Ресурс) Тогда
						
						СтруктураРесурса = ОбъектыСУЗ.ПолучитьПредставление(ПодходящаяСтрока.Ресурс, ПараметрыСсылки, КонтекстВыполнения);
						
						ОбъектСУЗXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/KnowledgeSources", "ОбъектСУЗ");
						РесурсXDTO = ФабрикаXDTO.Создать(ОбъектСУЗXDTOТип);
						РесурсXDTO.Представление = СтруктураРесурса.Представление;
						РесурсXDTO.Скрипт = СтруктураРесурса.Скрипт;
						
						ФинальнаяСтраницаXDTO.РесурсКомментария = РесурсXDTO;
						
					КонецЕсли;
					
				КонецЕсли;
				
				// Вставляем комментарий для психологического тестирования
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	СхемаАнализаПсихологическогоТестированияСУЗ.Комментарий,
				|	СхемаАнализаПсихологическогоТестированияСУЗ.Наименование,
				|	СхемаАнализаПсихологическогоТестированияСУЗ.НачалоДиапазона,
				|	СхемаАнализаПсихологическогоТестированияСУЗ.КонецДиапазона,
				|	СхемаАнализаПсихологическогоТестированияСУЗ.Поставщик,
				|	СхемаАнализаПсихологическогоТестированияСУЗ.Ресурс
				|ИЗ
				|	Справочник.СхемаАнализаПсихологическогоТестированияСУЗ КАК СхемаАнализаПсихологическогоТестированияСУЗ
				|ГДЕ
				|	СхемаАнализаПсихологическогоТестированияСУЗ.Владелец = &Подборка
				|	И СхемаАнализаПсихологическогоТестированияСУЗ.ПометкаУдаления = ЛОЖЬ";
				
				Запрос.УстановитьПараметр("Подборка", Подборка);
				
				Результат = Запрос.Выполнить();
				
				ТаблицаДиапазонов = Результат.Выгрузить(); // Выбираем все комментарии
				
				ПодходящаяСтрока = Неопределено;
				
				ПоказыватьПоследнююВерсию = Константы.ПоказыватьПоследнююВерсиюСУЗ.Получить();
				
				Если ПоказыватьПоследнююВерсию Тогда
					ПредпочитаемыйПоставщик = Константы.ПредпочитатьПоставщикаСУЗ.Получить();
				Иначе
					ПредпочитаемыйПоставщик = Неопределено;
				КонецЕсли;
				
				Для каждого Строка Из ТаблицаДиапазонов Цикл
					
					Если ДокументСессии.СуммаБалловПсихологическихВопросов >= Строка.НачалоДиапазона
						И ДокументСессии.СуммаБалловПсихологическихВопросов <= Строка.КонецДиапазона Тогда
						
						Если ПодходящаяСтрока = Неопределено Тогда
							
							ПодходящаяСтрока = Строка;
							
						Иначе
							
							Если Строка.Поставщик = ПредпочитаемыйПоставщик Тогда // Предпочитаемый поставщик имеет больший приоритет.
								ПодходящаяСтрока = Строка;
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если ПодходящаяСтрока <> Неопределено Тогда
					
					ФинальнаяСтраницаXDTO.КомментарийПсихологическогоТестирования = ПодходящаяСтрока.Комментарий;
					
					Если ЗначениеЗаполнено(ПодходящаяСтрока.Ресурс) Тогда
						
						СтруктураРесурса = ОбъектыСУЗ.ПолучитьПредставление(ПодходящаяСтрока.Ресурс, ПараметрыСсылки, КонтекстВыполнения);
						
						ОбъектСУЗXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/KnowledgeSources", "ОбъектСУЗ");
						РесурсXDTO = ФабрикаXDTO.Создать(ОбъектСУЗXDTOТип);
						РесурсXDTO.Представление = СтруктураРесурса.Представление;
						РесурсXDTO.Скрипт = СтруктураРесурса.Скрипт;
						
						ФинальнаяСтраницаXDTO.РесурсКомментарияПсихологическогоТестирования = РесурсXDTO;
						
					КонецЕсли;
					
				КонецЕсли;
				
				// Вставляем таблицу вопросов
				
				Если Подборка.ИнформацияНаФинальнойСтранице = Перечисления.ИнформацияНаФинальнойСтраницеТестаСУЗ.ВопросыСОшибками Тогда
					
					ВопросыТестаXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Collection", "ВопросыТеста");
					ВопросыТестаXDTO = ФабрикаXDTO.Создать(ВопросыТестаXDTOТип);
					
					ВопросТестаXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Collection", "ВопросТеста");
					
					ТаблицаВопросовТеста = Документы.ПопыткаВыполненияПодборкиВопросовСУЗ.ВопросыТеста(ДокументСессии.Ссылка);
					
					Для каждого Строка Из ТаблицаВопросовТеста Цикл
						
						Если ЗначениеЗаполнено(Строка.ОтветНаВопрос) И Строка.ВопросОтвечен И Строка.Результат < 100 Тогда
							
							ВопросТестаXDTO = ФабрикаXDTO.Создать(ВопросТестаXDTOТип);
							ВопросТестаXDTO.Номер = Строка.Номер;
							ВопросТестаXDTO.Наименование = Строка.Наименование;
							
							ВопросыТестаXDTO.ВопросТеста.Добавить(ВопросТестаXDTO);
							
						КонецЕсли;
						
					КонецЦикла;
					
					ФинальнаяСтраницаXDTO.ВопросыТеста = ВопросыТестаXDTO;
					
				КонецЕсли;
				
			КонецЕсли;
			
			//
			ПодборкаXDTO.ФинальнаяСтраница = ФинальнаяСтраницаXDTO;
			//
			
		КонецЕсли;
		
		ШаблонОбъекта = ОбъектыСУЗ.ПолучитьСсылкуНаXSLШаблонОбъекта(Подборка);
		ОбъектыСУЗ.ДобавитьШаблонВСписокОбъекта(ШаблонОбъекта, КонтекстВыполнения.СписокШаблонов);
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ПодборкаXDTO);
		XMLДанные = ЗаписьXML.Закрыть();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	Возврат XMLДанные;
	
КонецФункции

// Позволяет получить таблицу групп элементов верхнего уровня подборки.
// Группа элементов - это ссылка на элемент справочника ЭлементыПодборкиСУЗ, не имеющая родителя.
//
// Параметры
//  Нет.
//
// Возвращаемое значение:
//   Таблица – содержит данные о группах подборки.
//
Функция ПолучитьГруппыЭлементовПодборки(Подборка, УчитыватьПредыдущиеПопытки = Ложь, МаксимальноеКоличествоЭлементов = 0, КонтекстВыполнения = Неопределено) Экспорт
	
	ЗапросГруппыПодборки = Новый Запрос("ВЫБРАТЬ
	                                    |	ЭлементыПодборкиСУЗ.Ссылка,
	                                    |	ЭлементыПодборкиСУЗ.ЭтоГруппа,
	                                    |	ЭлементыПодборкиСУЗ.СсылкаНаОбъектСУЗ,
	                                    |	ЭлементыПодборкиСУЗ.Наименование
	                                    |ИЗ
	                                    |	Справочник.ЭлементыПодборкиСУЗ КАК ЭлементыПодборкиСУЗ
	                                    |ГДЕ
	                                    |	ЭлементыПодборкиСУЗ.Владелец = &Владелец
	                                    |	И ЭлементыПодборкиСУЗ.Родитель = &Родитель
	                                    |	И ЭлементыПодборкиСУЗ.ПометкаУдаления = &ПометкаУдаления
	                                    |
	                                    |УПОРЯДОЧИТЬ ПО
	                                    |	ЭлементыПодборкиСУЗ.Код");
		
	
	ЗапросГруппыПодборки.УстановитьПараметр("Владелец", Подборка); 
	ЗапросГруппыПодборки.УстановитьПараметр("Родитель", Справочники.ЭлементыПодборкиСУЗ.ПустаяСсылка()); 
	ЗапросГруппыПодборки.УстановитьПараметр("ПометкаУдаления", Ложь); 
	
	ГруппыПодборки = ЗапросГруппыПодборки.Выполнить().Выгрузить();
	
	Если УчитыватьПредыдущиеПопытки
		И МаксимальноеКоличествоЭлементов <> 0
		И МаксимальноеКоличествоЭлементов < ГруппыПодборки.Количество() Тогда
		
		Возврат ПолучитьГруппыПодборкиСУчетомРезультатов(Подборка, ОбъектыСУЗ.ТекущийПользователь(КонтекстВыполнения), ГруппыПодборки, МаксимальноеКоличествоЭлементов);
		
	Иначе
	
		Возврат ГруппыПодборки;	
		
	КонецЕсли;
	
	
КонецФункции

// Выбирает вопросы из рубрикатора, для последующего использования при тестировании.
//
Функция ВопросыИзРубрикатора(Подборка, УчитыватьПредыдущиеПопытки = Ложь, МаксимальноеКоличествоЭлементов = 0, ПараметрыЭкспорта = Неопределено, КонтекстВыполнения) Экспорт
	
	// 1. Сначала выбираем все элементы подборки из справочника
	// ЭлементыПодборкиИзРубрикатораСУЗ
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭлементыПодборкиИзРубрикатораСУЗ.Ссылка,
	               |	ЭлементыПодборкиИзРубрикатораСУЗ.КоличествоЭлементов,
	               |	ЭлементыПодборкиИзРубрикатораСУЗ.ЭлементРубрикатора,
	               |	ЭлементыПодборкиИзРубрикатораСУЗ.Рубрикатор,
	               |	ЭлементыПодборкиИзРубрикатораСУЗ.ИсключенныеЭлементы.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		Рубрикатор,
	               |		ЭлементРубрикатора
	               |	),
	               |	ЭлементыПодборкиИзРубрикатораСУЗ.РазрешенныйВес
	               |ИЗ
	               |	Справочник.ЭлементыПодборкиИзРубрикатораСУЗ КАК ЭлементыПодборкиИзРубрикатораСУЗ
	               |ГДЕ
	               |	ЭлементыПодборкиИзРубрикатораСУЗ.Владелец = &Владелец
	               |	И ЭлементыПодборкиИзРубрикатораСУЗ.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Владелец", Подборка);
	
	ВыборкаЭлементовПодборки = Запрос.Выполнить().Выбрать();
	
	// 2. Получаем таблицу, содержащую все рубрики из которых
	// следует выбирать элементы подборки и таблицу исключенных рубрик.
	// Рубрик может быть больше, чем указано было пользователем, так как
	// существуют вложенные рубрики, которые так же следует учесть.
	
	// 2.1 Формируем таблицы ТаблицаВсехРубрик и ТаблицаВсехИсключенныхРубрик
	
	ОписаниеТиповЭлементПодборки    = Новый ОписаниеТипов("СправочникСсылка.ЭлементыПодборкиИзРубрикатораСУЗ"); 
	ОписаниеТиповЭлементРубрикатора = Новый ОписаниеТипов("СправочникСсылка.ЭлементыРубрикатораСУЗ"); 
	ОписаниеТиповЧисло              = Новый ОписаниеТипов("Число"); 
	
	ТаблицаВсехРубрик = Новый ТаблицаЗначений;
	ТаблицаВсехРубрик.Колонки.Добавить("ЭлементПодборки", ОписаниеТиповЭлементПодборки); // Ссылка на элемент справочника ЭлементыПодборкиИзРубрикатораСУЗ
	ТаблицаВсехРубрик.Колонки.Добавить("ЭлементРубрикатора", ОписаниеТиповЭлементРубрикатора);
	ТаблицаВсехРубрик.Колонки.Добавить("РазрешенныйВес", ОписаниеТиповЧисло);
	
	ТаблицаВсехИсключенныхРубрик = Новый ТаблицаЗначений;
	ТаблицаВсехИсключенныхРубрик.Колонки.Добавить("ЭлементПодборки", ОписаниеТиповЭлементПодборки); // Ссылка на элемент справочника ЭлементыПодборкиИзРубрикатораСУЗ
	ТаблицаВсехИсключенныхРубрик.Колонки.Добавить("ЭлементРубрикатора", ОписаниеТиповЭлементРубрикатора);
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭлементыРубрикатораСУЗ.Ссылка
	               |ИЗ
	               |	Справочник.ЭлементыРубрикатораСУЗ КАК ЭлементыРубрикатораСУЗ
	               |ГДЕ
	               |	ЭлементыРубрикатораСУЗ.Ссылка В ИЕРАРХИИ(&ЭлементРубрикатора)
	               |	И ЭлементыРубрикатораСУЗ.Владелец = &Рубрикатор";
	
	// Примечание: используются вложенные циклы с обращением к базе.
	// Потенциально узкое место.
	
	НомерЭлемента = 0;
	
	Пока ВыборкаЭлементовПодборки.Следующий() Цикл
		
		// Добавляем строки к таблице ТаблицаВсехРубрик
		
		Запрос.УстановитьПараметр("Рубрикатор", ВыборкаЭлементовПодборки.Рубрикатор);
		Запрос.УстановитьПараметр("ЭлементРубрикатора", ВыборкаЭлементовПодборки.ЭлементРубрикатора);
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Пока Результат.Следующий() Цикл
			
			НоваяСтрока = ТаблицаВсехРубрик.Добавить();
			
			НоваяСтрока.ЭлементПодборки    = ВыборкаЭлементовПодборки.Ссылка;
		    НоваяСтрока.ЭлементРубрикатора = Результат.Ссылка;
			НоваяСтрока.РазрешенныйВес     = ВыборкаЭлементовПодборки.РазрешенныйВес;
			
		КонецЦикла;
		
		// Добавляем строки к таблице ТаблицаВсехИсключенныхРубрик
		// Перебираем исключенные рубрики для текущего элемента подборки.
		
		ТекИсключенныеЭлементы = ВыборкаЭлементовПодборки.ИсключенныеЭлементы.Выгрузить();
		
		Для каждого ИсключенныйЭлемент Из ТекИсключенныеЭлементы Цикл
			
			Запрос.УстановитьПараметр("ЭлементРубрикатора", ИсключенныйЭлемент.ЭлементРубрикатора);
			Запрос.УстановитьПараметр("Рубрикатор", ИсключенныйЭлемент.Рубрикатор);
			
			Результат = Запрос.Выполнить().Выбрать();
			
			Пока Результат.Следующий() Цикл
				
				НоваяСтрока = ТаблицаВсехИсключенныхРубрик.Добавить();
				НоваяСтрока.ЭлементПодборки    = ВыборкаЭлементовПодборки.Ссылка;
			    НоваяСтрока.ЭлементРубрикатора = Результат.Ссылка;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// 2.2 Формируем таблицу со всеми объектами, которые
	// Могут входить в тест, но исключаем те, которые указаны в исключении.
	
	ТаблицаОбъектовСУЗ  = ПолучитьВопросыРубрик(ТаблицаВсехРубрик);
	
	Если ТаблицаВсехИсключенныхРубрик.Количество() > 0 Тогда
		
		ТаблицаИсключенныхОбъектовСУЗ = ПолучитьВопросыРубрик(ТаблицаВсехИсключенныхРубрик);
		
		// Удаляем вопросы, которые исключены
			
		Сч = ТаблицаОбъектовСУЗ.Количество();

		Пока Сч > 0 Цикл			
			
			ТекСтрока = ТаблицаОбъектовСУЗ[Сч - 1];

			Отбор = Новый Структура();
			Отбор.Вставить("СсылкаНаОбъектСУЗ", ТекСтрока.СсылкаНаОбъектСУЗ);
			
			Если ТаблицаИсключенныхОбъектовСУЗ.НайтиСтроки(Отбор).Количество() > 0 Тогда
				ТаблицаОбъектовСУЗ.Удалить(Сч - 1);		
			КонецЕсли;
			
			Сч = Сч - 1;
			
		КонецЦикла;	
		
	КонецЕсли;
	
	// Удаляем вопросы не подходящие по весу
	
	Сч = ТаблицаОбъектовСУЗ.Количество();

	Пока Сч > 0 Цикл			
		
		ТекСтрока = ТаблицаОбъектовСУЗ[Сч - 1];

		Если ТекСтрока.ВесВопроса > 0 Тогда
		
			// Ищем все разрешенные веса
			
			МассивРазрешенныхВесов = Новый Массив();
			
			Отбор = Новый Структура();
			Отбор.Вставить("ЭлементРубрикатора", ТекСтрока.ЭлементРубрикатора);
			
			СтрокиТВР = ТаблицаВсехРубрик.НайтиСтроки(Отбор);
			
			Для каждого СтрокаТВР Из СтрокиТВР Цикл
			
				Если СтрокаТВР.РазрешенныйВес > 0
					И МассивРазрешенныхВесов.Найти(СтрокаТВР.РазрешенныйВес) = Неопределено Тогда
					
					МассивРазрешенныхВесов.Добавить(СтрокаТВР.РазрешенныйВес);
					
				КонецЕсли;
			
			КонецЦикла;
			
			// Удаляем вопросы, если есть ограничение по весу вопроса
			
			Если МассивРазрешенныхВесов.Количество() > 0 Тогда
				
				Если МассивРазрешенныхВесов.Найти(ТекСтрока.ВесВопроса) = Неопределено Тогда
					ТаблицаОбъектовСУЗ.Удалить(Сч - 1);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Сч = Сч - 1;
		
	КонецЦикла;	
	
	// Удаляем открытые вопросы, если надо
			
	Если Подборка.ИсключитьОткрытыеВопросы Тогда
		
		Сч = ТаблицаОбъектовСУЗ.Количество();

		Пока Сч > 0 Цикл
			
            ТекСтрока = ТаблицаОбъектовСУЗ[Сч - 1];
			
			Если ТекСтрока.ТипВопроса = Перечисления.ТипыВопросовСУЗ.Открытый Тогда
				ТаблицаОбъектовСУЗ.Удалить(Сч - 1);
			КонецЕсли;
			
			Сч = Сч - 1;
			
		КонецЦикла;	
		
	КонецЕсли;
	
	// Заполняем таблицу ТаблицаДоступныхОбъектов - это
	// Финальная таблица для возврата из функции.
	
	ТаблицаДоступныхОбъектов = Новый ТаблицаЗначений();
	ТаблицаДоступныхОбъектов.Колонки.Добавить("Ссылка");
	ТаблицаДоступныхОбъектов.Колонки.Добавить("ВесВопроса");
	ТаблицаДоступныхОбъектов.Колонки.Добавить("ТипВопроса");
	ТаблицаДоступныхОбъектов.Колонки.Добавить("ЭлементПодборки");
	
	// Заполняем таблицу ТаблицаЭлементовПодборки, в которой
	// Хранится информация о количестве вопросов для каждого
	// Элемента подборки, которые добавлены в финальную таблицу
	
	ТаблицаЭлементовПодборки = Новый ТаблицаЗначений();
	ТаблицаЭлементовПодборки.Колонки.Добавить("ЭлементПодборки");
	ТаблицаЭлементовПодборки.Колонки.Добавить("КоличествоВопросов");
	ТаблицаЭлементовПодборки.Колонки.Добавить("РазрешенноеКоличествоВопросов");
	
	// Выбираем из доступных объектов СУЗ (ТаблицаОбъектовСУЗ) необходимое
	// Количество для каждого элемента подборки.
	
	ВыборкаЭлементовПодборки.Сбросить();
	
	НомерИтерации = 0;
	
	Пока ВыборкаЭлементовПодборки.Следующий() Цикл
		
		НомерИтерации = НомерИтерации + 1;
		
		ТаблицаВопросовЭП = Новый ТаблицаЗначений(); // Таблица вопросов только для одного правила
		
		Для каждого Колонка Из ТаблицаОбъектовСУЗ.Колонки Цикл
			ТаблицаВопросовЭП.Колонки.Добавить(Колонка.Имя);
		КонецЦикла;
		
		Для каждого СтрокаТО Из ТаблицаОбъектовСУЗ Цикл
			
			Если СтрокаТО.ЭлементПодборки = ВыборкаЭлементовПодборки.Ссылка Тогда // Вопрос из нужной рубрики
				
				НоваяСтрокаТВ = ТаблицаВопросовЭП.Добавить(); 
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТВ, СтрокаТО); 				  
				
			КонецЕсли;
				
		КонецЦикла;
		
		Если УчитыватьПредыдущиеПопытки
			И ТаблицаВопросовЭП.Количество() > 0 Тогда
			
			ТаблицаВопросовЭП = ПолучитьГруппыПодборкиСУчетомРезультатов(Подборка, ОбъектыСУЗ.ТекущийПользователь(КонтекстВыполнения), ТаблицаВопросовЭП, ВыборкаЭлементовПодборки.КоличествоЭлементов);
			
		КонецЕсли;
		
		Если ВыборкаЭлементовПодборки.КоличествоЭлементов > 0
			И ТаблицаВопросовЭП.Количество() > ВыборкаЭлементовПодборки.КоличествоЭлементов
			И ПараметрыЭкспорта = Неопределено Тогда
			КоличествоЭлементов = ВыборкаЭлементовПодборки.КоличествоЭлементов;
		Иначе
			КоличествоЭлементов = ТаблицаВопросовЭП.Количество();
		КонецЕсли;
		
		ИндексМассив = ОбщегоНазначенияСУ.ИндексМассив(0, ТаблицаВопросовЭП.Количество(), ?(ПараметрыЭкспорта = Неопределено, Истина, Ложь));
		

		// Формируем выходную таблицу.
		
		Для Сч=0 По КоличествоЭлементов-1 Цикл
			
			НоваяСтрока = ТаблицаДоступныхОбъектов.Добавить();
			НоваяСтрока.Ссылка          = ТаблицаВопросовЭП[ИндексМассив[Сч]].СсылкаНаОбъектСУЗ;
			НоваяСтрока.ВесВопроса      = ТаблицаВопросовЭП[ИндексМассив[Сч]].ВесВопроса;
			НоваяСтрока.ТипВопроса      = ТаблицаВопросовЭП[ИндексМассив[Сч]].ТипВопроса;
			НоваяСтрока.ЭлементПодборки = ТаблицаВопросовЭП[ИндексМассив[Сч]].ЭлементПодборки;
			
		КонецЦикла;
		
		// Запоминаем количество элементов
		
		НоваяСтрокаТЭП = ТаблицаЭлементовПодборки.Добавить();
		НоваяСтрокаТЭП.ЭлементПодборки               = ВыборкаЭлементовПодборки.Ссылка;
		НоваяСтрокаТЭП.КоличествоВопросов            = КоличествоЭлементов;
		НоваяСтрокаТЭП.РазрешенноеКоличествоВопросов = ?(ПараметрыЭкспорта = Неопределено, ВыборкаЭлементовПодборки.КоличествоЭлементов, 0);
		
	КонецЦикла;
	
	// Если в режиме УчитыватьПредыдущиеПопытки вопросов меньше, чем нужно для теста,
	// То пытаемся их добавить. Это нужно делать после основного набора вопросов, который
	// Мы сделали до этого, так как некоторые вопросы имеют приоритет и должны быть добавлены в тест
	// В первую очередь.
	
	// Если количество вопросов уже больше или равно требуемому для
	// Всего теста, то ничего не делаем.
	
	Если УчитыватьПредыдущиеПопытки	И ТаблицаДоступныхОбъектов.Количество() < МаксимальноеКоличествоЭлементов Тогда
		
		Для каждого СтрокаТЭП Из ТаблицаЭлементовПодборки Цикл
			
			Если ТаблицаДоступныхОбъектов.Количество() >= МаксимальноеКоличествоЭлементов Тогда
				Прервать; // Уже хватает вопросов для теста
			КонецЕсли;
			
			Если СтрокаТЭП.РазрешенноеКоличествоВопросов = 0
				ИЛИ СтрокаТЭП.КоличествоВопросов < СтрокаТЭП.РазрешенноеКоличествоВопросов Тогда // Не хватает для текущего элемента подборки
				
				// Создаем таблицу с вопросами, которые можно добавить в тест
				// Т.е. его еще нет в тесте и он соответствует текущему элементу подборки
				
				ТаблицаВопросовЭП = Новый ТаблицаЗначений();
				
				Для каждого Колонка Из ТаблицаОбъектовСУЗ.Колонки Цикл
					ТаблицаВопросовЭП.Колонки.Добавить(Колонка.Имя);
				КонецЦикла;
				
				Для каждого СтрокаТО Из ТаблицаОбъектовСУЗ Цикл
					
					Если ТаблицаДоступныхОбъектов.Найти(СтрокаТО.СсылкаНаОбъектСУЗ, "Ссылка") = Неопределено
						И СтрокаТО.ЭлементПодборки = СтрокаТЭП.ЭлементПодборки Тогда
						
						НоваяСтрокаТВ = ТаблицаВопросовЭП.Добавить(); 
						ЗаполнитьЗначенияСвойств(НоваяСтрокаТВ, СтрокаТО); 				  
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если ТаблицаВопросовЭП.Количество() = 0 Тогда
					Продолжить; // Нечего добавлять
				КонецЕсли;
				
				ТребуетсяДобавитьВопросов = МаксимальноеКоличествоЭлементов - ТаблицаДоступныхОбъектов.Количество();
				
				Если ТребуетсяДобавитьВопросов < ТаблицаВопросовЭП.Количество() Тогда
					КоличествоЭлементов = ТребуетсяДобавитьВопросов;
				Иначе
					КоличествоЭлементов = ТаблицаВопросовЭП.Количество();
				КонецЕсли;
				
				ИндексМассив = ОбщегоНазначенияСУ.ИндексМассив(0, ТаблицаВопросовЭП.Количество(), Истина);
				
				// Формируем выходную таблицу.
				
				Для Сч=0 По КоличествоЭлементов-1 Цикл
					
					НоваяСтрока = ТаблицаДоступныхОбъектов.Добавить();
					НоваяСтрока.Ссылка        = ТаблицаВопросовЭП[ИндексМассив[Сч]].СсылкаНаОбъектСУЗ;
					НоваяСтрока.ВесВопроса    = ТаблицаВопросовЭП[ИндексМассив[Сч]].ВесВопроса;
					НоваяСтрока.ТипВопроса    = ТаблицаВопросовЭП[ИндексМассив[Сч]].ТипВопроса;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаДоступныхОбъектов;
	
КонецФункции

// Позволяет получить все элементы группы и все элементы вложенных подгрупп.
// Ссылки на сами группы не выводит, только элементы.
//
// Параметры
//  Группа - Ссылка на элемент справочника ЭлементыПодборкиСУЗ.
//
// Возвращаемое значение:
//   Таблица – содержит ссылки на найденные элементы заданной группы.
//
Функция ВсеЭлементы(Подборка, Группа = Неопределено, ТипЭлемента = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭлементыПодборкиСУЗ.Ссылка КАК Ссылка,
	               |	ЭлементыПодборкиСУЗ.СсылкаНаОбъектСУЗ КАК СсылкаНаОбъектСУЗ,
	               |	ЭлементыПодборкиСУЗ.ВесВопроса КАК ВесВопроса,
	               |	ЭлементыПодборкиСУЗ.Родитель КАК Родитель,
	               |	ЭлементыПодборкиСУЗ.Код КАК Код
	               |ИЗ
	               |	Справочник.ЭлементыПодборкиСУЗ КАК ЭлементыПодборкиСУЗ
	               |ГДЕ
	               |	ЭлементыПодборкиСУЗ.Владелец = &Подборка
	               |	И ЭлементыПодборкиСУЗ.ПометкаУдаления = ЛОЖЬ
	               |	И ЭлементыПодборкиСУЗ.ЭтоГруппа = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Подборка", Подборка);
	
	Если ЗначениеЗаполнено(Группа) Тогда
		
		Запрос.Текст = Запрос.Текст + "
		| И	ЭлементыПодборкиСУЗ.Родитель В ИЕРАРХИИ(&Группа)";
		
		Запрос.УстановитьПараметр("Группа", Группа);
		
	КонецЕсли;

	Если ЗначениеЗаполнено(ТипЭлемента) Тогда
		
		Запрос.Текст = Запрос.Текст + "
		| И	ТИПЗНАЧЕНИЯ(ЭлементыПодборкиСУЗ.СсылкаНаОбъектСУЗ) = &ТипЭлемента";
		
		Запрос.УстановитьПараметр("ТипЭлемента", ТипЭлемента);
		
	КонецЕсли;
		
	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
	
КонецФункции

// Возвращает группу, в которой хранятся элементы подборки.
// В случае ее отсутствия, создает новую.
//
Функция ГруппаПодчиненныхЭлементов(Знач Подборка, Знач ТипПодчиненногоЭлемента, Знач ЭлектронныйРесурс = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Подборка)
		ИЛИ НЕ ЗначениеЗаполнено(ТипПодчиненногоЭлемента) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ГруппаПодчиненныхЭлементов = РегистрыСведений.ГруппыОбъектовСУЗ.ГруппаДляХраненияПодчиненныхЭлементов(Подборка, ТипПодчиненногоЭлемента);
	
	Если ГруппаПодчиненныхЭлементов = Неопределено Тогда
		
		ИмяСправочника = Метаданные.НайтиПоТипу(ТипПодчиненногоЭлемента).Имя;
		
		НоваяГруппаОбъект =  Справочники[ИмяСправочника].СоздатьГруппу();
		НоваяГруппаОбъект.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подборка, "Наименование");
	
		Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
			НоваяГруппаОбъект.Родитель = Справочники.СводыЗнанийСУЗ.ГруппаДляХраненияПодчиненныхЭлементов(ЭлектронныйРесурс, ТипПодчиненногоЭлемента);	
		КонецЕсли;
		
		РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(НоваяГруппаОбъект);

		НоваяГруппаОбъект.Записать();
		
		ГруппаПодчиненныхЭлементов = НоваяГруппаОбъект.Ссылка;
		
		РегистрыСведений.ГруппыОбъектовСУЗ.СохранитьГруппуДляХраненияПодчиненныхЭлементов(Подборка, ГруппаПодчиненныхЭлементов);		
				
	КонецЕсли;

	Возврат ГруппаПодчиненныхЭлементов;

КонецФункции

// Находит номер группы (страницы) подборки 
//
Функция НомерГруппыПодборки(Подборка = Неопределено, СсылкаНаЭлементГруппы) Экспорт
	
	Если Подборка = Неопределено Тогда
		Подборка = СсылкаНаЭлементГруппы.Владелец;	
	КонецЕсли;
	
	НомерГруппы           = 0;
	ТаблицаГруппЭлементов = ПолучитьГруппыЭлементовПодборки(Подборка);
	СтрокаТаблицы         = ТаблицаГруппЭлементов.Найти(СсылкаНаЭлементГруппы, "Ссылка");
	
	Если СтрокаТаблицы <> Неопределено Тогда
		НомерГруппы = ТаблицаГруппЭлементов.Индекс(СтрокаТаблицы) + 1;
	КонецЕсли;
	
	Возврат НомерГруппы;
	
КонецФункции

Функция СтраницаПодборкиПоНомеру(Подборка, НомерГруппыПодборки) Экспорт	
		
	ГруппыЭлементовПодборки = Справочники.ПодборкиСУЗ.ПолучитьГруппыЭлементовПодборки(Подборка);
	
	Если ГруппыЭлементовПодборки.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерГруппыПодборки) Тогда
		
		Попытка
			ЭлементПодборки = ГруппыЭлементовПодборки[НомерГруппыПодборки-1].Ссылка;
		Исключение
			ЭлементПодборки = ГруппыЭлементовПодборки[0].Ссылка;
		КонецПопытки;		
		
	Иначе
		
		ЭлементПодборки = ГруппыЭлементовПодборки[0].Ссылка;
		
	КонецЕсли;		
	
	Возврат Неопределено;
	
КонецФункции

// Получает номер группы (страницы) из параметров http ссылки
//
Функция НомерСтраницы(ПараметрыСсылки, Подборка = Неопределено) Экспорт
	
	НомерСтраницы = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "numGroup");
	
	Если ЗначениеЗаполнено(НомерСтраницы) Тогда
		
		Попытка
			НомерСтраницы = Число(НомерСтраницы);
		Исключение
			НомерСтраницы = 0;
		КонецПопытки;
		
		Возврат НомерСтраницы; 
		
	Иначе
		
		ИдентификаторЭлемента = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "idGroup");
		
		Если ЗначениеЗаполнено(ИдентификаторЭлемента) Тогда
			ЭлементПодборки = Справочники.ЭлементыПодборкиСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторЭлемента));
		Иначе
			Возврат 0;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭлементПодборки) Тогда
			
			// Находим верхний по иерархии элемент подборки
			Если ЗначениеЗаполнено(ЭлементПодборки.Родитель) Тогда
				ГруппаПодборки = ЭлементПодборки.Родитель;
				Если ЗначениеЗаполнено(ГруппаПодборки.Родитель) Тогда
					ГруппаПодборки = ГруппаПодборки.Родитель
				КонецЕсли;
			Иначе
				ГруппаПодборки = ЭлементПодборки;
			КонецЕсли;
			
		Иначе
			
			Возврат 0;
			
		КонецЕсли;
			
		Возврат НомерГруппыПодборки(Подборка, ГруппаПодборки);
		
	КонецЕсли;	
	
	Возврат 0;	
	
КонецФункции

Функция ЕдинственныйЭлементПодборки(Подборка, ВключатьЗависимые = Ложь) Экспорт
	
	ЕдинственныйЭлемент = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭлементыПодборкиСУЗ.СсылкаНаОбъектСУЗ
		|ИЗ
		|	Справочник.ЭлементыПодборкиСУЗ КАК ЭлементыПодборкиСУЗ
		|ГДЕ
		|	ЭлементыПодборкиСУЗ.ПометкаУдаления = ЛОЖЬ
		|	И ЭлементыПодборкиСУЗ.Владелец = &Подборка
		|	И ЭлементыПодборкиСУЗ.ЭтоГруппа = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Подборка", Подборка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
			
			ВыборкаДетальныеЗаписи.Следующий();
	
			ЕдинственныйЭлемент = ВыборкаДетальныеЗаписи.СсылкаНаОбъектСУЗ;

		КонецЕсли;

	КонецЕсли;
	
	Если НЕ ВключатьЗависимые Тогда
		Возврат ЕдинственныйЭлемент;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкрытыеРесурсы.Ресурс КАК СсылкаНаОбъектСУЗ
		|ИЗ
		|	Справочник.ПодборкиСУЗ.СкрытыеРесурсы КАК СкрытыеРесурсы
		|ГДЕ
		|	СкрытыеРесурсы.Ссылка = &Подборка";
	
	Запрос.УстановитьПараметр("Подборка", Подборка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Количество() = 1 И ЕдинственныйЭлемент = Неопределено Тогда
			
			ВыборкаДетальныеЗаписи.Следующий();
	
			ЕдинственныйЭлемент = ВыборкаДетальныеЗаписи.СсылкаНаОбъектСУЗ;

		КонецЕсли;

	КонецЕсли;
	
	Возврат ЕдинственныйЭлемент;
		
КонецФункции

Функция ПустаяПодборка(Подборка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Подборка) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭлементыПодборкиСУЗ.Ссылка
		|ИЗ
		|	Справочник.ЭлементыПодборкиСУЗ КАК ЭлементыПодборкиСУЗ
		|ГДЕ
		|	ЭлементыПодборкиСУЗ.ПометкаУдаления = ЛОЖЬ
		|	И ЭлементыПодборкиСУЗ.ЭтоГруппа = ЛОЖЬ
		|	И ЭлементыПодборкиСУЗ.Владелец = &Подборка";
	
	Запрос.Параметры.Вставить("Подборка", Подборка);	
		
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

// РЕДАКТИРОВАНИЕ ПОДБОРКИ

// Устанавливает обязательные реквизиты для заданных условий.
// Вызывается в обработчике события ПередЗаписью и в форме элемента справочника.
//
// Параметры
//  Объект - объект для заполнения свойствами
//
Процедура УстановитьОбязательныеРеквизиты(Объект) Экспорт
		
	Если Объект.ЭтоТест Тогда
		
		Объект.ПоказыватьСтартовуюСтраницу = Истина;	
		
		Объект.Карта = Справочники.КартыСУЗ.ПустаяСсылка();
		
		Если НЕ ЗначениеЗаполнено(Объект.НазначениеТестирования) Тогда
			Объект.НазначениеТестирования = Перечисления.НазначенияТестированийСУЗ.Аттестация;
		КонецЕсли;
		
		Объект.ТипНавигации = Перечисления.ТипыНавигацииПодборкиСУЗ.ПустаяСсылка();
		
		Если Объект.НазначениеТестирования = Перечисления.НазначенияТестированийСУЗ.Анкетирование Тогда
			Объект.КоличествоПопыток = 1;
		КонецЕсли;
		
		Если Объект.НазначениеТестирования = Перечисления.НазначенияТестированийСУЗ.Упражнение Тогда
			Объект.ИсключитьОткрытыеВопросы = Истина;
			Объект.ПереходитьВпередАвтоматически = Ложь;
			Объект.ПоказыватьНавигацию = Истина;
		КонецЕсли;
		
		Если Объект.ВыбиратьЭлементыИзРубрикатора Тогда
			Объект.ПеремешиватьГруппыЭлементов = Истина;
		КонецЕсли;				 
		
		Если НЕ Объект.ПоказыватьНавигацию Тогда
			Объект.ПереходитьВпередАвтоматически = Истина;
		КонецЕсли;
		
	Иначе
		
		Объект.ПеремешиватьГруппыЭлементов   = Ложь;
		Объект.ПоказыватьНавигацию           = Истина;
		Объект.ПереходитьВпередАвтоматически = Ложь;
		Объект.КоличествоПопыток             = 0;
		Объект.НазначениеТестирования        = Перечисления.НазначенияТестированийСУЗ.ПустаяСсылка();
		Объект.ВыбиратьЭлементыИзРубрикатора = Ложь;
		
		Если Объект.ЭтоПрезентация Тогда
			Объект.ТипНавигации = Перечисления.ТипыНавигацииПодборкиСУЗ.Слайды;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.ПредставлениеЭлементов = Перечисления.ВариантыПредставленияЭлементовПодборкиСУЗ.КлассификационнаяТаблица Тогда
		
		Объект.ПоказыватьКлассификатор = Истина;
		Объект.СвернутьРазделы = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

// Создает электронный ресурс с типом "Тест" и помещает в него подборку.
// Если электронный ресурс существует, обновляет данные.
//
Процедура ОбновитьЭлектронныйРесурсТеста(Подборка, ЭлектронныйРесурс, Отказ, Знач Родитель = Неопределено) Экспорт
	
	НаименованиеПодборки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подборка, "Наименование");
	
	Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		
		ЭлектронныйРесурсОбъект = ЭлектронныйРесурс.ПолучитьОбъект();
		ЭлектронныйРесурсОбъект.Заблокировать();
		
		ЭлектронныйРесурсОбъект.Наименование = НаименованиеПодборки;
		
		ЭлектронныйРесурсОбъект.Записать();
		ЭлектронныйРесурсОбъект.Разблокировать();
		
		ЭлементСодержания = Справочники.СводыЗнанийСУЗ.ЕдинственныйЭлементСодержания(ЭлектронныйРесурс);
		
		Если ЭлементСодержания = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Элемент содержания электронного курса/теста не найден'"),,,, Отказ);
			Возврат;
		КонецЕсли;
		
	Иначе
		
		ЭлектронныйРесурсОбъект = Справочники.СводыЗнанийСУЗ.СоздатьЭлемент();
		
		ЭлектронныйРесурсОбъект.Наименование  = НаименованиеПодборки;
		ЭлектронныйРесурсОбъект.Редакция      = 1;
		ЭлектронныйРесурсОбъект.Тип           = Перечисления.ТипыЭлектронныхРесурсовСУЗ.Тест;
		ЭлектронныйРесурсОбъект.Родитель      = Родитель;
		
		РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ЭлектронныйРесурсОбъект);
		
		ЭлектронныйРесурсОбъект.Записать();
		
		ЭлектронныйРесурс = ЭлектронныйРесурсОбъект.Ссылка;
		
	КонецЕсли;

	ОбновитьЭлементСодержания(Подборка, ЭлектронныйРесурс, ЭлементСодержания,, Отказ);
	
КонецПроцедуры

Процедура ОбновитьЭлементСодержания(Подборка, ЭлектронныйРесурс, ЭлементСодержания, ГруппаЭлементаСодержания = Неопределено, Отказ) Экспорт
	
	НаименованиеПодборки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подборка, "Наименование");
	
	Если ЗначениеЗаполнено(ЭлементСодержания) Тогда
		
		ЭлементСодержанияОбъект = ЭлементСодержания.ПолучитьОбъект();
		ЭлементСодержанияОбъект.Заблокировать();
		
		ЭлементСодержанияОбъект.Наименование = НаименованиеПодборки;
		
		ЭлементСодержанияОбъект.Записать();
		ЭлементСодержанияОбъект.Разблокировать();
		
	Иначе
		
		ЭлементСодержанияОбъект = Справочники.СодержаниеСУЗ.СоздатьЭлемент();
		
		ЭлементСодержанияОбъект.Наименование    = НаименованиеПодборки;
		ЭлементСодержанияОбъект.Владелец        = ЭлектронныйРесурс;
		ЭлементСодержанияОбъект.СсылкаНаЭлемент = Подборка;
		ЭлементСодержанияОбъект.Родитель        = ГруппаЭлементаСодержания;
		
		РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ЭлементСодержанияОбъект);
			
		ЭлементСодержанияОбъект.Записать();
		
		ЭлементСодержания = ЭлементСодержанияОбъект.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьВопросВПодборку(Знач Вопрос, Знач Подборка, Знач ВесВопроса = 1, Знач ГруппаЭлементовПодборки) Экспорт
	
	Если ТипЗнч(Вопрос) = Тип("Массив") Тогда
		
		МассивВопросовСГруппами = Вопрос;
		
	Иначе
		
		МассивВопросовСГруппами = Новый Массив();
		МассивВопросовСГруппами.Добавить(Вопрос);
		
	КонецЕсли;
	
	// Выбираем все вопросы из массива и вопросы возможных групп

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВопросыСУЗ.Ссылка,
		|	ВопросыСУЗ.Наименование
		|ИЗ
		|	Справочник.ВопросыСУЗ КАК ВопросыСУЗ
		|ГДЕ
		|	(ВопросыСУЗ.Ссылка В ИЕРАРХИИ (&МассивВопросов)
		|			ИЛИ ВопросыСУЗ.Ссылка В (&МассивВопросов))
		|	И ВопросыСУЗ.ЭтоГруппа = ЛОЖЬ
		|	И ВопросыСУЗ.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("МассивВопросов", МассивВопросовСГруппами);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	// Получаем все вопросы подборки
	
	ТаблицаВопросовТеста = Справочники.ПодборкиСУЗ.ВсеЭлементы(Подборка,,Тип("СправочникСсылка.ВопросыСУЗ"));
	
	// Добавляем вопросы в тест
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ТаблицаВопросовТеста.Найти(ВыборкаДетальныеЗаписи.Ссылка, "СсылкаНаОбъектСУЗ") = Неопределено Тогда // Вопрос еще не добавлен в тест
			ДобавитьЭлементВПодборку(Подборка, ВыборкаДетальныеЗаписи.Ссылка, ГруппаЭлементовПодборки, ВесВопроса);
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры

Функция ДобавитьЭлементВПодборку(Подборка, Элемент, ГруппаЭлементовПодборки, ВесВопроса = 1) Экспорт
	
	ЭлементПодборкиОбъект = Справочники.ЭлементыПодборкиСУЗ.СоздатьЭлемент();
		
	ЭлементПодборкиОбъект.Наименование      = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент, "Наименование");
	ЭлементПодборкиОбъект.Владелец          = Подборка;
	ЭлементПодборкиОбъект.СсылкаНаОбъектСУЗ = Элемент; 
	
	Если ТипЗнч(Элемент) = Тип("СправочникСсылка.ВопросыСУЗ") Тогда
		ЭлементПодборкиОбъект.ВесВопроса = ВесВопроса;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГруппаЭлементовПодборки) Тогда
		
		ДанныеГруппыЭлементаПодборки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ГруппаЭлементовПодборки, "ЭтоГруппа, Родитель");
		
		Если ДанныеГруппыЭлементаПодборки.ЭтоГруппа Тогда
			ЭлементПодборкиОбъект.Родитель = ГруппаЭлементовПодборки;
		Иначе
			ЭлементПодборкиОбъект.Родитель = ДанныеГруппыЭлементаПодборки.Родитель;
		КонецЕсли;
		
	КонецЕсли;
	
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ЭлементПодборкиОбъект);
	
	ЭлементПодборкиОбъект.Записать();
	
	Возврат ЭлементПодборкиОбъект.Ссылка;	
	
КонецФункции

Процедура ОбновитьПрезентацию(Подборка, ЭлектронныйРесурс, СписокФайловДляЗагрузки, ПодборкаОбъект = Неопределено) Экспорт
	
	НачатьТранзакцию();
	
	// Делаем проверки и получаем основные данные
	//
	
	Если НЕ ЗначениеЗаполнено(Подборка) Тогда
		Возврат;
	КонецЕсли;
	
	Если СписокФайловДляЗагрузки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписыватьПодборку = Ложь;
	
	Если ПодборкаОбъект = Неопределено Тогда
		
		ПодборкаОбъект = Подборка.ПолучитьОбъект();
		
		ЗаписыватьПодборку = Истина;
		
	КонецЕсли;
	
	РесурсПрезентации = ПодборкаОбъект.Презентация;

	// Создаем ресурс для хранения файла презентации
	//
	
	Если НЕ ЗначениеЗаполнено(РесурсПрезентации) Тогда
		
		РесурсПрезентацииОбъект = Справочники.РесурсыСУЗ.СоздатьЭлемент();
		
		РесурсПрезентацииОбъект.Наименование = ПодборкаОбъект.Наименование;
		РесурсПрезентацииОбъект.Родитель     = Справочники.ПодборкиСУЗ.ГруппаПодчиненныхЭлементов(Подборка, Тип("СправочникСсылка.РесурсыСУЗ"), ЭлектронныйРесурс);
		
		РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(РесурсПрезентацииОбъект);
		
		РесурсПрезентацииОбъект.Записать();
		
		РесурсПрезентации = РесурсПрезентацииОбъект.Ссылка;		
		
	Иначе
		
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РесурсПрезентации, "ПометкаУдаления") Тогда
			
			РесурсПрезентацииОбъект = РесурсПрезентации.ПолучитьОбъект();
			РесурсПрезентацииОбъект.УстановитьПометкуУдаления(Ложь, Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Обновляем подборку
	//
		
	ПодборкаОбъект.Презентация = РесурсПрезентации;
	ПодборкаОбъект.ЭтоПрезентация = Истина;
	ПодборкаОбъект.ТипНавигации = Перечисления.ТипыНавигацииПодборкиСУЗ.Слайды;
	
	Если ЗаписыватьПодборку Тогда
		
		ПодборкаОбъект.Записать();	
		
		Если ПодборкаОбъект.ПометкаУдаления Тогда
			ПодборкаОбъект.УстановитьПометкуУдаления(Ложь, Истина);
		КонецЕсли;
		
	КонецЕсли;
		
	// Сохраняем файл оригинала презентации и слайды (элементы подборки)
	//
	
	ОбновленныеЭлементыПодборки = Новый Массив;
	
	Для каждого ОписаниеФайла Из СписокФайловДляЗагрузки Цикл
		
		СохраняемыйФайл = Новый Файл(ОписаниеФайла.Имя); // Примечание: тип значения ОписаниеФайла - ОписаниеПереданногоФайла 
		
		Если РазработкаСУЗКлиентСервер.ЭтоФайлПрезентации(ОписаниеФайла.Имя) Тогда // Обновляем ресурс с оригиналом презентации
			
			Справочники.ФайлыСУЗ.ОбновитьФайлРесурса(
				РесурсПрезентации,
				СохраняемыйФайл.Имя,
				ПодборкаОбъект.Наименование,
				ПолучитьИзВременногоХранилища(ОписаниеФайла.Хранение),
				ПодборкаОбъект.Наименование,
				СохраняемыйФайл.Расширение,
				Ложь);			
			
		Иначе  // Обновляем элемент подборки со слайдом
			
			// Ищем элемент подборки слайда
			
			ЭлементПодборки = ОбщегоНазначенияСУ.НайтиЭлементСправочника("ЭлементыПодборкиСУЗ", "Наименование", СохраняемыйФайл.ИмяБезРасширения, Подборка);
			
			Если ЗначениеЗаполнено(ЭлементПодборки) Тогда				
				ЭлементПодборкиОбъект = ЭлементПодборки.ПолучитьОбъект();				
			Иначе				
				ЭлементПодборкиОбъект = Справочники.ЭлементыПодборкиСУЗ.СоздатьЭлемент();				
			КонецЕсли;
			
			Если ЭлементПодборкиОбъект.ПометкаУдаления Тогда
				ЭлементПодборкиОбъект.УстановитьПометкуУдаления(Ложь, Истина);
			КонецЕсли;			
			
			// Обновляем ресурс слайда
			
			Если ЗначениеЗаполнено(ЭлементПодборкиОбъект.СсылкаНаОбъектСУЗ) 
				И ТипЗнч(ЭлементПодборкиОбъект.СсылкаНаОбъектСУЗ) = Тип("СправочникСсылка.РесурсыСУЗ")  Тогда
				
				РесурсСлайдаОбъект = ЭлементПодборкиОбъект.СсылкаНаОбъектСУЗ.ПолучитьОбъект();
				
				РесурсСлайда = ЭлементПодборкиОбъект.СсылкаНаОбъектСУЗ;
				
			Иначе
				
				РесурсСлайдаОбъект = Справочники.РесурсыСУЗ.СоздатьЭлемент();
				
				РесурсСлайдаОбъект.Наименование = СохраняемыйФайл.ИмяБезРасширения;
				РесурсСлайдаОбъект.Родитель     = Справочники.ПодборкиСУЗ.ГруппаПодчиненныхЭлементов(Подборка, Тип("СправочникСсылка.РесурсыСУЗ"), ЭлектронныйРесурс);
				
				РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(РесурсСлайдаОбъект);
				
			КонецЕсли;
			
			РесурсСлайдаОбъект.Записать();
			
			РесурсСлайда = РесурсСлайдаОбъект.Ссылка;			
			
			// Обновляем файл ресурса
			
			ФайлКартинкиОбъект = Справочники.ФайлыСУЗ.ОбновитьФайлРесурса(
									РесурсСлайда,
									СохраняемыйФайл.Имя,
									СохраняемыйФайл.ИмяБезРасширения,
									ПолучитьИзВременногоХранилища(ОписаниеФайла.Хранение),
									ПодборкаОбъект.Наименование,
									СохраняемыйФайл.Расширение,
									Ложь);
				
			ФайлКартинкиОбъект.Высота      = "100%";
			ФайлКартинкиОбъект.Выравнивать = Перечисления.СпособыВыравниванияСУЗ.center;

			ФайлКартинкиОбъект.Записать();
			
			// Обновляем элемент подборки
			
			ЭлементПодборкиОбъект.Наименование      = СохраняемыйФайл.ИмяБезРасширения;
			ЭлементПодборкиОбъект.Владелец          = Подборка;
			ЭлементПодборкиОбъект.СсылкаНаОбъектСУЗ = РесурсСлайда; 
			
			РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ЭлементПодборкиОбъект);
			
			ЭлементПодборкиОбъект.Записать();
			
			// Запоминаем обновленный элемент
			
			ОбновленныеЭлементыПодборки.Добавить(ЭлементПодборкиОбъект.Ссылка);
			
		КонецЕсли;
		
			
	КонецЦикла;
	
	// Помечаем на удаление не обновленные элементы подборки	
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭлементыПодборкиСУЗ.Ссылка
		|ИЗ
		|	Справочник.ЭлементыПодборкиСУЗ КАК ЭлементыПодборкиСУЗ
		|ГДЕ
		|	ЭлементыПодборкиСУЗ.ПометкаУдаления = ЛОЖЬ
		|	И ЭлементыПодборкиСУЗ.ЭтоГруппа = ЛОЖЬ
		|	И ЭлементыПодборкиСУЗ.Владелец = &Подборка
		|	И НЕ ЭлементыПодборкиСУЗ.Ссылка В (&ОбновленныеЭлементыПодборки)";
	
	Запрос.УстановитьПараметр("ОбновленныеЭлементыПодборки", ОбновленныеЭлементыПодборки);
	Запрос.УстановитьПараметр("Подборка", Подборка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ЭлементПодборкиОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ЭлементПодборкиОбъект.УстановитьПометкуУдаления(Истина, Истина);
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();	
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ПолучитьГруппыПодборкиСУчетомРезультатов(Подборка, Пользователь, ГруппыПодборки, МаксимальноеКоличествоЭлементов)

	// Для каждой группы подборки находим соответствующие ей вопросы
	
	ГруппыПодборки.Колонки.Добавить("ВопросыГруппы");
	
	ЕстьКолонкаЭтоГруппа = ?(ГруппыПодборки.Колонки.Найти("ЭтоГруппа") = Неопределено, Ложь, Истина); 
		
	Для каждого СтрокаТП Из ГруппыПодборки Цикл
	
		Если ЕстьКолонкаЭтоГруппа И СтрокаТП.ЭтоГруппа Тогда
			
			ТаблицаВопросовГруппы = ВсеЭлементы(Подборка, СтрокаТП.Ссылка, Тип("СправочникСсылка.ВопросыСУЗ"));
			
			СтрокаТП.ВопросыГруппы = ТаблицаВопросовГруппы.ВыгрузитьКолонку("СсылкаНаОбъектСУЗ");
			
		Иначе
			
			ВопросыГруппы = Новый Массив();
			
			Если ТипЗнч(СтрокаТП.СсылкаНаОбъектСУЗ) = Тип("СправочникСсылка.ВопросыСУЗ") Тогда
				ВопросыГруппы.Добавить(СтрокаТП.СсылкаНаОбъектСУЗ);
			КонецЕсли;
			
			СтрокаТП.ВопросыГруппы = ВопросыГруппы;
			
		КонецЕсли;
		
	
	КонецЦикла;
	
	// Получаем массив всех вопросов из всех групп подборок
	
	МассивВопросов = Новый Массив();
	
	Для каждого СтрокаТП Из ГруппыПодборки Цикл
		
		  Для каждого Вопрос Из СтрокаТП.ВопросыГруппы Цикл
		  
			  Если МассивВопросов.Найти(Вопрос) = Неопределено Тогда
				  МассивВопросов.Добавить(Вопрос);
			  КонецЕсли;
		  
		  КонецЦикла;
		
	КонецЦикла;
	
	// Получаем результаты ответов на все вопросы и формируем массив
	// Вопросов, которые можно включить в тест с учетом прошлых результатов, т.е.
	// На которые пользователь еще не отвечал, или отвечал неверно.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветНаВопросСУЗ.Вопрос,
		|	ОтветНаВопросСУЗ.Результат
		|ИЗ
		|	Документ.ОтветНаВопросСУЗ КАК ОтветНаВопросСУЗ
		|ГДЕ
		|	ОтветНаВопросСУЗ.Вопрос В(&МассивВопросов)
		|	И ОтветНаВопросСУЗ.Пользователь = &Пользователь
		|	И ОтветНаВопросСУЗ.ВопросОтвечен = ИСТИНА
		|   И ОтветНаВопросСУЗ.Отменено = ЛОЖЬ
		|	И ОтветНаВопросСУЗ.Проведен = ИСТИНА";

	Запрос.УстановитьПараметр("МассивВопросов", МассивВопросов);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	МассивПодходящихВопросов = Новый Массив();
	
	Для каждого Вопрос Из МассивВопросов Цикл
	
		ВыборкаДетальныеЗаписи.Сбросить();
		
		Если НЕ ВыборкаДетальныеЗаписи.НайтиСледующий(Новый Структура("Результат, Вопрос", 100, Вопрос)) Тогда
			МассивПодходящихВопросов.Добавить(Вопрос); // Подходит, так как либо его нет в выборке, либо результат <> 100.
		КонецЕсли;
		
	КонецЦикла;
	
	// Формируем специальную таблицу групп подборок, в которые помещаем только подходящие группы
	//, т.е. те, в которых есть хоть один подходящий вопрос.
	
	ГруппыПодборкиСУчетомРезультатов = Новый ТаблицаЗначений();
	
	Для каждого Колонка Из ГруппыПодборки.Колонки Цикл
		ГруппыПодборкиСУчетомРезультатов.Колонки.Добавить(Колонка.Имя);
	КонецЦикла;
	
	Для каждого СтрокаТП Из ГруппыПодборки Цикл
		
		ГруппуМожноВключитьВТест = Ложь;	
		
		Для каждого Вопрос Из СтрокаТП.ВопросыГруппы Цикл
			
			Если МассивПодходящихВопросов.Найти(Вопрос) <> Неопределено Тогда 
				// Можно включить в тест, так как в группе есть подходящий вопрос.
				ГруппуМожноВключитьВТест = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ГруппуМожноВключитьВТест Тогда
			
			НоваяСтрокаСУР = ГруппыПодборкиСУчетомРезультатов.Добавить(); 
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСУР, СтрокаТП); 				  
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Если не хватает еще групп подборки
	
	Если ГруппыПодборкиСУчетомРезультатов.Количество() < МаксимальноеКоличествоЭлементов Тогда 
		
		МассивОставшихсяСтрок = Новый Массив(); // Массив, где хранятся ссылки на строки таблицы ГруппыПодборки,
												// Которые еще не попали в выборку.
												
		Для каждого Строка Из ГруппыПодборки Цикл
			
			Если ЕстьКолонкаЭтоГруппа Тогда // Простой тест
				
				Если ГруппыПодборкиСУчетомРезультатов.Найти(Строка.Ссылка, "Ссылка") = Неопределено Тогда
					МассивОставшихсяСтрок.Добавить(Строка);
				КонецЕсли;
				
			Иначе // Выбор из рубрикатора
				
				Если ГруппыПодборкиСУчетомРезультатов.Найти(Строка.СсылкаНаОбъектСУЗ, "СсылкаНаОбъектСУЗ") = Неопределено Тогда
					МассивОставшихсяСтрок.Добавить(Строка);
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЦикла;
		
		МассивОставшихсяСтрок = ОбщегоНазначенияСУ.ПеремешатьМассив(МассивОставшихсяСтрок);
		
		Если МассивОставшихсяСтрок.Количество() > 0 Тогда
			
			А = 0;
			
			Пока ГруппыПодборкиСУчетомРезультатов.Количество() < МаксимальноеКоличествоЭлементов И А < МассивОставшихсяСтрок.Количество() - 1  Цикл
				
				НоваяСтрока = ГруппыПодборкиСУчетомРезультатов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, МассивОставшихсяСтрок[А]);
				
				А = А + 1;
			  
			КонецЦикла;
						
		КонецЕсли;
			
	КонецЕсли;
	
	Возврат ГруппыПодборкиСУчетомРезультатов;
	
КонецФункции

// Позволяет получить таблицу элементов подборки заданной группы.
//
// Внимание! Возвращает в том числе и подгруппы в виде
// ссылок на элементы справочника ЭлементыПодборкиСУЗ. Если требуется получить
// все элементы группы и все элементы вложенных подгрупп, то можно использовать
// функцию ПолучитьВсеВложенныеЭлементыГруппы().
//
// Параметры
//  Группа - Ссылка на элемент справочника ЭлементыПодборкиСУЗ.
//
// Возвращаемое значение:
//   Массив – содержит ссылки на найденные элементы заданной группы.
//
Функция ПолучитьЭлементыГруппы(Подборка, ДокументСессии, Группа)
	
	МассивЭлементовГруппы = Новый Массив();
			
	Если НЕ Группа.ЭтоГруппа Тогда
		
		МассивЭлементовГруппы.Добавить(Группа.Ссылка);
		
	Иначе
		
		ЭлементыГруппы = Справочники.ЭлементыПодборкиСУЗ.Выбрать(Группа.Ссылка, Подборка, , "Код");
		
		Пока ЭлементыГруппы.Следующий() Цикл
			
			Если НЕ ЭлементыГруппы.ПометкаУдаления Тогда
				
				// Проверяем есть ли вопрос в сессии. Если его нет, то не показываем.
				// Его может не быть если он был добавлен позже и не попал по ограничению для группы.
				МожноПоказыватьЭлемент = Истина;
				Если ДокументСессии <> Неопределено
					И ТипЗнч(ЭлементыГруппы.СсылкаНаОбъектСУЗ) = Тип("СправочникСсылка.ВопросыСУЗ") Тогда
					
					ВопросВСессии = ДокументСессии.Вопросы.Найти(ЭлементыГруппы.СсылкаНаОбъектСУЗ, "Вопрос");
					
					Если ВопросВСессии = Неопределено Тогда
						МожноПоказыватьЭлемент = Ложь;
					КонецЕсли;
					
				КонецЕсли;
				
				Если МожноПоказыватьЭлемент Тогда
					МассивЭлементовГруппы.Добавить(ЭлементыГруппы.Ссылка);	
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;		
	
	Возврат МассивЭлементовГруппы;
	
КонецФункции

// Добавляет в таблицу классификаторов новую запись, если это требуется.
// В таблицу классификаторов записываются данные всех использованных классификаторов.
// Она ускоряет вывод информации, так как если классификатор повторяется,
// то данные о нем берутся из таблицы, а не преобразуются снова.
//
// Параметры
//  ЭлементГруппы          – Ссылка на элемент справочника ЭлементыПодборкиСУЗ.
//                           Содержит ссылки только на элементы заданной группы данного справочника.
//  ТаблицаКлассов         - Таблица, содержит данные классов элементов подборки.
//  ПараметрыСсылки        – Структура, содержит параметры ссылки на данную подборку.
//                 
//
Процедура ДобавитьКлассВТаблицуКлассов(Подборка, Класс, ТаблицаКлассов, ПараметрыСсылки, КонтекстВыполнения)
				
	Если 
		ТаблицаКлассов.Найти(Класс, "Ссылка") = Неопределено И
		Подборка.ПоказыватьКлассификатор И
		ЗначениеЗаполнено(Класс) И
		(НЕ ЗначениеЗаполнено(Подборка.КлассификационнаяГруппировка) ИЛИ Подборка.КлассификационнаяГруппировка.ГруппаКлассов.Найти(Класс, "Класс") <> Неопределено)
		// Если нет классификационной группировки, то добавляем все классы.
		// Примечание: В случае, если есть КлассификационнаяГруппировка, тогда добавляем класс в таблицу, если класс есть в классификационной группировки.
		Тогда
		
		СтрокаТабл = ТаблицаКлассов.Добавить();
		
		Если ЗначениеЗаполнено(Подборка.КлассификационнаяГруппировка) Тогда
			ПорядковыйНомер = Подборка.КлассификационнаяГруппировка.ГруппаКлассов.Найти(Класс, "Класс").НомерСтроки;
			СтрокаТабл.ПорядковыйНомер = ПорядковыйНомер;
		КонецЕсли;
		
		СтрокаТабл.Ссылка = Класс;
		СтрокаТабл.Код = Класс.Код;
		СтрокаТабл.Наименование = Класс.Наименование;
		
		Если ЗначениеЗаполнено(Класс.ПредставлениеКласса) Тогда
			
			СтруктураДанныхОбъектаКлассификатора = ОбъектыСУЗ.ПолучитьПредставление(Класс.ПредставлениеКласса, ПараметрыСсылки, КонтекстВыполнения);
			
			СтрокаТабл.Представление = СтруктураДанныхОбъектаКлассификатора.Представление;
			СтрокаТабл.Скрипт = СтруктураДанныхОбъектаКлассификатора.Скрипт;
			
		Иначе
			
			СтрокаТабл.Представление = "";
			СтрокаТабл.Скрипт = "";
			
		КонецЕсли;
		
	КонецЕсли;
	

КонецПроцедуры // ДобавитьКлассВТаблицуКлассов()

// Добавляет к настройкам тестирования доступные режимы тестирования.
// Настройки используются ТОЛЬКО при отображении стартовой страницы теста.
//
// Параметры
//  НастройкиТестированияXDTO - ОбъектXDTO.
//
Процедура ДобавитьXDTOРежимовТестирования(Подборка, ТаблицаПопытокТестирования, НастройкиТестированияXDTO, КонтекстВыполнения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураНастроек = ПолучитьНастройкиТестированияПоУмолчанию(Подборка, КонтекстВыполнения);
	
	// 1. Находим результат теста и количество сделанных попыток.

	Если КонтекстВыполнения.ПараметрыЭкспорта = Неопределено Тогда
		
		НастройкиТестированияXDTO.КоличествоСделанныхПопыток = ТаблицаПопытокТестирования.Количество();
					
		НастройкиТестированияXDTO.ТолькоПросмотр = Ложь; // Может быть переопределено ниже в процедуре
		                                                 // ПриЗаполненииНастроекТестирования
		
		Если НастройкиТестированияXDTO.КоличествоСделанныхПопыток > 0 Тогда
				
			Если ЗначениеЗаполнено(КонтекстВыполнения.ПрохождениеОбучения) Тогда
				ИмяРеквизитаДляПоиска = "ДатаТеста"; // Указываем результат последней попытки
			Иначе
				ИмяРеквизитаДляПоиска = "Результат"; // Указываем максимальный результат
			КонецЕсли;
			
			НайденнаяСтрока = Неопределено;
			
			Для каждого Строка Из ТаблицаПопытокТестирования Цикл
			
				Если НайденнаяСтрока = Неопределено
					ИЛИ Строка[ИмяРеквизитаДляПоиска] > НайденнаяСтрока[ИмяРеквизитаДляПоиска] Тогда
					
					НайденнаяСтрока = Строка;
					
				КонецЕсли;
				
				Если Строка.ПроверяетсяПреподавателем И Строка.ПроверенПреподавателем Тогда
					НастройкиТестированияXDTO.ТолькоПросмотр = Истина; // Запрещаем проходить проверенный тест
				КонецЕсли;
			
			КонецЦикла;
			
			Если НайденнаяСтрока = Неопределено Тогда
				НастройкиТестированияXDTO.ИтоговыйРезультат = 0;
			Иначе
				НастройкиТестированияXDTO.ИтоговыйРезультат = НайденнаяСтрока.Результат;
			КонецЕсли;
			
		КонецЕсли;
		
		// Находим незавершенную попытку
		
		НезавершеннаяСессияТеста = Неопределено;
		
		Для каждого Строка Из ТаблицаПопытокТестирования Цикл
			
			Если НЕ Строка.ПопыткаЗавершена Тогда
				
				Если НезавершеннаяСессияТеста = Неопределено
					ИЛИ НезавершеннаяСессияТеста.ДатаТеста > Строка.ДатаТеста Тогда
					
					НезавершеннаяСессияТеста = Новый Структура("ДатаТеста, НомерСессии", Строка.ДатаТеста, Строка.НомерСессии);
					
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЦикла;
		
		Если НезавершеннаяСессияТеста <> Неопределено Тогда
			
			СессияВыполненияТестаXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Collection", "СессияВыполненияТеста"));
			
			СессияВыполненияТестаXDTO.ДатаНачалаВыполненияТеста = Формат(НезавершеннаяСессияТеста.ДатаТеста, "");
			СессияВыполненияТестаXDTO.НомерСессии               = НезавершеннаяСессияТеста.НомерСессии;
			СессияВыполненияТестаXDTO.ТестЗавершен              = Ложь;
			
			НастройкиТестированияXDTO.НезавершеннаяСессияТеста = СессияВыполненияТестаXDTO;
			
		КонецЕсли;
		
		
		// 2. Находим настройки теста по умолчанию
		
		НастройкиТестированияXDTO.КоличествоРазрешенныхПопыток = СтруктураНастроек.КоличествоПопыток;
		
		// Добавляем к разрешенным те попытки, которые были добавлены
		
		Если НастройкиТестированияXDTO.КоличествоРазрешенныхПопыток > 0 Тогда
			
			Если КонтекстВыполнения.ЭлементСодержания = Неопределено Тогда
				ЭлементСодержания = Справочники.СодержаниеСУЗ.ПустаяСсылка();
			Иначе
				ЭлементСодержания = КонтекстВыполнения.ЭлементСодержания;
			КонецЕсли;
			
			Пользователь = ОбъектыСУЗ.ТекущийПользователь(КонтекстВыполнения);
			
			Если КонтекстВыполнения.Свойство("ПрохождениеОбучения")
				И ЗначениеЗаполнено(КонтекстВыполнения.ПрохождениеОбучения) Тогда
								
				ЭлектронныеРесурсыПереопределяемый.ПользовательОбучения(Пользователь, КонтекстВыполнения.ПрохождениеОбучения);
				
			КонецЕсли;			
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ДополнительныеПопыткиПрохожденияТестовСУЗ.Период
				|ИЗ
				|	РегистрСведений.ДополнительныеПопыткиПрохожденияТестовСУЗ КАК ДополнительныеПопыткиПрохожденияТестовСУЗ
				|ГДЕ
				|	ДополнительныеПопыткиПрохожденияТестовСУЗ.Пользователь = &Пользователь
				|	И ДополнительныеПопыткиПрохожденияТестовСУЗ.ЭлементСодержания = &ЭлементСодержания
				|	И ДополнительныеПопыткиПрохожденияТестовСУЗ.ПрохождениеОбучения = &ПрохождениеОбучения
				|	И ДополнительныеПопыткиПрохожденияТестовСУЗ.Задание = &Задание
				|	И ДополнительныеПопыткиПрохожденияТестовСУЗ.Тест = &Тест";

			Запрос.УстановитьПараметр("Задание", КонтекстВыполнения.Задание);
			Запрос.УстановитьПараметр("Пользователь", Пользователь);
			Запрос.УстановитьПараметр("ПрохождениеОбучения", КонтекстВыполнения.ПрохождениеОбучения);
			Запрос.УстановитьПараметр("ЭлементСодержания", ЭлементСодержания);
			Запрос.УстановитьПараметр("Тест", Подборка);

			Результат = Запрос.Выполнить();

			Если Результат.Пустой() Тогда
				
				НастройкиТестированияXDTO.КоличествоДобавленныхПопыток = 0;
				
			Иначе
				
				ВыборкаДетальныеЗаписи = Результат.Выбрать();
				
				НастройкиТестированияXDTO.КоличествоДобавленныхПопыток = ВыборкаДетальныеЗаписи.Количество();
				НастройкиТестированияXDTO.КоличествоРазрешенныхПопыток = НастройкиТестированияXDTO.КоличествоРазрешенныхПопыток + НастройкиТестированияXDTO.КоличествоДобавленныхПопыток;
				
			КонецЕсли;
			
		КонецЕсли;
		
		
		
	Иначе
		
		НастройкиТестированияXDTO.КоличествоСделанныхПопыток = 0;
		НастройкиТестированияXDTO.КоличествоРазрешенныхПопыток = СтруктураНастроек.КоличествоПопыток;
		НастройкиТестированияXDTO.ТолькоПросмотр = Ложь;
		НастройкиТестированияXDTO.КоличествоДобавленныхПопыток = 0;

	КонецЕсли;
		
	// Формируем сложность теста по умолчанию
	
	СложностьПоУмолчаниюXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Collection", "СложностьПоУмолчанию");
	СложностьПоУмолчаниюXDTO    = ФабрикаXDTO.Создать(СложностьПоУмолчаниюXDTOТип);
	
	СложностьПоУмолчаниюXDTO.Номер = Подборка.НомерСложностиПоУмолчанию;
	
	Если ЗначениеЗаполнено(Подборка.НаименованиеСложностиПоУмолчанию) Тогда
		СложностьПоУмолчаниюXDTO.Наименование = Подборка.НаименованиеСложностиПоУмолчанию;
	Иначе
		СложностьПоУмолчаниюXDTO.Наименование = "По умолчанию";
	КонецЕсли;
	
	СложностьПоУмолчаниюXDTO.Идентификатор = "default";
	
	ВремяТестаПоУмолчанию                = ОбъектыSCORM.ПолучитьДатуИзКоличестваСекунд(СтруктураНастроек.ВремяТестаВСекундах);
	ВремяТестаXDTOТип                    = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Collection", "ВремяТеста");
	СложностьПоУмолчаниюXDTO.ВремяТеста  = СоздатьВремяТестаXDTO(ВремяТестаПоУмолчанию, ВремяТестаXDTOТип);
	
	ТаблицаГруппЭлементов = ПолучитьГруппыЭлементовПодборки(Подборка);
	КоличествоГруппЭлементовПоУмолчанию = ТаблицаГруппЭлементов.Количество();
	
	Если СтруктураНастроек.КоличествоГруппЭлементов = 0 Тогда
		СложностьПоУмолчаниюXDTO.КоличествоГруппЭлементов = КоличествоГруппЭлементовПоУмолчанию;
	Иначе
		СложностьПоУмолчаниюXDTO.КоличествоГруппЭлементов = СтруктураНастроек.КоличествоГруппЭлементов;
	КонецЕсли;
	
	НастройкиТестированияXDTO.СложностьПоУмолчанию  = СложностьПоУмолчаниюXDTO;
	
	// Добавляем дополнительные сложности
	
	Если НЕ ЗначениеЗаполнено(КонтекстВыполнения.Задание)
		ИЛИ ТипЗнч(КонтекстВыполнения.Задание) = Тип("СправочникСсылка.СводыЗнанийСУЗ")
		ИЛИ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КонтекстВыполнения.Задание, "ИспользоватьСтандартныеНастройкиТеста") Тогда
		
		// Примечание: настройки режима тестирования включают одну сложность "По умолчанию".
		// Здесь добавляются дополнительные сложности.
		
		// Сложности не действуют, если тест является частью задания, так как для задания
		// Задаются собственные настройки теста, которые нельзя изменить.
		
		СложностиXDTOТип   = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Collection", "Сложности");
		СложностьXDTOТип   = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Collection", "Сложность");
		
		СложностиXDTO = ФабрикаXDTO.Создать(СложностиXDTOТип);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СложностиТестовСУЗ.Код КАК Номер,
			|	СложностиТестовСУЗ.Наименование,
			|	СложностиТестовСУЗ.ВремяТеста,
			|	СложностиТестовСУЗ.КоличествоГруппЭлементов,
			|	СложностиТестовСУЗ.Ссылка
			|ИЗ
			|	Справочник.СложностиТестовСУЗ КАК СложностиТестовСУЗ
			|ГДЕ
			|	СложностиТестовСУЗ.ПометкаУдаления = ЛОЖЬ
			|	И СложностиТестовСУЗ.Владелец = &Подборка
			|
			|УПОРЯДОЧИТЬ ПО
			|	СложностиТестовСУЗ.Код";

		Запрос.УстановитьПараметр("Подборка", Подборка);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СложностьXDTO = ФабрикаXDTO.Создать(СложностьXDTOТип);
			СложностьXDTO.Номер                    = ВыборкаДетальныеЗаписи.Номер;
			
			Если ВыборкаДетальныеЗаписи.КоличествоГруппЭлементов = 0 Тогда
				СложностьXDTO.КоличествоГруппЭлементов = КоличествоГруппЭлементовПоУмолчанию;
			Иначе
				СложностьXDTO.КоличествоГруппЭлементов = ВыборкаДетальныеЗаписи.КоличествоГруппЭлементов;
			КонецЕсли;
			
			СложностьXDTO.ВремяТеста               = СоздатьВремяТестаXDTO(ВыборкаДетальныеЗаписи.ВремяТеста, ВремяТестаXDTOТип);
			СложностьXDTO.Идентификатор            = Строка(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор());
			СложностьXDTO.Наименование             = ВыборкаДетальныеЗаписи.Наименование;
			
			СложностиXDTO.Сложность.Добавить(СложностьXDTO);
			
		КонецЦикла;

		НастройкиТестированияXDTO.Сложности  = СложностиXDTO;
		
	КонецЕсли;
	
	Если КонтекстВыполнения.ПараметрыЭкспорта = Неопределено Тогда
		
		ЭлектронныеРесурсыПереопределяемый.ПриЗаполненииНастроекТестирования(НастройкиТестированияXDTO, КонтекстВыполнения);
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьПопыткиПрохожденияТестов(Подборка, КонтекстВыполнения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.НомерРегистратора КАК Номер,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.НомерРегистратора КАК НомерСессии,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Регистратор КАК ПрохождениеПодборки,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ВремяПрохожденияВСекундах,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Результат,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПопыткаЗавершена КАК ПопыткаЗавершена,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПроверяетсяПреподавателем КАК ПроверяетсяПреподавателем,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПроверенПреподавателем КАК ПроверенПреподавателем,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ДатаНачалаПрохождения,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ДатаОкончанияПрохождения,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Период КАК ДатаТеста,
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Сложность.Наименование КАК Сложность
		|ИЗ
		|	РегистрСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ КАК ПопыткиПрохожденияЭлектронныхРесурсовСУЗ
		|ГДЕ
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Пользователь = &Пользователь
		|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлементСодержания = &ЭлементСодержания
		|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПрохождениеОбучения = &ПрохождениеОбучения
		|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Задание = &Задание
		|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.СсылкаНаОбъектСУЗ = &Подборка
		|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭтоТест = ИСТИНА
		|	И ТИПЗНАЧЕНИЯ(ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Регистратор) = ТИП(Документ.ПопыткаВыполненияПодборкиВопросовСУЗ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Период";
						

	// Примечание: элемент содержания может иметь значение Неопределено, когда
	// Его нет вообще и ПустаяСсылка, если выбран корень свода знаний. В базе
	// Хранится только пустая ссылка, а значит нужно привести к этому типу.
	Если КонтекстВыполнения.ЭлементСодержания = Неопределено Тогда
		ЭлементСодержания = Справочники.СодержаниеСУЗ.ПустаяСсылка();
	Иначе
		ЭлементСодержания = КонтекстВыполнения.ЭлементСодержания;
	КонецЕсли;
	
	Пользователь = ОбъектыСУЗ.ТекущийПользователь(КонтекстВыполнения);
	
	Если КонтекстВыполнения.Свойство("ПрохождениеОбучения")
		И ЗначениеЗаполнено(КонтекстВыполнения.ПрохождениеОбучения) Тогда
		
		ЭлектронныеРесурсыПереопределяемый.ПользовательОбучения(Пользователь, КонтекстВыполнения.ПрохождениеОбучения);
		
	КонецЕсли;
				
	Запрос.УстановитьПараметр("Пользователь", Пользователь);	
	Запрос.УстановитьПараметр("ЭлементСодержания", ЭлементСодержания);
	Запрос.УстановитьПараметр("ПрохождениеОбучения", КонтекстВыполнения.ПрохождениеОбучения);
	Запрос.УстановитьПараметр("Задание", КонтекстВыполнения.Задание);
	Запрос.УстановитьПараметр("Подборка", Подборка);

	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
	
КонецФункции

Функция ПолучитьXDTOГруппыЭлементовПодборки(Подборка, ДокументСессии, ТекущаяГруппа, ТаблицаКлассов, ПараметрыСсылки, КоличествоГруппЭлементов, ЭтоПодгруппа, КонтекстВыполнения)
	
	ГруппаЭлементовXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Collection", "ГруппаЭлементов");
	ГруппаЭлементовXDTO     = ФабрикаXDTO.Создать(ГруппаЭлементовXDTOТип);
	
	ГруппаЭлементовXDTO.Наименование = ТекущаяГруппа.Наименование;
	ГруппаЭлементовXDTO.Идентификатор = ТекущаяГруппа.Ссылка.УникальныйИдентификатор();
	
	// Примечание: Если на верхнем уровне находится элемент справочника,
	// Тогда предполагается, что группа состоит из одного элемента.
	ЭлементыГруппы = ПолучитьЭлементыГруппы(Подборка, ДокументСессии, ТекущаяГруппа); // Массив элементов, выбранной группы.
	
	НомерПодгруппы = 1;
	Для каждого ЭлементГруппы Из ЭлементыГруппы Цикл // Перебираем элементы группы (некоторые из них могут быть подгруппами).
		
		Если ЭлементГруппы.ЭтоГруппа Тогда // Если элемент группы - это подгруппа.
			ПодгруппаXDTO = ПолучитьXDTOГруппыЭлементовПодборки(Подборка, ДокументСессии, ЭлементГруппы, ТаблицаКлассов, ПараметрыСсылки, КоличествоГруппЭлементов, Истина, КонтекстВыполнения);
			ПодгруппаXDTO.Номер = НомерПодгруппы;
			ГруппаЭлементовXDTO.ГруппаЭлементов.Добавить(ПодгруппаXDTO);
			НомерПодгруппы = НомерПодгруппы + 1;
		Иначе
			
			Если ТипЗнч(ЭлементГруппы) = Тип("СправочникСсылка.ЭлементыПодборкиСУЗ") Тогда
				ДобавитьКлассВТаблицуКлассов(Подборка, ЭлементГруппы.Класс, ТаблицаКлассов, ПараметрыСсылки, КонтекстВыполнения);
			КонецЕсли;
			
			ЭлементПодборкиXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Collection", "ЭлементПодборки");
			ЭлементПодборкиXDTO     = ФабрикаXDTO.Создать(ЭлементПодборкиXDTOТип);
			
			ЭлементПодборкиXDTO.id = ЭлементГруппы.Ссылка.УникальныйИдентификатор();
			ЭлементПодборкиXDTO.Наименование = ЭлементГруппы.Наименование;
			
			Если ТипЗнч(ЭлементГруппы) = Тип("СправочникСсылка.ЭлементыПодборкиСУЗ") Тогда
				СсылкаНаОбъектСУЗ = ЭлементГруппы.СсылкаНаОбъектСУЗ;
			Иначе
				СсылкаНаОбъектСУЗ = ЭлементГруппы;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СсылкаНаОбъектСУЗ) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(СсылкаНаОбъектСУЗ) = ТипЗнч("СправочникСсылка.ФайлыСУЗ") Тогда
				
				пСтрокаПоиска = Новый Структура();

				Для каждого ЗначОбщейСтруктуры Из ПараметрыСсылки Цикл
					пСтрокаПоиска.Вставить(ЗначОбщейСтруктуры.Ключ, ЗначОбщейСтруктуры.Значение);
				КонецЦикла;
				
				пСтрокаПоиска.Вставить("anchor", ЭлементГруппы.Якорь);
				пСтрокаПоиска.Вставить("alt", ЭлементГруппы.Наименование);
				
			Иначе
				пСтрокаПоиска = Новый Структура();
				пСтрокаПоиска = ПараметрыСсылки;
			КонецЕсли;
			
			Если (ТипЗнч(СсылкаНаОбъектСУЗ) = Тип("СправочникСсылка.РесурсыСУЗ") ИЛИ ТипЗнч(СсылкаНаОбъектСУЗ) = Тип("СправочникСсылка.ФайлыСУЗ"))
				И (КоличествоГруппЭлементов = 1 ИЛИ Подборка.ТипНавигации = Перечисления.ТипыНавигацииПодборкиСУЗ.Слайды )
				И ЭлементыГруппы.Количество() = 1
				И НЕ ЭтоПодгруппа Тогда
				
				КонтекстВыполнения.Вставить("ВозможноПоказатьОдинФайл", Истина);
				
			КонецЕсли;
			
			// Примечание: Выгружать файл в кэш не требуется, так как это произойдет при получении его представления.
			
			СтруктураЭлементаГруппы = ОбъектыСУЗ.ПолучитьПредставление(СсылкаНаОбъектСУЗ, пСтрокаПоиска, КонтекстВыполнения);
			
			ЭлементПодборкиXDTO.Представление = СтруктураЭлементаГруппы.Представление;
			ЭлементПодборкиXDTO.Скрипт = СтруктураЭлементаГруппы.Скрипт;
			
			Если ТипЗнч(ЭлементГруппы) = Тип("СправочникСсылка.ЭлементыПодборкиСУЗ") Тогда
			
				Если ЗначениеЗаполнено(ЭлементГруппы.Класс) И Подборка.ПоказыватьКлассификатор Тогда
					
					КлассификаторСтрока = ТаблицаКлассов.Найти(ЭлементГруппы.Класс, "Ссылка");
					
					Если НЕ КлассификаторСтрока = Неопределено Тогда
						КлассXDTO = ПолучитьXDTOКласса(КлассификаторСтрока);
						ЭлементПодборкиXDTO.Класс = КлассXDTO;
					КонецЕсли;
							
				КонецЕсли;
				
			КонецЕсли;
				
			ГруппаЭлементовXDTO.ЭлементПодборки.Добавить(ЭлементПодборкиXDTO);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ГруппаЭлементовXDTO;
	
КонецФункции

Функция ПолучитьXDTOКласса(КлассификаторСтрока)

	КлассXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/Collection", "Класс");
	
	КлассXDTO     = ФабрикаXDTO.Создать(КлассXDTOТип);
	КлассXDTO.Код = СокрЛП(КлассификаторСтрока.Код);
	КлассXDTO.Наименование = КлассификаторСтрока.Наименование;
	
	Если ЗначениеЗаполнено(КлассификаторСтрока.ПорядковыйНомер) Тогда
		КлассXDTO.ПорядковыйНомер = КлассификаторСтрока.ПорядковыйНомер;
	КонецЕсли;
	
	ОбъектСУЗXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/KnowledgeSources", "ОбъектСУЗ");
	
	ИконкаXDTO = ФабрикаXDTO.Создать(ОбъектСУЗXDTOТип);
	ИконкаXDTO.Представление = КлассификаторСтрока.Представление;
	ИконкаXDTO.Скрипт        = КлассификаторСтрока.Скрипт;
	
	КлассXDTO.Иконка = ИконкаXDTO;
	
    Возврат КлассXDTO;
	
КонецФункции // ПолучитьXDTOКласса()

Функция ПолучитьВопросыРубрик(ТаблицаРубрик)
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ВнешнийИсточник", ТаблицаРубрик);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭлементПодборки,
	|   ЭлементРубрикатора
	|ПОМЕСТИТЬ ДоступныеРубрики
	|ИЗ &ВнешнийИсточник КАК ВнешнийИсточник";
	
	Запрос.Выполнить();
		
	// 3. Получаем все объекты СУЗ из доступных рубрик.
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РубрикиОбъектовСУЗ.СсылкаНаОбъектСУЗ КАК СсылкаНаОбъектСУЗ,
	               |	РубрикиОбъектовСУЗ.ЭлементРубрикатора КАК ЭлементРубрикатора,
	               |	ДоступныеРубрики.ЭлементПодборки КАК ЭлементПодборки,
	               |	РубрикиОбъектовСУЗ.ВесВопроса,
				   |	ВЫРАЗИТЬ(РубрикиОбъектовСУЗ.СсылкаНаОбъектСУЗ КАК Справочник.ВопросыСУЗ).ТипВопроса КАК ТипВопроса
	               |ИЗ
	               |	РегистрСведений.РубрикиОбъектовСУЗ КАК РубрикиОбъектовСУЗ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДоступныеРубрики КАК ДоступныеРубрики
	               |		ПО РубрикиОбъектовСУЗ.ЭлементРубрикатора = ДоступныеРубрики.ЭлементРубрикатора
	               |ГДЕ
	               |	РубрикиОбъектовСУЗ.СсылкаНаОбъектСУЗ.ПометкаУдаления = ЛОЖЬ
	               |	И ТИПЗНАЧЕНИЯ(РубрикиОбъектовСУЗ.СсылкаНаОбъектСУЗ) = &ТипОбъекта";
	
		
	Запрос.УстановитьПараметр("ТипОбъекта", Тип("СправочникСсылка.ВопросыСУЗ"));
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьНастройкиТестированияПоУмолчанию(Подборка, КонтекстВыполнения)
	
	НастройкиТестирования = Новый Структура;
	
	Если ЗначениеЗаполнено(КонтекстВыполнения.Вариант) Тогда
		ИсточникНастроек = КонтекстВыполнения.Вариант;	
	ИначеЕсли ЗначениеЗаполнено(КонтекстВыполнения.Задание) Тогда
		ИсточникНастроек = КонтекстВыполнения.Задание;
	Иначе
		ИсточникНастроек = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КонтекстВыполнения.ПрохождениеОбучения)
		И ЗначениеЗаполнено(ИсточникНастроек)
		И ТипЗнч(ИсточникНастроек) <> Тип("СправочникСсылка.СводыЗнанийСУЗ")
		И НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсточникНастроек, "ИспользоватьСтандартныеНастройкиТеста") Тогда
		
		НастройкиТестирования.Вставить("КоличествоПопыток", ИсточникНастроек.КоличествоПопыток);
		НастройкиТестирования.Вставить("КоличествоГруппЭлементов", ИсточникНастроек.КоличествоСтраницВопросов);
		НастройкиТестирования.Вставить("ВремяТестаВСекундах", ИсточникНастроек.ПродолжительностьВСекундах);
		
	Иначе
		
		НастройкиТестирования.Вставить("КоличествоПопыток", Подборка.КоличествоПопыток);
		НастройкиТестирования.Вставить("КоличествоГруппЭлементов", Подборка.КоличествоГруппЭлементов);
		НастройкиТестирования.Вставить("ВремяТестаВСекундах", ОбъектыSCORM.ПолучитьКоличествоСекундИзДаты(Подборка.ВремяТеста));
		
	КонецЕсли;
	
	Возврат НастройкиТестирования;
	
КонецФункции

Функция СоздатьВремяТестаXDTO(ВремяТеста, ВремяТестаXDTOТип)
	
	ФормСтрока = "Л = ru_RU;";
	
	ПарЧаса    ="час,часа,часов,м,,,,,0";
	ПарМинуты  ="минута,минуты,минут,ж,,,,,0";
	ПарСекунды ="секунда,секунды,секунд,ж,,,,,0";
	
	ВремяТестаXDTO = ФабрикаXDTO.Создать(ВремяТестаXDTOТип);
	
	КолЧасовПрописью  = ЧислоПрописью(Час(ВремяТеста), ФормСтрока, ПарЧаса);
	КолМинутПрописью  = ЧислоПрописью(Минута(ВремяТеста), ФормСтрока, ПарМинуты);
	КолСекундПрописью = ЧислоПрописью(Секунда(ВремяТеста), ФормСтрока, ПарСекунды);
	
	ВремяТестаНеОграниченно = Ложь;
	
	Если ВремяТеста = Дата("00010101") Тогда
		ВремяТестаНеОграниченно = Истина;
	КонецЕсли;
	
	ВремяТестаXDTO.НеОграниченно   = ВремяТестаНеОграниченно;
	ВремяТестаXDTO.ЧасовПрописью  = КолЧасовПрописью;
	ВремяТестаXDTO.МинутПрописью  = КолМинутПрописью;
	ВремяТестаXDTO.СекундПрописью = КолСекундПрописью;
	ВремяТестаXDTO.Время          = ВремяТеста; 
	
	Возврат ВремяТестаXDTO;
	
КонецФункции

#КонецОбласти	


#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("ЭтоТест");
	Поля.Добавить("ЭтоПрезентация");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = "%2 ""%1""";
	
	Если ТипЗнч(Данные.ЭтоТест) = Тип("Булево") Тогда
		
		Если Данные.ЭтоТест Тогда
			ТипПодборки	= НСтр("ru = 'Тест'");
		ИначеЕсли Данные.ЭтоПрезентация Тогда
			ТипПодборки	= НСтр("ru = 'Презентация'");
		Иначе
			ТипПодборки	= НСтр("ru = 'Теория'");
		КонецЕсли;
		
	Иначе
		
		ТипПодборки = "Группа";
		
	КонецЕсли;
	
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Представление, Данные.Наименование, ТипПодборки);

КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		
		// Получаем переменные
		
		ЭтоГруппа          = Неопределено;
		Ключ               = Неопределено;
		ЗначенияЗаполнения = Неопределено;
		ОткрытьФормуФайла  = Неопределено;
		
		Параметры.Свойство("ОткрытьФормуФайла", ОткрытьФормуФайла);
		Параметры.Свойство("Ключ", Ключ);
		Параметры.Свойство("ЭтоГруппа", ЭтоГруппа);
		Параметры.Свойство("ЗначенияЗаполнения", ЗначенияЗаполнения);
		
		Если ЭтоГруппа = Неопределено И ЗначениеЗаполнено(Ключ) Тогда
			ЭтоГруппа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ключ, "ЭтоГруппа");
		КонецЕсли;		
		
		// Делаем проверки
		
		Если Параметры.Свойство("ЗначениеКопирования") Тогда
			Возврат;
		КонецЕсли;				
		
		Если ЭтоГруппа = Истина Тогда
			Возврат;
		КонецЕсли;
		
		// Определяем форму
		
		СтандартнаяОбработка = Ложь;
		
		ЭтоТест        = Неопределено;
		ЭтоПрезентация = Неопределено;
		
		Если Ключ = Неопределено Тогда
			
			Если ЗначенияЗаполнения <> Неопределено Тогда
				ЗначенияЗаполнения.Свойство("ЭтоТест", ЭтоТест);
				ЗначенияЗаполнения.Свойство("ЭтоПрезентация", ЭтоПрезентация);
			КонецЕсли;
			
		Иначе
			
			ДанныеКлюча = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ключ, "ЭтоТест, ЭтоПрезентация");
			
			ЭтоТест = ДанныеКлюча.ЭтоТест;
			ЭтоПрезентация = ДанныеКлюча.ЭтоПрезентация;

		КонецЕсли;
		
		Если ЭтоТест = ИСТИНА Тогда
			
			ВыбраннаяФорма = "ФормаТеста";
			
		ИначеЕсли ЭтоТест = ЛОЖЬ Тогда
			
			Если ЭтоПрезентация = ИСТИНА Тогда
				ВыбраннаяФорма = "ФормаПрезентации";
			Иначе
				ВыбраннаяФорма = "ФормаТеории";
			КонецЕсли;
			
			Если ОткрытьФормуФайла = ИСТИНА
				И ЗначениеЗаполнено(Ключ)
				И ТипЗнч(Ключ) = Тип("СправочникСсылка.ПодборкиСУЗ")
				И ЭтоПрезентация = ЛОЖЬ Тогда
				
				ЕдинственныйФайл = Неопределено;
				
				ЕдинственныйЭлемент = ЕдинственныйЭлементПодборки(Ключ, Истина);
				
				Если ТипЗнч(ЕдинственныйЭлемент) = Тип("СправочникСсылка.ФайлыСУЗ") Тогда
					ЕдинственныйФайл = ЕдинственныйЭлемент;
				КонецЕсли;
				
				Если ТипЗнч(ЕдинственныйЭлемент) = Тип("СправочникСсылка.РесурсыСУЗ") Тогда
					ЕдинственныйФайл = Справочники.РесурсыСУЗ.ЕдинственныйФайлРесурса(ЕдинственныйЭлемент);
				КонецЕсли;
				
				Если ЕдинственныйФайл <> Неопределено Тогда
				
					СтандартнаяОбработка = Ложь;
					Параметры.Ключ = ЕдинственныйФайл;
					ВыбраннаяФорма = Метаданные.Справочники.ФайлыСУЗ.Формы.ФормаЭлемента;
					
				КонецЕсли;
					
			КонецЕсли;
			
		Иначе
			
			ВыбраннаяФорма = "ФормаСоздания";
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
