#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоГруппа Тогда
		ТипОбъектаСУЗ = Перечисления.ТипыОбъектовСУЗ.collection;
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;
	КонецЕсли;
		
	Если НЕ ЭтоГруппа Тогда
		
		Если НЕ ЭтоНовый() Тогда
			ВыполнитьПроверкуПодборки(Отказ);		
		КонецЕсли;
			
		Справочники.ПодборкиСУЗ.УстановитьОбязательныеРеквизиты(ЭтотОбъект);
		
		РазработкаСУЗ.ПереименоватьАвтоРодителей(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// Создаем или обновляем ресурс, если тест входит в электронный ресурс типа Тест
	
	Если ДополнительныеСвойства.Свойство("СоздатьЭлектронныйРесурс") Тогда
		
		ЭлектронныйРесурс = Неопределено;
		РодительЭлектронногоРесурса = Неопределено;
		ДополнительныеСвойства.Свойство("РодительЭлектронногоРесурса", РодительЭлектронногоРесурса); 
		
		Справочники.ПодборкиСУЗ.ОбновитьЭлектронныйРесурсТеста(Ссылка, ЭлектронныйРесурс, Отказ, РодительЭлектронногоРесурса);
		
		ДополнительныеСвойства.Вставить("ЭлектронныйРесурс", ЭлектронныйРесурс);
		
	Иначе
		
		Если ДополнительныеСвойства.Свойство("ЭлектронныйРесурс")
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДополнительныеСвойства.ЭлектронныйРесурс, "Тип") = Перечисления.ТипыЭлектронныхРесурсовСУЗ.Тест Тогда
			
			Справочники.ПодборкиСУЗ.ОбновитьЭлектронныйРесурсТеста(Ссылка, ДополнительныеСвойства.ЭлектронныйРесурс, Отказ);
			
		КонецЕсли;		
		
	КонецЕсли;	
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ОбъектКопирования", ОбъектКопирования);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ВыполнитьПроверкуПодборки(Отказ)
	
	Если НЕ ПоказыватьНавигацию Тогда // Делаем проверку, чтобы каждая группа элементов содержала хотя бы один вопрос.
		    		
		ЕстьГруппыБезВопросов = Ложь;
		    		
		ГруппыЭтойПодборки = Справочники.ПодборкиСУЗ.ПолучитьГруппыЭлементовПодборки(Ссылка);
		    		
		Для каждого ТекущаяГруппа Из ГруппыЭтойПодборки Цикл
		    		   
			Если ТекущаяГруппа.ЭтоГруппа Тогда
						
				ВсеЭлементыГруппы = Справочники.ПодборкиСУЗ.ВсеЭлементы(Ссылка, ТекущаяГруппа.Ссылка);
				ЕстьВГруппеВопрос = Ложь;
				Для каждого ЭлементГруппы Из ВсеЭлементыГруппы Цикл
					Если ТипЗнч(ЭлементГруппы.СсылкаНаОбъектСУЗ) = Тип("СправочникСсылка.ВопросыСУЗ") Тогда
						ЕстьВГруппеВопрос = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
							
				Если НЕ ЕстьВГруппеВопрос Тогда
					ЕстьГруппыБезВопросов = Истина;
				КонецЕсли;
							
			Иначе
				
				Если ТипЗнч(ТекущаяГруппа.СсылкаНаОбъектСУЗ) <> Тип("СправочникСсылка.ВопросыСУЗ") Тогда
					ЕстьГруппыБезВопросов = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
		    		
		КонецЦикла;
		
		Если ЕстьГруппыБезВопросов Тогда
			Текст = НСтр("ru = 'При снятом флажке ""Показывать навигацию"" каждая группа элементов должна содержать хотя бы один вопрос'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПредставлениеЭлементов = Перечисления.ВариантыПредставленияЭлементовПодборкиСУЗ.КлассификационнаяТаблица Тогда
		
		// Проверяем, чтобы каждая группа содержала более одного класса.
		// Если в группе один класс и есть еще элементы без класса, выводим предупреждение.
		// Имеет смысл при условии, что не указана классификационная группировка.
		
		Если НЕ ЗначениеЗаполнено(КлассификационнаяГруппировка) Тогда
			
			ГруппыЭтойПодборки = Справочники.ПодборкиСУЗ.ПолучитьГруппыЭлементовПодборки(Ссылка);
			
			Для каждого ТекущаяГруппа Из ГруппыЭтойПодборки Цикл
				
				Запрос = Новый Запрос("	
					|ВЫБРАТЬ
					|	ЭлементыПодборкиСУЗ.Класс КАК Класс
					|ИЗ
					|	Справочник.ЭлементыПодборкиСУЗ КАК ЭлементыПодборкиСУЗ
					|ГДЕ
					|	ЭлементыПодборкиСУЗ.Владелец = &Владелец
					|	И ЭлементыПодборкиСУЗ.ПометкаУдаления = ЛОЖЬ
					|	И ЭлементыПодборкиСУЗ.Родитель В ИЕРАРХИИ(&Родитель)
					|	И ЭлементыПодборкиСУЗ.ЭтоГруппа = ЛОЖЬ
					|	И ЭлементыПодборкиСУЗ.Класс <> &НетКласса
					|ИТОГИ
					|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Класс)
					|ПО
					|	ОБЩИЕ");

				Запрос.УстановитьПараметр("Владелец", ЭтотОбъект.Ссылка); 
				Запрос.УстановитьПараметр("Родитель", ТекущаяГруппа.Ссылка); 
				Запрос.УстановитьПараметр("НетКласса", Справочники.КлассификаторОбъектовСУЗ.ПустаяСсылка()); 
				
				РезультатЗапроса = Запрос.Выполнить().Выгрузить();
				
				Если РезультатЗапроса.Количество() > 0 Тогда
					КоличествоРазличных = РезультатЗапроса.Получить(0).Класс;
				Иначе
					КоличествоРазличных = 0;
				КонецЕсли;
				
				Если КоличествоРазличных = 1 Тогда
					
					Запрос2 = Новый Запрос("	
						|ВЫБРАТЬ
						|	ЭлементыПодборкиСУЗ.Класс КАК Класс
						|ИЗ
						|	Справочник.ЭлементыПодборкиСУЗ КАК ЭлементыПодборкиСУЗ
						|ГДЕ
						|	ЭлементыПодборкиСУЗ.Владелец = &Владелец
						|	И ЭлементыПодборкиСУЗ.ПометкаУдаления = ЛОЖЬ
						|	И ЭлементыПодборкиСУЗ.Родитель В ИЕРАРХИИ(&Родитель)
						|	И ЭлементыПодборкиСУЗ.ЭтоГруппа = ЛОЖЬ
						|	И ЭлементыПодборкиСУЗ.Класс = &НетКласса");
					
					Запрос2.УстановитьПараметр("Владелец", ЭтотОбъект.Ссылка); 
					Запрос2.УстановитьПараметр("Родитель", ТекущаяГруппа.Ссылка); 
					Запрос2.УстановитьПараметр("НетКласса", Справочники.КлассификаторОбъектовСУЗ.ПустаяСсылка()); 
					
					РезультатЗапроса2 = Запрос2.Выполнить().Выгрузить();
					
					Если РезультатЗапроса2.Количество() > 0 Тогда
						Текст = НСтр("ru = 'Для группы """+ ТекущаяГруппа.Наименование +""" элементы, не имеющие класса, будут размещены в одной колонке с элементами, которым назначен класс'");
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
					КонецЕсли;
					
				КонецЕсли;
				
				
			КонецЦикла;
			
		КонецЕсли;
				
	КонецЕсли;
	
	
КонецПроцедуры // ВыполнитьПроверкуПодборки()

#КонецОбласти

#КонецЕсли

