#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ИнтерактивныйРесурс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "Интерактивный");
	
	Если ИнтерактивныйРесурс Тогда
		
		Если НЕ ЗначениеЗаполнено(Модуль) Тогда
			Текст = НСтр("ru = 'Укажите модуль'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,, "Модуль",,Отказ);
		КонецЕсли;
		
		Ресурс = Неопределено;
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(Ресурс) Тогда
			Текст = НСтр("ru = 'Укажите набор файлов'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,, "Ресурс",,Отказ);
		КонецЕсли;
		
		Модуль = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
