&НаСервере
Функция СформироватьФайлНастроек(Знач ПубликацияВебКабинета) 
	
	ДанныеФайлаНастроек = Новый Структура("АдресФайла, ИмяФайла");
	
	ДанныеФайлаНастроек.АдресФайла = Справочники.ПубликацииВебКабинетаСУ.СформироватьФайлНастроек(ПубликацияВебКабинета);	
	ДанныеФайлаНастроек.ИмяФайла = ВебКабинетСУ.ИмяФайлаНастроек();
	
	Возврат ДанныеФайлаНастроек;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДанныеФайлаНастроек = СформироватьФайлНастроек(ПараметрКоманды);
	
	Если ЗначениеЗаполнено(ДанныеФайлаНастроек.АдресФайла) Тогда
		ПолучитьФайл(ДанныеФайлаНастроек.АдресФайла, ДанныеФайлаНастроек.ИмяФайла, Истина);
	КонецЕсли;
	
КонецПроцедуры
