#Область СлужебныеПроцедурыИФункции

Процедура УстановитьФункциональныйПрофиль(Знач ИмяПрофиля = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ИмяПрофиля = Неопределено Тогда
		ИмяПрофиля = Метаданные.Имя;
	КонецЕсли;
	
	ПолныйИнтерфейсСУО = Ложь;
	ОбразовательнаяОрганизацияОО = Ложь;
	ЭкзаменаторЭР = Ложь;
	
	ИспользоватьСотрудников = Константы.ИспользоватьСотрудниковСУО.Получить();
	ИспользоватьСтудентов = Константы.ИспользоватьСтудентовСУО.Получить();
	ИспользоватьТолькоПользователей = Константы.ИспользоватьТолькоПользователейСУ.Получить();
	ИспользоватьСлушателей = Константы.ИспользоватьСлушателейСУО.Получить();
	
	Если Найти(ИмяПрофиля, "КорпоративныйУниверситет") = 1 Тогда
		
		ПолныйИнтерфейсСУО = Истина;
		
		Константы.ИспользоватьУниверсальныйСервисОбщенияСУО.Установить(Ложь);
		Константы.ИспользоватьЛичныеСообщенияСУО.Установить(Истина);
		Константы.ИспользоватьФорумыСУО.Установить(Истина);
		
		Если НЕ ИспользоватьСотрудников 
			И НЕ ИспользоватьСтудентов 
			И НЕ ИспользоватьТолькоПользователей 
			И НЕ ИспользоватьСлушателей Тогда
			
			Константы.ИспользоватьСотрудниковСУО.Установить(Истина);
			
		КонецЕсли;
		
		Если ИспользоватьСлушателей Тогда
			Константы.ИспользоватьПрограммыОбученияСУО.Установить(Ложь);
			Константы.ИспользоватьЗаявкиНаОбучениеСУО.Установить(Ложь);
		Иначе
			Константы.ИспользоватьПрограммыОбученияСУО.Установить(Истина);
			Константы.ИспользоватьЗаявкиНаОбучениеСУО.Установить(Истина);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Найти(ИмяПрофиля, "ОбразовательнаяОрганизация") = 1 Тогда
		
		ОбразовательнаяОрганизацияОО = Истина;
		
		Константы.ИспользоватьУниверсальныйСервисОбщенияСУО.Установить(Ложь);
		Константы.ИспользоватьЛичныеСообщенияСУО.Установить(Истина);
		Константы.ИспользоватьФорумыСУО.Установить(Истина);
		Константы.ИспользоватьАнкетирование.Установить(Ложь);
		
		Константы.ИспользоватьСтудентовСУО.Установить(Истина);
		Константы.ИспользоватьСотрудниковСУО.Установить(Ложь);
		Константы.ИспользоватьСлушателейСУО.Установить(Ложь);
		Константы.ИспользоватьТолькоПользователейСУ.Установить(Ложь);
		Константы.РасширеннаяФункциональностьСУО.Установить(Ложь);
		
		Константы.ИспользоватьПрограммыОбученияСУО.Установить(Ложь);
		Константы.ИспользоватьЗаявкиНаОбучениеСУО.Установить(Ложь);
		
	КонецЕсли;
	
	Если Найти(ИмяПрофиля, "Экзаменатор") = 1 Тогда
		
		ЭкзаменаторЭР = Истина;
		
		Константы.ИспользоватьУниверсальныйСервисОбщенияСУО.Установить(Ложь);
		Константы.ИспользоватьЛичныеСообщенияСУО.Установить(Истина);
		Константы.ИспользоватьФорумыСУО.Установить(Ложь);
		Константы.ИспользоватьАнкетирование.Установить(Ложь);
		Константы.ИспользоватьДополнительныеМатериалыСУЗ.Установить(Ложь);
		Константы.ПоказыватьОбщиеДополнительныеМатериалыПослеПроверкиСУЗ.Установить(Ложь);
		Константы.РасширеннаяФункциональностьСУО.Установить(Ложь);
		
		Если НЕ ИспользоватьСотрудников 
			И НЕ ИспользоватьСтудентов 
			И НЕ ИспользоватьТолькоПользователей
			И НЕ ИспользоватьСлушателей Тогда
			
			Константы.ИспользоватьСотрудниковСУО.Установить(Истина);
			
		КонецЕсли;
		
		Константы.ИспользоватьПрограммыОбученияСУО.Установить(Ложь);
		Константы.ИспользоватьЗаявкиНаОбучениеСУО.Установить(Ложь);
		
	КонецЕсли;
				
	Константы.ПолныйИнтерфейсСУО.Установить(ПолныйИнтерфейсСУО);
	Константы.ОбразовательнаяОрганизацияОО.Установить(ОбразовательнаяОрганизацияОО);
	Константы.ЭкзаменаторЭР.Установить(ЭкзаменаторЭР);	
	
	РегистрыСведений.НастройкиУчебныхМатериаловСУО.УстановитьНастройки();
	
КонецПроцедуры

#Область Обучение 

Функция ЗачислитьУчастникаНаОбучение(Знач ПроведениеОбучения, Знач Сценарий = Неопределено, Знач Пользователь, Знач УчебнаяГруппа = Неопределено, Знач РодительскоеПрохождение = Неопределено, Знач Заявка = Неопределено, Знач ДелатьПроверки = Истина, Знач ОбновлятьСуществующее = Ложь, Знач ОбновитьДанныеВебКабинета = Ложь, Знач ЭтоИнтерактивноеЗачисление = Ложь, Знач ЭтоАвтозачисление = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем переменные
	//
	
	ДанныеОПроведении = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеОбучения, "ПроведениеПрограммыОбучения, ДатаНачалаПроведения, ОткрытоеМероприятие, ДатаОткрытияЗаписи, ДатаЗакрытияЗаписи, МаксимальноеКоличествоУчастников, Мероприятие, ЭлектронныйРесурс, НаОсновеЭлектронногоРесурса, НаОсновеМероприятия, БезСценария, ПрименениеУсловийЗачисления, ДатаКонтроля, СхемаПроведения, ВидОбучения, Проведен, ФильтрПоДатеПриемаНаРаботу");
	
	Если НЕ ЗначениеЗаполнено(Сценарий) Тогда
		Сценарий = Документы.ПроведениеОбученияСУО.СценарийОбучения(ПроведениеОбучения);
	КонецЕсли;
	
	ВидОбучения = Документы.ПроведениеОбученияСУО.ВидОбучения(ДанныеОПроведении, Сценарий);
	
	СуществующееПрохождение = Документы.ПроведениеОбученияСУО.ПрохождениеОбучения(ПроведениеОбучения, Сценарий, Пользователь);
	
	// Делаем проверки возможности записи
	//
	
	Если ЭтоАвтозачисление
		И НЕ ЗначениеЗаполнено(СуществующееПрохождение)
		И Документы.ПроведениеОбученияСУО.ЕстьОтмененныеПрохожденияОбучения(ПроведениеОбучения, Пользователь, Сценарий) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Если ДелатьПроверки И (ДанныеОПроведении.Мероприятие = Сценарий  
		ИЛИ ДанныеОПроведении.НаОсновеЭлектронногоРесурса
		ИЛИ ДанныеОПроведении.БезСценария) Тогда
		
		РезультатБазовойПроверки = Документы.ПроведениеОбученияСУО.ПроверитьВозможностьЗачисленияНаОбучение(Пользователь, ПроведениеОбучения, ДанныеОПроведении, СуществующееПрохождение);
	
		Если РезультатБазовойПроверки.ЕстьОшибки Тогда
			Текст = НСтр("ru = 'Пользователь %1 не может быть зачислен. %2'");
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, Пользователь, РезультатБазовойПроверки.ТекстОшибки);				
			Если ЭтоИнтерактивноеЗачисление Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
			Иначе
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Зачисление участника на обучение'"),
					УровеньЖурналаРегистрации.Предупреждение,,ПроведениеОбучения,Текст);
			КонецЕсли;
			Возврат Неопределено;
		КонецЕсли;		
				
	КонецЕсли;
		
	// Создаем новое прохождение обучения или если оно есть возвращаем
	//
	
	Если НЕ ОбновлятьСуществующее И ЗначениеЗаполнено(СуществующееПрохождение) Тогда
		
		Если ЗначениеЗаполнено(ДанныеОПроведении.ПроведениеПрограммыОбучения)
			И НЕ ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СуществующееПрохождение, "ПрохождениеПрограммыОбучения")) Тогда
			
			ОбновлятьСуществующее = Истина; // Если зачислили не через программу, а потом к ней присоединили
			
		КонецЕсли;
		
		Если НЕ ОбновлятьСуществующее Тогда		
			Возврат СуществующееПрохождение;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СуществующееПрохождение) Тогда
				
		ПрохождениеОбъект = СуществующееПрохождение.ПолучитьОбъект();
		
	Иначе
		
		ПрохождениеОбъект = Документы.ПрохождениеОбученияСУО.СоздатьДокумент();
		
		ПрохождениеОбъект.Дата                        = ТекущаяДата();
		ПрохождениеОбъект.Пользователь                = Пользователь;
		ПрохождениеОбъект.ПроведениеОбучения          = ПроведениеОбучения;
		ПрохождениеОбъект.Сценарий                    = Сценарий;		
		ПрохождениеОбъект.Статус                      = Перечисления.СтатусыПрохожденияОбъектовСУО.Зачислен;
		
		Если ЗначениеЗаполнено(РодительскоеПрохождение) Тогда
			ПрохождениеОбъект.РодительскоеПрохождение = РодительскоеПрохождение;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УчебнаяГруппа) Тогда
		ПрохождениеОбъект.УчебнаяГруппа = УчебнаяГруппа;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Заявка) Тогда
		ПрохождениеОбъект.Заявка = Заявка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеОПроведении.ПроведениеПрограммыОбучения) Тогда
		ПрохождениеПрограммыОбучения = Документы.ПроведениеПрограммыОбученияСУО.ПрохождениеПрограммыОбучения(ДанныеОПроведении.ПроведениеПрограммыОбучения, Пользователь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПрохождениеПрограммыОбучения) Тогда
		ПрохождениеОбъект.ПрохождениеПрограммыОбучения = ПрохождениеПрограммыОбучения;
	КонецЕсли;
	
	Если ВидОбучения.ТребуетсяПреподаватель
		И НЕ ВидОбучения.Общее Тогда
	
		Если ВидОбучения.Электронное
			И ВидОбучения.ВыставляетсяОценка Тогда
			
			// Если есть электронный ресурс, то считаем,
			// что проверка не требуется. В процессе прохождение
			// это может быть изменено, если в тестах есть открытые вопросы.
			
			// Преподаватель не требуется, если есть задания, так как
			// они тоже могут быть не требующие проверки. При прохождении
			// это может быть изменено. если окажется, что есть задания,
			// требующие проверки.
			
			// Если нет электронного ресурса и заданий и выставляется оценка
			// за электронное обучение, то проверка явно нужна, например,
			// чтобы проверить прикрепленный файл и выставить оценку.
			
			Если ЗначениеЗаполнено(Документы.ПроведениеОбученияСУО.ЭлектронныйРесурсОбучения(ДанныеОПроведении, Сценарий))
				ИЛИ Документы.ПроведениеОбученияСУО.ЗаданияОбучения(ПроведениеОбучения, Сценарий,,ВидОбучения).Количество() > 0 Тогда
				
				ПрохождениеОбъект.ПроверяетсяПреподавателем = Ложь;
				
			Иначе
				
				ПрохождениеОбъект.ПроверяетсяПреподавателем = Истина;
				
			КонецЕсли;
			
		Иначе
			
			// Не электронные обучения, например, вебинар не проверяются преподавателем,
			// даже если за них выставляется оценка.
			
			ПрохождениеОбъект.ПроверяетсяПреподавателем = Ложь;
			
		КонецЕсли;		
		
	Иначе
		
		ПрохождениеОбъект.ПроверяетсяПреподавателем = Ложь;
		
	КонецЕсли;	
	
	ЭтоНовоеИнтерактивноеЗачисление = ПрохождениеОбъект.ЭтоНовый() И ЭтоИнтерактивноеЗачисление;
	
	Если НЕ ЭтоНовоеИнтерактивноеЗачисление
		И ДанныеОПроведении.Проведен 
		И НЕ ПрохождениеОбъект.ПометкаУдаления Тогда
		ПрохождениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		ПрохождениеОбъект.ДополнительныеСвойства.Вставить("НеОбновлятьДанныеВебКабинета", Истина);
		// Данные веб-кабинета не следует обновлять, так как документ новый и не проведенный.
		// Задание на обновление будет создано при проведении документа.
		ПрохождениеОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
	// Зачисляем на подчиненные мероприятия
	//	
	
	Если ТипЗнч(Сценарий) = Тип("СправочникСсылка.КаталогМероприятийСУО")
		И НЕ ЗначениеЗаполнено(РодительскоеПрохождение)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сценарий, "Вид.Общее") Тогда
		
		ТаблицаПодчиненныхМероприятий = Документы.ПроведениеОбученияСУО.ПодчиненныеМероприятия(ПроведениеОбучения);
		
		Если ТаблицаПодчиненныхМероприятий.Количество() > 0 Тогда
		
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОПроведении.СхемаПроведения, "ПоследовательноеПрохождение") Тогда
				
				// При последовательном прохождении зачисляем только на первое обучение.
				// На остальные будем зачислять в событии ПриПрохожденииМероприятия.
				// При этом, если родительское обучение не актуально, то зачисление не происходит.
				
				Если Документы.ПрохождениеОбученияСУО.Актуально(ПрохождениеОбъект.Ссылка) Тогда 				
					ЗачислитьУчастникаНаОбучение(ПроведениеОбучения, ТаблицаПодчиненныхМероприятий[0].Мероприятие, Пользователь, УчебнаяГруппа, ПрохождениеОбъект.Ссылка, Заявка,,,ОбновитьДанныеВебКабинета); // Рекурсия
				КонецЕсли;
				
			Иначе
				
				// Зачисляем на все подчиненные
				
				Для каждого Строка Из ТаблицаПодчиненныхМероприятий Цикл
					ЗачислитьУчастникаНаОбучение(ПроведениеОбучения, Строка.Мероприятие, Пользователь, УчебнаяГруппа, ПрохождениеОбъект.Ссылка, Заявка,,,ОбновитьДанныеВебКабинета); // Рекурсия
				КонецЦикла;				
				
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;		
	
	// Создаем автоматическую рассылку
	//
	
	УправлениеОбучениемСУО.СоздатьАвтоматическуюРассылку(ПрохождениеОбъект);
	
	// Добавляем документ проведения обучения в документы, требующие перепроведения
	//
	
	Если ОбновитьДанныеВебКабинета Тогда		
		Документы.ПрохождениеОбученияСУО.ОбновитьДанныеВебКабинета(ПрохождениеОбъект.Ссылка);
	КонецЕсли;
	
	Если НЕ ЭтоИнтерактивноеЗачисление Тогда
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(ПроведениеОбучения);
	КонецЕсли;
	
	Возврат ПрохождениеОбъект.Ссылка;
	
КонецФункции

Функция НазначитьПреподавателяНаОбучение(Знач ПроведениеОбучения, Знач Сценарий = Неопределено, Знач Преподаватель, Знач Роль = Неопределено, Знач РекурсивныйВызов = Ложь, Знач РодительскоеПроведение = Неопределено, Знач ЭтоИнтерактивноеЗачисление = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем данные
	//
	
	ДанныеОПроведении  = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеОбучения, "Мероприятие, ЭлектронныйРесурс, НаОсновеЭлектронногоРесурса, Проведен, СхемаПроведения, НаОсновеМероприятия, БезСценария, ВидОбучения");
	
	Если НЕ ЗначениеЗаполнено(Сценарий) Тогда
		Сценарий = Документы.ПроведениеОбученияСУО.СценарийОбучения(ПроведениеОбучения);
	КонецЕсли;	
	
	// Зачисляем на общее мероприятие
	//
	
	Если ТипЗнч(Сценарий) = Тип("СправочникСсылка.КаталогМероприятийСУО")
		И ДанныеОПроведении.Мероприятие <> Сценарий
		И НЕ РекурсивныйВызов
		И РодительскоеПроведение = Неопределено Тогда 
		
		// Это подчиненное мероприятие
		
		// Создаем документ, фиксирующий проведение общего мероприятия, если его еще нет.

		РодительскоеПроведение = Документы.ПроведениеОбученияСУО.ПроведениеОбученияПреподавателем(ПроведениеОбучения, ДанныеОПроведении.Мероприятие, Преподаватель);
		
		Если НЕ ЗначениеЗаполнено(РодительскоеПроведение) Тогда
			
			РодительскоеПроведениеОбъект = Документы.ПроведениеПреподавателемОбученияСУО.СоздатьДокумент();
			РодительскоеПроведениеОбъект.Дата = ТекущаяДата();
			РодительскоеПроведениеОбъект.Пользователь         = Преподаватель;
			РодительскоеПроведениеОбъект.Сценарий             = ДанныеОПроведении.Мероприятие;
			РодительскоеПроведениеОбъект.ПроведениеОбучения   = ПроведениеОбучения;
			
			// Роль преподавателя не указывается, так как он может иметь разные роли в рамках одного общего курса.
			
			Если ДанныеОПроведении.Проведен Тогда
				РодительскоеПроведениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				РодительскоеПроведениеОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			
			РодительскоеПроведение = РодительскоеПроведениеОбъект.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Ищем существующее проведение
	//

	Проведение = Документы.ПроведениеОбученияСУО.ПроведениеОбученияПреподавателем(ПроведениеОбучения, Сценарий, Преподаватель);
	
	Если ЗначениеЗаполнено(Проведение) Тогда
		
		ПроведениеОбъект = Проведение.ПолучитьОбъект();
		
	Иначе
		
		ПроведениеОбъект = Документы.ПроведениеПреподавателемОбученияСУО.СоздатьДокумент();
		ПроведениеОбъект.Дата                        = ТекущаяДата();
		ПроведениеОбъект.Сценарий                    = Сценарий;
		ПроведениеОбъект.ПроведениеОбучения          = ПроведениеОбучения;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Роль) Тогда
		ПроведениеОбъект.Роль = Роль;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Роль) И ТипЗнч(Роль) = Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда
		ПроведениеОбъект.Роль = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сценарий, "РольПреподавателя");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Роль) Тогда
		ПроведениеОбъект.Роль = Справочники.РолиПреподавателейСУО.Модератор;
	КонецЕсли;
	
	ПроведениеОбъект.Пользователь = Преподаватель;
	
	Если ЗначениеЗаполнено(РодительскоеПроведение) Тогда
		ПроведениеОбъект.РодительскоеПроведение = РодительскоеПроведение;
	КонецЕсли;
	
	ЭтоНовоеИнтерактивноеЗачисление = ПроведениеОбъект.ЭтоНовый() И ЭтоИнтерактивноеЗачисление;
	
	Если НЕ ЭтоНовоеИнтерактивноеЗачисление И ДанныеОПроведении.Проведен И НЕ ПроведениеОбъект.ПометкаУдаления Тогда
		ПроведениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		ПроведениеОбъект.ДополнительныеСвойства.Вставить("НеОбновлятьДанныеВебКабинета", Истина);
		ПроведениеОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
	Если НЕ РекурсивныйВызов И НЕ УправлениеОбучениемСУО.ЕстьРольПреподавателя(Преподаватель) Тогда
		Текст = НСтр("ru = 'Предупреждение: %1 не имеет прав преподавателя'");
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, Преподаватель);
		Если ЭтоИнтерактивноеЗачисление Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Иначе
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Назначение преподавателя на обучение'"),
					УровеньЖурналаРегистрации.Предупреждение,,ПроведениеОбучения,Текст);
		КонецЕсли;
	КонецЕсли;			
	
	// Зачисляем на подчиненные мероприятия
	//
	
	Если ДанныеОПроведении.ВидОбучения.Общее И ДанныеОПроведении.Мероприятие = Сценарий Тогда
		
		ПодчиненныеМероприятия = Документы.ПроведениеОбученияСУО.ПодчиненныеМероприятия(
			ПроведениеОбучения, Истина, ДанныеОПроведении.СхемаПроведения);
		
		Для каждого Строка Из ПодчиненныеМероприятия Цикл
			НазначитьПреподавателяНаОбучение(
				ПроведениеОбучения, Строка.Мероприятие, Преподаватель, Роль, Истина, ПроведениеОбъект.Ссылка); // Рекурсия		
		КонецЦикла;
		
	КонецЕсли;
	
	// Создаем рассылку
	//
	
	УправлениеОбучениемСУО.СоздатьАвтоматическуюРассылку(ПроведениеОбъект);
	
	// Добавляем документ проведения обучения в документы, требующие перепроведения
	//
	
	Если НЕ ЭтоИнтерактивноеЗачисление Тогда
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(ПроведениеОбучения);
	КонецЕсли;
	
	Возврат ПроведениеОбъект.Ссылка;
	
КонецФункции

Функция ЗачислитьУчастникаНаПрограммуОбучения(ПроведениеПрограммыОбучения, Пользователь, УчебнаяГруппа = Неопределено, Заявка = Неопределено, ОбновлятьСуществующее = Ложь, ОбновитьДанныеВебКабинета = Ложь, Знач ЭтоИнтерактивноеЗачисление = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеОПроведении = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеПрограммыОбучения,
		"ОткрытаяПрограмма, ДатаОткрытияЗаписи, ДатаЗакрытияЗаписи, МаксимальноеКоличествоУчастников, БезСценария, ПрограммаОбучения, Ссылка, Проведен");
	
	МаксимальноеКоличествоУчастников = ДанныеОПроведении.МаксимальноеКоличествоУчастников;
	
	Если МаксимальноеКоличествоУчастников > 0 Тогда
	
		КоличествоЗачисленныхУчастников  = Документы.ПроведениеПрограммыОбученияСУО.КоличествоУчастниковПрограммыОбучения(ПроведениеПрограммыОбучения);
		
		Если КоличествоЗачисленныхУчастников >= МаксимальноеКоличествоУчастников Тогда			
			Текст = НСтр("ru = 'Пользователь %1 не может быть зачислен на программу обучения. Превышено допустимое количество участников'");
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, Пользователь);
			Если ЭтоИнтерактивноеЗачисление Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);			
			Иначе
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Зачисление участника на программу обучения'"),
					УровеньЖурналаРегистрации.Предупреждение,,ПроведениеПрограммыОбучения,Текст);
			КонецЕсли;
			Возврат Неопределено;			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДанныеОПроведении.ОткрытаяПрограмма Тогда
		
		Если ЗначениеЗаполнено(ДанныеОПроведении.ДатаОткрытияЗаписи)
			И ТекущаяДата() < ДанныеОПроведении.ДатаОткрытияЗаписи Тогда		
			Текст = НСтр("ru = 'Пользователь %1 не может быть зачислен на программу обучения. Запись будет открыта с %2'");
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, Пользователь, ДанныеОПроведении.ДатаОткрытияЗаписи);
			Если ЭтоИнтерактивноеЗачисление Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);			
			Иначе
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Зачисление участника на программу обучения'"),
					УровеньЖурналаРегистрации.Предупреждение,,ПроведениеПрограммыОбучения,Текст);
			КонецЕсли;
			Возврат Неопределено;			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеОПроведении.ДатаЗакрытияЗаписи)
			И ТекущаяДата() > ДанныеОПроведении.ДатаЗакрытияЗаписи Тогда		
			Текст = НСтр("ru = 'Пользователь %1 не может быть зачислен на программу обучения. Запись была доступна до %2'");
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, Пользователь, ДанныеОПроведении.ДатаЗакрытияЗаписи);
			Если ЭтоИнтерактивноеЗачисление Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);			
			Иначе
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Зачисление участника на программу обучения'"),
					УровеньЖурналаРегистрации.Предупреждение,,ПроведениеПрограммыОбучения,Текст);
			КонецЕсли;
			Возврат Неопределено;			
		КонецЕсли;
		
	КонецЕсли;
	
	СуществующееПрохождение = Документы.ПроведениеПрограммыОбученияСУО.ПрохождениеПрограммыОбучения(ПроведениеПрограммыОбучения, Пользователь);
	
	Если НЕ ЭтоИнтерактивноеЗачисление
		И НЕ ЗначениеЗаполнено(СуществующееПрохождение)
		И Документы.ПроведениеПрограммыОбученияСУО.ЕстьОтмененныеПрохождения(ПроведениеПрограммыОбучения, Пользователь) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Если НЕ ОбновлятьСуществующее
		И ЗначениеЗаполнено(СуществующееПрохождение) Тогда
		
		Возврат СуществующееПрохождение;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СуществующееПрохождение) Тогда
		
		ПрохождениеОбъект = СуществующееПрохождение.ПолучитьОбъект();
		
	Иначе
		
		ПрохождениеОбъект = Документы.ПрохождениеПрограммыОбученияСУО.СоздатьДокумент();
		
		ПрохождениеОбъект.Дата                        = ТекущаяДата();
		ПрохождениеОбъект.Пользователь                = Пользователь;
		ПрохождениеОбъект.Сценарий                    = Документы.ПроведениеПрограммыОбученияСУО.СценарийОбучения(ДанныеОПроведении);
		ПрохождениеОбъект.ПроведениеПрограммыОбучения = ПроведениеПрограммыОбучения;
		ПрохождениеОбъект.Статус                      = Перечисления.СтатусыПрохожденияОбъектовСУО.Зачислен;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УчебнаяГруппа) Тогда
		ПрохождениеОбъект.УчебнаяГруппа = УчебнаяГруппа;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Заявка) Тогда
		ПрохождениеОбъект.Заявка = Заявка;
	КонецЕсли;
	
	ЭтоНовоеИнтерактивноеЗачисление = ПрохождениеОбъект.ЭтоНовый() И ЭтоИнтерактивноеЗачисление;
	
	Если НЕ ЭтоНовоеИнтерактивноеЗачисление И ДанныеОПроведении.Проведен И НЕ ПрохождениеОбъект.ПометкаУдаления Тогда
		
		ПрохождениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
		ТаблицаМероприятий = Документы.ПроведениеПрограммыОбученияСУО.ПроведенияОбучения(ПроведениеПрограммыОбучения);
			
		Для каждого Строка Из ТаблицаМероприятий Цикл		
			ЗачислитьУчастникаНаОбучение(Строка.ПроведениеОбучения, Строка.Мероприятие, Пользователь, УчебнаяГруппа,,,Ложь,, ОбновитьДанныеВебКабинета, ЭтоИнтерактивноеЗачисление, Истина);
		КонецЦикла;

		УправлениеОбучениемСУО.СоздатьАвтоматическуюРассылку(ПрохождениеОбъект);
		
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(ПроведениеПрограммыОбучения);		
		
	Иначе
		
		ПрохождениеОбъект.ДополнительныеСвойства.Вставить("НеОбновлятьДанныеВебКабинета", Истина);
		ПрохождениеОбъект.Записать(РежимЗаписиДокумента.Запись);
		
	КонецЕсли;	
	
	Возврат ПрохождениеОбъект.Ссылка;
	
КонецФункции

#КонецОбласти

#Область Пользователи

Функция ВходВПрограммуРазрешен(Пользователь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВходВПрограммуРазрешен = Ложь;
	
	ВходВПрограммуРазрешен = Пользователи.ВходВПрограммуРазрешен(Пользователь);
	
	Если НЕ ВходВПрограммуРазрешен
		И ВебКабинетСУ.Используется() Тогда
		
		ВходВПрограммуРазрешен = РегистрыСведений.ПользователиВебКабинетаСУ.ПользовательСуществует(,Пользователь); 
		
	КонецЕсли;
	
	Возврат ВходВПрограммуРазрешен;
	
КонецФункции

Процедура УстановитьКонстантуИспользоватьТолькоПользователейСУ() Экспорт
	УстановитьПривилегированныйРежим(Истина);	
	ИспользоватьСотрудников = Константы.ИспользоватьСотрудниковСУО.Получить();
	ИспользоватьСтудентов = Константы.ИспользоватьСтудентовСУО.Получить();
	ИспользоватьСлушателей = Константы.ИспользоватьСлушателейСУО.Получить();	
	ИспользоватьТолькоПользователей = НЕ ИспользоватьСотрудников И НЕ ИспользоватьСтудентов И НЕ ИспользоватьСлушателей; 
	Константы.ИспользоватьТолькоПользователейСУ.Установить(ИспользоватьТолькоПользователей);
КонецПроцедуры

Функция ОбязательныеРеквизитыСлушателяУЦ() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеРеквизитыИСведения.Ссылка,
		|	ДополнительныеРеквизитыИСведения.Заголовок
		|ИЗ
		|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
		|ГДЕ
		|	ДополнительныеРеквизитыИСведения.НаборСвойств = &НаборСвойствПользователи
		|	И ДополнительныеРеквизитыИСведения.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("НаборСвойствПользователи", УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Пользователи"));
	
	ТаблицаРеквизитовВБазе = Запрос.Выполнить().Выгрузить();
		
	ТаблицаРеквизитов = Новый ТаблицаЗначений;
	ТаблицаРеквизитов.Колонки.Добавить("Наименование");
	ТаблицаРеквизитов.Колонки.Добавить("НаименованиеАнгл");
	ТаблицаРеквизитов.Колонки.Добавить("ИмяРеквизита");
	ТаблицаРеквизитов.Колонки.Добавить("АвтоСсылка");
	ТаблицаРеквизитов.Колонки.Добавить("Ссылка");
	ТаблицаРеквизитов.Колонки.Добавить("Существует");
	ТаблицаРеквизитов.Колонки.Добавить("ТипЗначения");
	ТаблицаРеквизитов.Колонки.Добавить("Варианты");
	ТаблицаРеквизитов.Колонки.Добавить("КвалификаторыДаты");	
	ТаблицаРеквизитов.Колонки.Добавить("ИмяПоляФормы");
	
	// Поля: СНИЛС, Дата рождения, Пол (выбор из списка Муж/Жен)
		
	ТаблицаВариантов = Новый ТаблицаЗначений;
	ТаблицаВариантов.Колонки.Добавить("Наименование");
	ТаблицаВариантов.Колонки.Добавить("Идентификатор");
	НоваяСтрокаТВ = ТаблицаВариантов.Добавить();
	НоваяСтрокаТВ.Идентификатор = "2b7b803e-d429-4c63-ac0d-3cf608304738";
	НоваяСтрокаТВ.Наименование = "Мужской";
	НоваяСтрокаТВ = ТаблицаВариантов.Добавить();
	НоваяСтрокаТВ.Идентификатор = "b9a8d565-750e-42de-bc0a-eb0ccd7f4519";
	НоваяСтрокаТВ.Наименование = "Женский";
	ЗаполнитьТаблицуОбязательныхРеквизитовСлушателяУЦ(ТаблицаРеквизитов, ТаблицаРеквизитовВБазе, "Пол", "Sex", "Пол", "Gender", "e004ecbc-060b-4e57-ba2a-e7369a44509e", "СправочникСсылка.ЗначенияСвойствОбъектов", ТаблицаВариантов);

	ЗаполнитьТаблицуОбязательныхРеквизитовСлушателяУЦ(ТаблицаРеквизитов, ТаблицаРеквизитовВБазе, "Дата рождения", "Birthday", "ДатаРождения", "Birthday" , "57333403-c823-4ae8-a922-7d215f565ec9", "Дата",, Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ЗаполнитьТаблицуОбязательныхРеквизитовСлушателяУЦ(ТаблицаРеквизитов, ТаблицаРеквизитовВБазе, "СНИЛС", "PFR number", "СтраховойНомерПФР", "PFRNumber", "bf6339f3-3dea-459e-a959-c66557d97061", "Строка");
	
	Возврат ТаблицаРеквизитов;
	
КонецФункции

Процедура ЗаполнитьТаблицуОбязательныхРеквизитовСлушателяУЦ(ТаблицаРеквизитов, ТаблицаРеквизитовВБазе, Наименование, НаименованиеАнгл, ИмяРеквизита, ИмяПоляФормы, АвтоИдентификатор, ТипЗначения, Варианты = Неопределено, КвалификаторыДаты = Неопределено)
	
	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.Наименование = Наименование;	
	НоваяСтрока.АвтоСсылка = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПолучитьСсылку(
		Новый УникальныйИдентификатор(АвтоИдентификатор)); 
	НоваяСтрока.ТипЗначения = ТипЗначения;
	НоваяСтрока.Варианты = Варианты;
	НоваяСтрока.Существует = Ложь;
	НоваяСтрока.КвалификаторыДаты = КвалификаторыДаты;
	НоваяСтрока.ИмяРеквизита = ИмяРеквизита;
	НоваяСтрока.ИмяПоляФормы = ИмяПоляФормы;
	НоваяСтрока.НаименованиеАнгл = НаименованиеАнгл;

	Если НЕ НоваяСтрока.Существует Тогда
		НайденнаяСтрока = ТаблицаРеквизитовВБазе.Найти(НоваяСтрока.АвтоСсылка, "Ссылка");	
		Если НайденнаяСтрока <> Неопределено Тогда
			НоваяСтрока.Ссылка = НоваяСтрока.АвтоСсылка;
			НоваяСтрока.Существует = Истина;
		КонецЕсли;	
	КонецЕсли;
	
	Если НЕ НоваяСтрока.Существует Тогда
		НайденнаяСтрока = ТаблицаРеквизитовВБазе.Найти(НоваяСтрока.Наименование, "Заголовок");
		Если НайденнаяСтрока <> Неопределено Тогда
			НоваяСтрока.Ссылка = НайденнаяСтрока.Ссылка;
			НоваяСтрока.Существует = Истина;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Процедура УстановитьОбязательныеРеквизитыСлушателяУЦ() Экспорт
		
	ТаблицаРеквизитов = ОбязательныеРеквизитыСлушателяУЦ();
	
	НачатьТранзакцию();
	
	Попытка
		
		Для каждого Строка Из ТаблицаРеквизитов Цикл
			
			Если Строка.Существует Тогда
				НовыйРеквизитОбъект = Строка.Ссылка.ПолучитьОбъект();
			Иначе
				НовыйРеквизитОбъект = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
				НовыйРеквизитОбъект.УстановитьСсылкуНового(Строка.АвтоСсылка);
			КонецЕсли;						
			
			НовыйРеквизитОбъект.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 (Пользователь)'"), Строка.Наименование);
			
			Если Строка.ТипЗначения = "СправочникСсылка.ЗначенияСвойствОбъектов" Тогда			
				НовыйРеквизитОбъект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойствОбъектов");
				НовыйРеквизитОбъект.ДополнительныеЗначенияИспользуются = Истина;
			ИначеЕсли Строка.ТипЗначения = "Дата" Тогда
				НовыйРеквизитОбъект.ТипЗначения = Новый ОписаниеТипов(Строка.ТипЗначения,,,,, Строка.КвалификаторыДаты);
			Иначе			
				НовыйРеквизитОбъект.ТипЗначения = Новый ОписаниеТипов(Строка.ТипЗначения);			
			КонецЕсли;
			
			НовыйРеквизитОбъект.Заголовок = Строка.Наименование;
			НовыйРеквизитОбъект.НаборСвойств = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Пользователи");
			НовыйРеквизитОбъект.Записать();
			
			НовыйРеквизит = НовыйРеквизитОбъект.Ссылка;
									
			НаборСвойствОбъект = НовыйРеквизитОбъект.НаборСвойств.ПолучитьОбъект();
			ТабличнаяЧасть = НаборСвойствОбъект.ДополнительныеРеквизиты;
			НайденнаяСтрока = ТабличнаяЧасть.Найти(НовыйРеквизит, "Свойство");
			Если НайденнаяСтрока = Неопределено Тогда
				НоваяСтрока = ТабличнаяЧасть.Добавить();
				НоваяСтрока.Свойство = НовыйРеквизит;
				НаборСвойствОбъект.Записать();
			Иначе
				НаборСвойствОбъект = Неопределено;
			КонецЕсли;
			
			Если Строка.ТипЗначения = "СправочникСсылка.ЗначенияСвойствОбъектов" Тогда			
				Для каждого СтрокаТВ Из Строка.Варианты Цикл
					СуществующийВариантСсылка = Справочники.ЗначенияСвойствОбъектов.ПолучитьСсылку(
						Новый УникальныйИдентификатор(СтрокаТВ.Идентификатор));
					Если НЕ ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(СуществующийВариантСсылка) Тогда
							СуществующийВариантСсылка = Неопределено;
					КонецЕсли;
					Если СуществующийВариантСсылка = Неопределено Тогда
						СуществующийВариантСсылка = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(СтрокаТВ.Наименование,,,НовыйРеквизит);
					КонецЕсли;
					Если ЗначениеЗаполнено(СуществующийВариантСсылка) Тогда
						ЗначенияСвойстваОбъект = СуществующийВариантСсылка.ПолучитьОбъект();
					Иначе
						ЗначенияСвойстваОбъект = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
						ЗначенияСвойстваОбъект.Владелец = НовыйРеквизит;
					КонецЕсли;												
					ЗначенияСвойстваОбъект.Наименование = СтрокаТВ.Наименование;
					ЗначенияСвойстваОбъект.Записать();					
				КонецЦикла;			
			КонецЕсли;
			
		КонецЦикла;	
		
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗагрузитьПользователей(ДанныеСтрока) Экспорт
	
	ТелоХранилище = XMLЗначение(Тип("ХранилищеЗначения"), ДанныеСтрока);	
	СтруктураДанных = ТелоХранилище.Получить();
	
	Если ТипЗнч(СтруктураДанных) <> Тип("Структура") Тогда
		ВызватьИсключение НСтр("ru = 'Неверный формат структуры данных'");													
	КонецЕсли;
	
	// Загружаем данные
	
	НачатьТранзакцию();
	
	Попытка
		
		УстановитьПривилегированныйРежим(Истина);
		
		// Формируем группы пользователей на основе групп физических лиц
		
		Если СтруктураДанных.Свойство("ГруппыФизическихЛиц") Тогда
			УправлениеОбучениемСУО.ЗагрузитьГруппыПользователейИзГруппФизическихЛиц(СтруктураДанных.ГруппыФизическихЛиц);
		КонецЕсли;
		
		// Формируем должности
		
		Если СтруктураДанных.Свойство("Должности") Тогда
			УправлениеОбучениемСУО.ЗагрузитьДолжности(СтруктураДанных.Должности);
		КонецЕсли;		
		
		// Формируем структуру предприятия
		
		Если СтруктураДанных.Свойство("СтруктураПредприятия") Тогда
			УправлениеОбучениемСУО.ЗагрузитьСтруктуруПредприятия(СтруктураДанных.СтруктураПредприятия);
		КонецЕсли;				
		
		// Формируем организации
		
		Если СтруктураДанных.Свойство("Организации") Тогда
			УправлениеОбучениемСУО.ЗагрузитьОрганизации(СтруктураДанных.Организации);
		КонецЕсли;			
		
		// Формируем подразделения организаций
		
		Если СтруктураДанных.Свойство("ПодразделенияОрганизаций") Тогда
			УправлениеОбучениемСУО.ЗагрузитьПодразделенияОрганизаций(СтруктураДанных.ПодразделенияОрганизаций);
		КонецЕсли;			
		
		// Формируем пользователей из физических лиц
		
		Если СтруктураДанных.Свойство("ФизическиеЛицаСотрудников") Тогда
			УправлениеОбучениемСУО.ЗагрузитьПользователейИзФизическихЛицСотрудников(СтруктураДанных.ФизическиеЛицаСотрудников);
		КонецЕсли;			
		
		Если СтруктураДанных.Свойство("ФизическиеЛицаУУЦ") Тогда
			УправлениеОбучениемСУО.ЗагрузитьФизическиеЛицаУУЦ(СтруктураДанных.ФизическиеЛицаУУЦ);
		КонецЕсли;

		// Формируем сотрудников и их кадровые данные
		
		Если СтруктураДанных.Свойство("КадровыеДанныеСотрудников") Тогда
			УправлениеОбучениемСУО.ЗагрузитьСотрудниковПоКадровымДанным(СтруктураДанных.КадровыеДанныеСотрудников);
		КонецЕсли;
		
		// Указываем состояния сотрудников		
		
		Если СтруктураДанных.Свойство("СостоянияСотрудников") Тогда
			УправлениеОбучениемСУО.ЗагрузитьВозможностьУчиться(СтруктураДанных.СостоянияСотрудников);
		КонецЕсли;
		
		// Завершаем
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

Функция ЕстьРольПреподавателя(Пользователь = Неопределено) Экспорт
	
	Возврат УправлениеДоступом.ЕстьРоль("ЛичныйКабинетПреподавательОбученияСУО",,Пользователь);
	
КонецФункции

#КонецОбласти

#Область ЗагрузкаДанных

// Кадры

Процедура ЗагрузитьВозможностьУчиться(СостоянияСотрудников) Экспорт
	
	// Колонки таблицы: Начало, Окончание, ОкончаниеПредположительно, Состояние, Сотрудник, ФизическоеЛицо
	
	ТаблицаСсылочныхЗначений = ПустаяТаблицаСсылочныхЗначений();
	
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "ФизическоеЛицо";
	НоваяСтрока.Тип = "Справочник.Пользователи";
		
	ПодготовитьТаблицуКЗагрузке(СостоянияСотрудников, ТаблицаСсылочныхЗначений);	
	
	НачатьТранзакцию();
	
	Попытка
		
		Для каждого Строка Из СостоянияСотрудников Цикл
			
			Если НЕ ЗначениеЗаполнено(Строка.Начало) Тогда
				Продолжить;
			КонецЕсли;
			
			МожетУчиться = (Строка.Состояние.Идентификатор = "Работа");
			
			Если ЗначениеЗаполнено(Строка.Окончание) Тогда
				
				ТекущийПериод = Строка.Начало;
				Пока ТекущийПериод <= Строка.Окончание Цикл
					РегистрыСведений.ВозможностиУчитьсяСУО.УстановитьЗагруженноеЗначение(
						Строка.ФизическоеЛицо, ТекущийПериод, Ложь, МожетУчиться);
					ТекущийПериод = КонецДня(ТекущийПериод) + 1;						
				КонецЦикла;					
				
			Иначе
				РегистрыСведений.ВозможностиУчитьсяСУО.УстановитьЗагруженноеЗначение(
					Строка.ФизическоеЛицо, Строка.Начало, Истина, МожетУчиться);
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;	
	
КонецПроцедуры

Процедура ЗагрузитьСотрудниковПоКадровымДанным(КадровыеДанные) Экспорт
	
	// Колонки таблицы КадровыеДанные: ВидЗанятости, ДатаЗавершенияРаботы, ДатаПриема, Должность,
	// ДолжностьПоШтатномуРасписанию, МестоВСтруктуреПредприятия, Организация, Период, Подразделение, Состояние,
	// СостояниеПериодРегистрации, Сотрудник, ФизическоеЛицо.
	
	ТаблицаСсылочныхЗначений = ПустаяТаблицаСсылочныхЗначений();
	
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "Должность";
	НоваяСтрока.Тип = "Справочник.ДолжностиСУО";
	
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "МестоВСтруктуреПредприятия";
	НоваяСтрока.Тип = "Справочник.ПодразделенияПредприятияСУО";	
	
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "Организация";
	НоваяСтрока.Тип = "Справочник.Организации";
	
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "Подразделение";
	НоваяСтрока.Тип = "Справочник.ПодразделенияОрганизацииСУО";
	
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "ФизическоеЛицо";
	НоваяСтрока.Тип = "Справочник.Пользователи";	
	
	ПодготовитьТаблицуКЗагрузке(КадровыеДанные, ТаблицаСсылочныхЗначений);	
	
	НачатьТранзакцию();
	
	Попытка
		
		Для каждого Строка Из КадровыеДанные Цикл
			
			Если НЕ ЗначениеЗаполнено(Строка.СостояниеПериодРегистрации) Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Строка.ФизическоеЛицо) Тогда
				Продолжить;
			КонецЕсли;			
			
			МенеджерЗаписи = РегистрыСведений.СотрудникиСУО.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период       = Строка.СостояниеПериодРегистрации;
			МенеджерЗаписи.Пользователь = Строка.ФизическоеЛицо;
			МенеджерЗаписи.Уволен = Значениезаполнено(Строка.ДатаЗавершенияРаботы);
			МенеджерЗаписи.Организация = Строка.Организация;
			МенеджерЗаписи.ТабельныйНомер = Строка.ТабельныйНомер;			
			МенеджерЗаписи.ПодразделениеОрганизации = Строка.Подразделение;
			МенеджерЗаписи.ПодразделениеПредприятия = Строка.МестоВСтруктуреПредприятия;
			МенеджерЗаписи.Должность = Строка.Должность;
			
			МенеджерЗаписи.Записать();
			
			ОбновитьДанныеСотрудников(МенеджерЗаписи.Пользователь);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;		
	
КонецПроцедуры

Процедура ЗагрузитьПользователейИзФизическихЛицСотрудников(ТаблицаДанных) Экспорт
	
	ИспользуетсяВебКабинет = ВебКабинетСУ.Используется();
	
	// Колонки таблицы:	Ссылка, ФИО, Код, ДатаИзменения, Родитель, ЭлектроннаяПочта
	
	ИмяСправочника = "Пользователи";
	
	ТаблицаСсылочныхЗначений = ПустаяТаблицаСсылочныхЗначений();
	
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "Ссылка";
	НоваяСтрока.Тип = "Справочник." + ИмяСправочника;

	Если ТаблицаДанных.Колонки.Найти("Родитель") <> Неопределено Тогда
		
		НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
		НоваяСтрока.ИмяКолонки = "Родитель";
		НоваяСтрока.Тип = "Справочник.ГруппыПользователей";
		
	КонецЕсли;
		
	ПодготовитьТаблицуКЗагрузке(ТаблицаДанных, ТаблицаСсылочныхЗначений);
	
	НачатьТранзакцию();
	
	Попытка
		
		МассивГруппПользователей = Новый Массив;
		МассивГруппПользователей.Добавить(Справочники.ГруппыПользователей.ВсеПользователи);
		
		Для каждого Строка Из ТаблицаДанных Цикл
			
			// Обновляем пользователя
			
			Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(Строка.Ссылка) Тогда
				ЭлементОбъект = Строка.Ссылка.ПолучитьОбъект();
			Иначе
				ЭлементОбъект = Справочники[ИмяСправочника].СоздатьЭлемент();
				ЭлементОбъект.УстановитьСсылкуНового(Строка.Ссылка);
			КонецЕсли;
			
			ЭлементОбъект.Наименование = Строка.ФИО;		
			
			Если ТаблицаДанных.Колонки.Найти("Код") <> Неопределено Тогда
				ЭлементОбъект.Код = Строка.Код;
			КонецЕсли;				
			
			// Обновляем контактную информацию
			
			КонтактнаяИнформацияДляЗаполнения = УправлениеКонтактнойИнформацией.НоваяКонтактнаяИнформация(Ложь);
						
			Если ТаблицаДанных.Колонки.Найти("ЭлектроннаяПочта") <> Неопределено
				И ЗначениеЗаполнено(Строка.ЭлектроннаяПочта) Тогда
				
				СтрокаЗаполнения = КонтактнаяИнформацияДляЗаполнения.Добавить();
				СтрокаЗаполнения.Вид = Справочники.ВидыКонтактнойИнформации.EmailПользователя;
				СтрокаЗаполнения.Представление = СокрЛП(Строка.ЭлектроннаяПочта);
				
			КонецЕсли;		
			
			Если ТаблицаДанных.Колонки.Найти("МобильныйТелефон") <> Неопределено
				И ЗначениеЗаполнено(Строка.МобильныйТелефон) Тогда
				
				СтрокаЗаполнения = КонтактнаяИнформацияДляЗаполнения.Добавить();
				СтрокаЗаполнения.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонПользователя;
				СтрокаЗаполнения.Представление = СокрЛП(Строка.МобильныйТелефон);
			
			КонецЕсли;
			
			Если КонтактнаяИнформацияДляЗаполнения.Количество() > 0 Тогда			
				УправлениеКонтактнойИнформацией.УстановитьКонтактнуюИнформациюОбъекта(ЭлементОбъект, КонтактнаяИнформацияДляЗаполнения, Истина);
			КонецЕсли;
						
			// Устанавливаем свойства пользователя ИБ, если он еще не является пользователем базы
			
			Если ТаблицаДанных.Колонки.Найти("ОписаниеПользователяИБ") <> Неопределено
				И ТипЗнч(Строка.ОписаниеПользователяИБ) = Тип("Структура") Тогда
				
				ОписаниеПользователяИБ = Новый Структура;				
				ОписаниеПользователяИБ.Вставить("Действие", "Записать");
				ОписаниеПользователяИБ.Вставить("Имя", Строка.ОписаниеПользователяИБ.Имя);
				ОписаниеПользователяИБ.Вставить("СохраняемоеЗначениеПароля", Строка.ОписаниеПользователяИБ.СохраняемоеЗначениеПароля);
				ОписаниеПользователяИБ.Вставить("ПользовательОС", Строка.ОписаниеПользователяИБ.ПользовательОС);
				ОписаниеПользователяИБ.Вставить("АутентификацияOpenID", Строка.ОписаниеПользователяИБ.АутентификацияOpenID);
				ОписаниеПользователяИБ.Вставить("АутентификацияСтандартная", Строка.ОписаниеПользователяИБ.АутентификацияСтандартная);
				ОписаниеПользователяИБ.Вставить("АутентификацияОС", Строка.ОписаниеПользователяИБ.АутентификацияОС);
				ОписаниеПользователяИБ.Вставить("ЗапрещеноИзменятьПароль", Строка.ОписаниеПользователяИБ.ЗапрещеноИзменятьПароль);
				ОписаниеПользователяИБ.Вставить("ПоказыватьВСпискеВыбора", Строка.ОписаниеПользователяИБ.ПоказыватьВСпискеВыбора);								
				ОписаниеПользователяИБ.Вставить("РежимЗапуска", Строка.ОписаниеПользователяИБ.РежимЗапуска);				
				
				Если НЕ ЗначениеЗаполнено(ЭлементОбъект.ИдентификаторПользователяИБ)
					И ИспользуетсяВебКабинет Тогда

					ЭлементОбъект.ДополнительныеСвойства.Вставить("АутентификацияВебКабинета", Истина);
					
				ИначеЕсли ЗначениеЗаполнено(ЭлементОбъект.Ссылка) Тогда
					
					ЭлементОбъект.ДополнительныеСвойства.Вставить("АутентификацияВебКабинета",
						РегистрыСведений.ПользователиВебКабинетаСУ.ПользовательСуществует(, ЭлементОбъект.Ссылка));
					
				КонецЕсли;
				
				ЭлементОбъект.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);
				
			КонецЕсли;
			
			Если ТаблицаДанных.Колонки.Найти("НедействительныйПользователь") <> Неопределено 
				И ТипЗнч(Строка.НедействительныйПользователь) = Тип("Булево") Тогда
				ЭлементОбъект.Недействителен = Строка.НедействительныйПользователь;				
			КонецЕсли;
			
			ЭлементОбъект.Записать(); // Обязательно записывать объект, чтобы отработали все подписки
			
			// Обновляем дополнительные реквизиты
			
			Если ПолучитьФункциональнуюОпцию("ИспользоватьСлушателейСУО") Тогда
				
				ТаблицаРеквизитовУЦ = ОбязательныеРеквизитыСлушателяУЦ();
				
				ТаблицаСвойств = Новый ТаблицаЗначений;
				ТаблицаСвойств.Колонки.Добавить("Свойство");
				ТаблицаСвойств.Колонки.Добавить("Значение");
				
				Для каждого СтрокаТР Из ТаблицаРеквизитовУЦ Цикл
					
					Если СтрокаТР.Существует
						И ТаблицаДанных.Колонки.Найти(СтрокаТР.ИмяРеквизита) <> Неопределено
						И ЗначениеЗаполнено(Строка[СтрокаТР.ИмяРеквизита]) Тогда
						
						НоваяСтрокаТС = ТаблицаСвойств.Добавить();
						НоваяСтрокаТС.Свойство = СтрокаТР.Ссылка;
						
						Если СтрокаТР.ТипЗначения = "СправочникСсылка.ЗначенияСвойствОбъектов" Тогда
							НоваяСтрокаТС.Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(Строка[СтрокаТР.ИмяРеквизита].Идентификатор,,, СтрокаТР.Ссылка);
						Иначе
							НоваяСтрокаТС.Значение = Строка[СтрокаТР.ИмяРеквизита];
						КонецЕсли;
											
					КонецЕсли;
					
				КонецЦикла;
				
				Если ТаблицаСвойств.Количество() > 0 Тогда				
					УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(ЭлементОбъект.Ссылка, ТаблицаСвойств); 
				КонецЕсли;
				
			КонецЕсли;
			
			Если ТаблицаДанных.Колонки.Найти("Родитель") <> Неопределено Тогда
					
				// Добавляем пользователя в группу
				
				Если ЗначениеЗаполнено(Строка.Родитель) Тогда
					ГруппаДляДобавления = РодительскийЭлементСправочника(Строка.Родитель, Ложь);
					ГруппаДляДобавленияОбъект = ГруппаДляДобавления.ПолучитьОбъект();
					СтрокаСостава = ГруппаДляДобавленияОбъект.Состав.Добавить();
					СтрокаСостава.Пользователь = ЭлементОбъект.Ссылка;
					ОбновлениеИнформационнойБазы.ЗаписатьДанные(ГруппаДляДобавленияОбъект);
					Если МассивГруппПользователей.Найти(ГруппаДляДобавления) = Неопределено Тогда
						МассивГруппПользователей.Добавить(ГруппаДляДобавления);
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЦикла;	
		
		// Обновляем группы пользователей
		Для каждого ГруппаДляДобавления Из МассивГруппПользователей Цикл
			ПользователиСлужебный.ОбновитьСоставыГруппПользователей(ГруппаДляДобавления);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;		
		
КонецПроцедуры

Процедура ЗагрузитьПодразделенияОрганизаций(ТаблицаДанных) Экспорт
	
	// Колонки таблицы:	Код, Наименование, ПометкаУдаления, Родитель, Ссылка, ДатаИзменения, Владелец
	
	ИмяСправочника = "ПодразделенияОрганизацииСУО";
	
	ТаблицаСсылочныхЗначений = ПустаяТаблицаСсылочныхЗначений();
	
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "Ссылка";
	НоваяСтрока.Тип = "Справочник." + ИмяСправочника;
	
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "Родитель";
	НоваяСтрока.Тип = "Справочник." + ИмяСправочника;
	
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "Владелец";
	НоваяСтрока.Тип = "Справочник.Организации";	
	
	ПодготовитьТаблицуКЗагрузке(ТаблицаДанных, ТаблицаСсылочныхЗначений);
	
	НачатьТранзакцию();
	
	Попытка
		
		Для каждого Строка Из ТаблицаДанных Цикл
			
			Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(Строка.Ссылка) Тогда
				ЭлементОбъект = Строка.Ссылка.ПолучитьОбъект();
			Иначе
				ЭлементОбъект = Справочники[ИмяСправочника].СоздатьЭлемент();
				ЭлементОбъект.УстановитьСсылкуНового(Строка.Ссылка);
			КонецЕсли;
			
			ЭлементОбъект.ПометкаУдаления = Строка.ПометкаУдаления;
			ЭлементОбъект.Наименование = Строка.Наименование;
			ЭлементОбъект.Родитель = РодительскийЭлементСправочника(Строка.Родитель, Ложь);
			ЭлементОбъект.Владелец = Строка.Владелец;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементОбъект);
			
		КонецЦикла;	
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;	
	
КонецПроцедуры

Процедура ЗагрузитьОрганизации(ТаблицаДанных) Экспорт
	
	// Колонки таблицы:	Наименование, ПометкаУдаления, Ссылка, ДатаИзменения
	
	ИмяСправочника = "Организации";
	
	ТаблицаСсылочныхЗначений = ПустаяТаблицаСсылочныхЗначений();
	
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "Ссылка";
	НоваяСтрока.Тип = "Справочник." + ИмяСправочника;
	
	ПодготовитьТаблицуКЗагрузке(ТаблицаДанных, ТаблицаСсылочныхЗначений);
	
	НачатьТранзакцию();
	
	Попытка
		
		Для каждого Строка Из ТаблицаДанных Цикл
			
			Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(Строка.Ссылка) Тогда
				ЭлементОбъект = Строка.Ссылка.ПолучитьОбъект();
			Иначе
				ЭлементОбъект = Справочники[ИмяСправочника].СоздатьЭлемент();
				ЭлементОбъект.УстановитьСсылкуНового(Строка.Ссылка);
			КонецЕсли;
			
			ЭлементОбъект.ПометкаУдаления = Строка.ПометкаУдаления;
			ЭлементОбъект.Наименование = Строка.Наименование;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементОбъект);
			
		КонецЦикла;	
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;	
	
КонецПроцедуры

Процедура ЗагрузитьСтруктуруПредприятия(ТаблицаДанных) Экспорт
	
	// Колонки таблицы:	Код, Наименование, ПометкаУдаления, Родитель, Ссылка, ДатаИзменения
	
	ИмяСправочника = "ПодразделенияПредприятияСУО";
	
	ТаблицаСсылочныхЗначений = ПустаяТаблицаСсылочныхЗначений();
	
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "Ссылка";
	НоваяСтрока.Тип = "Справочник." + ИмяСправочника;
	
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "Родитель";
	НоваяСтрока.Тип = "Справочник." + ИмяСправочника;		
	
	ПодготовитьТаблицуКЗагрузке(ТаблицаДанных, ТаблицаСсылочныхЗначений);
	
	НачатьТранзакцию();
	
	Попытка
		
		Для каждого Строка Из ТаблицаДанных Цикл
			
			Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(Строка.Ссылка) Тогда
				ЭлементОбъект = Строка.Ссылка.ПолучитьОбъект();
			Иначе
				ЭлементОбъект = Справочники[ИмяСправочника].СоздатьЭлемент();
				ЭлементОбъект.УстановитьСсылкуНового(Строка.Ссылка);
			КонецЕсли;
			
			ЭлементОбъект.ПометкаУдаления = Строка.ПометкаУдаления;
			ЭлементОбъект.Наименование = Строка.Наименование;
			ЭлементОбъект.Родитель = РодительскийЭлементСправочника(Строка.Родитель, Ложь);
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементОбъект);
			
		КонецЦикла;	
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;	
	
КонецПроцедуры

Процедура ЗагрузитьДолжности(ТаблицаДанных) Экспорт
	
	// Колонки таблицы:	Наименование, ПометкаУдаления, Ссылка, ДатаИзменения
		
	ТаблицаСсылочныхЗначений = ПустаяТаблицаСсылочныхЗначений();
	
	ИмяСправочника = "ДолжностиСУО";
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "Ссылка";
	НоваяСтрока.Тип = "Справочник." + ИмяСправочника;
	
	ПодготовитьТаблицуКЗагрузке(ТаблицаДанных, ТаблицаСсылочныхЗначений);
	
	НачатьТранзакцию();
	
	Попытка
		
		Для каждого Строка Из ТаблицаДанных Цикл
			
			Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(Строка.Ссылка) Тогда
				ЭлементОбъект = Строка.Ссылка.ПолучитьОбъект();
			Иначе
				ЭлементОбъект = Справочники[ИмяСправочника].СоздатьЭлемент();
				ЭлементОбъект.УстановитьСсылкуНового(Строка.Ссылка);
			КонецЕсли;
			
			ЭлементОбъект.ПометкаУдаления = Строка.ПометкаУдаления;
			ЭлементОбъект.Наименование = Строка.Наименование;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементОбъект);
			
		КонецЦикла;	
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;	
	
КонецПроцедуры

Процедура ЗагрузитьГруппыПользователейИзГруппФизическихЛиц(ТаблицаГруппФизическихЛиц) Экспорт
	
	// Колонки таблицы: Ссылка, ПометкаУдаления, Родитель, Код, Наименование
	
	ТаблицаСсылочныхЗначений = ПустаяТаблицаСсылочныхЗначений();
	
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "Ссылка";
	НоваяСтрока.Тип = "Справочник.ГруппыПользователей";
	
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "Родитель";
	НоваяСтрока.Тип = "Справочник.ГруппыПользователей";	
	
	ПодготовитьТаблицуКЗагрузке(ТаблицаГруппФизическихЛиц, ТаблицаСсылочныхЗначений);
	
	НачатьТранзакцию();
	
	Попытка
		
		Для каждого Строка Из ТаблицаГруппФизическихЛиц Цикл
			
			Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(Строка.Ссылка) Тогда
				ГруппаОбъект = Строка.Ссылка.ПолучитьОбъект();
			Иначе
				ГруппаОбъект = Справочники.ГруппыПользователей.СоздатьЭлемент();
				ГруппаОбъект.УстановитьСсылкуНового(Строка.Ссылка);
			КонецЕсли;
			
			ГруппаОбъект.ПометкаУдаления = Строка.ПометкаУдаления;
			ГруппаОбъект.Родитель = РодительскийЭлементСправочника(Строка.Родитель, Ложь);
			ГруппаОбъект.Наименование = Строка.Наименование;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ГруппаОбъект);
			
		КонецЦикла;	
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
		
КонецПроцедуры

Функция ПустаяТаблицаСсылочныхЗначений() Экспорт
	ТаблицаСсылочныхЗначений = Новый ТаблицаЗначений;
	ТаблицаСсылочныхЗначений.Колонки.Добавить("ИмяКолонки");
	ТаблицаСсылочныхЗначений.Колонки.Добавить("Тип");
	Возврат ТаблицаСсылочныхЗначений;
КонецФункции

Процедура ПодготовитьТаблицуКЗагрузке(ТаблицаЭлементов, ТаблицаСсылочныхЗначений) Экспорт
	
	Для каждого СтрокаТЭ Из ТаблицаЭлементов Цикл
		Для каждого СтрокаТСЗ Из ТаблицаСсылочныхЗначений Цикл
			СтрокаТЭ[СтрокаТСЗ.ИмяКолонки] = СтруктураВСсылку(СтрокаТЭ[СтрокаТСЗ.ИмяКолонки], СтрокаТСЗ.Тип);
		КонецЦикла;	
	КонецЦикла;
	
КонецПроцедуры

Функция СтруктураВСсылку(СтруктураСсылки, ПолноеИмяОбъектаМетаданных)
	Если ТипЗнч(СтруктураСсылки) = Тип("Структура") Тогда
		Возврат ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъектаМетаданных).ПолучитьСсылку(
			Новый УникальныйИдентификатор(СтруктураСсылки.Идентификатор));
	Иначе		
		Возврат ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъектаМетаданных).ПустаяСсылка();
	КонецЕсли;
КонецФункции

Функция РодительскийЭлементСправочника(Ссылка, ЭтоГруппа)
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Ссылка;
	КонецЕсли;
	
	Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(Ссылка) Тогда
		Возврат Ссылка;
	Иначе
		МенеджерЭлемента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Ссылка);
		Если ЭтоГруппа Тогда
			ЭлементОбъект = МенеджерЭлемента.СоздатьГруппу();
		Иначе
			ЭлементОбъект = МенеджерЭлемента.СоздатьЭлемент();
		КонецЕсли;
		ЭлементОбъект.УстановитьСсылкуНового(Ссылка);
		ЭлементОбъект.Наименование = НСтр("ru = '<Не указан>'");
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементОбъект);
		Возврат ЭлементОбъект.Ссылка;
	КонецЕсли;
	
КонецФункции

// Управление обучением

Процедура ЗагрузитьПроведенияОбучения(ТаблицаПроведенийОбучения, ЗагруженоИзУУЦ = Ложь) Экспорт
	
	ТаблицаСсылочныхЗначенийПО = ПустаяТаблицаСсылочныхЗначений();
	
	НоваяСтрока = ТаблицаСсылочныхЗначенийПО.Добавить();
	НоваяСтрока.ИмяКолонки = "Ссылка";
	НоваяСтрока.Тип = "Документ.ПроведениеОбученияСУО";	
	
	Если ТаблицаПроведенийОбучения.Колонки.Найти("ВидМероприятия") = Неопределено Тогда	
		
		ТаблицаПроведенийОбучения.Колонки.Добавить("ВидМероприятия");
		ТаблицаПроведенийОбучения.Колонки.Добавить("НаименованиеВидаМероприятия");
		
		Для каждого СтрокаТПО Из ТаблицаПроведенийОбучения Цикл
			СтрокаТПО.ВидМероприятия = Справочники.ВидыМероприятийСУО.ПолучитьСсылку(
				Новый УникальныйИдентификатор("3e2965cc-7c51-468c-a5e1-db5ac62aa035"));
			СтрокаТПО.НаименованиеВидаМероприятия = НСтр("ru = 'Обучение учебного центра (по умолчанию)'");		
		КонецЦикла;
		
	Иначе		
		
		НоваяСтрока = ТаблицаСсылочныхЗначенийПО.Добавить();
		НоваяСтрока.ИмяКолонки = "ВидМероприятия";
		НоваяСтрока.Тип = "Справочник.ВидыМероприятийСУО";
		
	КонецЕсли;
	
	Если ТаблицаПроведенийОбучения.Колонки.Найти("Преподаватель") <> Неопределено Тогда	
		НоваяСтрока = ТаблицаСсылочныхЗначенийПО.Добавить();
		НоваяСтрока.ИмяКолонки = "Преподаватель";
		НоваяСтрока.Тип = "Справочник.Пользователи";	
	КонецЕсли;
	
	Если ТаблицаПроведенийОбучения.Колонки.Найти("ПрограммаОбучения") <> Неопределено Тогда	
		НоваяСтрока = ТаблицаСсылочныхЗначенийПО.Добавить();
		НоваяСтрока.ИмяКолонки = "ПрограммаОбучения";
		НоваяСтрока.Тип = "Справочник.КаталогПрограммОбученияСУО";	
	КонецЕсли;
	
	Если ТаблицаПроведенийОбучения.Колонки.Найти("ГруппаСлушателей") <> Неопределено Тогда	
		НоваяСтрока = ТаблицаСсылочныхЗначенийПО.Добавить();
		НоваяСтрока.ИмяКолонки = "ГруппаСлушателей";
		НоваяСтрока.Тип = "Справочник.УчебныеГруппыУЦ";	
	КонецЕсли;
		
	ПодготовитьТаблицуКЗагрузке(ТаблицаПроведенийОбучения, ТаблицаСсылочныхЗначенийПО);		
	
	Для каждого Строка Из ТаблицаПроведенийОбучения Цикл
		
		// Создаем вид обучения
				
		ВидМероприятия = Строка.ВидМероприятия;
			
		Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ВидМероприятия) Тогда
			ВидМероприятияОбъект = ВидМероприятия.ПолучитьОбъект();
		Иначе
			ВидМероприятияОбъект = Справочники.ВидыМероприятийСУО.СоздатьЭлемент();
			ВидМероприятияОбъект.УстановитьСсылкуНового(ВидМероприятия);
			ВидМероприятияОбъект.Электронное = Истина;
			ВидМероприятияОбъект.ТребуетсяПреподаватель = Истина;
			ВидМероприятияОбъект.ВыставляетсяОценка = Истина;
			ВидМероприятияОбъект.ЗакрытьДоступКМатериаламПослеЗавершения = Ложь;
			ВидМероприятияОбъект.ЗавершатьАвтоматически = Истина;
			ВидМероприятияОбъект.ВремяИзученияЭлектронныхКурсов = Перечисления.ВариантыОтображенияВремениИзученияЭлектронногоРесурсаСУО.НеПоказывать;
		КонецЕсли;
		
		ВидМероприятияОбъект.Наименование = Строка.НаименованиеВидаМероприятия;						
		ВидМероприятияОбъект.Записать();
						
		// Создаем проведение обучения
		
		ПроведениеОбучения = Строка.Ссылка;
		
		Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ПроведениеОбучения) Тогда
			
			ПроведениеОбученияОбъект = ПроведениеОбучения.ПолучитьОбъект();
			
		Иначе
			
			ПроведениеОбученияДляКопирования = Неопределено;
			Если ТаблицаПроведенийОбучения.Колонки.Найти("ПрограммаОбучения") <> Неопределено Тогда
				ПроведениеОбученияДляКопирования = ПроведениеОбученияДляКопирования(Строка.ПрограммаОбучения);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ПроведениеОбученияДляКопирования) Тогда
				ПроведениеОбученияОбъект = ПроведениеОбученияДляКопирования.Скопировать();
			Иначе
				ПроведениеОбученияОбъект = Документы.ПроведениеОбученияСУО.СоздатьДокумент();				
				ПроведениеОбученияОбъект.МестоПроведения = Перечисления.МестаПроведенияМероприятийСУО.Дистанционно;
				Отказ = Ложь;
				Документы.ПроведениеОбученияСУО.УстановитьВидСценария(ПроведениеОбученияОбъект, Отказ);
				Если Отказ Тогда
					ВызватьИсключение НСтр("ru = 'Произошла ошибка установки вида сценария'");
				КонецЕсли;
			КонецЕсли;			
			
			ПроведениеОбученияОбъект.УстановитьСсылкуНового(ПроведениеОбучения);
			ПроведениеОбученияОбъект.Дата = Строка.Дата;
			ПроведениеОбученияОбъект.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Запланировано;			
					
		КонецЕсли;
		
		Если ТаблицаПроведенийОбучения.Колонки.Найти("Комментарий") <> Неопределено Тогда
			ПроведениеОбученияОбъект.КомментарийДляМенеджера = Строка.Комментарий;
		КонецЕсли;
		
		ПроведениеОбученияОбъект.Наименование = Строка.НаименованиеМероприятия;
		
		Если ЗагруженоИзУУЦ Тогда
			
			Если Строка.ДатаНачала = Строка.ДатаОкончания Тогда
				ПроведениеОбученияОбъект.Наименование = ПроведениеОбученияОбъект.Наименование 
						+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(" %1", Формат(Строка.ДатаНачала, "ДЛФ=D"));
			Иначе
				Если ЗначениеЗаполнено(Строка.ДатаНачала) Тогда
					ПроведениеОбученияОбъект.Наименование = ПроведениеОбученияОбъект.Наименование 
						+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(" с %1", Формат(Строка.ДатаНачала, "ДЛФ=D"));
				КонецЕсли;
				Если ЗначениеЗаполнено(Строка.ДатаОкончания) Тогда
					ПроведениеОбученияОбъект.Наименование = ПроведениеОбученияОбъект.Наименование 
						+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(" по %1", Формат(Строка.ДатаОкончания, "ДЛФ=D"));
				КонецЕсли
			КонецЕсли;
			
		КонецЕсли;
		
		ПроведениеОбученияОбъект.ВидОбучения = ВидМероприятия;
		ПроведениеОбученияОбъект.ЗагруженоИзУУЦ = ЗагруженоИзУУЦ;
		
		ЭлектронноДистанционное = Документы.ПроведениеОбученияСУО.ЭлектронноДистанционноеОбучение(ПроведениеОбученияОбъект); 
		
		Если ЭлектронноДистанционное Тогда
			
			ПроведениеОбученияОбъект.ДатаНачалаДоступа = Строка.ДатаНачала;
			ПроведениеОбученияОбъект.ДатаКонтроля = КонецДня(Строка.ДатаОкончания);
			
			Если НачалоДня(ПроведениеОбученияОбъект.ДатаНачалаДоступа) =
				НачалоДня(ПроведениеОбученияОбъект.ДатаКонтроля) Тогда				
				ПроведениеОбученияОбъект.СкрытьВремяПроведения = Ложь;
			Иначе
				ПроведениеОбученияОбъект.СкрытьВремяПроведения = Истина;				
			КонецЕсли;
			
		Иначе
			
			ПроведениеОбученияОбъект.ДатаНачалаПроведения = Строка.ДатаНачала;
			ПроведениеОбученияОбъект.ДатаОкончанияПроведения = КонецДня(Строка.ДатаОкончания);
			
			Если НачалоДня(ПроведениеОбученияОбъект.ДатаНачалаПроведения) =
				НачалоДня(ПроведениеОбученияОбъект.ДатаОкончанияПроведения) Тогда				
				ПроведениеОбученияОбъект.СкрытьВремяПроведения = Ложь;				
			Иначе
				ПроведениеОбученияОбъект.СкрытьВремяПроведения = Истина;				
			КонецЕсли;
			
		КонецЕсли;		
		
		
		Если ТаблицаПроведенийОбучения.Колонки.Найти("ПрограммаОбучения") <> Неопределено Тогда
			ПроведениеОбученияОбъект.ПрограммаОбучения = Строка.ПрограммаОбучения;
		КонецЕсли;

		Если ТаблицаПроведенийОбучения.Колонки.Найти("ГруппаСлушателей") <> Неопределено Тогда
			ПроведениеОбученияОбъект.ГруппаСлушателей = Строка.ГруппаСлушателей;
		КонецЕсли;
		
		Если ПроведениеОбученияОбъект.Проведен Тогда
			ПроведениеОбученияОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ПроведениеОбученияОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
						
		// Назначаем преподавателя
		
		Если ТаблицаПроведенийОбучения.Колонки.Найти("Преподаватель") <> Неопределено
			И ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(Строка.Преподаватель) Тогда
			НазначитьПреподавателяНаОбучение(ПроведениеОбучения,,Строка.Преподаватель);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПроведениеОбученияДляКопирования(ПрограммаОбучения) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ПрограммаОбучения) Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПроведениеОбученияСУО.Ссылка
		|ИЗ
		|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
		|ГДЕ
		|	ПроведениеОбученияСУО.ПометкаУдаления = ЛОЖЬ
		|	И ПроведениеОбученияСУО.ПрограммаОбучения = &ПрограммаОбучения
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПроведениеОбученияСУО.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ПрограммаОбучения", ПрограммаОбучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	ВыборкаДетальныеЗаписи.Следующий();

	Возврат ВыборкаДетальныеЗаписи.Ссылка; 
	
КонецФункции

Процедура ЗагрузитьУчастниковОбучения(ТаблицаСотрудников) Экспорт
	
	// Зачисляем участников
		
	ТаблицаСсылочныхЗначений = ПустаяТаблицаСсылочныхЗначений();
	
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "ФизическоеЛицо";
	НоваяСтрока.Тип = "Справочник.Пользователи";			
	
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "ОбучениеРазвитиеСотрудников";
	НоваяСтрока.Тип = "Документ.ПроведениеОбученияСУО";
	
	ПодготовитьТаблицуКЗагрузке(ТаблицаСотрудников, ТаблицаСсылочныхЗначений);	
	
	Для каждого СтрокаТС Из ТаблицаСотрудников Цикл		
		ЗачислитьУчастникаНаОбучение(СтрокаТС.ОбучениеРазвитиеСотрудников,,СтрокаТС.ФизическоеЛицо);		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ЗагрузитьФизическиеЛицаУУЦ(ТаблицаФизическихЛиц) Экспорт	
	ЗагрузитьПользователейИзФизическихЛицСотрудников(ТаблицаФизическихЛиц);
КонецПроцедуры

Процедура ЗагрузитьПрограммыОбученияУУЦ(ТаблицаПрограммОбучения) Экспорт	
		
	ТаблицаСсылочныхЗначений = ПустаяТаблицаСсылочныхЗначений();
		
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "Ссылка";
	НоваяСтрока.Тип = "Справочник.КаталогПрограммОбученияСУО";			
	
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "Родитель";
	НоваяСтрока.Тип = "Справочник.КаталогПрограммОбученияСУО";
		
	ПодготовитьТаблицуКЗагрузке(ТаблицаПрограммОбучения, ТаблицаСсылочныхЗначений);		
		
	Для каждого СтрокаТПО Из ТаблицаПрограммОбучения Цикл
	
		Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(СтрокаТПО.Ссылка) Тогда
			ПрограммаОбученияОбъект = СтрокаТПО.Ссылка.ПолучитьОбъект();
		Иначе
			ПрограммаОбученияОбъект = Справочники.КаталогПрограммОбученияСУО.СоздатьЭлемент();
			ПрограммаОбученияОбъект.УстановитьСсылкуНового(СтрокаТПО.Ссылка);		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТПО.Родитель)
			И ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(СтрокаТПО.Родитель) Тогда
			
			ПрограммаОбученияОбъект.Родитель = СтрокаТПО.Родитель;
			
		КонецЕсли;
		
		ПрограммаОбученияОбъект.Наименование = СтрокаТПО.Наименование;
		ПрограммаОбученияОбъект.Записать();
				
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьРасписаниеКурсовУУЦ(ТаблицаПроведенийОбучения) Экспорт
	ЗагрузитьПроведенияОбучения(ТаблицаПроведенийОбучения, Истина);	
КонецПроцедуры

Процедура ЗагрузитьСлушателейКурсовУУЦ(ТаблицаСлушателей) Экспорт
	
	ТаблицаСсылочныхЗначений = ПустаяТаблицаСсылочныхЗначений();
		
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "Слушатель";
	НоваяСтрока.Тип = "Справочник.Пользователи";		
	
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "РасписаниеКурса";
	НоваяСтрока.Тип = "Документ.ПроведениеОбученияСУО";	
	
	ПодготовитьТаблицуКЗагрузке(ТаблицаСлушателей, ТаблицаСсылочныхЗначений);		
		
	Для каждого СтрокаТПО Из ТаблицаСлушателей Цикл
		ЗачислитьУчастникаНаОбучение(СтрокаТПО.РасписаниеКурса,,СтрокаТПО.Слушатель);
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЗагрузитьПреподавателейКурсовУУЦ(ТаблицаПреподавателей) Экспорт
	
	ТаблицаСсылочныхЗначений = ПустаяТаблицаСсылочныхЗначений();
		
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "Преподаватель";
	НоваяСтрока.Тип = "Справочник.Пользователи";		
	
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "РасписаниеКурса";
	НоваяСтрока.Тип = "Документ.ПроведениеОбученияСУО";	
	
	ПодготовитьТаблицуКЗагрузке(ТаблицаПреподавателей, ТаблицаСсылочныхЗначений);		
		
	Для каждого СтрокаТПО Из ТаблицаПреподавателей Цикл
		НазначитьПреподавателяНаОбучение(СтрокаТПО.РасписаниеКурса,,СтрокаТПО.Преподаватель);
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЗагрузитьГруппыСлушателейУУЦ(ТаблицаГруппСлушателей) Экспорт
	
	ТаблицаСсылочныхЗначений = ПустаяТаблицаСсылочныхЗначений();
		
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "Ссылка";
	НоваяСтрока.Тип = "Справочник.УчебныеГруппыУЦ";		
	
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "Родитель";
	НоваяСтрока.Тип = "Справочник.УчебныеГруппыУЦ";	
	
	НоваяСтрока = ТаблицаСсылочныхЗначений.Добавить();
	НоваяСтрока.ИмяКолонки = "Территория";
	НоваяСтрока.Тип = "Справочник.ТерриторииСУО";	
	
	ПодготовитьТаблицуКЗагрузке(ТаблицаГруппСлушателей, ТаблицаСсылочныхЗначений);		
		
	Для каждого СтрокаТПО Из ТаблицаГруппСлушателей Цикл
		
		Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(СтрокаТПО.Ссылка) Тогда
			ГруппаСлушателейОбъект = СтрокаТПО.Ссылка.ПолучитьОбъект();			
		Иначе			
			Если СтрокаТПО.ЭтоГруппа Тогда
				ГруппаСлушателейОбъект = Справочники.УчебныеГруппыУЦ.СоздатьГруппу();
			Иначе
				ГруппаСлушателейОбъект = Справочники.УчебныеГруппыУЦ.СоздатьЭлемент();
			КонецЕсли;
			ГруппаСлушателейОбъект.УстановитьСсылкуНового(СтрокаТПО.Ссылка);		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТПО.Родитель)
			И ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(СтрокаТПО.Родитель) Тогда
			
			ГруппаСлушателейОбъект.Родитель = СтрокаТПО.Родитель;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТПО.Территория)
			И ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(СтрокаТПО.Территория)
			И НЕ ГруппаСлушателейОбъект.ЭтоГруппа Тогда
			
			ГруппаСлушателейОбъект.Территория = СтрокаТПО.Территория;
			
		КонецЕсли;		
				
		ГруппаСлушателейОбъект.Код = СтрокаТПО.Код;
		ГруппаСлушателейОбъект.Наименование = СтрокаТПО.Наименование;
		ГруппаСлушателейОбъект.Записать();
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ПервоеПроведенияОбученияПустаяСтруктура() Экспорт
	
	РезультатСтруктура = Новый Структура;
	РезультатСтруктура.Вставить("ПроведениеОбучения", Неопределено);
	РезультатСтруктура.Вставить("ДатаНачала", Дата("00010101"));
	РезультатСтруктура.Вставить("СкрытьВремя", Ложь);
	
	Возврат РезультатСтруктура;
	
КонецФункции

#КонецОбласти

#Область Рассылки

Процедура СоздатьАвтоматическуюРассылку(ИсточникСобытияОбъект, Знач Адресаты = Неопределено, СозданныеРассылки = Неопределено) Экспорт
	
	// Примечание: данная процедура не создает рассылки,
	// формируемые регламентными заданиями. Это делается
	// отдельно в блоке РЕГЛАМЕНТНЫЕ ЗАДАНИЯ.
	
	// Здесь создаются рассылки, вызываемые из кода.
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИсточникСобытия = ИсточникСобытияОбъект.Ссылка;
	
	// Ищем тип автоматической рассылки по типу источника события
	
	ТипАвтоРассылки = Неопределено;
	ПричинаВозвратаНаДоработку = Неопределено;
	ЭтоДокумент = Ложь;
	
	Если ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ПрохождениеОбученияСУО") Тогда
		
		ЭтоДокумент = Истина;
		
		СтатусОбучения = Документы.ПрохождениеОбученияСУО.СтатусПроцессаОбучения(ИсточникСобытия);
		
		Если ИсточникСобытия.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Зачислен Тогда
			
			// Здесь проверяем именно статус прохождения, так как статус обучения зависит
			// от статуса проведения обучения, а нам надо в любом случае создать рассылку
			// при зачислении на обучение.
			ТипАвтоРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриЗачисленииНаМероприятие;
			
		КонецЕсли;
		
		Если СтатусОбучения = Перечисления.СтатусыПроцессаОбученияСУО.Активно Тогда
			
			ТипАвтоРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриНачалеПрохожденияМероприятия;
			
		КонецЕсли;
		
		Если СтатусОбучения = Перечисления.СтатусыПроцессаОбученияСУО.Окончено Тогда
			
			ТипАвтоРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеПрохожденияМероприятия;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ПрохождениеПрограммыОбученияСУО") Тогда
		
		ЭтоДокумент = Истина;
		
		СтатусПрохождения = ИсточникСобытия.Статус;
		
		Если СтатусПрохождения = Перечисления.СтатусыПрохожденияОбъектовСУО.Зачислен Тогда
			
			ТипАвтоРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриЗачисленииНаПрограммуОбучения;
			
		КонецЕсли;
		
		Если СтатусПрохождения = Перечисления.СтатусыПрохожденияОбъектовСУО.Проходит Тогда
			
			ТипАвтоРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриНачалеПрохожденияПрограммыОбучения;
			
		КонецЕсли;
		
		Если СтатусПрохождения = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил
			ИЛИ СтатусПрохождения = Перечисления.СтатусыПрохожденияОбъектовСУО.НеЗавершил
			ИЛИ СтатусПрохождения = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат Тогда
			
			ТипАвтоРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеПрохожденияПрограммыОбучения;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		
		ЭтоДокумент = Истина;
		
		Если ИсточникСобытияОбъект.ОткрытоеМероприятие Тогда
			ТипАвтоРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриглашениеНаОткрытоеМероприятие;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО") Тогда
		
		ЭтоДокумент = Истина;
		
		Если ИсточникСобытияОбъект.ОткрытаяПрограмма Тогда
			ТипАвтоРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриглашениеНаОткрытуюПрограммуОбучения;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ПроведениеПреподавателемОбученияСУО") Тогда
		
		ЭтоДокумент = Истина;
		
		ТипАвтоРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриНазначенииПреподавателяНаМероприятие;
		
	КонецЕсли;
	
	Если ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ПопыткаВыполненияЗаданияСУО")
		И ИсточникСобытия.ПопыткаЗавершена
		И ИсточникСобытия.ПроверяетсяПреподавателем
		И НЕ ИсточникСобытия.ПроверенПреподавателем Тогда
		
		ЭтоДокумент = Истина;
		
		ТипАвтоРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриОтправкеЗаданияНаПроверку;		
		
	КонецЕсли;
	
	Если ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ПопыткаВыполненияЗаданияСУО")
		И ИсточникСобытия.ПопыткаЗавершена
		И ИсточникСобытия.ПроверяетсяПреподавателем
		И ИсточникСобытия.ПроверенПреподавателем Тогда
		
		ЭтоДокумент = Истина;
		
		ТипАвтоРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеПроверкиЗаданияПреподавателем;
		
	КонецЕсли;
	
	Если ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ПопыткаВыполненияЗаданияСУО")
		И ИсточникСобытия.ПроверяетсяПреподавателем
		И ИсточникСобытия.ВозвращеноНаДоработку Тогда
		
		ЭтоДокумент = Истина;
		
		ТипАвтоРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеВозвратаНаДоработкуЗадания;
		ПричинаВозвратаНаДоработку = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсточникСобытия, "ПричинаВозвратаНаДоработку");
		
	КонецЕсли;	
	
	Если ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.НовостьСУО") Тогда
		
		ЭтоДокумент = Истина;
		
		ТипАвтоРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ВажнаяНовость;
		
	КонецЕсли;
	
	Если ТипЗнч(ИсточникСобытия) = Тип("СправочникСсылка.Пользователи") Тогда
		
		ТипАвтоРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.РегистрацияНовогоПользователя;
		
	КонецЕсли;
	
	Если ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ВосстановлениеПароляСУ") Тогда
		
		ЭтоДокумент = Истина;
		
		ТипАвтоРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ВосстановлениеПароля;
		
	КонецЕсли;	
	
	Если ТипАвтоРассылки = Неопределено Тогда
		Возврат; // Автоматические рассылки в данной систуации не предусмотрены
	КонецЕсли;
	
	Если ЭтоДокумент И НЕ ИсточникСобытияОбъект.Проведен Тогда
		Возврат;
	КонецЕсли;
	
	// Ищем шаблон рассылки нужного типа и с учетом условий

	Мероприятие = Неопределено;
	ВидОбучения = Неопределено;
	ПрограммаОбучения = Неопределено;
	ПроведениеОбучения = Неопределено;
	ПроведениеПрограммыОбучения = Неопределено;
	
	
	Если ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		
		ПроведениеОбучения = ИсточникСобытия;		
		СценарийОбучения = Документы.ПроведениеОбученияСУО.СценарийОбучения(ПроведениеОбучения);				
		
	КонецЕсли;

	Если ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ПрохождениеОбученияСУО")
		ИЛИ ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ПроведениеПреподавателемОбученияСУО")
		ИЛИ ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ПопыткаВыполненияЗаданияСУО") Тогда
		
		ПроведениеОбучения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсточникСобытия, "ПроведениеОбучения");		
		
	КонецЕсли;
	
	Если ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ПрохождениеОбученияСУО") Тогда
		СценарийОбучения = Документы.ПрохождениеОбученияСУО.СценарийОбучения(ИсточникСобытия);
	КонецЕсли;
	
	Если ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ПроведениеПреподавателемОбученияСУО") Тогда
		СценарийОбучения = Документы.ПроведениеПреподавателемОбученияСУО.СценарийОбучения(ИсточникСобытия);
	КонецЕсли;
	
	Если ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ПопыткаВыполненияЗаданияСУО") Тогда
		СценарийОбучения = Документы.ПопыткаВыполненияЗаданияСУО.СценарийОбучения(ИсточникСобытия);
	КонецЕсли;			
	
	Если ЗначениеЗаполнено(ПроведениеОбучения) Тогда
		ВидОбучения = Документы.ПроведениеОбученияСУО.ВидОбучения(ПроведениеОбучения, СценарийОбучения);		
	КонецЕсли;
	
	Если ТипЗнч(СценарийОбучения) = Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда
		Мероприятие = СценарийОбучения;
	КонецЕсли;

	Если ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ПрохождениеПрограммыОбученияСУО") Тогда
		
		ПроведениеПрограммыОбучения = ИсточникСобытияОбъект.ПроведениеПрограммыОбучения;
		
		Если ТипЗнч(ИсточникСобытияОбъект.Сценарий) = Тип("СправочникСсылка.КаталогПрограммОбученияСУО") Тогда
			ПрограммаОбучения = ИсточникСобытияОбъект.Сценарий;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО") Тогда
		
		ПроведениеПрограммыОбучения = ИсточникСобытия;
		
		Если НЕ ИсточникСобытияОбъект.БезСценария И ЗначениеЗаполнено(ИсточникСобытияОбъект.ПрограммаОбучения) Тогда
			ПрограммаОбучения = ИсточникСобытияОбъект.ПрограммаОбучения;
		КонецЕсли;
		
	КонецЕсли;	
	
	// Ищем организаторов
	
	Организаторы = Новый Массив;
		
	Справочники.ОрганизаторыСУО.ОрганизаторыЭлемента(ПроведениеОбучения, Организаторы);
	Справочники.ОрганизаторыСУО.ОрганизаторыЭлемента(ПроведениеПрограммыОбучения, Организаторы);
	
	Если Организаторы.Найти(Справочники.ОрганизаторыСУО.ПустаяСсылка()) = Неопределено Тогда
		// Добавляем пустого организатора, чтобы искать правила без организатора
		Организаторы.Добавить(Справочники.ОрганизаторыСУО.ПустаяСсылка());
	КонецЕсли;

	// Ищем отборы	
		
	ОтборыПользователей = Справочники.ОтборыПользователейСУО.ВсеОтборы();
	Если ОтборыПользователей.Найти(Справочники.ОтборыПользователейСУО.ПустаяСсылка()) = Неопределено Тогда
		// Добавляем пустой отбор для поиска без отбора
		ОтборыПользователей.Добавить(Справочники.ОтборыПользователейСУО.ПустаяСсылка());
	КонецЕсли;
	
	// Ищем правило автоматической рассылки
	
	НайденнаяРассылка = РегистрыСведений.АвтоматическиеРассылкиСУО.АвтоматическаяРассылка(ТипАвтоРассылки, ВидОбучения, Мероприятие, ПрограммаОбучения, ПроведениеОбучения, Организаторы, ОтборыПользователей, ПричинаВозвратаНаДоработку, ПроведениеПрограммыОбучения);

	Если НайденнаяРассылка = Неопределено Тогда
		Возврат; // Нет подходящих автоматических рассылок
	КонецЕсли;
	
	Если НайденнаяРассылка.Шаблон = Неопределено Тогда
		Возврат; // Шаблон не нашли
	КонецЕсли;
	
	// Находим контрольную сумму рассылки
	
	КонтрольнаяСумма = 0;
	
	Если ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ПопыткаВыполненияЗаданияСУО")
		И ИсточникСобытия.ПроверяетсяПреподавателем Тогда
	
		ХешированиеСобытия = Новый ХешированиеДанных(ХешФункция.CRC32);
	
		Если ТипАвтоРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриОтправкеЗаданияНаПроверку Тогда
			ХешированиеСобытия.Добавить(Формат(ИсточникСобытия.ДатаОтправкиНаПроверку,"ДФ=dd.MM.yyyy.hh.mm.ss"));
		КонецЕсли;
		
		Если ТипАвтоРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеПроверкиЗаданияПреподавателем Тогда
			ХешированиеСобытия.Добавить(Формат(ИсточникСобытия.ДатаПроверки,"ДФ=dd.MM.yyyy.hh.mm.ss"));
		КонецЕсли;
		
		Если ТипАвтоРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеВозвратаНаДоработкуЗадания Тогда
			ХешированиеСобытия.Добавить(Формат(ИсточникСобытия.ДатаВозвратаНаДоработку,"ДФ=dd.MM.yyyy.hh.mm.ss"));
		КонецЕсли;		
		 		
		КонтрольнаяСумма = ХешированиеСобытия.ХешСумма;			
		
	КонецЕсли;
	
	// Ищем ранее созданную автоматическую рассылку
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РассылкаСообщенийСУО.Ссылка,
		|	РассылкаСообщенийСУО.Адресаты.(
		|		Пользователь
		|	) КАК Адресаты,
		|	РассылкаСообщенийСУО.АдминистраторуАвтоматическойРассылки,
		|	РассылкаСообщенийСУО.Преподавателям,
		|	РассылкаСообщенийСУО.Организаторам,
		|	ВЫБОР
		|		КОГДА РассылкаСообщенийСУО.ЭлектроннаяПочта <> ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПользователя)
		|				И РассылкаСообщенийСУО.ЭлектроннаяПочта <> ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК АльтернативнаяРассылка
		|ИЗ
		|	Документ.РассылкаСообщенийСУО КАК РассылкаСообщенийСУО
		|ГДЕ
		|	РассылкаСообщенийСУО.АвтоматическаяРассылка = ИСТИНА
		|	И РассылкаСообщенийСУО.ОснованиеАвтоматическойРассылки = &ОснованиеАвтоматическойРассылки
		|	И РассылкаСообщенийСУО.ТипАвтоматическойРассылки = &ТипАвтоматическойРассылки
		|	И РассылкаСообщенийСУО.ПометкаУдаления = ЛОЖЬ
		|	И РассылкаСообщенийСУО.КонтрольнаяСумма = &КонтрольнаяСумма";

	Запрос.УстановитьПараметр("ОснованиеАвтоматическойРассылки", ИсточникСобытия);
	Запрос.УстановитьПараметр("ТипАвтоматическойРассылки", ТипАвтоРассылки);
	Запрос.УстановитьПараметр("КонтрольнаяСумма", КонтрольнаяСумма);

	Результат = Запрос.Выполнить();

	АдресатыКопия = ОбщегоНазначенияКлиентСервер.СкопироватьРекурсивно(Адресаты);
	
	РассылкиВыборка = Результат.Выбрать();
	
	Если НЕ Результат.Пустой() Тогда
		
		Если АдресатыКопия = Неопределено ИЛИ АдресатыКопия.Количество() = 0 Тогда
		
			Возврат; // Рассылка была сделана раньше. Новую не создаем и не обновляем
			
		Иначе
			
			Если РассылкиВыборка.НайтиСледующий(Новый Структура("АдминистраторуАвтоматическойРассылки, Преподавателям, Организаторам, АльтернативнаяРассылка", Ложь, Ложь, Ложь, Ложь)) Тогда
				
				РассылкаДляОбновления   = РассылкиВыборка.Ссылка;
				АдресатыРассылкиВыборка = РассылкиВыборка.Адресаты.Выбрать();
				
				Пока АдресатыРассылкиВыборка.Следующий() Цикл
				
					АдресатСтрока = АдресатыКопия.Найти(АдресатыРассылкиВыборка.Пользователь, "Пользователь");
					
					Если АдресатСтрока <> Неопределено Тогда
						АдресатыКопия.Удалить(АдресатСтрока); // Адресат уже есть в рассылке, удаляем его из списка переданных
					КонецЕсли;
					
				КонецЦикла;
				
				Если АдресатыКопия.Количество() = 0 Тогда
					Возврат; // Нет новых адресатов
				КонецЕсли;
				
			КонецЕсли;	
				
		КонецЕсли;
		
	КонецЕсли;	
	
	// Создаем и записываем документ рассылки на основе найденного шаблона (автоматическую рассылку)
	
	АвторРассылки = Константы.АвторАвтоматическихРассылокСУО.Получить();
	
	Если НЕ ЗначениеЗаполнено(АвторРассылки) Тогда
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Автоматическая рассылка.Создание'"),
			УровеньЖурналаРегистрации.Ошибка,,, 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для корректного формирования рассылки ""%1"" укажите автора автоматических рассылок в настройках информационной базы (Администрирование -> Органайзер и средства общения)'"),
			Строка(ТипАвтоРассылки)));
		
		АвторРассылки = Пользователи.СсылкаНеуказанногоПользователя();
		
	КонецЕсли;
	
	// Создаем рассылку для пользователя
	
	Основание = Неопределено;	
	
	Если ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ПрохождениеОбученияСУО") Тогда
		Основание = ИсточникСобытияОбъект.ПроведениеОбучения;
	КонецЕсли;
	
	Если ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ПроведениеПреподавателемОбученияСУО") Тогда
		Основание = ИсточникСобытияОбъект.ПроведениеОбучения;
	КонецЕсли;
	
	Если ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ПрохождениеПрограммыОбученияСУО") Тогда
		Основание = ИсточникСобытияОбъект.ПроведениеПрограммыОбучения;
	КонецЕсли;
	
	Если ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ПопыткаВыполненияЗаданияСУО") Тогда
		Основание = ИсточникСобытияОбъект.ПрохождениеОбучения;
	КонецЕсли;
	
	Если ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		Основание = ИсточникСобытия;
	КонецЕсли;
	
	Если ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО") Тогда
		Основание = ИсточникСобытия;
	КонецЕсли;
	
	Если ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.НовостьСУО") Тогда
		Основание = ИсточникСобытия;
	КонецЕсли;
	
	Если ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ВосстановлениеПароляСУ") Тогда
		Основание = ИсточникСобытия;
	КонецЕсли;	
	
	Если ТипЗнч(ИсточникСобытия) = Тип("СправочникСсылка.Пользователи") Тогда
		Основание = ИсточникСобытия;
	КонецЕсли;	
	
	Если Основание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если (ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ПрохождениеОбученияСУО")
		ИЛИ ТипЗнч(ИсточникСобытия) = Тип("ДокументСсылка.ПопыткаВыполненияЗаданияСУО")) Тогда

		ПрикреплятьФайлыОснования = НайденнаяРассылка.ПрикреплятьФайлы;
		
	Иначе
		
		ПрикреплятьФайлыОснования = Ложь;
		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(НайденнаяРассылка.Шаблон)
		ИЛИ ТипЗнч(ИсточникСобытияОбъект) = Тип("ДокументОбъект.НовостьСУО") Тогда
	
		Если РассылкаДляОбновления = Неопределено Тогда
			
			НоваяРассылка = Документы.РассылкаСообщенийСУО.СоздатьДокумент();
			
			Если ТипЗнч(ИсточникСобытияОбъект) = Тип("ДокументОбъект.НовостьСУО") Тогда
				НоваяРассылка.Дата = ИсточникСобытияОбъект.ДатаПубликации;
			Иначе
				НоваяРассылка.Дата = ТекущаяДата();
			КонецЕсли;
		
			НоваяРассылка.Автор = АвторРассылки;
			
			Если ТипЗнч(ИсточникСобытияОбъект) = Тип("ДокументОбъект.НовостьСУО") Тогда
				НоваяРассылка.Шаблон = Основание;
			Иначе
				НоваяРассылка.Шаблон = НайденнаяРассылка.Шаблон;
			КонецЕсли;
			
			НоваяРассылка.Описание                             = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Автоматическая рассылка: %1.'"), Строка(ТипАвтоРассылки));
			НоваяРассылка.Основание                            = Основание;
			НоваяРассылка.АвтоматическаяРассылка               = Истина;
			НоваяРассылка.ОснованиеАвтоматическойРассылки      = ИсточникСобытия;
			НоваяРассылка.ТипАвтоматическойРассылки            = ТипАвтоРассылки;
			НоваяРассылка.ТолькоЭлектроннаяПочта               = НайденнаяРассылка.ТолькоЭлектроннаяПочта;
			НоваяРассылка.АдминистраторуАвтоматическойРассылки = Ложь;
			НоваяРассылка.КонтрольнаяСумма                     = КонтрольнаяСумма;
			НоваяРассылка.ПрикреплятьФайлыОснования            = ПрикреплятьФайлыОснования;
			
			Если АдресатыКопия = Неопределено Тогда
				
				Если ТипЗнч(ИсточникСобытияОбъект) = Тип("ДокументОбъект.ПроведениеПреподавателемОбученияСУО") Тогда
					
					Если Справочники.ОтборыПользователейСУО.ПользовательВходитВОтбор(НайденнаяРассылка.ОтборПользователей, ИсточникСобытияОбъект.Пользователь) Тогда
						НовыйАдресат = НоваяРассылка.Адресаты.Добавить();						
						НовыйАдресат.Пользователь = ИсточникСобытияОбъект.Пользователь;
					КонецЕсли;
					
				ИначеЕсли ТипЗнч(ИсточникСобытияОбъект) = Тип("ДокументОбъект.ПопыткаВыполненияЗаданияСУО") Тогда
					
					ВыполняющийЗадание = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсточникСобытияОбъект.ПрохождениеОбучения, "Пользователь");
					
					Если Справочники.ОтборыПользователейСУО.ПользовательВходитВОтбор(НайденнаяРассылка.ОтборПользователей, ВыполняющийЗадание) Тогда
						НовыйАдресат = НоваяРассылка.Адресаты.Добавить();
						НовыйАдресат.Пользователь = ВыполняющийЗадание; 
					КонецЕсли;					
					
				ИначеЕсли ТипЗнч(ИсточникСобытияОбъект) = Тип("ДокументОбъект.НовостьСУО") Тогда

					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	Пользователи.Ссылка
						|ИЗ
						|	Справочник.Пользователи КАК Пользователи
						|ГДЕ
						|	Пользователи.ПометкаУдаления = ЛОЖЬ
						|	И Пользователи.Недействителен = ЛОЖЬ";

					Результат = Запрос.Выполнить();

					ВыборкаДетальныеЗаписи = Результат.Выбрать();

					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						Если Справочники.ОтборыПользователейСУО.ПользовательВходитВОтбор(НайденнаяРассылка.ОтборПользователей,  ВыборкаДетальныеЗаписи.Ссылка) Тогда
							НовыйАдресат = НоваяРассылка.Адресаты.Добавить();
							НовыйАдресат.Пользователь = ВыборкаДетальныеЗаписи.Ссылка;
						КонецЕсли;
					КонецЦикла;
					
				ИначеЕсли ТипЗнч(ИсточникСобытияОбъект) = Тип("СправочникОбъект.Пользователи") Тогда				
					
					Если Справочники.ОтборыПользователейСУО.ПользовательВходитВОтбор(НайденнаяРассылка.ОтборПользователей, ИсточникСобытияОбъект.Ссылка) Тогда
						НовыйАдресат = НоваяРассылка.Адресаты.Добавить();
						НовыйАдресат.Пользователь = ИсточникСобытияОбъект.Ссылка; 				
					КонецЕсли;
					
				Иначе
					
					Если Справочники.ОтборыПользователейСУО.ПользовательВходитВОтбор(НайденнаяРассылка.ОтборПользователей, ИсточникСобытияОбъект.Пользователь) Тогда
						НовыйАдресат = НоваяРассылка.Адресаты.Добавить();
						НовыйАдресат.Пользователь = ИсточникСобытияОбъект.Пользователь; 
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				Для каждого Строка Из АдресатыКопия Цикл
					
					Если Справочники.ОтборыПользователейСУО.ПользовательВходитВОтбор(НайденнаяРассылка.ОтборПользователей, Строка.Пользователь) Тогда
						НовыйАдресат = НоваяРассылка.Адресаты.Добавить();
						НовыйАдресат.Пользователь = Строка.Пользователь;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			НоваяРассылка.ЗаполнитьПеременные();
			
		Иначе // Добавляем новых адресатов
			
			НоваяРассылка = РассылкаДляОбновления.ПолучитьОбъект();
			
			Для каждого Строка Из АдресатыКопия Цикл
				
				Если Справочники.ОтборыПользователейСУО.ПользовательВходитВОтбор(НайденнаяРассылка.ОтборПользователей, Строка.Пользователь) Тогда
					НовыйАдресат = НоваяРассылка.Адресаты.Добавить();
					НовыйАдресат.Пользователь = Строка.Пользователь;
				КонецЕсли;
					
			КонецЦикла;
			
		КонецЕсли;
		
		Если НоваяРассылка.Адресаты.Количество() > 0 Тогда
			НоваяРассылка.Записать();  // Не проводим. Документ будет проведен по регламентному заданию или фоновой процедурой.
		Иначе
			Возврат;
		КонецЕсли;		
		
		Если ТипЗнч(СозданныеРассылки) = Тип("Массив") Тогда
			СозданныеРассылки.Добавить(НоваяРассылка.Ссылка);	
		КонецЕсли;
		
	КонецЕсли;
	
	// Создаем альтернативную рассылку
	
	Если ЗначениеЗаполнено(НайденнаяРассылка.АльтернативныйШаблон)
		И ЗначениеЗаполнено(НайденнаяРассылка.АльтернативнаяЭлектроннаяПочта) Тогда
		
		АдресатыКопия = ОбщегоНазначенияКлиентСервер.СкопироватьРекурсивно(Адресаты);
		
		РассылкиВыборка.Сбросить();
		
		РассылкаДляОбновления = Неопределено;
		
		Если РассылкиВыборка.НайтиСледующий(Новый Структура("АльтернативнаяРассылка", Истина)) Тогда
			
			РассылкаДляОбновления  = РассылкиВыборка.Ссылка;
			
			Если АдресатыКопия <> Неопределено И АдресатыКопия.Количество() > 0 Тогда
			
				АдресатыРассылкиВыборка = РассылкиВыборка.Адресаты.Выбрать();
				
				Пока АдресатыРассылкиВыборка.Следующий() Цикл
				
					АдресатСтрока = АдресатыКопия.Найти(АдресатыРассылкиВыборка.Пользователь, "Пользователь");
					
					Если АдресатСтрока <> Неопределено Тогда
						АдресатыКопия.Удалить(АдресатСтрока); // Адресат уже есть в рассылке, удаляем его из списка переданных
					КонецЕсли;
					
				КонецЦикла;			
				
			КонецЕсли;
				
		КонецЕсли;	
			
		Если РассылкаДляОбновления = Неопределено Тогда
			
			АльтернативнаяРассылкаОбъект = Документы.РассылкаСообщенийСУО.СоздатьДокумент();
			
			Если ТипЗнч(ИсточникСобытияОбъект) = Тип("ДокументОбъект.НовостьСУО") Тогда
				АльтернативнаяРассылкаОбъект.Дата = ИсточникСобытияОбъект.ДатаПубликации;
			Иначе
				АльтернативнаяРассылкаОбъект.Дата = ТекущаяДата();
			КонецЕсли;
		
			АльтернативнаяРассылкаОбъект.Автор = АвторРассылки;
			
			Если ТипЗнч(ИсточникСобытияОбъект) = Тип("ДокументОбъект.НовостьСУО") Тогда
				АльтернативнаяРассылкаОбъект.Шаблон = Основание;
			Иначе
				АльтернативнаяРассылкаОбъект.Шаблон = НайденнаяРассылка.АльтернативныйШаблон;
			КонецЕсли;
			
			АльтернативнаяРассылкаОбъект.ЭлектроннаяПочта                     = НайденнаяРассылка.АльтернативнаяЭлектроннаяПочта;
			
			АльтернативнаяРассылкаОбъект.Описание                             = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Альтернативная автоматическая рассылка: %1.'"), Строка(ТипАвтоРассылки));
			АльтернативнаяРассылкаОбъект.Основание                            = Основание;
			АльтернативнаяРассылкаОбъект.АвтоматическаяРассылка               = Истина;
			АльтернативнаяРассылкаОбъект.ОснованиеАвтоматическойРассылки      = ИсточникСобытия;
			АльтернативнаяРассылкаОбъект.ТипАвтоматическойРассылки            = ТипАвтоРассылки;
			АльтернативнаяРассылкаОбъект.ТолькоЭлектроннаяПочта               = НайденнаяРассылка.ТолькоЭлектроннаяПочта;
			АльтернативнаяРассылкаОбъект.АдминистраторуАвтоматическойРассылки = Ложь;
			АльтернативнаяРассылкаОбъект.КонтрольнаяСумма                     = КонтрольнаяСумма;			
			АльтернативнаяРассылкаОбъект.ПрикреплятьФайлыОснования            = ПрикреплятьФайлыОснования;
			
			Если АдресатыКопия = Неопределено Тогда
				
				Если ТипЗнч(ИсточникСобытияОбъект) = Тип("ДокументОбъект.ПроведениеПреподавателемОбученияСУО") Тогда
					
					Если Справочники.ОтборыПользователейСУО.ПользовательВходитВОтбор(НайденнаяРассылка.ОтборПользователей, ИсточникСобытияОбъект.Пользователь) Тогда
						НовыйАдресат = АльтернативнаяРассылкаОбъект.Адресаты.Добавить();						
						НовыйАдресат.Пользователь = ИсточникСобытияОбъект.Пользователь;
					КонецЕсли;
					
				ИначеЕсли ТипЗнч(ИсточникСобытияОбъект) = Тип("ДокументОбъект.ПопыткаВыполненияЗаданияСУО") Тогда
					
					ВыполняющийЗадание = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсточникСобытияОбъект.ПрохождениеОбучения, "Пользователь");
					
					Если Справочники.ОтборыПользователейСУО.ПользовательВходитВОтбор(НайденнаяРассылка.ОтборПользователей, ВыполняющийЗадание) Тогда
						НовыйАдресат = АльтернативнаяРассылкаОбъект.Адресаты.Добавить();
						НовыйАдресат.Пользователь = ВыполняющийЗадание; 
					КонецЕсли;					
					
				ИначеЕсли ТипЗнч(ИсточникСобытияОбъект) = Тип("ДокументОбъект.НовостьСУО") Тогда

					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	Пользователи.Ссылка
						|ИЗ
						|	Справочник.Пользователи КАК Пользователи
						|ГДЕ
						|	Пользователи.ПометкаУдаления = ЛОЖЬ
						|	И Пользователи.Недействителен = ЛОЖЬ";

					Результат = Запрос.Выполнить();

					ВыборкаДетальныеЗаписи = Результат.Выбрать();

					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						Если Справочники.ОтборыПользователейСУО.ПользовательВходитВОтбор(НайденнаяРассылка.ОтборПользователей,  ВыборкаДетальныеЗаписи.Ссылка) Тогда
							НовыйАдресат = АльтернативнаяРассылкаОбъект.Адресаты.Добавить();
							НовыйАдресат.Пользователь = ВыборкаДетальныеЗаписи.Ссылка;
						КонецЕсли;
					КонецЦикла;
					
				ИначеЕсли ТипЗнч(ИсточникСобытияОбъект) = Тип("СправочникОбъект.Пользователи") Тогда				
					
					Если Справочники.ОтборыПользователейСУО.ПользовательВходитВОтбор(НайденнаяРассылка.ОтборПользователей, ИсточникСобытияОбъект.Ссылка) Тогда
						НовыйАдресат = АльтернативнаяРассылкаОбъект.Адресаты.Добавить();
						НовыйАдресат.Пользователь = ИсточникСобытияОбъект.Ссылка; 				
					КонецЕсли;
					
				Иначе
					
					Если Справочники.ОтборыПользователейСУО.ПользовательВходитВОтбор(НайденнаяРассылка.ОтборПользователей, ИсточникСобытияОбъект.Пользователь) Тогда
						НовыйАдресат = АльтернативнаяРассылкаОбъект.Адресаты.Добавить();
						НовыйАдресат.Пользователь = ИсточникСобытияОбъект.Пользователь; 
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				Для каждого Строка Из АдресатыКопия Цикл
					
					Если Справочники.ОтборыПользователейСУО.ПользовательВходитВОтбор(НайденнаяРассылка.ОтборПользователей, Строка.Пользователь) Тогда
						НовыйАдресат = АльтернативнаяРассылкаОбъект.Адресаты.Добавить();
						НовыйАдресат.Пользователь = Строка.Пользователь;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			АльтернативнаяРассылкаОбъект.ЗаполнитьПеременные();
			
		Иначе // Добавляем новых адресатов
			
			АльтернативнаяРассылкаОбъект = РассылкаДляОбновления.ПолучитьОбъект();
			
			Для каждого Строка Из АдресатыКопия Цикл
				
				Если Справочники.ОтборыПользователейСУО.ПользовательВходитВОтбор(НайденнаяРассылка.ОтборПользователей, Строка.Пользователь) Тогда
					НовыйАдресат = АльтернативнаяРассылкаОбъект.Адресаты.Добавить();
					НовыйАдресат.Пользователь = Строка.Пользователь;
				КонецЕсли;
					
			КонецЦикла;
			
		КонецЕсли;
		
		Если АльтернативнаяРассылкаОбъект.Адресаты.Количество() > 0 Тогда
			АльтернативнаяРассылкаОбъект.Записать();  // Не проводим. Документ будет проведен по регламентному заданию или фоновой процедурой.
		Иначе
			Возврат;
		КонецЕсли;		
		
		Если ТипЗнч(СозданныеРассылки) = Тип("Массив") Тогда
			СозданныеРассылки.Добавить(АльтернативнаяРассылкаОбъект.Ссылка);	
		КонецЕсли;
			
	КонецЕсли;
	
	
	// Создаем рассылку для администратора
	
	Если ЗначениеЗаполнено(НайденнаяРассылка.ШаблонСообщенияАдминистратору)
		И РассылкаДляОбновления = Неопределено Тогда
	
		НоваяРассылка = Документы.РассылкаСообщенийСУО.СоздатьДокумент();
		
		НоваяРассылка.Дата                                 = ТекущаяДата();
		НоваяРассылка.Автор                                = АвторРассылки;
		НоваяРассылка.Шаблон                               = НайденнаяРассылка.ШаблонСообщенияАдминистратору;
		НоваяРассылка.Описание                             = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Автоматическая рассылка администратору: %1'"), Строка(ТипАвтоРассылки));
		НоваяРассылка.Основание                            = Основание;
		НоваяРассылка.АвтоматическаяРассылка               = Истина;
		НоваяРассылка.ОснованиеАвтоматическойРассылки      = ИсточникСобытия;
		НоваяРассылка.ТипАвтоматическойРассылки            = ТипАвтоРассылки;
		НоваяРассылка.ТолькоЭлектроннаяПочта               = НайденнаяРассылка.ТолькоЭлектроннаяПочта;
		НоваяРассылка.АдминистраторуАвтоматическойРассылки = Истина;
		НоваяРассылка.КонтрольнаяСумма                     = КонтрольнаяСумма;
		НоваяРассылка.ПрикреплятьФайлыОснования            = ПрикреплятьФайлыОснования;
		
		НовыйАдресат = НоваяРассылка.Адресаты.Добавить();
		
		Если ЗначениеЗаполнено(НайденнаяРассылка.Администратор) Тогда
			НовыйАдресат.Пользователь = НайденнаяРассылка.Администратор; 
		Иначе
			НовыйАдресат.Пользователь = АвторРассылки; 
		КонецЕсли;
		
		НоваяРассылка.ЗаполнитьПеременные();
		
		НоваяРассылка.Записать(); // Не проводим. Документ будет проведен по регламентному заданию.
		
		Если ТипЗнч(СозданныеРассылки) = Тип("Массив") Тогда
			СозданныеРассылки.Добавить(НоваяРассылка.Ссылка);	
		КонецЕсли;
		
	КонецЕсли;
	
	// Создаем рассылку для преподавателей
	
	Если ЗначениеЗаполнено(НайденнаяРассылка.ШаблонСообщенияПреподавателям) Тогда		
		
		ПроведениеОбучения = Неопределено;
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
			
			ПроведениеОбучения = Основание;
			
		КонецЕсли;
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПроведениеПреподавателемОбученияСУО")
			ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ПрохождениеОбученияСУО")
			ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ПопыткаВыполненияЗаданияСУО") Тогда
			
			ПроведениеОбучения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "ПроведениеОбучения");
			
		КонецЕсли;		
		
		Если ЗначениеЗаполнено(ПроведениеОбучения) Тогда
			
			Преподаватели = Документы.ПроведениеОбученияСУО.Преподаватели(ПроведениеОбучения,,Ложь);
			
			Если Преподаватели.Количество() > 0 Тогда
			
				Если РассылкиВыборка = Неопределено Тогда
					РассылкиВыборка = Результат.Выбрать();
				Иначе
					РассылкиВыборка.Сбросить();	
				КонецЕсли;			
				
				Если РассылкиВыборка.НайтиСледующий(Новый Структура("Преподавателям", Истина)) Тогда			
					РассылкаДляПреподавателей = РассылкиВыборка.Ссылка.ПолучитьОбъект();
				Иначе
					РассылкаДляПреподавателей = Документы.РассылкаСообщенийСУО.СоздатьДокумент();
				КонецЕсли;
				
				Для каждого Строка Из Преподаватели Цикл
				
					Если РассылкаДляПреподавателей.Адресаты.Найти(Строка.Пользователь, "Пользователь") = Неопределено Тогда
						
						НоваяСтрока = РассылкаДляПреподавателей.Адресаты.Добавить();
						НоваяСтрока.Пользователь = Строка.Пользователь;					
						
					КонецЕсли;
				
				КонецЦикла;
				
				РассылкаДляПреподавателей.Дата                            = ТекущаяДата();
				РассылкаДляПреподавателей.Автор                           = АвторРассылки;
				РассылкаДляПреподавателей.Шаблон                          = НайденнаяРассылка.ШаблонСообщенияПреподавателям;
				РассылкаДляПреподавателей.Описание                        = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Автоматическая рассылка преподавателям: %1.'"), Строка(ТипАвтоРассылки));
				РассылкаДляПреподавателей.Основание                       = Основание;
				РассылкаДляПреподавателей.АвтоматическаяРассылка          = Истина;
				РассылкаДляПреподавателей.ОснованиеАвтоматическойРассылки = ИсточникСобытия;
				РассылкаДляПреподавателей.ТипАвтоматическойРассылки       = ТипАвтоРассылки;
				РассылкаДляПреподавателей.ТолькоЭлектроннаяПочта          = НайденнаяРассылка.ТолькоЭлектроннаяПочта;
				РассылкаДляПреподавателей.Преподавателям                  = Истина;			
				РассылкаДляПреподавателей.КонтрольнаяСумма                = КонтрольнаяСумма;
				РассылкаДляПреподавателей.ПрикреплятьФайлыОснования       = ПрикреплятьФайлыОснования;
				
				РассылкаДляПреподавателей.ЗаполнитьПеременные();
				
				РассылкаДляПреподавателей.Записать(); // Не проводим. Документ будет проведен по регламентному заданию.
				
				Если ТипЗнч(СозданныеРассылки) = Тип("Массив") Тогда
					СозданныеРассылки.Добавить(РассылкаДляПреподавателей.Ссылка);	
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЕсли;
	
	// Создаем рассылку организаторам
	
	Если ЗначениеЗаполнено(НайденнаяРассылка.ШаблонСообщенияОрганизаторам)
		И Организаторы.Количество() > 0 Тогда
		
		Если РассылкиВыборка = Неопределено Тогда
			РассылкиВыборка = Результат.Выбрать();
		Иначе
			РассылкиВыборка.Сбросить();	
		КонецЕсли;			
		
		Если РассылкиВыборка.НайтиСледующий(Новый Структура("Организаторам", Истина)) Тогда			
			РассылкаДляОрганизаторов = РассылкиВыборка.Ссылка.ПолучитьОбъект();
		Иначе
			РассылкаДляОрганизаторов = Документы.РассылкаСообщенийСУО.СоздатьДокумент();
		КонецЕсли;
		
		Для каждого Организатор Из Организаторы Цикл
			
			Пользователь = Неопределено;
			
			Если ЗначениеЗаполнено(Организатор) Тогда
				Пользователь = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организатор, "Пользователь");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Пользователь)
				И РассылкаДляОрганизаторов.Адресаты.Найти(Пользователь, "Пользователь") = Неопределено Тогда
				
				НоваяСтрока = РассылкаДляОрганизаторов.Адресаты.Добавить();
				НоваяСтрока.Пользователь = Пользователь;					
				
			КонецЕсли;
		
		КонецЦикла;
		
		РассылкаДляОрганизаторов.Дата                            = ТекущаяДата();
		РассылкаДляОрганизаторов.Автор                           = АвторРассылки;
		РассылкаДляОрганизаторов.Шаблон                          = НайденнаяРассылка.ШаблонСообщенияОрганизаторам;
		РассылкаДляОрганизаторов.Описание                        = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Автоматическая рассылка организаторам: %1.'"), Строка(ТипАвтоРассылки));
		РассылкаДляОрганизаторов.Основание                       = Основание;
		РассылкаДляОрганизаторов.АвтоматическаяРассылка          = Истина;
		РассылкаДляОрганизаторов.ОснованиеАвтоматическойРассылки = ИсточникСобытия;
		РассылкаДляОрганизаторов.ТипАвтоматическойРассылки       = ТипАвтоРассылки;
		РассылкаДляОрганизаторов.ТолькоЭлектроннаяПочта          = НайденнаяРассылка.ТолькоЭлектроннаяПочта;
		РассылкаДляОрганизаторов.Организаторам                   = Истина;			
		РассылкаДляОрганизаторов.КонтрольнаяСумма                = КонтрольнаяСумма;
		РассылкаДляОрганизаторов.ПрикреплятьФайлыОснования       = ПрикреплятьФайлыОснования;
		
		РассылкаДляОрганизаторов.ЗаполнитьПеременные();
		
		РассылкаДляОрганизаторов.Записать(); // Не проводим. Документ будет проведен по регламентному заданию.
		
		Если ТипЗнч(СозданныеРассылки) = Тип("Массив") Тогда
			СозданныеРассылки.Добавить(РассылкаДляОрганизаторов.Ссылка);	
		КонецЕсли;		
		
	КонецЕсли;
	
		
КонецПроцедуры

Функция ПодключитьСоединениеРассылок() Экспорт
	
	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	Профиль = РаботаСПочтовымиСообщениямиСлужебный.ИнтернетПочтовыйПрофиль(УчетнаяЗапись);
	Соединение = Новый ИнтернетПочта;
	Соединение.Подключиться(Профиль);
	
	Возврат Соединение;
	
КонецФункции

Функция ОтключитьСоединениеРассылок(Соединение) Экспорт
	Соединение.Отключиться();	
КонецФункции

Процедура РазослатьСообщенияНаЭлектроннуюПочту(РассылкаСообщений = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Рассылаем по электронной почте письма (без транзакции)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РассылкаСообщенийСУОАдресаты.Сообщение КАК Сообщение,
		|	РассылкаСообщенийСУОАдресаты.Ссылка КАК Рассылка
		|ИЗ
		|	Документ.РассылкаСообщенийСУО.Адресаты КАК РассылкаСообщенийСУОАдресаты
		|ГДЕ
		|	РассылкаСообщенийСУОАдресаты.ОтправленоНаЭлектроннуюПочту = ЛОЖЬ
		|	И РассылкаСообщенийСУОАдресаты.Ссылка.Проведен = ИСТИНА
		|	И РассылкаСообщенийСУОАдресаты.ОтправкаНаЭлектроннуюПочтуЗапрещена = ЛОЖЬ
		|	И РассылкаСообщенийСУОАдресаты.КоличествоПопытокОтправкиНаЭлектроннуюПочту < 10
		|
		|УПОРЯДОЧИТЬ ПО
		|	Рассылка";

	Если РассылкаСообщений <> Неопределено Тогда
		
		ОбщегоНазначенияСУ.ДобавитьОтборКЗапросу(Запрос, "РассылкаСообщенийСУОАдресаты.Ссылка = &РассылкаСообщений"); 
		
		Запрос.Параметры.Вставить("РассылкаСообщений", РассылкаСообщений);
		
	КонецЕсли;
		
	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	// Создаем одно соединение на все отправки
	
	Соединение = ПодключитьСоединениеРассылок();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
		// Создаем объект рассылки.
		РассылкаОбъект = ВыборкаДетальныеЗаписи.Рассылка.ПолучитьОбъект();
		
		Попытка 
			РассылкаОбъект.Заблокировать(); // Блокируем до отправки
		Исключение
			Продолжить;
		КонецПопытки;
		
		СтрокТЧ = РассылкаОбъект.Адресаты.Найти(ВыборкаДетальныеЗаписи.Сообщение, "Сообщение");
		
		Если СтрокТЧ = Неопределено Тогда
			РассылкаОбъект.Разблокировать();
			Продолжить;
		КонецЕсли;
		
		РезультатОтправки = Документы.СообщениеСУО.ОтправитьСообщениеНаЭлектроннуюПочту(ВыборкаДетальныеЗаписи.Сообщение, Соединение);		
		
		СтрокТЧ.КоличествоПопытокОтправкиНаЭлектроннуюПочту = СтрокТЧ.КоличествоПопытокОтправкиНаЭлектроннуюПочту + 1;		

		Если РезультатОтправки.Отправлено ИЛИ РезультатОтправки.ОтправкаНаЭлектроннуюПочтуЗапрещена Тогда
			
			СтрокТЧ.ОтправленоНаЭлектроннуюПочту = РезультатОтправки.Отправлено;
			СтрокТЧ.ОтправкаНаЭлектроннуюПочтуЗапрещена = РезультатОтправки.ОтправкаНаЭлектроннуюПочтуЗапрещена;
			
		Иначе
			
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Автоматическая рассылка. Отправка сообщений на электронную почту'"), 
				УровеньЖурналаРегистрации.Ошибка,,,РезультатОтправки.ТекстОшибки);
			
		КонецЕсли;
		
		РассылкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		РассылкаОбъект.Разблокировать();
		
	КонецЦикла;
	
	ОтключитьСоединениеРассылок(Соединение)
	
КонецПроцедуры

Функция ТаблицаЗначенийДополнительныхПеременных(ТаблицаПеременных, Пользователь) Экспорт
	
	ТаблицаЗначенийДопПеременных = Новый ТаблицаЗначений;
	ТаблицаЗначенийДопПеременных.Колонки.Добавить("Переменная");
	ТаблицаЗначенийДопПеременных.Колонки.Добавить("ИмяПеременной");
	ТаблицаЗначенийДопПеременных.Колонки.Добавить("Значение");
	
	МассивДопСвойств = Новый Массив;
	МассивВидовКИ = Новый Массив;		
	МассивПеременных = Новый Массив;
	МассивПользователей = Новый Массив;
	
	МассивПользователей.Добавить(Пользователь);		
	
	Для каждого СтрокаТП Из ТаблицаПеременных Цикл
	
		Если ТипЗнч(СтрокаТП.Переменная) = Тип("СправочникСсылка.ВидыКонтактнойИнформации") Тогда
			МассивВидовКИ.Добавить(СтрокаТП.Переменная);
		КонецЕсли;
		
		Если ТипЗнч(СтрокаТП.Переменная) = Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения") Тогда
			МассивДопСвойств.Добавить(СтрокаТП.Переменная);
		КонецЕсли;			
		
		СвойстваПеременной = Новый Структура;
		СвойстваПеременной.Вставить("Переменная", СтрокаТП.Переменная);
		СвойстваПеременной.Вставить("ИмяПеременной", СтрокаТП.ИмяПеременной);
		
		МассивПеременных.Добавить(СвойстваПеременной);		
	
	КонецЦикла;
	
	ТаблицаКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивПользователей,,МассивВидовКИ);
	ТаблицаДопСвойств = УправлениеСвойствами.ПолучитьЗначенияСвойств(Пользователь, Истина, Истина, МассивДопСвойств);
	
	Для каждого СвойстваПеременной Из МассивПеременных Цикл
		
		ЗначениеПеременной = "";
		
		Если ТипЗнч(СвойстваПеременной.Переменная) = Тип("СправочникСсылка.ВидыКонтактнойИнформации") Тогда
			СтрокиТаблицыКИ = ТаблицаКИ.НайтиСтроки(Новый Структура("Объект, Вид", Пользователь, СвойстваПеременной.Переменная));
			Если СтрокиТаблицыКИ.Количество() > 0 Тогда
				ЗначениеПеременной = СтрокиТаблицыКИ[0].Представление;
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЗнч(СвойстваПеременной.Переменная) = Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения") Тогда
			СтрокаТаблицыСвойств = ТаблицаДопСвойств.Найти(СвойстваПеременной.Переменная, "Свойство");
			Если СтрокаТаблицыСвойств <> Неопределено Тогда
				ЗначениеПеременной = СтрокаТаблицыСвойств.Значение;
			КонецЕсли;
			Если СвойстваПеременной.Переменная.ТипЗначения.СодержитТип(Тип("Булево"))
				И СтрокаТаблицыСвойств = Неопределено Тогда
				ЗначениеПеременной = Ложь;
			КонецЕсли;
		КонецЕсли;						
		
		Если ТипЗнч(ЗначениеПеременной) = Тип("Дата") Тогда
			ЗначениеПеременной = Формат(ЗначениеПеременной, "ДЛФ=DD");
		КонецЕсли;
		
		Если ТипЗнч(ЗначениеПеременной) = Тип("Число") Тогда
			ЗначениеПеременной = ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(ЗначениеПеременной);
		КонецЕсли;
		
		Если ТипЗнч(ЗначениеПеременной) = Тип("Булево") Тогда
			ЗначениеПеременной = ОбщегоНазначенияСУКлиентСервер.БулевоВСтроку(ЗначениеПеременной);
		КонецЕсли;
		
		НоваяСтрока = ТаблицаЗначенийДопПеременных.Добавить();
		НоваяСтрока.Переменная = СвойстваПеременной.Переменная;
		НоваяСтрока.ИмяПеременной = СвойстваПеременной.ИмяПеременной;
		НоваяСтрока.Значение = ЗначениеПеременной;
		
	КонецЦикла;	
	
	Возврат ТаблицаЗначенийДопПеременных; 
	
КонецФункции

#КонецОбласти

#Область Сертификаты

// Выдает сертификаты.
// Выполняется асинхронно через фоновые задания.
//
Функция ВыдатьСертификат(ПрохождениеОбучения, НеОбновлятьДанныеВебКабинета = Неопределено, ПрохождениеОбученияСвойства = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Документы.СертификатСУО.ВыдатьСертификат(ПрохождениеОбучения, НеОбновлятьДанныеВебКабинета, ПрохождениеОбученияСвойства);	
	
КонецФункции

#КонецОбласти

#Область РегламентныеЗадания

// Процедура запускается по регламентному заданию "ПерепроведениеДокументовСУО"
//
Процедура ПерепроведениеДокументовСУО() Экспорт

	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания();
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Перепроводим документ
	
	КоличествоПерепроведенных = 0;
	
	Пока Истина Цикл
	
		Задания = РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ЗаданияДляПроведения();
		
		Если Задания = Неопределено ИЛИ КоличествоПерепроведенных > 100000 Тогда
			Прервать;
		КонецЕсли;
		
		Пока Задания.Следующий() Цикл
			
			НачатьТранзакцию();
			
			ПовторитьПроведение = Ложь;
			РежимЗаписи = Задания.РежимЗаписиДокумента.Получить();
			
			// Блокируем данные
			
			ДокументОбъект = Задания.Ссылка.ПолучитьОбъект();
			
			Попытка
				
				Если НЕ ДокументОбъект.ПометкаУдаления Тогда
					
					ДокументОбъект.Заблокировать();
					
					ТекущийРежимЗаписи = РежимЗаписи;
					Если ТекущийРежимЗаписи = Неопределено Тогда				
						ТекущийРежимЗаписи = ?(ДокументОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);				
					КонецЕсли;			
					
					ДокументОбъект.ДополнительныеСвойства.Вставить("ОбновлятьПодчиненныеДокументы", Задания.ОбновлятьПодчиненныеДокументы);
					ДокументОбъект.ДополнительныеСвойства.Вставить("ЭтоПерепроведение", Истина);
					ДокументОбъект.ДополнительныеСвойства.Вставить("Важность", Задания.Важность);
					ДокументОбъект.Записать(ТекущийРежимЗаписи);
					
				КонецЕсли;
				
				// Удаляем запись о документе из регистра
				
				НаборЗаписей = РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Документ.Установить(Задания.Ссылка);
				НаборЗаписей.Записать(); // Удаляем набор
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				
				ПовторитьПроведение = Истина;
				ИмяДокумента = ДокументОбъект.Метаданные().Имя;
				ТекстОшибки = НСтр("ru = 'Выполнение задания по обновлению данных учебного процесса завершилось с ошибкой. '") + Строка(Задания.НомерПовтора) + Символы.ПС + ДокументОбъект.Номер + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				
				ЗаписьЖурналаРегистрации(
					НСтр("ru = 'Управление обучением.Обновление данных'"),
					УровеньЖурналаРегистрации.Предупреждение,
					,
					ИмяДокумента,
					ТекстОшибки);			
				
			КонецПопытки;		
								
			Если ПовторитьПроведение Тогда			
				Если Задания.НомерПовтора < 25 Тогда
					
					НомерПовтора = Задания.НомерПовтора + 1;
					РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(Задания.Ссылка, РежимЗаписи, Задания.ОбновлятьПодчиненныеДокументы, НомерПовтора, 0);
					
				Иначе
					
					ЗаписьЖурналаРегистрации(
						НСтр("ru = 'Управление обучением.Обновление данных'"),
						УровеньЖурналаРегистрации.Ошибка,
						,
						ИмяДокумента,
						ТекстОшибки);
						
					// Удаляем запись о документе из регистра
					
					НаборЗаписей = РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Документ.Установить(Задания.Ссылка);
					НаборЗаписей.Записать(); // Удаляем набор
						
				КонецЕсли;
			КонецЕсли;
			
			КоличествоПерепроведенных = КоличествоПерепроведенных + 1;
			
		КонецЦикла;
		
	КонецЦикла;
		
КонецПроцедуры

// Процедура запускается по регламентному заданию "ПроведениеАвтоматическихРассылокСУО"
//
Процедура ПровестиСозданныеАвтоматическиеРассылки() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания();
	
	УстановитьПривилегированныйРежим(Истина);	
	
	// Выбираем все непроведенные документы рассылок и проводим их
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РассылкаСообщенийСУО.Ссылка
		|ИЗ
		|	Документ.РассылкаСообщенийСУО КАК РассылкаСообщенийСУО
		|ГДЕ
		|	РассылкаСообщенийСУО.АвтоматическаяРассылка = ИСТИНА
		|	И РассылкаСообщенийСУО.Проведен = ЛОЖЬ
		|	И РассылкаСообщенийСУО.ПометкаУдаления = ЛОЖЬ
		|	И РассылкаСообщенийСУО.Дата < &ТекущаяДата";

	Запрос.Параметры.Вставить("ТекущаяДата", ТекущаяДатаСеанса());
		
	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	ОбщегоНазначенияСУ.ПерепровестиВыборкуДокументов(ВыборкаДетальныеЗаписи, РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

// Процедура запускается по регламентному заданию "РассылкаСообщенийНаЭлектроннуюПочтуСУО"
//
Процедура РазослатьСообщенияРассылокНаЭлектроннуюПочту() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания();
	
	УстановитьПривилегированныйРежим(Истина);
	
	РазослатьСообщенияНаЭлектроннуюПочту();
		
КонецПроцедуры

// Процедура запускается по регламентному заданию "КонтрольНепрочитанныхСообщенийСУО"
//
Процедура КонтрольНепрочитанныхЛичныхСообщенийСУО() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания();
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем автора автоматической рассылки
	
	АвторРассылки   = Константы.АвторАвтоматическихРассылокСУО.Получить();
	ТипАвтоРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.КонтрольНепрочитанныхЛичныхСообщений;
	
	Если НЕ ЗначениеЗаполнено(АвторРассылки) Тогда
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Автоматическая рассылка.Создание'"), 
			УровеньЖурналаРегистрации.Ошибка,,, 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для корректного формирования рассылки ""%1"" укажите автора автоматических рассылок в настройках информационной базы (Администрирование -> Органайзер и средства общения)'"),
			Строка(ТипАвтоРассылки)));
		
		Возврат; // Автор рассылки не указан
		
	КонецЕсли;
	
	// Ищем автоматическую рассылку
		
	АвтоматическаяРассылка = РегистрыСведений.АвтоматическиеРассылкиСУО.АвтоматическаяРассылка(ТипАвтоРассылки);
	
	Если АвтоматическаяРассылка = Неопределено Тогда
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Автоматическая рассылка. Автоматическая рассылка не найдена.'"), 
			УровеньЖурналаРегистрации.Ошибка,,,НСтр("ru = 'Создайте в регистре сведений ""Автоматические рассылки"" рассылку типа ""Контроль непрочитанных сообщений""'"));
			
		Возврат;
			
	КонецЕсли;	
	
	Шаблон                        = АвтоматическаяРассылка.Шаблон;
	ШаблонСообщенияАдминистратору = АвтоматическаяРассылка.ШаблонСообщенияАдминистратору;
	Администратор                 = АвтоматическаяРассылка.Администратор;
	ТолькоЭлектроннаяПочта        = АвтоматическаяРассылка.ТолькоЭлектроннаяПочта;
		
	НепрочитанныеТемыПользователей = Документы.СообщениеСУО.ПользователиСНовымиЛичнымиСообщениями();
	
	МассивПользователей = НепрочитанныеТемыПользователей.ВыгрузитьКолонку("Пользователь");
	
	НастройкиЗапретаУведомлений = РегистрыСведений.НастройкиПользователейСУО.ПолучитьНастройкуПользователей(МассивПользователей, "ЗапретитьУведомленияОНовыхЛичныхСообщениях");
	
	НачатьТранзакцию();
	
	Для каждого Строка Из НепрочитанныеТемыПользователей Цикл
		
		НастройкаПользователя = НастройкиЗапретаУведомлений.Найти(Строка.Пользователь, "Пользователь");
		
		Если НастройкаПользователя <> Неопределено И НастройкаПользователя.ЗапретитьУведомленияОНовыхЛичныхСообщениях Тогда
			Продолжить;
		КонецЕсли;		
		
		//0. Ищем ранее созданную автоматическую рассылку
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РассылкаСообщенийСУО.Ссылка,
			|	РассылкаСообщенийСУО.АдминистраторуАвтоматическойРассылки
			|ИЗ
			|	Документ.РассылкаСообщенийСУО КАК РассылкаСообщенийСУО
			|ГДЕ
			|	РассылкаСообщенийСУО.АвтоматическаяРассылка = ИСТИНА
			|	И РассылкаСообщенийСУО.ОснованиеАвтоматическойРассылки = &ОснованиеАвтоматическойРассылки
			|	И РассылкаСообщенийСУО.ТипАвтоматическойРассылки = &ТипАвтоматическойРассылки
			|	И РассылкаСообщенийСУО.ПометкаУдаления = ЛОЖЬ
			|	И РассылкаСообщенийСУО.КонтрольнаяСумма = &КонтрольнаяСумма";

		Запрос.УстановитьПараметр("ОснованиеАвтоматическойРассылки", Строка.Пользователь);
		Запрос.УстановитьПараметр("ТипАвтоматическойРассылки", ТипАвтоРассылки);
		Запрос.УстановитьПараметр("КонтрольнаяСумма", Строка.КонтрольнаяСумма);
		
		ТаблицаСозданныхРассылок = Запрос.Выполнить().Выгрузить();
		
		// 1. Создаем рассылку для пользователя
		
		Если ЗначениеЗаполнено(Шаблон) Тогда
			
			Если ТаблицаСозданныхРассылок.Найти(Ложь, "АдминистраторуАвтоматическойРассылки") <> Неопределено Тогда
				Продолжить; // Уже была рассылка с этой контрольной суммой
			КонецЕсли;	
			
			НоваяРассылка = Документы.РассылкаСообщенийСУО.СоздатьДокумент();
			
			НоваяРассылка.Дата                                 = ТекущаяДата();
			НоваяРассылка.Автор                                = АвторРассылки;
			НоваяРассылка.Шаблон                               = Шаблон;
			НоваяРассылка.Описание                             = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Автоматическая рассылка: ""%1"".'"), Строка(ТипАвтоРассылки));
			НоваяРассылка.Основание                            = Строка.Пользователь;
			НоваяРассылка.АвтоматическаяРассылка               = Истина;
			НоваяРассылка.ОснованиеАвтоматическойРассылки      = Строка.Пользователь;
			НоваяРассылка.ТолькоЭлектроннаяПочта               = ТолькоЭлектроннаяПочта;
			НоваяРассылка.ТипАвтоматическойРассылки            = ТипАвтоРассылки;
			НоваяРассылка.КонтрольнаяСумма                     = Строка.КонтрольнаяСумма;
			
			НоваяРассылка.АдминистраторуАвтоматическойРассылки = Ложь;
			
			НовыйАдресат = НоваяРассылка.Адресаты.Добавить();
			НовыйАдресат.Пользователь = Строка.Пользователь; 
			
			НоваяРассылка.ЗаполнитьПеременные();
			
			// Значения некоторых переменных нельзя заполнить исходя из основания рассылки,
			// Поэтому заполняем их отдельно:
			
			Для каждого СтрокаТЧ Из НоваяРассылка.ЗначенияПеременных Цикл
			
				Если СтрокаТЧ.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоСообщений Тогда
					СтрокаТЧ.Значение = Строка.КоличествоСообщений;
				КонецЕсли;
				
				Если СтрокаТЧ.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь Тогда
					СтрокаТЧ.Значение = Строка.Пользователь;
				КонецЕсли;
			
			КонецЦикла;
			
			НоваяРассылка.Записать(); // Не проводим
			
		КонецЕсли;
			
		// 2. Создаем рассылку для администратора
		
		Если ЗначениеЗаполнено(ШаблонСообщенияАдминистратору) Тогда
			
			Если ТаблицаСозданныхРассылок.Найти(Истина, "АдминистраторуАвтоматическойРассылки") <> Неопределено Тогда
				Продолжить; // Уже была рассылка с этой контрольной суммой
			КонецЕсли;			
			
			НоваяРассылка = Документы.РассылкаСообщенийСУО.СоздатьДокумент();
			
			НоваяРассылка.Дата                                 = ТекущаяДата();
			НоваяРассылка.Автор                                = АвторРассылки;
			НоваяРассылка.Шаблон                               = ШаблонСообщенияАдминистратору;
			НоваяРассылка.Описание                             = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Автоматическая рассылка администратору: ""%1"".'"), Строка(ТипАвтоРассылки));
			НоваяРассылка.Основание                            = Строка.Пользователь;
			НоваяРассылка.АвтоматическаяРассылка               = Истина;
			НоваяРассылка.ОснованиеАвтоматическойРассылки      = Строка.Пользователь;
			НоваяРассылка.ТолькоЭлектроннаяПочта               = ТолькоЭлектроннаяПочта;
			НоваяРассылка.АдминистраторуАвтоматическойРассылки = Истина;
			НоваяРассылка.ТипАвтоматическойРассылки            = ТипАвтоРассылки;
			НоваяРассылка.КонтрольнаяСумма                     = Строка.КонтрольнаяСумма;
			
			НовыйАдресат = НоваяРассылка.Адресаты.Добавить();
			
			Если ЗначениеЗаполнено(Администратор) Тогда
				НовыйАдресат.Пользователь = Администратор; 
			Иначе
				НовыйАдресат.Пользователь = АвторРассылки; 
			КонецЕсли;
			
			НоваяРассылка.ЗаполнитьПеременные();
			
			// Значения некоторых переменных нельзя заполнить исходя из основания рассылки,
			// Поэтому заполняем их отдельно:
			
			Для каждого СтрокаТЧ Из НоваяРассылка.ЗначенияПеременных Цикл
			
				Если СтрокаТЧ.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоСообщений Тогда
					СтрокаТЧ.Значение = Строка.КоличествоСообщений;
				КонецЕсли;
				
				Если СтрокаТЧ.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь Тогда
					СтрокаТЧ.Значение = Строка.Пользователь;
				КонецЕсли;
			
			КонецЦикла;
			
			НоваяРассылка.Записать(); // Не проводим
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();	
	
КонецПроцедуры

Процедура КонтрольНепрочитанныхТемФорумаСУО() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания();
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем автора автоматической рассылки
	
	АвторРассылки   = Константы.АвторАвтоматическихРассылокСУО.Получить();
	ТипАвтоРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.КонтрольНепрочитанныхТемФорума;
	
	Если НЕ ЗначениеЗаполнено(АвторРассылки) Тогда
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Автоматическая рассылка.Создание'"), 
			УровеньЖурналаРегистрации.Ошибка,,, 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось создать автоматическую рассылку ""%1"". Укажите автора автоматических рассылок в настройках информационной базы (Администрирование -> Органайзер и средства общения)'"),
			Строка(ТипАвтоРассылки)));
		
		Возврат; // Автор рассылки не указан
		
	КонецЕсли;
	
	// Ищем автоматическую рассылку
		
	АвтоматическаяРассылка = РегистрыСведений.АвтоматическиеРассылкиСУО.АвтоматическаяРассылка(ТипАвтоРассылки);
	
	Если АвтоматическаяРассылка = Неопределено Тогда
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Автоматическая рассылка. Автоматическая рассылка не найдена.'"), 
			УровеньЖурналаРегистрации.Ошибка,,,"Требуется создать в регистре сведений ""Автоматические рассылки"" рассылку типа ""Контроль непрочитанных тем форума"".");
			
		Возврат;
			
	КонецЕсли;	
	
	Шаблон                        = АвтоматическаяРассылка.Шаблон;
	ШаблонСообщенияАдминистратору = АвтоматическаяРассылка.ШаблонСообщенияАдминистратору;
	Администратор                 = АвтоматическаяРассылка.Администратор;
	ТолькоЭлектроннаяПочта        = АвтоматическаяРассылка.ТолькоЭлектроннаяПочта;
		
	НепрочитанныеТемыПользователей = Документы.СообщениеСУО.ПользователиСНовымиГрупповымиСообщениями();
	
	МассивПользователей = НепрочитанныеТемыПользователей.ВыгрузитьКолонку("Пользователь");
	
	НастройкиЗапретаУведомлений = РегистрыСведений.НастройкиПользователейСУО.ПолучитьНастройкуПользователей(МассивПользователей, "ЗапретитьУведомленияОНовыхСообщенияхФорума");
	
	НачатьТранзакцию();
	
	Для каждого Строка Из НепрочитанныеТемыПользователей Цикл
		
		НастройкаПользователя = НастройкиЗапретаУведомлений.Найти(Строка.Пользователь, "Пользователь");
		
		Если НастройкаПользователя <> Неопределено И НастройкаПользователя.ЗапретитьУведомленияОНовыхСообщенияхФорума Тогда
			Продолжить;
		КонецЕсли;
		
		//0. Ищем ранее созданную автоматическую рассылку
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РассылкаСообщенийСУО.Ссылка,
			|	РассылкаСообщенийСУО.АдминистраторуАвтоматическойРассылки
			|ИЗ
			|	Документ.РассылкаСообщенийСУО КАК РассылкаСообщенийСУО
			|ГДЕ
			|	РассылкаСообщенийСУО.АвтоматическаяРассылка = ИСТИНА
			|	И РассылкаСообщенийСУО.ОснованиеАвтоматическойРассылки = &ОснованиеАвтоматическойРассылки
			|	И РассылкаСообщенийСУО.ТипАвтоматическойРассылки = &ТипАвтоматическойРассылки
			|	И РассылкаСообщенийСУО.ПометкаУдаления = ЛОЖЬ
			|	И РассылкаСообщенийСУО.КонтрольнаяСумма = &КонтрольнаяСумма";

		Запрос.УстановитьПараметр("ОснованиеАвтоматическойРассылки", Строка.Пользователь);
		Запрос.УстановитьПараметр("ТипАвтоматическойРассылки", ТипАвтоРассылки);
		Запрос.УстановитьПараметр("КонтрольнаяСумма", Строка.КонтрольнаяСумма);
		
		ТаблицаСозданныхРассылок = Запрос.Выполнить().Выгрузить();		
		
		// 1. Создаем рассылку для пользователя
		
		Если ЗначениеЗаполнено(Шаблон) Тогда
			
			Если ТаблицаСозданныхРассылок.Найти(Ложь, "АдминистраторуАвтоматическойРассылки") <> Неопределено Тогда
				Продолжить; // Уже была рассылка с этой контрольной суммой
			КонецЕсли;				
			
			НоваяРассылка = Документы.РассылкаСообщенийСУО.СоздатьДокумент();
			
			НоваяРассылка.Дата                                 = ТекущаяДата();
			НоваяРассылка.Автор                                = АвторРассылки;
			НоваяРассылка.Шаблон                               = Шаблон;
			НоваяРассылка.Описание                             = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Автоматическая рассылка: ""%1"".'"), Строка(ТипАвтоРассылки));
			НоваяРассылка.Основание                            = Строка.Пользователь;
			НоваяРассылка.АвтоматическаяРассылка               = Истина;
			НоваяРассылка.ОснованиеАвтоматическойРассылки      = Строка.Пользователь;
			НоваяРассылка.ТолькоЭлектроннаяПочта               = ТолькоЭлектроннаяПочта;
			НоваяРассылка.ТипАвтоматическойРассылки            = ТипАвтоРассылки;
			НоваяРассылка.КонтрольнаяСумма                     = Строка.КонтрольнаяСумма;

			
			НоваяРассылка.АдминистраторуАвтоматическойРассылки = Ложь;
			
			НовыйАдресат = НоваяРассылка.Адресаты.Добавить();
			НовыйАдресат.Пользователь = Строка.Пользователь; 
			
			НоваяРассылка.ЗаполнитьПеременные();
			
			// Значения некоторых переменных нельзя заполнить исходя из основания рассылки,
			// Поэтому заполняем их отдельно:
			
			Для каждого СтрокаТЧ Из НоваяРассылка.ЗначенияПеременных Цикл
				
				Если СтрокаТЧ.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь Тогда
					СтрокаТЧ.Значение = Строка.Пользователь;
				КонецЕсли;
			
			КонецЦикла;
			
			НоваяРассылка.Записать(); // Не проводим
			
		КонецЕсли;
			
		// 2. Создаем рассылку для администратора
		
		Если ЗначениеЗаполнено(ШаблонСообщенияАдминистратору) Тогда
			
			Если ТаблицаСозданныхРассылок.Найти(Истина, "АдминистраторуАвтоматическойРассылки") <> Неопределено Тогда
				Продолжить; // Уже была рассылка с этой контрольной суммой
			КонецЕсли;				
			
			НоваяРассылка = Документы.РассылкаСообщенийСУО.СоздатьДокумент();
			
			НоваяРассылка.Дата                                 = ТекущаяДата();
			НоваяРассылка.Автор                                = АвторРассылки;
			НоваяРассылка.Шаблон                               = ШаблонСообщенияАдминистратору;
			НоваяРассылка.Описание                             = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Автоматическая рассылка администратору: ""%1"".'"), Строка(ТипАвтоРассылки));
			НоваяРассылка.Основание                            = Строка.Пользователь;
			НоваяРассылка.АвтоматическаяРассылка               = Истина;
			НоваяРассылка.ОснованиеАвтоматическойРассылки      = Строка.Пользователь;
			НоваяРассылка.ТолькоЭлектроннаяПочта               = ТолькоЭлектроннаяПочта;
			НоваяРассылка.АдминистраторуАвтоматическойРассылки = Истина;			
			НоваяРассылка.ТипАвтоматическойРассылки            = ТипАвтоРассылки;
			НоваяРассылка.КонтрольнаяСумма                     = Строка.КонтрольнаяСумма;

			НовыйАдресат = НоваяРассылка.Адресаты.Добавить();
			
			Если ЗначениеЗаполнено(Администратор) Тогда
				НовыйАдресат.Пользователь = Администратор; 
			Иначе
				НовыйАдресат.Пользователь = АвторРассылки; 
			КонецЕсли;
			
			НоваяРассылка.ЗаполнитьПеременные();
			
			// Значения некоторых переменных нельзя заполнить исходя из основания рассылки,
			// Поэтому заполняем их отдельно:
			
			Для каждого СтрокаТЧ Из НоваяРассылка.ЗначенияПеременных Цикл
				
				Если СтрокаТЧ.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Пользователь Тогда
					СтрокаТЧ.Значение = Строка.Пользователь;
				КонецЕсли;
			
			КонецЦикла;
			
			НоваяРассылка.Записать(); // Не проводим
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();	
	
КонецПроцедуры

// Зачисляет пользователей на обучение по расписанию из регистра "НовыеЗачисленияНаОбучениеСУО"
//
Процедура ЗачислениеПользователейНаОбучениеСУО(Пользователь = Неопределено, ОбновитьДанныеВебКабинета = Ложь) Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания();
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Выбираем данные
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НовыеЗачисленияНаОбучениеСУО.Пользователь,
		|	НовыеЗачисленияНаОбучениеСУО.ПроведениеОбучения
		|ИЗ
		|	РегистрСведений.НовыеЗачисленияНаОбучениеСУО КАК НовыеЗачисленияНаОбучениеСУО";
		
	Если Пользователь <> Неопределено Тогда		
		ОбщегоНазначенияСУ.ДобавитьОтборКЗапросу(Запрос, "НовыеЗачисленияНаОбучениеСУО.Пользователь = &Пользователь");		
		Запрос.Параметры.Вставить("Пользователь", Пользователь);		
	КонецЕсли;
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НачатьТранзакцию();
		
		// Блокируем данные
			
		Блокировка = Новый БлокировкаДанных;

		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.НовыеЗачисленияНаОбучениеСУО");
		ЭлементБлокировки.УстановитьЗначение("Пользователь", ВыборкаДетальныеЗаписи.Пользователь);
		ЭлементБлокировки.УстановитьЗначение("ПроведениеОбучения", ВыборкаДетальныеЗаписи.ПроведениеОбучения);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		Попытка 
			Блокировка.Заблокировать();
		Исключение
			ОтменитьТранзакцию();
			Возврат;
		КонецПопытки;
		
		// Зачисляем пользователя
		
		УправлениеОбучениемСУО.ЗачислитьУчастникаНаОбучение(ВыборкаДетальныеЗаписи.ПроведениеОбучения,, ВыборкаДетальныеЗаписи.Пользователь,,,,,,ОбновитьДанныеВебКабинета,,Истина);
		
		// Удаляем информацию из регистра
		
		НаборЗаписей = РегистрыСведений.НовыеЗачисленияНаОбучениеСУО.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Пользователь.Установить(ВыборкаДетальныеЗаписи.Пользователь);
		НаборЗаписей.Отбор.ПроведениеОбучения.Установить(ВыборкаДетальныеЗаписи.ПроведениеОбучения);
		НаборЗаписей.Записать(); // Удаляем набор
		
		ЗафиксироватьТранзакцию();
		
	КонецЦикла;	
		
КонецПроцедуры

// Включает или отключает доступ пользователей к программе по времени
//
Процедура КонтрольВремениДоступаПользователейСУО() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания();
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Закрываем сессии веб-кабинета
	
	Если ВебКабинетСУ.Используется() Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СессииВебКабинетаСУ.Пользователь,
			|	СессииВебКабинетаСУ.Идентификатор
			|ИЗ
			|	РегистрСведений.СессииВебКабинетаСУ КАК СессииВебКабинетаСУ
			|ГДЕ
			|	СессииВебКабинетаСУ.Закрыта = ЛОЖЬ";
		
		ТаблицаСессий = Запрос.Выполнить().Выгрузить();

		МассивПользователей = ТаблицаСессий.ВыгрузитьКолонку("Пользователь");
		
		Если МассивПользователей.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ТаблицаДоступа = РегистрыСведений.ВремяДоступаПользователейСУО.ТаблицаВремениДоступа(МассивПользователей);
		
		Если ТаблицаДоступа.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Для каждого Строка Из ТаблицаСессий Цикл
			
			ДанныеДоступа = ТаблицаДоступа.Найти(Строка.Пользователь);
			
			Если ДанныеДоступа = Неопределено Тогда
				Продолжить; // Нет ограничений доступа
			КонецЕсли;
			
			Если ДанныеДоступа.ДоступРазрешен Тогда
				Продолжить; // Доступ разрешен
			КонецЕсли;
			
			Если Пользователи.ЭтоПолноправныйПользователь(Строка.Пользователь,,Ложь) Тогда
				Продолжить; //Это полноправный пользователь
			КонецЕсли;
			
			РегистрыСведений.СессииВебКабинетаСУ.ЗакрытьСессию(Строка.Идентификатор); //Закрываем сессию (доступ закрыт)
		
		КонецЦикла;
		
	КонецЕсли;
		
	// Создаем рассылки	
	//	
	
	НачатьТранзакцию();	
	
	ТипАвтоРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПередОкончаниемДоступаКБазе;	
	АвторРассылки = Константы.АвторАвтоматическихРассылокСУО.Получить();
	
	// Ищем рассылки для каждого организатора
	
	ЗапросОрганизаторов = Новый Запрос;
	ЗапросОрганизаторов.Текст = 
		"ВЫБРАТЬ
		|	ОрганизаторыСУО.Ссылка
		|ИЗ
		|	Справочник.ОрганизаторыСУО КАК ОрганизаторыСУО
		|ГДЕ
		|	ОрганизаторыСУО.ПометкаУдаления = ЛОЖЬ";
	
	МассивОрганизаторов = ЗапросОрганизаторов.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	МассивОрганизаторов.Добавить(Справочники.ОрганизаторыСУО.ПустаяСсылка());
	
	Для каждого Организатор Из МассивОрганизаторов Цикл

		АвтоматическаяРассылка = РегистрыСведений.АвтоматическиеРассылкиСУО.АвтоматическаяРассылка(ТипАвтоРассылки,,,,,Организатор);
		
		Если АвтоматическаяРассылка = Неопределено Тогда
			Продолжить;
		КонецЕсли;
			
		// Делаем проверки
		
		Если НЕ ЗначениеЗаполнено(АвторРассылки) Тогда
			
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Автоматическая рассылка.Создание'"), 
			УровеньЖурналаРегистрации.Ошибка,,, 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Автоматическая рассылка ""%1"" не может быть создана, так как не указан автор автоматических рассылок в настройках информационной базы.'"),
			Строка(ТипАвтоРассылки)));		
			
			ОтменитьТранзакцию();
			
			Возврат;
			
		КонецЕсли;		
			
		// Получаем переменные
		
		Шаблон                         = АвтоматическаяРассылка.Шаблон;
		ШаблонСообщенияАдминистратору  = АвтоматическаяРассылка.ШаблонСообщенияАдминистратору;
		Администратор                  = АвтоматическаяРассылка.Администратор;
		ШаблонСообщенияОрганизаторам   = АвтоматическаяРассылка.ШаблонСообщенияОрганизаторам;
		ТолькоЭлектроннаяПочта         = АвтоматическаяРассылка.ТолькоЭлектроннаяПочта;		
		ОтборПользователей             = АвтоматическаяРассылка.ОтборПользователей;	
		КоличествоЧасов                = АвтоматическаяРассылка.КоличествоЧасов;
		АльтернативныйШаблон           = АвтоматическаяРассылка.АльтернативныйШаблон;
		АльтернативнаяЭлектроннаяПочта = АвтоматическаяРассылка.АльтернативнаяЭлектроннаяПочта;
		
		// Ищем тех, кому делаем рассылку
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВремяДоступаПользователейСУО.Пользователь,
			|	ВремяДоступаПользователейСУО.ДатаОкончанияДоступа
			|ИЗ
			|	РегистрСведений.ВремяДоступаПользователейСУО КАК ВремяДоступаПользователейСУО
			|ГДЕ
			|	(&КоличествоЧасов > 0
			|				И РАЗНОСТЬДАТ(&ТекущаяДата, ВремяДоступаПользователейСУО.ДатаОкончанияДоступа, ЧАС) <= &КоличествоЧасов
			|				И РАЗНОСТЬДАТ(&ТекущаяДата, ВремяДоступаПользователейСУО.ДатаОкончанияДоступа, ЧАС) > 0
			|			ИЛИ &КоличествоЧасов = 0
			|				И ВремяДоступаПользователейСУО.ДатаОкончанияДоступа < &ТекущаяДата)
			|	И ВремяДоступаПользователейСУО.ДатаОкончанияДоступа <> ДАТАВРЕМЯ(1, 1, 1)";
		
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		Запрос.УстановитьПараметр("КоличествоЧасов", КоличествоЧасов);
		
		ТаблицаПользователей = Запрос.Выполнить().Выгрузить();		
		
		// Формируем рассылки для каждого пользователя		
		
		Для каждого Строка Из ТаблицаПользователей Цикл
			
			// Делаем проверки
			
			Если ЗначениеЗаполнено(ОтборПользователей)
				И НЕ Справочники.ОтборыПользователейСУО.ПользовательВходитВОтбор(ОтборПользователей, Строка.Пользователь) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			// Получаем хэш события
			
			ХешированиеСобытия = Новый ХешированиеДанных(ХешФункция.CRC32);
			ХешированиеСобытия.Добавить(Формат(Строка.ДатаОкончанияДоступа,"ДФ=dd.MM.yyyy.hh.mm.ss"));
			ХешированиеСобытия.Добавить(ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(КоличествоЧасов));
			
			КонтрольнаяСуммаСобытия = ХешированиеСобытия.ХешСумма;			
			
			// Ищем ранее созданную автоматическую рассылку
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РассылкаСообщенийСУО.Ссылка,
			|	РассылкаСообщенийСУО.АдминистраторуАвтоматическойРассылки,
			|	РассылкаСообщенийСУО.Организаторам,
			|	ВЫБОР
			|		КОГДА РассылкаСообщенийСУО.ЭлектроннаяПочта <> ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПользователя)
			|				И РассылкаСообщенийСУО.ЭлектроннаяПочта <> ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ПустаяСсылка)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК АльтернативнаяРассылка
			|ИЗ
			|	Документ.РассылкаСообщенийСУО КАК РассылкаСообщенийСУО
			|ГДЕ
			|	РассылкаСообщенийСУО.АвтоматическаяРассылка = ИСТИНА
			|	И РассылкаСообщенийСУО.ОснованиеАвтоматическойРассылки = &ОснованиеАвтоматическойРассылки
			|	И РассылкаСообщенийСУО.ТипАвтоматическойРассылки = &ТипАвтоматическойРассылки
			|	И РассылкаСообщенийСУО.ПометкаУдаления = ЛОЖЬ
			|	И РассылкаСообщенийСУО.КонтрольнаяСумма = &КонтрольнаяСумма";
			
			Запрос.УстановитьПараметр("ОснованиеАвтоматическойРассылки", Строка.Пользователь);
			Запрос.УстановитьПараметр("ТипАвтоматическойРассылки", ТипАвтоРассылки);
			Запрос.УстановитьПараметр("КонтрольнаяСумма", КонтрольнаяСуммаСобытия);
			
			ТаблицаСозданныхРассылок = Запрос.Выполнить().Выгрузить();
			
			// 1. Создаем рассылку для пользователя
			
			Если ЗначениеЗаполнено(Шаблон) Тогда
				
				Если ТаблицаСозданныхРассылок.НайтиСтроки(Новый Структура("АдминистраторуАвтоматическойРассылки, Организаторам, АльтернативнаяРассылка", Ложь, Ложь, Ложь)).Количество() > 0 Тогда
					Продолжить; // Уже была рассылка с этой контрольной суммой
				КонецЕсли;	
				
				НоваяРассылка = Документы.РассылкаСообщенийСУО.СоздатьДокумент();
				
				НоваяРассылка.Дата                                 = ТекущаяДата();
				НоваяРассылка.Автор                                = АвторРассылки;
				НоваяРассылка.Шаблон                               = Шаблон;
				НоваяРассылка.Описание                             = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Автоматическая рассылка: ""%1"".'"), Строка(ТипАвтоРассылки));
				НоваяРассылка.Основание                            = Строка.Пользователь;
				НоваяРассылка.АвтоматическаяРассылка               = Истина;
				НоваяРассылка.ОснованиеАвтоматическойРассылки      = Строка.Пользователь;
				НоваяРассылка.ТолькоЭлектроннаяПочта               = ТолькоЭлектроннаяПочта;
				НоваяРассылка.ТипАвтоматическойРассылки            = ТипАвтоРассылки;
				НоваяРассылка.КонтрольнаяСумма                     = КонтрольнаяСуммаСобытия;
				
				НоваяРассылка.АдминистраторуАвтоматическойРассылки = Ложь;
				
				НовыйАдресат = НоваяРассылка.Адресаты.Добавить();
				НовыйАдресат.Пользователь = Строка.Пользователь; 
				
				НоваяРассылка.ЗаполнитьПеременные();
				
				НоваяРассылка.Записать(); // Не проводим
				
			КонецЕсли;
			
			// 2. Создаем рассылку для администратора
			
			Если ЗначениеЗаполнено(ШаблонСообщенияАдминистратору) Тогда
				
				Если ТаблицаСозданныхРассылок.Найти(Истина, "АдминистраторуАвтоматическойРассылки") <> Неопределено Тогда
					Продолжить; // Уже была рассылка с этой контрольной суммой
				КонецЕсли;			
				
				НоваяРассылка = Документы.РассылкаСообщенийСУО.СоздатьДокумент();
				
				НоваяРассылка.Дата                                 = ТекущаяДата();
				НоваяРассылка.Автор                                = АвторРассылки;
				НоваяРассылка.Шаблон                               = ШаблонСообщенияАдминистратору;
				НоваяРассылка.Описание                             = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Автоматическая рассылка администратору: ""%1"".'"), Строка(ТипАвтоРассылки));
				НоваяРассылка.Основание                            = Строка.Пользователь;
				НоваяРассылка.АвтоматическаяРассылка               = Истина;
				НоваяРассылка.ОснованиеАвтоматическойРассылки      = Строка.Пользователь;
				НоваяРассылка.ТолькоЭлектроннаяПочта               = ТолькоЭлектроннаяПочта;
				НоваяРассылка.АдминистраторуАвтоматическойРассылки = Истина;
				НоваяРассылка.ТипАвтоматическойРассылки            = ТипАвтоРассылки;
				НоваяРассылка.КонтрольнаяСумма                     = КонтрольнаяСуммаСобытия;
				
				НовыйАдресат = НоваяРассылка.Адресаты.Добавить();
				
				Если ЗначениеЗаполнено(Администратор) Тогда
					НовыйАдресат.Пользователь = Администратор; 
				Иначе
					НовыйАдресат.Пользователь = АвторРассылки; 
				КонецЕсли;
				
				НоваяРассылка.ЗаполнитьПеременные();				
				
				НоваяРассылка.Записать(); // Не проводим
				
			КонецЕсли;
			
			// 3. Создаем рассылку для организатора
			
			Если ЗначениеЗаполнено(ШаблонСообщенияОрганизаторам) Тогда
				
				Если ТаблицаСозданныхРассылок.Найти(Истина, "Организаторам") <> Неопределено Тогда
					Продолжить; // Уже была рассылка с этой контрольной суммой
				КонецЕсли;			
				
				НоваяРассылка = Документы.РассылкаСообщенийСУО.СоздатьДокумент();
				
				НоваяРассылка.Дата                                 = ТекущаяДата();
				НоваяРассылка.Автор                                = АвторРассылки;
				НоваяРассылка.Шаблон                               = ШаблонСообщенияОрганизаторам;
				НоваяРассылка.Описание                             = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Автоматическая рассылка организатору: ""%1"".'"), Строка(ТипАвтоРассылки));
				НоваяРассылка.Основание                            = Строка.Пользователь;
				НоваяРассылка.АвтоматическаяРассылка               = Истина;
				НоваяРассылка.ОснованиеАвтоматическойРассылки      = Строка.Пользователь;
				НоваяРассылка.ТолькоЭлектроннаяПочта               = ТолькоЭлектроннаяПочта;
				НоваяРассылка.Организаторам                        = Истина;
				НоваяРассылка.ТипАвтоматическойРассылки            = ТипАвтоРассылки;
				НоваяРассылка.КонтрольнаяСумма                     = КонтрольнаяСуммаСобытия;
				
				НовыйАдресат = НоваяРассылка.Адресаты.Добавить();
				
				Если ЗначениеЗаполнено(Организатор) Тогда
					НовыйАдресат.Пользователь = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организатор, "Пользователь"); 
				Иначе
					НовыйАдресат.Пользователь = АвторРассылки; 
				КонецЕсли;
				
				НоваяРассылка.ЗаполнитьПеременные();				
				
				НоваяРассылка.Записать(); // Не проводим
				
			КонецЕсли;			
			
			// 4. Создаем альтернативное сообщение
				
			Если Значениезаполнено(АльтернативныйШаблон)
				И ЗначениеЗаполнено(АльтернативнаяЭлектроннаяПочта) Тогда
				
				Если ТаблицаСозданныхРассылок.Найти(Истина, "АльтернативнаяРассылка") <> Неопределено Тогда
					Продолжить; // Уже была рассылка с этой контрольной суммой
				КонецЕсли;			
				
	
				НоваяРассылка = Документы.РассылкаСообщенийСУО.СоздатьДокумент();
				
				НоваяРассылка.Дата                                 = ТекущаяДата();
				НоваяРассылка.Автор                                = АвторРассылки;
				НоваяРассылка.Шаблон                               = АльтернативныйШаблон;
				НоваяРассылка.Описание                             = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Автоматическая рассылка на альтернативный адрес: ""%1"".'"), Строка(ТипАвтоРассылки));
				НоваяРассылка.Основание                            = Строка.Пользователь;
				НоваяРассылка.АвтоматическаяРассылка               = Истина;
				НоваяРассылка.ОснованиеАвтоматическойРассылки      = Строка.Пользователь;
				НоваяРассылка.ТолькоЭлектроннаяПочта               = ТолькоЭлектроннаяПочта;
				НоваяРассылка.ТипАвтоматическойРассылки            = ТипАвтоРассылки;
				НоваяРассылка.КонтрольнаяСумма                     = КонтрольнаяСуммаСобытия;
				НоваяРассылка.ЭлектроннаяПочта                     = АльтернативнаяЭлектроннаяПочта;
				
				НоваяРассылка.АдминистраторуАвтоматическойРассылки = Ложь;
				
				НовыйАдресат = НоваяРассылка.Адресаты.Добавить();
				НовыйАдресат.Пользователь = Строка.Пользователь; 
				
				НоваяРассылка.ЗаполнитьПеременные();
				
				НоваяРассылка.Записать(); // Не проводим
				
			КонецЕсли;

			
		КонецЦикла;
		
		
	КонецЦикла;
	
	
	
	ЗафиксироватьТранзакцию();

	
КонецПроцедуры

Процедура ФормированиеОтборовПользователейСУО() Экспорт
	
	// Создаем рассылки
	//	
	
	// Выбираем все отборы
	
	МассивОтборов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтборыПользователейСУО.Ссылка
		|ИЗ
		|	Справочник.ОтборыПользователейСУО КАК ОтборыПользователейСУО
		|ГДЕ
		|	ОтборыПользователейСУО.ЭтоГруппа = ЛОЖЬ
		|	И ОтборыПользователейСУО.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивОтборов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");	
	
	// Получаем массив организаторов
	
	ЗапросОрганизаторов = Новый Запрос;
	ЗапросОрганизаторов.Текст = 
		"ВЫБРАТЬ
		|	ОрганизаторыСУО.Ссылка
		|ИЗ
		|	Справочник.ОрганизаторыСУО КАК ОрганизаторыСУО
		|ГДЕ
		|	ОрганизаторыСУО.ПометкаУдаления = ЛОЖЬ";
	
	МассивОрганизаторов = ЗапросОрганизаторов.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	МассивОрганизаторов.Добавить(Справочники.ОрганизаторыСУО.ПустаяСсылка()); // Без организатора
	
	// Получаем рассылки
	
	ТипАвтоРассылки = Перечисления.ТипыАвтоматическихРассылокСУО.ПриОбновленииОтбораПользователей;	
	АвторРассылки = Константы.АвторАвтоматическихРассылокСУО.Получить();	
	
	Если НЕ ЗначениеЗаполнено(АвторРассылки) Тогда		
		Возврат;		
	КонецЕсли;	
	
	Для каждого Отбор Из МассивОтборов Цикл		
				
		Для каждого Организатор Из МассивОрганизаторов Цикл
			
			АвтоматическаяРассылка = РегистрыСведений.АвтоматическиеРассылкиСУО.АвтоматическаяРассылка(ТипАвтоРассылки,,,,, Организатор, Отбор);
			
			Если АвтоматическаяРассылка = Неопределено Тогда
				Продолжить;
			КонецЕсли;

			// Получаем переменные
			
			ПользователиОтбора = Новый Массив;			
			Справочники.ОтборыПользователейСУО.ПользователиОтбора(Отбор, ПользователиОтбора);			
			
			Шаблон                         = АвтоматическаяРассылка.Шаблон;			
			ШаблонСообщенияАдминистратору  = АвтоматическаяРассылка.ШаблонСообщенияАдминистратору;
			Администратор                  = АвтоматическаяРассылка.Администратор;			
			ШаблонСообщенияОрганизаторам   = АвтоматическаяРассылка.ШаблонСообщенияОрганизаторам;			
			ТолькоЭлектроннаяПочта         = АвтоматическаяРассылка.ТолькоЭлектроннаяПочта;		
			АльтернативныйШаблон           = АвтоматическаяРассылка.АльтернативныйШаблон;
			АльтернативнаяЭлектроннаяПочта = АвтоматическаяРассылка.АльтернативнаяЭлектроннаяПочта;
			
			Для каждого Пользователь Из ПользователиОтбора Цикл
		
				// Ищем ранее созданную автоматическую рассылку
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	РассылкаСообщенийСУО.Ссылка,
					|	РассылкаСообщенийСУО.АдминистраторуАвтоматическойРассылки,
					|	РассылкаСообщенийСУО.Организаторам,
					|	ВЫБОР
					|		КОГДА РассылкаСообщенийСУО.ЭлектроннаяПочта <> ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПользователя)
					|				И РассылкаСообщенийСУО.ЭлектроннаяПочта <> ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ПустаяСсылка)
					|			ТОГДА ИСТИНА
					|		ИНАЧЕ ЛОЖЬ
					|	КОНЕЦ КАК АльтернативнаяРассылка
					|ИЗ
					|	Документ.РассылкаСообщенийСУО КАК РассылкаСообщенийСУО
					|ГДЕ
					|	РассылкаСообщенийСУО.АвтоматическаяРассылка = ИСТИНА
					|	И РассылкаСообщенийСУО.ОснованиеАвтоматическойРассылки = &ОснованиеАвтоматическойРассылки
					|	И РассылкаСообщенийСУО.ТипАвтоматическойРассылки = &ТипАвтоматическойРассылки
					|	И РассылкаСообщенийСУО.ПометкаУдаления = ЛОЖЬ
					|	И РассылкаСообщенийСУО.Основание = &Отбор";
				
				Запрос.УстановитьПараметр("ОснованиеАвтоматическойРассылки", Пользователь);
				Запрос.УстановитьПараметр("ТипАвтоматическойРассылки", ТипАвтоРассылки);
				Запрос.УстановитьПараметр("Отбор", Отбор);
				
				ТаблицаСозданныхРассылок = Запрос.Выполнить().Выгрузить();				
				
				// 1. Создаем рассылку для пользователя
				
				Если ЗначениеЗаполнено(Шаблон) Тогда
					
					Если ТаблицаСозданныхРассылок.НайтиСтроки(Новый Структура("АдминистраторуАвтоматическойРассылки, Организаторам, АльтернативнаяРассылка", Ложь, Ложь, Ложь)).Количество() > 0 Тогда
						Продолжить; // Уже была рассылка
					КонецЕсли;	
					
					НоваяРассылка = Документы.РассылкаСообщенийСУО.СоздатьДокумент();
					
					НоваяРассылка.Дата                                 = ТекущаяДата();
					НоваяРассылка.Автор                                = АвторРассылки;
					НоваяРассылка.Шаблон                               = Шаблон;
					НоваяРассылка.Описание                             = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Автоматическая рассылка: ""%1"".'"), Строка(ТипАвтоРассылки));
					НоваяРассылка.Основание                            = Отбор;
					НоваяРассылка.АвтоматическаяРассылка               = Истина;
					НоваяРассылка.ОснованиеАвтоматическойРассылки      = Пользователь;
					НоваяРассылка.ТолькоЭлектроннаяПочта               = ТолькоЭлектроннаяПочта;
					НоваяРассылка.ТипАвтоматическойРассылки            = ТипАвтоРассылки;
					
					НоваяРассылка.АдминистраторуАвтоматическойРассылки = Ложь;
					
					НовыйАдресат = НоваяРассылка.Адресаты.Добавить();
					НовыйАдресат.Пользователь = Пользователь; 
					
					НоваяРассылка.ЗаполнитьПеременные();
					
					НоваяРассылка.Записать(); // Не проводим
					
				КонецЕсли;
				
				// 2. Создаем рассылку для администратора
				
				Если ЗначениеЗаполнено(ШаблонСообщенияАдминистратору) Тогда
					
					Если ТаблицаСозданныхРассылок.Найти(Истина, "АдминистраторуАвтоматическойРассылки") <> Неопределено Тогда
						Продолжить; // Уже была рассылка
					КонецЕсли;			
					
					НоваяРассылка = Документы.РассылкаСообщенийСУО.СоздатьДокумент();
					
					НоваяРассылка.Дата                                 = ТекущаяДата();
					НоваяРассылка.Автор                                = АвторРассылки;
					НоваяРассылка.Шаблон                               = ШаблонСообщенияАдминистратору;
					НоваяРассылка.Описание                             = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Автоматическая рассылка администратору: ""%1"".'"), Строка(ТипАвтоРассылки));
					НоваяРассылка.Основание                            = Отбор;
					НоваяРассылка.АвтоматическаяРассылка               = Истина;
					НоваяРассылка.ОснованиеАвтоматическойРассылки      = Пользователь;
					НоваяРассылка.ТолькоЭлектроннаяПочта               = ТолькоЭлектроннаяПочта;
					НоваяРассылка.АдминистраторуАвтоматическойРассылки = Истина;
					НоваяРассылка.ТипАвтоматическойРассылки            = ТипАвтоРассылки;
					
					НовыйАдресат = НоваяРассылка.Адресаты.Добавить();
					
					Если ЗначениеЗаполнено(Администратор) Тогда
						НовыйАдресат.Пользователь = Администратор; 
					Иначе
						НовыйАдресат.Пользователь = АвторРассылки; 
					КонецЕсли;
					
					НоваяРассылка.ЗаполнитьПеременные();				
					
					НоваяРассылка.Записать(); // Не проводим
					
				КонецЕсли;
				
				// 2. Создаем рассылку для организатора
				
				Если ЗначениеЗаполнено(ШаблонСообщенияОрганизаторам) Тогда
					
					Если ТаблицаСозданныхРассылок.Найти(Истина, "Организаторам") <> Неопределено Тогда
						Продолжить; // Уже была рассылка с этой контрольной суммой
					КонецЕсли;			
					
					НоваяРассылка = Документы.РассылкаСообщенийСУО.СоздатьДокумент();
					
					НоваяРассылка.Дата                                 = ТекущаяДата();
					НоваяРассылка.Автор                                = АвторРассылки;
					НоваяРассылка.Шаблон                               = ШаблонСообщенияОрганизаторам;
					НоваяРассылка.Описание                             = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Автоматическая рассылка организатору: ""%1"".'"), Строка(ТипАвтоРассылки));
					НоваяРассылка.Основание                            = Отбор;
					НоваяРассылка.АвтоматическаяРассылка               = Истина;
					НоваяРассылка.ОснованиеАвтоматическойРассылки      = Пользователь;
					НоваяРассылка.ТолькоЭлектроннаяПочта               = ТолькоЭлектроннаяПочта;
					НоваяРассылка.Организаторам                        = Истина;
					НоваяРассылка.ТипАвтоматическойРассылки            = ТипАвтоРассылки;
					
					НовыйАдресат = НоваяРассылка.Адресаты.Добавить();
					
					Если ЗначениеЗаполнено(Организатор) Тогда
						НовыйАдресат.Пользователь = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организатор, "Пользователь"); 
					Иначе
						НовыйАдресат.Пользователь = АвторРассылки; 
					КонецЕсли;
					
					НоваяРассылка.ЗаполнитьПеременные();				
					
					НоваяРассылка.Записать(); // Не проводим
					
				КонецЕсли;			
				
				// 3. Создаем альтернативное сообщение
				
				Если Значениезаполнено(АльтернативныйШаблон)
					И ЗначениеЗаполнено(АльтернативнаяЭлектроннаяПочта) Тогда
					
					Если ТаблицаСозданныхРассылок.Найти(Истина, "АльтернативнаяРассылка") <> Неопределено Тогда
						Продолжить; // Уже была рассылка с этой контрольной суммой
					КонецЕсли;			
					
					НоваяРассылка = Документы.РассылкаСообщенийСУО.СоздатьДокумент();
					
					НоваяРассылка.Дата                                 = ТекущаяДата();
					НоваяРассылка.Автор                                = АвторРассылки;
					НоваяРассылка.Шаблон                               = АльтернативныйШаблон;
					НоваяРассылка.Описание                             = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Автоматическая рассылка на альтернативный адрес: ""%1"".'"), Строка(ТипАвтоРассылки));
					НоваяРассылка.Основание                            = Отбор;
					НоваяРассылка.АвтоматическаяРассылка               = Истина;
					НоваяРассылка.ОснованиеАвтоматическойРассылки      = Пользователь;
					НоваяРассылка.ТолькоЭлектроннаяПочта               = ТолькоЭлектроннаяПочта;

					НоваяРассылка.ТипАвтоматическойРассылки            = ТипАвтоРассылки;
					НоваяРассылка.ЭлектроннаяПочта                     = АльтернативнаяЭлектроннаяПочта;
					
					НовыйАдресат = НоваяРассылка.Адресаты.Добавить();
					НовыйАдресат.Пользователь = Пользователь; 
					
					НоваяРассылка.ЗаполнитьПеременные();
					
					НоваяРассылка.Записать(); // Не проводим
					
					
				КонецЕсли;
				
			КонецЦикла;
				
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗакрытиеДоступаКБазеУволеннымСотрудникам() Экспорт
	
	// 1. Выбираем уволенных, которые имеют доступ к базе.
	// 2. Выбираем из уволенных тех, кто еще работает в других организациях.
	// 3. Выбираем уволенных, без учета тех, кто работает в других организация.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СотрудникиСУОСрезПоследних.Пользователь
		|ПОМЕСТИТЬ Уволенные
		|ИЗ
		|	РегистрСведений.СотрудникиСУО.СрезПоследних(, ) КАК СотрудникиСУОСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО СотрудникиСУОСрезПоследних.Пользователь = Пользователи.Ссылка
		|ГДЕ
		|	Пользователи.Недействителен = ЛОЖЬ
		|	И СотрудникиСУОСрезПоследних.Уволен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Уволенные.Пользователь
		|ПОМЕСТИТЬ РаботающиеСовместители
		|ИЗ
		|	Уволенные КАК Уволенные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиСУО.СрезПоследних(, ) КАК СотрудникиСУОСрезПоследних
		|		ПО Уволенные.Пользователь = СотрудникиСУОСрезПоследних.Пользователь
		|ГДЕ
		|	СотрудникиСУОСрезПоследних.Уволен = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Уволенные.Пользователь
		|ИЗ
		|	Уволенные КАК Уволенные
		|ГДЕ
		|	НЕ Уволенные.Пользователь В
		|				(ВЫБРАТЬ
		|					РаботающиеСовместители.Пользователь
		|				ИЗ
		|					РаботающиеСовместители КАК РаботающиеСовместители)";
	
	ПользователиДляЗакрытия = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");

	// Делаем пользователей недействительными
	
	НачатьТранзакцию();
	
	Попытка
		
		Для каждого Пользователь Из ПользователиДляЗакрытия Цикл
			
			ПользовательОбъект = Пользователь.ПолучитьОбъект();
			ПользовательОбъект.Недействителен = Истина;
			
			ОписаниеПользователяИБ = Новый Структура;				
			ОписаниеПользователяИБ.Вставить("Действие", "Удалить");

			ПользовательОбъект.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);
			
			ПользовательОбъект.Записать();
			
		КонецЦикла;		
		
		// Отменяем задания
		
		ЗаданияНаПроверку = Документы.ПопыткаВыполненияЗаданияСУО.ЗаданияТребующиеПроверки(ПользователиДляЗакрытия);
		
		Для каждого ПопыткаВыполненияЗадания Из ЗаданияНаПроверку Цикл		
			Документы.ПопыткаВыполненияЗаданияСУО.ОтменитьВыполнениеЗадания(ПопыткаВыполненияЗадания);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	
КонецПроцедуры

Процедура АктивацияПроведенийОбучения() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДатаПроверки = ТекущаяДатаСеанса();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроведениеОбученияСУО.Ссылка
		|ИЗ
		|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
		|ГДЕ
		|	ПроведениеОбученияСУО.АктивироватьАвтоматически = ИСТИНА
		|	И ПроведениеОбученияСУО.ДатаНачалаДоступа <= &ТекущаяДата
		|	И ПроведениеОбученияСУО.ДатаНачалаДоступа > &ПустаяДата
		|	И ПроведениеОбученияСУО.Статус = &СтатусЗапланировано
		|	И ПроведениеОбученияСУО.Проведен = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПроведениеОбученияСУО.Ссылка
		|ИЗ
		|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
		|ГДЕ
		|	ПроведениеОбученияСУО.АктивироватьАвтоматически = ИСТИНА
		|	И ПроведениеОбученияСУО.ДатаНачалаПроведения <= &ТекущаяДата
		|	И ПроведениеОбученияСУО.ДатаНачалаПроведения > &ПустаяДата
		|	И ПроведениеОбученияСУО.Статус = &СтатусЗапланировано
		|	И ПроведениеОбученияСУО.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("СтатусЗапланировано", Перечисления.СтатусыПроведенияОбъектовСУО.Запланировано);
	Запрос.УстановитьПараметр("ТекущаяДата", ДатаПроверки);
	Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПроведениеОбученияОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		Попытка 
			ПроведениеОбученияОбъект.Заблокировать();
		Исключение	
			ЗаписьЖурналаРегистрации(
				НСТр("ru = 'Управление обучением.Обновление данных'"),
				УровеньЖурналаРегистрации.Ошибка,
				,
				ПроведениеОбученияОбъект.Ссылка,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Продолжить;
		КонецПопытки;
		
		ПроведениеОбученияОбъект.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Активно;
		
		Попытка
			ПроведениеОбученияОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ЗаписьЖурналаРегистрации(
				НСТр("ru = 'Управление обучением.Обновление данных'"),
				УровеньЖурналаРегистрации.Ошибка,
				,
				ПроведениеОбученияОбъект.Ссылка,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Продолжить;
		КонецПопытки;
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЗакрытиеДоступаКБазеСтудентамСУО() Экспорт
	
	// Выбираем статусы для которых следует закрыть доступ
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыСтудентовОО.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтатусыСтудентовОО КАК СтатусыСтудентовОО
		|ГДЕ
		|	СтатусыСтудентовОО.ПометкаУдаления = ЛОЖЬ
		|	И СтатусыСтудентовОО.ЭтоГруппа = ЛОЖЬ
		|	И СтатусыСтудентовОО.ЗакрыватьДоступАвтоматически = ИСТИНА";
	
	СтатусыСтудентов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Если СтатусыСтудентов.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Невозможно выполнить задание «Закрытие доступа к базе студентам», так как отсутствуют статусы студентов с флажком «Закрывать доступ автоматически»'");
	КонецЕсли;

	// Выбираем студентов
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтудентыСрезПоследних.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.СтудентыОО.СрезПоследних(, ) КАК СтудентыСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО СтудентыСрезПоследних.Пользователь = Пользователи.Ссылка
		|ГДЕ
		|	Пользователи.Недействителен = ЛОЖЬ
		|	И СтудентыСрезПоследних.Статус В(&СтатусыСтедентов)";
	
	
	Запрос.Параметры.Вставить("СтатусыСтедентов", СтатусыСтудентов);
	
	ПользователиДляЗакрытия = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");

	// Очищаем данные
	
	НачатьТранзакцию();
	
	Попытка
		
		// Делаем пользователей недействительными
		
		Для каждого Пользователь Из ПользователиДляЗакрытия Цикл
			
			ПользовательОбъект = Пользователь.ПолучитьОбъект();
			ПользовательОбъект.Недействителен = Истина;
			
			ОписаниеПользователяИБ = Новый Структура;				
			ОписаниеПользователяИБ.Вставить("Действие", "Удалить");

			ПользовательОбъект.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);
			
			ПользовательОбъект.Записать();
			
		КонецЦикла;		
		
		// Отменяем задания
		
		ЗаданияНаПроверку = Документы.ПопыткаВыполненияЗаданияСУО.ЗаданияТребующиеПроверки(ПользователиДляЗакрытия);
		
		Для каждого ПопыткаВыполненияЗадания Из ЗаданияНаПроверку Цикл		
			Документы.ПопыткаВыполненияЗаданияСУО.ОтменитьВыполнениеЗадания(ПопыткаВыполненияЗадания);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;	
	
	
КонецПроцедуры

#КонецОбласти

#Область Предприятие

// Перепроводит документы и обновляет другие данные, относящиеся к сотруднику
//
Процедура ОбновитьДанныеСотрудников(Знач Пользователь = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Пользователь = Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Пользователи.Ссылка
			|ИЗ
			|	Справочник.Пользователи КАК Пользователи
			|ГДЕ
			|	Пользователи.ПометкаУдаления = ЛОЖЬ";

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбновитьДанныеСотрудников(ВыборкаДетальныеЗаписи.Ссылка); // Рекурсия
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	
	// Выбираем данные о сотруднике
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиСУОСрезПоследних.Организация,
		|	СотрудникиСУОСрезПоследних.ПодразделениеПредприятия,
		|	СотрудникиСУОСрезПоследних.Должность,
		|	СотрудникиСУОСрезПоследних.ПодразделениеОрганизации,
		|	СотрудникиСУОСрезПоследних.Пользователь
		|ИЗ
		|	РегистрСведений.СотрудникиСУО.СрезПоследних(, Пользователь = &Пользователь) КАК СотрудникиСУОСрезПоследних";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	// Записываем документы, которые надо будет перепровести
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл // Размер выборки почти всегда будет равен 1 или чуть больше
		
		ЗапросДок = Новый Запрос;
		ЗапросДок.Текст = 
			"ВЫБРАТЬ
			|	ПроведениеОбученияСУОДолжности.Ссылка
			|ИЗ
			|	Документ.ПроведениеОбученияСУО.Должности КАК ПроведениеОбученияСУОДолжности
			|ГДЕ
			|	ПроведениеОбученияСУОДолжности.Должность = &Должность
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПроведениеОбученияСУООрганизации.Ссылка
			|ИЗ
			|	Документ.ПроведениеОбученияСУО.Организации КАК ПроведениеОбученияСУООрганизации
			|ГДЕ
			|	ПроведениеОбученияСУООрганизации.Организация = &Организация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПроведениеОбученияСУОПодразделенияПредприятия.Ссылка
			|ИЗ
			|	Документ.ПроведениеОбученияСУО.ПодразделенияПредприятия КАК ПроведениеОбученияСУОПодразделенияПредприятия
			|ГДЕ
			|	ПроведениеОбученияСУОПодразделенияПредприятия.ПодразделениеПредприятия = &ПодразделениеПредприятия
			|;";
			
		ЗапросДок.Текст = ЗапросДок.Текст + "
			|
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПроведениеПрограммыОбученияСУОДолжности.Ссылка
			|ИЗ
			|	Документ.ПроведениеПрограммыОбученияСУО.Должности КАК ПроведениеПрограммыОбученияСУОДолжности
			|ГДЕ
			|	ПроведениеПрограммыОбученияСУОДолжности.Должность = &Должность
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПроведениеПрограммыОбученияСУООрганизации.Ссылка
			|ИЗ
			|	Документ.ПроведениеПрограммыОбученияСУО.Организации КАК ПроведениеПрограммыОбученияСУООрганизации
			|ГДЕ
			|	ПроведениеПрограммыОбученияСУООрганизации.Организация = &Организация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПроведениеПрограммыОбученияСУОПодразделенияПредприятия.Ссылка
			|ИЗ
			|	Документ.ПроведениеПрограммыОбученияСУО.ПодразделенияПредприятия КАК ПроведениеПрограммыОбученияСУОПодразделенияПредприятия
			|ГДЕ
			|	ПроведениеПрограммыОбученияСУОПодразделенияПредприятия.ПодразделениеПредприятия = &ПодразделениеПредприятия
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НаполнениеБиблиотекиПользователейСУОДолжности.Ссылка
			|ИЗ
			|	Документ.НаполнениеБиблиотекиПользователейСУО.Должности КАК НаполнениеБиблиотекиПользователейСУОДолжности
			|ГДЕ
			|	НаполнениеБиблиотекиПользователейСУОДолжности.Должность = &Должность
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НаполнениеБиблиотекиПользователейСУООрганизации.Ссылка
			|ИЗ
			|	Документ.НаполнениеБиблиотекиПользователейСУО.Организации КАК НаполнениеБиблиотекиПользователейСУООрганизации
			|ГДЕ
			|	НаполнениеБиблиотекиПользователейСУООрганизации.Организация = &Организация
			|	ИЛИ НаполнениеБиблиотекиПользователейСУООрганизации.ПодразделениеОрганизации = &ПодразделениеОрганизации
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НаполнениеБиблиотекиПользователейСУОПодразделенияПредприятия.Ссылка
			|ИЗ
			|	Документ.НаполнениеБиблиотекиПользователейСУО.ПодразделенияПредприятия КАК НаполнениеБиблиотекиПользователейСУОПодразделенияПредприятия
			|ГДЕ
			|	НаполнениеБиблиотекиПользователейСУОПодразделенияПредприятия.ПодразделениеПредприятия = &ПодразделениеПредприятия";

		
		ЗапросДок.УстановитьПараметр("Должность", ВыборкаДетальныеЗаписи.Должность);
		ЗапросДок.УстановитьПараметр("Организация", ВыборкаДетальныеЗаписи.Организация);
		ЗапросДок.УстановитьПараметр("ПодразделениеПредприятия", ВыборкаДетальныеЗаписи.ПодразделениеПредприятия);
		ЗапросДок.УстановитьПараметр("ПодразделениеОрганизации", ВыборкаДетальныеЗаписи.ПодразделениеОрганизации);

		МассивРезультатовДок = ЗапросДок.ВыполнитьПакет();
		
		Для каждого РезультатДок Из МассивРезультатовДок Цикл
		
			ВыборкаДетальныеЗаписиДок = РезультатДок.Выбрать();
			
			РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокументы(ВыборкаДетальныеЗаписиДок,,,3);
		
		КонецЦикла;
		
	КонецЦикла;
	
	// Записываем руководителей сотрудника
	
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		ЗаписатьДанныеОРуководителяхСотрудника(Пользователь, ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
КонецПроцедуры

Процедура РазместитьНаФормеДанныеОСотруднике(Форма, Пользователь, ИмяГруппыЭлементов) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ПравоДоступа("Просмотр", Метаданные.РегистрыСведений.СотрудникиСУО) Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиСУОСрезПоследних.Организация,
		|	СотрудникиСУОСрезПоследних.ПодразделениеОрганизации,
		|	СотрудникиСУОСрезПоследних.ПодразделениеПредприятия,
		|	СотрудникиСУОСрезПоследних.Должность,
		|	СотрудникиСУОСрезПоследних.Уволен
		|ИЗ
		|	РегистрСведений.СотрудникиСУО.СрезПоследних(, Пользователь = &Пользователь) КАК СотрудникиСУОСрезПоследних";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	НомерЗаписи       = 0;
	КоличествоЗаписей = ВыборкаДетальныеЗаписи.Количество();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НомерЗаписи = НомерЗаписи + 1;
		
		// Добавляем реквизиты формы
		
		ДобавляемыеРеквизиты = Новый Массив();
		
		НовыйРеквизит = Новый РеквизитФормы("Организация" + НомерЗаписи,
									   Новый ОписаниеТипов("СправочникСсылка.Организации"),
									   "",
									   НСтр("ru = 'Организация'"),
									   Ложь);
									   
		
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
		НовыйРеквизит = Новый РеквизитФормы("ПодразделениеОрганизации" + НомерЗаписи,
									   Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизацииСУО"),
									   "",
									   НСтр("ru = 'Подразделение организации'"),
									   Ложь);
									   
		
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
		Если НомерЗаписи = 1 Тогда
			
			НовыйРеквизит = Новый РеквизитФормы("ПодразделениеПредприятия" + НомерЗаписи,
										   Новый ОписаниеТипов("СправочникСсылка.ПодразделенияПредприятияСУО"),
										   "",
										   НСтр("ru = 'Подразделение предприятия'"),
										   Ложь);
										   
			
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
			
		КонецЕсли;
			
		НовыйРеквизит = Новый РеквизитФормы("Должность" + НомерЗаписи,
									   Новый ОписаниеТипов("СправочникСсылка.ДолжностиСУО"),
									   "",
									   НСтр("ru = 'Должность'"),
									   Ложь);
									   
									   
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
		Если ВыборкаДетальныеЗаписи.Уволен Тогда
			
			НовыйРеквизит = Новый РеквизитФормы("Уволен" + НомерЗаписи,
										   Новый ОписаниеТипов("Булево"),
										   "",
										   НСтр("ru = 'Уволен'"),
										   Ложь);
										   
			
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
			
						
		КонецЕсли;
		
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

		
		// Устанавливаем значение реквизитов
		
		Форма["Организация" + НомерЗаписи]              = ВыборкаДетальныеЗаписи.Организация;
		Форма["ПодразделениеОрганизации" + НомерЗаписи] = ВыборкаДетальныеЗаписи.ПодразделениеОрганизации;
		
		Если НомерЗаписи = 1 Тогда
			Форма["ПодразделениеПредприятия" + НомерЗаписи] = ВыборкаДетальныеЗаписи.ПодразделениеПредприятия;
		КонецЕсли;
		
		Форма["Должность" + НомерЗаписи] = ВыборкаДетальныеЗаписи.Должность;
		
		Если ВыборкаДетальныеЗаписи.Уволен Тогда
			Форма["Уволен" + НомерЗаписи] = ВыборкаДетальныеЗаписи.Уволен;
		КонецЕсли;
		
		// Добавляем элементы формы
		
		
		Если НомерЗаписи = 1 Тогда
			
			ЭлементФормы = Форма.Элементы.Добавить("ПодразделениеПредприятия" + НомерЗаписи,
											 Тип("ПолеФормы"),
											 Форма.Элементы[ИмяГруппыЭлементов]); 	
							  
			ЭлементФормы.Вид            = ВидПоляФормы.ПолеВвода;
			ЭлементФормы.Заголовок      = НСтр("ru = 'Подразделение на предприятии'");
			ЭлементФормы.ПутьКДанным    = "ПодразделениеПредприятия" + НомерЗаписи;
			ЭлементФормы.КнопкаОткрытия = Истина;
			ЭлементФормы.ТолькоПросмотр = Истина;
			ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
			
		КонецЕсли;
		
		Если КоличествоЗаписей = 1 Тогда
			
			ГруппаОформлен = Форма.Элементы[ИмяГруппыЭлементов];
			
		Иначе
			
			ГруппаОформлен = Форма.Элементы.Добавить("ГруппаОформлен" + НомерЗаписи,
											 Тип("ГруппаФормы"),
											 Форма.Элементы[ИмяГруппыЭлементов]); 	
							  
											 
			ГруппаОформлен.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			
		КонецЕсли;
			
		
		ЭлементФормы = Форма.Элементы.Добавить("Организация" + НомерЗаписи,
										 Тип("ПолеФормы"),
										 ГруппаОформлен); 	
						  
		ЭлементФормы.Вид            = ВидПоляФормы.ПолеВвода;
		ЭлементФормы.Заголовок      = НСтр("ru = 'Организация'");
		ЭлементФормы.ПутьКДанным    = "Организация" + НомерЗаписи;
		ЭлементФормы.КнопкаОткрытия = Истина;
		ЭлементФормы.ТолькоПросмотр = Истина;
		ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		
		ЭлементФормы = Форма.Элементы.Добавить("ПодразделениеОрганизации" + НомерЗаписи,
										 Тип("ПолеФормы"),
										 ГруппаОформлен); 	
						  
		ЭлементФормы.Вид            = ВидПоляФормы.ПолеВвода;
		ЭлементФормы.Заголовок      = НСтр("ru = 'Подразделение в организации'");
		ЭлементФормы.ПутьКДанным    = "ПодразделениеОрганизации" + НомерЗаписи;
		ЭлементФормы.КнопкаОткрытия = Истина;
		ЭлементФормы.ТолькоПросмотр = Истина;
		ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		
		
		ЭлементФормы = Форма.Элементы.Добавить("Должность" + НомерЗаписи,
										 Тип("ПолеФормы"),
										 ГруппаОформлен); 	
						  
		ЭлементФормы.Вид            = ВидПоляФормы.ПолеВвода;
		ЭлементФормы.Заголовок      = НСтр("ru = 'Должность'");
		ЭлементФормы.ПутьКДанным    = "Должность" + НомерЗаписи;
		ЭлементФормы.КнопкаОткрытия = Истина;
		ЭлементФормы.ТолькоПросмотр = Истина;
		ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		
		Если ВыборкаДетальныеЗаписи.Уволен Тогда
		
			ЭлементФормы = Форма.Элементы.Добавить("Уволен" + НомерЗаписи,
											 Тип("ПолеФормы"),
											 ГруппаОформлен); 	
							  
			ЭлементФормы.Вид            = ВидПоляФормы.ПолеФлажка;
			ЭлементФормы.Заголовок      = НСтр("ru = 'Уволен'");
			ЭлементФормы.ПутьКДанным    = "Уволен" + НомерЗаписи;
			ЭлементФормы.ТолькоПросмотр = Истина;
			ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
			
		КонецЕсли;
			
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ЗаписатьДанныеОРуководителях() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	// Очищаем регистр РуководителиСУО
	
	НаборЗаписей = РегистрыСведений.РуководителиСУО.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	// Выбираем сотрудников
	
	ЗапросСотрудников = Новый Запрос;
	ЗапросСотрудников.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиСУОСрезПоследних.Организация,
		|	СотрудникиСУОСрезПоследних.ПодразделениеПредприятия,
		|	СотрудникиСУОСрезПоследних.ПодразделениеОрганизации,
		|	СотрудникиСУОСрезПоследних.Пользователь
		|ИЗ
		|	РегистрСведений.СотрудникиСУО.СрезПоследних(, ) КАК СотрудникиСУОСрезПоследних
		|ГДЕ
		|	СотрудникиСУОСрезПоследних.Уволен = ЛОЖЬ";

	РезультатВыборкиСотрудников = ЗапросСотрудников.Выполнить();
	ВыборкаДанныхОСотруднике    = РезультатВыборкиСотрудников.Выбрать();
	ТаблицаСотрудников          = РезультатВыборкиСотрудников.Выгрузить();
	
	// Выбираем все ссылочные объекты
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодразделенияОрганизацииСУО.Ссылка
		|ИЗ
		|	Справочник.ПодразделенияОрганизацииСУО КАК ПодразделенияОрганизацииСУО
		|ГДЕ
		|	ПодразделенияОрганизацииСУО.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодразделенияПредприятияСУО.Ссылка
		|ИЗ
		|	Справочник.ПодразделенияПредприятияСУО КАК ПодразделенияПредприятияСУО
		|ГДЕ
		|	ПодразделенияПредприятияСУО.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УчебныеГруппыСУО.Ссылка,
		|	УчебныеГруппыСУО.Состав.(
		|		Пользователь
		|	)
		|ИЗ
		|	Справочник.УчебныеГруппыСУО КАК УчебныеГруппыСУО
		|ГДЕ
		|	УчебныеГруппыСУО.ПометкаУдаления = ЛОЖЬ";

		
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Для каждого Результат Из МассивРезультатов Цикл
	
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Отказ = Ложь;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			// Записываем данные о руководителях структуры предприятия
			ЗаписатьДанныеОРуководителяхЭлементаСтруктурыПредприятия(ВыборкаДетальныеЗаписи.Ссылка, Отказ);
		КонецЦикла;
		
		// Добавляем к списку сотрудников пользователей учебных групп
		
		Если ТипЗнч(ВыборкаДетальныеЗаписи.Ссылка) = Тип("СправочникСсылка.УчебныеГруппыСУО") Тогда
			
			ТаблицаУчастниковГруппы = ВыборкаДетальныеЗаписи.Состав.Выгрузить();
			
			Для каждого Строка Из ТаблицаУчастниковГруппы Цикл
			
				Если ТаблицаСотрудников.Найти(Строка.Пользователь, "Пользователь") = Неопределено Тогда
					
					НоваяСтрока = ТаблицаСотрудников.Добавить();
					НоваяСтрока.Пользователь = Строка.Пользователь;
					
				КонецЕсли;
			
			КонецЦикла;
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	ТаблицаСотрудников.Свернуть("Пользователь");
	
	Для каждого Строка Из ТаблицаСотрудников Цикл
		// Записываем данные о руководителях сотрудников
		ЗаписатьДанныеОРуководителяхСотрудника(Строка.Пользователь, ВыборкаДанныхОСотруднике);
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();

КонецПроцедуры
	
Процедура ЗаписатьДанныеОРуководителяхЭлементаСтруктурыПредприятия(Источник, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Источник может быть как ссылокй на объект, так и объектом.
	
	// Ищем всех руководителей данного объекта
	
	МассивРуководителей = Новый Массив();
	
	СформироватьМассивРуководителейИсточника(Источник, МассивРуководителей);
	
	// Записываем руководителей в базу. Примечание: если руководитель был удален,
	// То записи будут удалены из регистра.
	
	НаборЗаписей = РегистрыСведений.РуководителиСУО.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ОбъектРуководства.Установить(Источник.Ссылка);
	
	Для каждого Руководитель Из МассивРуководителей Цикл
	
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Пользователь      = Руководитель;
		НоваяЗапись.ОбъектРуководства = Источник.Ссылка;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	// Обновляем документы, требующие перепроведения после обновления данных о руководителях
	
	Запрос = Неопределено;
	
	Если ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.УчебныеГруппыСУО") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПроведениеОбученияСУОУчебныеГруппы.Ссылка
			|ИЗ
			|	Документ.ПроведениеОбученияСУО.УчебныеГруппы КАК ПроведениеОбученияСУОУчебныеГруппы
			|ГДЕ
			|	ПроведениеОбученияСУОУчебныеГруппы.Ссылка.Проведен = ИСТИНА
			|	И ПроведениеОбученияСУОУчебныеГруппы.УчебнаяГруппа = &УчебнаяГруппа
			|;";
			
		Запрос.Текст = Запрос.Текст + "
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПроведениеПрограммыОбученияСУОУчебныеГруппы.Ссылка
			|ИЗ
			|	Документ.ПроведениеПрограммыОбученияСУО.УчебныеГруппы КАК ПроведениеПрограммыОбученияСУОУчебныеГруппы
			|ГДЕ
			|	ПроведениеПрограммыОбученияСУОУчебныеГруппы.УчебнаяГруппа = &УчебнаяГруппа
			|	И ПроведениеПрограммыОбученияСУОУчебныеГруппы.Ссылка.Проведен = ИСТИНА";
			
		Запрос.УстановитьПараметр("УчебнаяГруппа", Источник.Ссылка);
		
	КонецЕсли;
	
	Если ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.Организации") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПроведениеОбученияСУООрганизации.Ссылка
			|ИЗ
			|	Документ.ПроведениеОбученияСУО.Организации КАК ПроведениеОбученияСУООрганизации
			|ГДЕ
			|	ПроведениеОбученияСУООрганизации.Ссылка.Проведен = ИСТИНА
			|	И ПроведениеОбученияСУООрганизации.Организация = &Организация
			|;";
			
		Запрос.Текст = Запрос.Текст + "
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПроведениеПрограммыОбученияСУООрганизации.Ссылка
			|ИЗ
			|	Документ.ПроведениеПрограммыОбученияСУО.Организации КАК ПроведениеПрограммыОбученияСУООрганизации
			|ГДЕ
			|	ПроведениеПрограммыОбученияСУООрганизации.Ссылка.Проведен = ИСТИНА
			|	И ПроведениеПрограммыОбученияСУООрганизации.Организация = &Организация";

		
		Запрос.УстановитьПараметр("Организация", Источник.Ссылка);
		
	КонецЕсли;
	
	Если ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.ПодразделенияПредприятияСУО") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПроведениеОбученияСУОПодразделенияПредприятия.Ссылка
			|ИЗ
			|	Документ.ПроведениеОбученияСУО.ПодразделенияПредприятия КАК ПроведениеОбученияСУОПодразделенияПредприятия
			|ГДЕ
			|	ПроведениеОбученияСУОПодразделенияПредприятия.Ссылка.Проведен = ИСТИНА
			|	И ПроведениеОбученияСУОПодразделенияПредприятия.ПодразделениеПредприятия = &ПодразделениеПредприятия
			|;";
			
		Запрос.Текст = Запрос.Текст + "	
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПроведениеПрограммыОбученияСУОПодразделенияПредприятия.Ссылка
			|ИЗ
			|	Документ.ПроведениеПрограммыОбученияСУО.ПодразделенияПредприятия КАК ПроведениеПрограммыОбученияСУОПодразделенияПредприятия
			|ГДЕ
			|	ПроведениеПрограммыОбученияСУОПодразделенияПредприятия.Ссылка.Проведен = ИСТИНА
			|	И ПроведениеПрограммыОбученияСУОПодразделенияПредприятия.ПодразделениеПредприятия = &ПодразделениеПредприятия";
			
		
		Запрос.УстановитьПараметр("ПодразделениеПредприятия", Источник.Ссылка);
		
	КонецЕсли;
	
	Если Запрос <> Неопределено Тогда
	
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		Для каждого Результат Из МассивРезультатов Цикл
		
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			
			РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокументы(ВыборкаДетальныеЗаписи,,,3);
		
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьДанныеОРуководителяхСотрудника(Знач Пользователь, Знач ВыборкаДанныхОСотруднике = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивРуководителей = Новый Массив();
	
	Если ВыборкаДанныхОСотруднике <> Неопределено Тогда
	
		ВыборкаДанныхОСотруднике.Сбросить();
		
		Пока ВыборкаДанныхОСотруднике.НайтиСледующий(Пользователь, "Пользователь") Цикл
			
			Если ЗначениеЗаполнено(ВыборкаДанныхОСотруднике.Организация) Тогда
				СформироватьМассивРуководителейИсточника(ВыборкаДанныхОСотруднике.Организация, МассивРуководителей);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаДанныхОСотруднике.ПодразделениеОрганизации) Тогда
				СформироватьМассивРуководителейИсточника(ВыборкаДанныхОСотруднике.ПодразделениеОрганизации, МассивРуководителей);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаДанныхОСотруднике.ПодразделениеПредприятия) Тогда
				СформироватьМассивРуководителейИсточника(ВыборкаДанныхОСотруднике.ПодразделениеПредприятия, МассивРуководителей);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
		
	// Выбираем все учебные группы, в которых состоит пользователь
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчебныеГруппыСУОСостав.Ссылка КАК УчебнаяГруппа
		|ИЗ
		|	Справочник.УчебныеГруппыСУО.Состав КАК УчебныеГруппыСУОСостав
		|ГДЕ
		|	УчебныеГруппыСУОСостав.Пользователь = &Пользователь";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СформироватьМассивРуководителейИсточника(ВыборкаДетальныеЗаписи.УчебнаяГруппа, МассивРуководителей);
	КонецЦикла;
	
	// Записываем руководителей в базу
	
	НаборЗаписей = РегистрыСведений.РуководителиСУО.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ОбъектРуководства.Установить(Пользователь);
	
	Для каждого Руководитель Из МассивРуководителей Цикл
	
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Пользователь      = Руководитель;
		НоваяЗапись.ОбъектРуководства = Пользователь;
	
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура СформироватьМассивРуководителейИсточника(Знач Источник, МассивРуководителей)
	
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Источник)) Тогда
		
		ТребуемыеРеквизиты = "Ссылка, Руководитель, ПометкаУдаления";
		
		Если ТипЗнч(Источник) = Тип("СправочникСсылка.ПодразделенияОрганизацииСУО") Тогда
			ТребуемыеРеквизиты =  ТребуемыеРеквизиты + ", Владелец";
		КонецЕсли;
		
		Если ТипЗнч(Источник) = Тип("СправочникСсылка.ПодразделенияОрганизацииСУО")
			ИЛИ ТипЗнч(Источник) = Тип("СправочникСсылка.ПодразделенияПредприятияСУО") Тогда
			
			ТребуемыеРеквизиты =  ТребуемыеРеквизиты + ", Родитель";
			
		КонецЕсли;			
		
		ДанныеИсточника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, ТребуемыеРеквизиты);
		
	Иначе
		
		ДанныеИсточника = Источник;
		
	КонецЕсли;
	
	Если ДанныеИсточника.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	// Руководитель всего предприятия
	
	РуководительПредприятия = УправлениеОбучениемСУОПовтИсп.ПолучитьРуководителяПредприятия();
	
	Если ЗначениеЗаполнено(РуководительПредприятия)
		И МассивРуководителей.Найти(РуководительПредприятия) = Неопределено Тогда
		
		МассивРуководителей.Добавить(РуководительПредприятия);
		
	КонецЕсли;
	
	// Руководитель источника
	
	Если ЗначениеЗаполнено(ДанныеИсточника.Руководитель)
		И МассивРуководителей.Найти(ДанныеИсточника.Руководитель) = Неопределено Тогда
		
		МассивРуководителей.Добавить(ДанныеИсточника.Руководитель);
		
	КонецЕсли;
	
	// Руководитель организации подразделения
	
	Если ТипЗнч(ДанныеИсточника.Ссылка) = Тип("СправочникСсылка.ПодразделенияОрганизацииСУО") Тогда
		
		РуководительОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеИсточника.Владелец, "Руководитель");
		
		Если ЗначениеЗаполнено(РуководительОрганизации)
			И МассивРуководителей.Найти(РуководительОрганизации) = Неопределено Тогда
			
			МассивРуководителей.Добавить(РуководительОрганизации);
			
		КонецЕсли;
			
	КонецЕсли;
	
	// Руководители вышестоящих подразделений
	
	Если ТипЗнч(ДанныеИсточника.Ссылка) = Тип("СправочникСсылка.ПодразделенияОрганизацииСУО")
		ИЛИ ТипЗнч(ДанныеИсточника.Ссылка) = Тип("СправочникСсылка.ПодразделенияПредприятияСУО") Тогда
		
		ДобавитьРуководителейРодительскихЭлементов(ДанныеИсточника.Родитель, МассивРуководителей);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьРуководителейРодительскихЭлементов(Знач РодительскийЭлемент, МассивРуководителей)
	
	ДанныеРодительскогоЭлемента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РодительскийЭлемент, "Родитель, Руководитель");

	Если ЗначениеЗаполнено(ДанныеРодительскогоЭлемента.Руководитель)
		И МассивРуководителей.Найти(ДанныеРодительскогоЭлемента.Руководитель) = Неопределено Тогда
		
		МассивРуководителей.Добавить(ДанныеРодительскогоЭлемента.Руководитель);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеРодительскогоЭлемента.Родитель) Тогда
		ДобавитьРуководителейРодительскихЭлементов(ДанныеРодительскогоЭлемента.Родитель, МассивРуководителей); // Рекурсия
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбщееДляОбъектов

Процедура ЗаполнитьОрганизаторовОбъекта(ОбъектИсточник) Экспорт
	
	Организаторы = Новый Массив;	
	Справочники.ОрганизаторыСУО.ОрганизаторыПользователя(ОбъектИсточник.Ответственный, Организаторы);	
	Справочники.ОрганизаторыСУО.ЗаполнитьТабличнуюЧастьОрганизаторы(ОбъектИсточник.Организаторы, Организаторы);	
	
КонецПроцедуры

Функция СценарийОбученияXDTO(Знач Сценарий, Знач НаименованиеСценария = Неопределено) Экспорт
	
	СценарийXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/3/EduTemplate", "Сценарий");
	СценарийXDTO    = ФабрикаXDTO.Создать(СценарийXDTOТип);
	
	Если НаименованиеСценария = Неопределено Тогда
		НаименованиеСценария = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сценарий, "Наименование");
	КонецЕсли;	
	
	СценарийXDTO.Идентификатор = Сценарий.УникальныйИдентификатор();
	СценарийXDTO.Наименование  = НаименованиеСценария;	
	СценарийXDTO.Тип           = ТипСценарияСтрока(Сценарий);
	
	Возврат СценарийXDTO;
	
КонецФункции

Функция ТипСценарияСтрока(Сценарий) Экспорт
	
	Если ТипЗнч(Сценарий) = Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда
		Возврат "activity";
	КонецЕсли;
	
	Если ТипЗнч(Сценарий) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
		Возврат "electronicResource";
	КонецЕсли;
	
	Если ТипЗнч(Сценарий) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		Возврат "providingEducation";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция МожноОбновлятьПодчиненныеДокументы(ДокументОбъект) Экспорт
	
	Если ДокументОбъект.ДополнительныеСвойства.Свойство("ОбновлятьПодчиненныеДокументы") Тогда
		Возврат ДокументОбъект.ДополнительныеСвойства.ОбновлятьПодчиненныеДокументы;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ЗаблокироватьДанныеФормы(Форма) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		ЗаблокироватьДанныеДляРедактирования(Форма.Объект.Ссылка,,Форма.УникальныйИдентификатор);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область ХарактеристикиМероприятий

// Добавляет характеристику учебного объекта в форму.
//
Процедура ДобавитьХарактеристикуНаСервере(Форма, ВидХарактеристики) Экспорт
	
	// Добавление реквизита
	ДобавляемыеРеквизиты = Новый Массив();
	Реквизит = Новый РеквизитФормы("Характеристика" + ВидХарактеристики.Код,
			ВидХарактеристики.ТипЗначения); 
	Реквизит.СохраняемыеДанные = Истина;	
	ДобавляемыеРеквизиты.Добавить(Реквизит);
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	// Добавление элемента, заполнение данных
	ЭлементФормы = Форма.Элементы.Добавить(
					  "Характеристика" + ВидХарактеристики.Код,
					  Тип("ПолеФормы"), Форма.Элементы.ГруппаХарактеристики); 	
	ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.Заголовок = ВидХарактеристики.Наименование;
	ЭлементФормы.ПутьКДанным = "Характеристика" + ВидХарактеристики.Код;
	
	Если Строка(Реквизит.ТипЗначения) = "Строка"
		И Реквизит.ТипЗначения.КвалификаторыСтроки.Длина = 1024 Тогда
		ЭлементФормы.МногострочныйРежим = Истина;
	КонецЕсли;
	
	МассивПараметровВыбора = Новый Массив();
	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец", ВидХарактеристики));
	ЭлементФормы.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	
	// Добавление описания характеристики для контроля уже добавленных характеристик
	ОписаниеХарактеристики = Форма.ОписаниеХарактеристик.Добавить();
	ОписаниеХарактеристики.ВидХарактеристики = ВидХарактеристики;
	ОписаниеХарактеристики.ИмяРеквизита = "Характеристика" + ВидХарактеристики.Код;
	
	// Новый элемент установим текущим
	Форма.ТекущийЭлемент = ЭлементФормы;
	
КонецПроцедуры

// Удаляет характеристику учебного объекта из формы.
//
Процедура УдалитьХарактеристикуНаСервере(Форма, Идентификатор) Экспорт
	
	ОписаниеХарактеристики = Форма.ОписаниеХарактеристик.НайтиПоИдентификатору(Идентификатор);
	ИмяРеквизита = ОписаниеХарактеристики.ИмяРеквизита;
	
	// Удаление описания
	Форма.ОписаниеХарактеристик.Удалить(ОписаниеХарактеристики);
	
	// Удаление элемента
	Форма.Элементы.Удалить(Форма.Элементы.Найти(ИмяРеквизита));
	
	// Удаление реквизита
	УдаляемыеРеквизиты = Новый Массив();
	УдаляемыеРеквизиты.Добавить(ИмяРеквизита);
	Форма.ИзменитьРеквизиты(, УдаляемыеРеквизиты);
	
КонецПроцедуры

// Получает выборку всех характеристик учебного объекта
//
Функция ПолучитьВыборкуХарактеристикОбъекта(СсылкаНаУчебныйОбъект) Экспорт
	
	// Добавление реквизитов
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыХарактеристик.Ссылка,
		|	ВидыХарактеристик.Код,
		|	ВидыХарактеристик.Наименование,
		|	ВидыХарактеристик.ТипЗначения,
		|	ВидыХарактеристик.СкрыватьОтУченика,
		|	ХарактеристикиУчебныхМодулей.УчебныйОбъект,
		|	ХарактеристикиУчебныхМодулей.Характеристика,
		|	ХарактеристикиУчебныхМодулей.Значение,
		|	ВидыХарактеристик.СкрыватьОтПросмотраЧерезОбщийКаталог
		|ИЗ
		|	ПланВидовХарактеристик.ХарактеристикиУчебныхОбъектовСУО КАК ВидыХарактеристик
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХарактеристикиУчебныхОбъектовСУО КАК ХарактеристикиУчебныхМодулей
		|		ПО (ХарактеристикиУчебныхМодулей.Характеристика = ВидыХарактеристик.Ссылка)
		|ГДЕ
		|	ХарактеристикиУчебныхМодулей.УчебныйОбъект = &УчебныйОбъект
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидыХарактеристик.Код";
		
	Запрос.УстановитьПараметр("УчебныйОбъект", СсылкаНаУчебныйОбъект);
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Выбрать();
	
КонецФункции

// Заполняет на форме все характеристики учебного объекта
//
Процедура ЗаполнитьХарактеристики(Форма, СсылкаНаУчебныйОбъект, ТолькоПросмотр = Ложь, СкрытьОтУченика = Ложь) Экспорт

	ВыборкаДетальныеЗаписи = ПолучитьВыборкуХарактеристикОбъекта(СсылкаНаУчебныйОбъект);
	
	ДобавляемыеРеквизиты = Новый Массив();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Реквизит = Новый РеквизитФормы(
			"Характеристика" + ВыборкаДетальныеЗаписи.Код,
			ВыборкаДетальныеЗаписи.ТипЗначения); 
		Реквизит.СохраняемыеДанные = Истина;	
		ДобавляемыеРеквизиты.Добавить(Реквизит);
		
	КонецЦикла;
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ВыборкаДетальныеЗаписи.Сбросить();
	
	// Добавление элементов, заполнение данных, добавление описания характеристики
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если СкрытьОтУченика
			И ВыборкаДетальныеЗаписи.СкрыватьОтУченика Тогда
			Продолжить;
		КонецЕсли;
			
		Элемент = Форма.Элементы.Добавить(
						  "Характеристика" + ВыборкаДетальныеЗаписи.Код,
						  Тип("ПолеФормы"), Форма.Элементы.ГруппаХарактеристики); 	
						  
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
			
		
		Элемент.Заголовок = ВыборкаДетальныеЗаписи.Наименование;
		Элемент.ПутьКДанным = "Характеристика" + ВыборкаДетальныеЗаписи.Код;
		
		Если Строка(ВыборкаДетальныеЗаписи.ТипЗначения) = "Строка"
			И ВыборкаДетальныеЗаписи.ТипЗначения.КвалификаторыСтроки.Длина = 1024 Тогда
			Элемент.МногострочныйРежим = Истина;
		КонецЕсли;
			
			
		Если ТолькоПросмотр Тогда
			
			Элемент.ТолькоПросмотр = Истина;
			
		Иначе
		
			МассивПараметровВыбора = Новый Массив();
			МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец", ВыборкаДетальныеЗаписи.Ссылка));
			Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
			
			ОписаниеХарактеристики = Форма.ОписаниеХарактеристик.Добавить();
			ОписаниеХарактеристики.ВидХарактеристики = ВыборкаДетальныеЗаписи.Ссылка;
			ОписаниеХарактеристики.ИмяРеквизита = "Характеристика" + ВыборкаДетальныеЗаписи.Код;

		КонецЕсли;
			
		Форма["Характеристика" + ВыборкаДетальныеЗаписи.Код] = ВыборкаДетальныеЗаписи.Значение;
		
	КонецЦикла;

КонецПроцедуры

// Записывает характеристики в базу данных
//
Процедура ЗаписатьХарактеристики(Форма) Экспорт

	// Сформируем набор записей с новыми значениями характеристик
	НаборЗаписей = РегистрыСведений.ХарактеристикиУчебныхОбъектовСУО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.УчебныйОбъект.Установить(Форма.Объект.Ссылка);
	Для каждого ОписаниеХарактеристики Из Форма.ОписаниеХарактеристик Цикл
		
		Запись = НаборЗаписей.Добавить();
		Запись.УчебныйОбъект = Форма.Объект.Ссылка;
		Запись.Характеристика = ОписаниеХарактеристики.ВидХарактеристики;
		Запись.Значение = Форма[ОписаниеХарактеристики.ИмяРеквизита];
		
	КонецЦикла;
	
	// Запишем набор записей
	НаборЗаписей.Записать();

КонецПроцедуры


#КонецОбласти

#КонецОбласти
