Функция ВыбратьЭлементыРасписания(Пользователь, НачалоПериода=Неопределено, КонецПериода=Неопределено, Актуально=Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос();

	Запрос.Параметры.Вставить("Пользователь", Пользователь);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасписаниеОбученияСУО.Регистратор КАК ПрохождениеОбучения,
	               |	РасписаниеОбученияСУО.ДатаНачалаПроведения КАК ДатаНачалаПроведения,
	               |	РасписаниеОбученияСУО.ДатаОкончанияПроведения КАК ДатаОкончанияПроведения,
	               |	РасписаниеОбученияСУО.Пользователь КАК Пользователь
	               |ИЗ
	               |	РегистрСведений.РасписаниеОбученияСУО КАК РасписаниеОбученияСУО
	               |ГДЕ
	               |	РасписаниеОбученияСУО.Пользователь В(&Пользователь)
	               |	И (РасписаниеОбученияСУО.Актуально = ИСТИНА
	               |			ИЛИ РасписаниеОбученияСУО.СтатусПроцессаОбучения = ЗНАЧЕНИЕ(Перечисление.СтатусыПроцессаОбученияСУО.НеДопущен))";
				   
	Если НачалоПериода <> Неопределено И КонецПериода <> Неопределено Тогда			   
				   
		Запрос.Текст = Запрос.Текст + "			   
					   |	И (РасписаниеОбученияСУО.ДатаНачалаПроведения МЕЖДУ &НачалоПериода И &КонецПериода
		               |			ИЛИ РасписаниеОбученияСУО.ДатаОкончанияПроведения МЕЖДУ &НачалоПериода И &КонецПериода
		               |			ИЛИ РасписаниеОбученияСУО.ДатаНачалаПроведения < &НачалоПериода
		               |				И РасписаниеОбученияСУО.ДатаОкончанияПроведения > &КонецПериода
		               |			ИЛИ РасписаниеОбученияСУО.ДатаНачалаПроведения = &ПустаяДата)";
					   
		Запрос.Параметры.Вставить("НачалоПериода", НачалоПериода);
		Запрос.Параметры.Вставить("КонецПериода", КонецПериода);
		Запрос.Параметры.Вставить("ПустаяДата", Дата("00010101"));
	
	КонецЕсли;
				   
	Результат = Запрос.Выполнить();

	Возврат Результат.Выбрать();
	
КонецФункции
