#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ОбъектКопирования", ОбъектКопирования);
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;	
		
	Если НЕ ЭтоГруппа Тогда
		
		Если НЕ ЭтоНовый() Тогда
			РодительСтарогоЭлемента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Родитель");
			Если РодительСтарогоЭлемента <> Родитель Тогда
				// Если меняется родитель, то предотвращаем смену даты изменения,
				// так как реально курс не меняется.				
				ДополнительныеСвойства.Вставить("ДатаИзменения", ДатаИзменения);
			КонецЕсли;
		КонецЕсли;
		
		ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
		
		ТипОбъектаСУЗ = Перечисления.ТипыОбъектовСУЗ.knowledgeBase;
		
		РазработкаСУЗ.ПереименоватьАвтоРодителей(ЭтотОбъект);
		
	КонецЕсли;

КонецПроцедуры

//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	КонтекстРедактирования = Неопределено;
	ДополнительныеСвойства.Свойство("КонтекстРедактирования", КонтекстРедактирования);
	
	Справочники.УчебныеМатериалыСУО.ПриЗаписиМатериала(Ссылка, КонтекстРедактирования);	
	
	Если НЕ ЭтоГруппа И РазработкаСУЗ.ИспользоватьВстроенныйПлеерКурсовВебКабинета() Тогда
		Если ДополнительныеСвойства.ЭтоНовый Тогда
			РегистрыСведений.ПлеерКурсовВебКабинетаСУЗ.УстановитьИспользованиеВстроенногоПлеера(Ссылка);
		Иначе			
			РегистрыСведений.ПлеерКурсовВебКабинетаСУЗ.ОбновитьСведенияЭлектронногоРесурса(Ссылка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//----------------------------------//

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Ссылка;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли


