
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТаблицаВидовОбучения = Справочники.ВидыМероприятийСУО.ВидыОбученияДляСозданияПроведенияОбучения();
	
	ЗначениеВРеквизитФормы(ТаблицаВидовОбучения, "ВидыОбучения");	
	Если Параметры.Свойство("ЗначенияЗаполнения") Тогда
		ЗначенияЗаполнения = Параметры.ЗначенияЗаполнения;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыВидыОбучения

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ВидыОбучения

&НаКлиенте
Процедура ВидыОбученияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ВыбратьВидОбучение();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ВыбратьВидОбучения(Команда)
	ВыбратьВидОбучение();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ВыбратьВидОбучение() 

	ТекущеДанные = Элементы.ВидыОбучения.ТекущиеДанные;
	
	Если ТекущеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть();
	
	УправлениеОбучениемСУОКлиент.СоздатьОбучениеПоВиду(ТекущеДанные.Ссылка, ТекущеДанные.ЕстьМероприятие,,, ЗначенияЗаполнения, ВладелецФормы);
	
КонецПроцедуры

#КонецОбласти