
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
Процедура РедактироватьВерсию()
	
	ТекущиеДанные = Элементы.СписокВерсий.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И ВладелецФормы <> Неопределено Тогда
		
		Если ВладелецФормы.Модифицированность Тогда
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаОтветаНаВопросРедактировать", ЭтотОбъект, ТекущиеДанные);		
			ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Редактируемая версия не сохранена. Изменения будут утеряны. Продолжить?'"), РежимДиалогаВопрос.ДаНет, 0);
			
		Иначе
			
			РедактироватьВерсиюПродолжение(ТекущиеДанные);
			 
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаНаВопросРедактировать(Ответ, ТекущиеДанные) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
			 
	РедактироватьВерсиюПродолжение(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьВерсиюПродолжение(ТекущиеДанные)
	
	ВладелецФормы.Объект.Версия = ТекущиеДанные.Версия;
	ВладелецФормы.Объект.Поставщик = ТекущиеДанные.Поставщик;
	
	ВладелецФормы.ЗагрузитьВерсию();

	Закрыть();	
	
КонецПроцедуры

&НаСервере
Процедура УдалитьВерсию(Поставщик, Версия)
	
	Если ОбъектыСУЗ.ИзменениеДанныхОтПоставщикаЗапрещено(Поставщик) Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаОбъект = Параметры.СсылкаНаОбъект;
	
	ИмяРегистраСДанными = ОбъектыСУЗ.ПолучитьИмяРегистраСДанными(СсылкаНаОбъект);
	ПолныйНаборТекстов = РегистрыСведений[ИмяРегистраСДанными].СоздатьНаборЗаписей();
	ПолныйНаборТекстов.Отбор.СсылкаНаОбъектСУЗ.Установить(СсылкаНаОбъект);
	ПолныйНаборТекстов.Прочитать();
	
	ПолныйНаборТекстов.УдалитьВерсиюИзНабора(Поставщик, Версия);
	ПолныйНаборТекстов.Записать();
	
	СформироватьСписокВерсий()
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСписокВерсий()
	
	СсылкаНаОбъект = Параметры.СсылкаНаОбъект;
	
	// Заполняем таблицу версий
	
	ВерсииОбъекта = ОбъектыСУЗ.ПолучитьНаборВерсий(СсылкаНаОбъект).Выгрузить();
	
	СписокВерсий.Очистить();
	
	Для каждого Строка Из ВерсииОбъекта Цикл
	
		НоваяВерсия = СписокВерсий.Добавить();
		НоваяВерсия.Поставщик = Строка.Поставщик;
		НоваяВерсия.Версия = Строка.Версия;
		НоваяВерсия.ДатаИзменения = Строка.ДатаИзменения;
	
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 СформироватьСписокВерсий();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура КомандаРедактироватьВерсию(Команда)
	РедактироватьВерсию();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ СписокВерсий

&НаКлиенте
Процедура СписокВерсийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	РедактироватьВерсию();
КонецПроцедуры

&НаКлиенте
Процедура СписокВерсийПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаОтветаНаВопросПередУдалением", ЭтотОбъект);		
		
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Удалить выбранную версию данных?'"), РежимДиалогаВопрос.ДаНет, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаНаВопросПередУдалением(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.СписокВерсий.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		УдалитьВерсию(ТекущиеДанные.Поставщик, ТекущиеДанные.Версия);
	КонецЕсли;
	
	СформироватьСписокВерсий();
	
КонецПроцедуры	

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
