

#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоказыватьАдресСертификата = Ложь;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВебКабинетСУ") Тогда
		
		АдресВебКабинета = Справочники.ПубликацииВебКабинетаСУ.АдресВебКабинета(); // Реквизит формы
		
		Если ЗначениеЗаполнено(АдресВебКабинета) Тогда
			 ПоказыватьАдресСертификата = Истина;
		КонецЕсли;
		
	КонецЕсли;
		
	Элементы.ГруппаАдрес.Видимость = ПоказыватьАдресСертификата;
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Список

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если НЕ ПоказыватьАдресСертификата Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		АдресТекущегоСертификата = "";
	Иначе
		АдресТекущегоСертификата = АдресВебКабинета + "/certificate.html?certificate=" + Строка(Элемент.ТекущиеДанные.Ссылка.УникальныйИдентификатор());
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОткрытьСертификатВВебКабинете(Команда)
	Если ЗначениеЗаполнено(АдресТекущегоСертификата) Тогда
		ПерейтиПоНавигационнойСсылке(АдресТекущегоСертификата);
	КонецЕсли;
КонецПроцедуры


#КонецОбласти



