
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ТерриторииСУО") Тогда
		ПараметрыФормы = Новый Структура("Территория", ПараметрКоманды);	
	Иначе
		ПараметрыФормы = Новый Структура("Аудитория", ПараметрКоманды);	
	КонецЕсли;
	
	ОткрытьФорму("Обработка.РасписаниеПоАудиториямСУО.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
