
Функция ПолучитьОписаниеОбъектаДляОткрытияПоСсылке(СтруктураСсылки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОписаниеОбъекта = Новый Структура;
	
	ИмяОбъекта              = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "object");
	id                      = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "id");
	Идентификатор           = Новый УникальныйИдентификатор(id); 
	
	ОписаниеОбъекта.Вставить("ИмяОбъекта", ИмяОбъекта);
	
	Если ИмяОбъекта = "book" Тогда
		ОписаниеОбъекта.Вставить("Ссылка", Справочники.ЛитератураСУО.ПолучитьСсылку(Идентификатор));
	КонецЕсли;
	
	Если ИмяОбъекта = "activity" Тогда
		ОписаниеОбъекта.Вставить("Ссылка", Справочники.КаталогМероприятийСУО.ПолучитьСсылку(Идентификатор));
	КонецЕсли;
	
	Если ИмяОбъекта = "file" Тогда
		ОписаниеОбъекта.Вставить("Ссылка", Справочники.Файлы.ПолучитьСсылку(Идентификатор));
	КонецЕсли;	
	
	Если ИмяОбъекта = "teacher" Тогда
		ОписаниеОбъекта.Вставить("Пользователь", Справочники.Пользователи.ПолучитьСсылку(Идентификатор));
	КонецЕсли;	
	
	Если ИмяОбъекта = "electronicResource" Тогда
		
		ОписаниеОбъекта.Вставить("Ссылка", Справочники.СводыЗнанийСУЗ.ПолучитьСсылку(Идентификатор));
		
		idItem = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "item");
		
		Если ЗначениеЗаполнено(idItem) Тогда
			ИдентификаторЭлемента = Новый УникальныйИдентификатор(idItem);
			ОписаниеОбъекта.Вставить("Фрагмент", Справочники.СодержаниеСУЗ.ПолучитьСсылку(ИдентификаторЭлемента));
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОписаниеОбъекта;
	
КонецФункции

Функция ЕстьПоддержкаСотрудников() Экспорт
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьСотрудниковСУО");
КонецФункции

Функция ЕстьПоддержкаСтудентов() Экспорт
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьСтудентовСУО");
КонецФункции
