
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если ВебКлиент Тогда
		Элементы.КомандаЗагрузитьВопросы.Видимость = Ложь;
	#КонецЕсли

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура ЗагрузитьВопросы(Команда)
	
	ОписаниеОповещенияПослеЗагрузки = Новый ОписаниеОповещения("ПослеЗагрузкиВопросов", ЭтотОбъект);
	
	РазработкаСУЗКлиент.ЗагрузитьФайлы(,,,,,"тест",,ОписаниеОповещенияПослеЗагрузки);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗагрузкиВопросов(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Элементы.Список.Обновить();
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновленСправочникВопросов" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ <Наименование>
