 
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
 
&НаСервере
Функция НайтиНомерСтрокиДерева(Знач Строки, Знач ЗначениеДляПоиска, НомерСтроки=0)
	
	Для каждого Строка Из Строки Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		Если Строка.Ссылка = ЗначениеДляПоиска Тогда
			Возврат НомерСтроки;
		КонецЕсли;
		
		НайденныйНомерСтроки = НайтиНомерСтрокиДерева(Строка.Строки, ЗначениеДляПоиска, НомерСтроки); // Рекурсия
		
		Если НайденныйНомерСтроки <> Неопределено Тогда
			Возврат НайденныйНомерСтроки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ВыбратьФайл(СтандартнаяОбработка=Истина)
	
	ТекущиеДанные = Элементы.ДеревоФайлов.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И НЕ ТекущиеДанные.ЭтоГруппа Тогда
		СтандартнаяОбработка = Ложь;
		Закрыть(ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
 
 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДеревоФайловРесурса = Справочники.РесурсыСУЗ.ДеревоФайлов(Параметры.Ресурс); 
	
	ЗначениеВДанныеФормы(ДеревоФайловРесурса, ДеревоФайлов);
	                  
	НачальнаяСтрока = НайтиНомерСтрокиДерева(ДеревоФайловРесурса.Строки, Параметры.НачальноеЗначение);
	
	Если НачальнаяСтрока <> Неопределено Тогда
		Элементы.ДеревоФайлов.ТекущаяСтрока = НачальнаяСтрока-1; // Индекс считается с нуля
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура Выбрать(Команда)
	ВыбратьФайл();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ <Наименование>
 
&НаКлиенте
Процедура ДеревоФайловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбратьФайл(СтандартнаяОбработка);
КонецПроцедуры