#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Заголовок");
	Поля.Добавить("ДатаПубликации");
 
КонецПроцедуры
	
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = Формат(Данные.ДатаПубликации, "ДЛФ=DD") + " - " + Данные.Заголовок;
	
КонецПроцедуры

// Веб-кабинет

Процедура ОбновитьДанныеВебКабинета(Новость, ДополнительныеДанные=Неопределено) Экспорт
	

	
	УстановитьПривилегированныйРежим(Истина);
	
	НовостьОбъект = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Новость, "Проведен, ФорматированныйДокумент, Автор");
	
	РегистрыСведений.ДанныеВебКабинетаСУО_ОП.УдалитьДанные(Новость, Перечисления.ТипыДанныхВебКабинетаСУО.Новость);
	РегистрыСведений.ДанныеВебКабинетаСУО_ПП.УдалитьДанные(Новость, Перечисления.ТипыДанныхВебКабинетаСУО.Новость);
	РегистрыСведений.ДанныеВебКабинетаСУО_ОН.УдалитьДанные(Новость, Перечисления.ТипыДанныхВебКабинетаСУО.НовостьОписание);	
	РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.УдалитьДанные(Новость, "Документ.НовостьСУО");
	
	Если НовостьОбъект.Проведен Тогда
		
		НовостьJSON = НовостьJSON(Новость);
		НовостьОписаниеXML = НовостьОписаниеОбщееXML(Новость);
		
		// Общее описание
		
		РегистрыСведений.ДанныеВебКабинетаСУО_ОН.ДобавитьДанные(Перечисления.ТипыДанныхВебКабинетаСУО.НовостьОписание, Новость, НовостьОписаниеXML, Перечисления.ФорматыВебДанныхСУ.xml);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НовостиСУО.Пользователь,
			|	НовостиСУО.Дата
			|ИЗ
			|	РегистрСведений.НовостиСУО КАК НовостиСУО
			|ГДЕ
			|	НовостиСУО.Регистратор = &Новость";
		
		Запрос.УстановитьПараметр("Новость", Новость);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Пользователь) Тогда
				РегистрыСведений.ДанныеВебКабинетаСУО_ПП.ДобавитьДанные(ВыборкаДетальныеЗаписи.Дата, ВыборкаДетальныеЗаписи.Пользователь, Перечисления.ТипыДанныхВебКабинетаСУО.Новость, Новость, НовостьJSON, Перечисления.ФорматыВебДанныхСУ.json);
			Иначе
				РегистрыСведений.ДанныеВебКабинетаСУО_ОП.ДобавитьДанные(ВыборкаДетальныеЗаписи.Дата, Перечисления.ТипыДанныхВебКабинетаСУО.Новость, Новость, НовостьJSON, Перечисления.ФорматыВебДанныхСУ.json);
			КонецЕсли;
			
		КонецЦикла;
		
		// Файлы новости
		
		ТекстНовостиСтруктура = ОбщегоНазначенияСУ.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(НовостьОбъект.ФорматированныйДокумент.Получить(), Строка(Новость.УникальныйИдентификатор()),, Истина, Ложь);
		
		Если ТекстНовостиСтруктура.ЕстьВложения Тогда
			ВебКабинетСУО.ВыгрузитьФайлыФорматированногоДокументаВКаталогВебКабинета(ТекстНовостиСтруктура.ДвоичныеДанные, ТекстНовостиСтруктура.ИдентификаторКаталога);
		КонецЕсли;		
		
		// Зависимости
		
		Зависимости = Новый Массив;
		Зависимости.Добавить(НовостьОбъект.Автор);
		
		РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.ДобавитьДанные(Новость, "Документ.НовостьСУО", Зависимости);
		
	КонецЕсли;	
	
	
КонецПроцедуры

Функция НовостьJSON(Новость) Экспорт
	
	ДанныеНовости = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Новость, "Заголовок, Выделить, Закрепить, ДатаПубликации, Автор, Автор.Наименование, Номер");
	
	АвторОписание = Новый Структура("Наименование, Идентификатор", ДанныеНовости.АвторНаименование, Строка(ДанныеНовости.Автор.УникальныйИдентификатор()));
	
	Возврат ОбщегоНазначенияСУ.ДанныеВJSON(Новый Структура("Заголовок, Выделить, Закрепить, ДатаПубликации, Автор, Номер, Идентификатор", ДанныеНовости.Заголовок, ДанныеНовости.Выделить, ДанныеНовости.Закрепить, ДанныеНовости.ДатаПубликации, АвторОписание, ДанныеНовости.Номер, Строка(Новость.УникальныйИдентификатор())));
	
КонецФункции

Функция НовостьОписаниеОбщееXML(Новость) Экспорт
	
	ДанныеНовости = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Новость, "Заголовок, Выделить, Закрепить, ДатаПубликации, Автор.Наименование, Автор, Номер, ФорматированныйДокумент");
	
	НовостьXDTOТип      = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/3/News","Новость");
	ПользовательXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/User","Пользователь");
	
	НовостьXDTO = ФабрикаXDTO.Создать(НовостьXDTOТип);
	
	НовостьXDTO.Заголовок = ДанныеНовости.Заголовок;
	НовостьXDTO.Номер     = ДанныеНовости.Номер;
	НовостьXDTO.Дата      = ДанныеНовости.ДатаПубликации;
	НовостьXDTO.ДатаЧисло = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ДанныеНовости.ДатаПубликации);
	
	ТекстНовостиСтруктура = ОбщегоНазначенияСУ.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ДанныеНовости.ФорматированныйДокумент.Получить(), Строка(Новость.УникальныйИдентификатор()),,Ложь,Истина);
	
	НовостьXDTO.Текст = СокрЛП(ТекстНовостиСтруктура.ПредставлениеHTML);
	
	ПользовательXDTO = ФабрикаXDTO.Создать(ПользовательXDTOТип);
	
	ПользовательXDTO.Ссылка = ДанныеНовости.Автор;
	Если ЗначениеЗаполнено(ДанныеНовости.Автор) Тогда
		ПользовательXDTO.ПолноеИмя = ДанныеНовости.АвторНаименование;
	Иначе
		ПользовательXDTO.ПолноеИмя = "";
	КонецЕсли;

	НовостьXDTO.Автор = ПользовательXDTO;
	НовостьXDTO.Выделить = ДанныеНовости.Выделить;
	НовостьXDTO.Закрепить = ДанныеНовости.Закрепить;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, НовостьXDTO);
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции


#КонецЕсли
