#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;			
	
	ДатаИзменения = ТекущаяДата();
	
	Если Ссылка.Пустая() И НЕ ЗначениеЗаполнено(Автор) Тогда
		Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.НовостиСУО.Записывать = Истина;
	
	Если Получатели.Количество() > 0 Тогда
		
		Для каждого Строка Из Получатели Цикл
		
			Движение = Движения.НовостиСУО.Добавить();
			
			Движение.Дата = ДатаПубликации;
			Движение.Пользователь = Строка.Пользователь;
			Движение.Заголовок = Заголовок;
			Движение.Выделить = Выделить;
			Движение.Закрепить = Закрепить;
		
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Автор) И Получатели.Найти(Автор, "Пользователь") = Неопределено Тогда
		
			Движение = Движения.НовостиСУО.Добавить();
			
			Движение.Дата = ДатаПубликации;
			Движение.Пользователь = Автор;
			Движение.Заголовок = Заголовок;
			Движение.Выделить = Выделить;
			Движение.Закрепить = Закрепить;
			
		КонецЕсли;
		
		Если АвтоматическаяРассылка Тогда
			УправлениеОбучениемСУО.СоздатьАвтоматическуюРассылку(ЭтотОбъект, Получатели);
		КонецЕсли;
		
	Иначе
		
		Движение = Движения.НовостиСУО.Добавить();
		
		Движение.Дата = ДатаПубликации;
		Движение.Заголовок = Заголовок;
		Движение.Выделить = Выделить;
		Движение.Закрепить = Закрепить;
		
		Если АвтоматическаяРассылка Тогда
			УправлениеОбучениемСУО.СоздатьАвтоматическуюРассылку(ЭтотОбъект);
		КонецЕсли;
		
	КонецЕсли;
	
	Движения.Записать();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ИдентификаторОбъектаКопирования = ОбъектКопирования.Ссылка.УникальныйИдентификатор();
КонецПроцедуры

#КонецОбласти


#КонецЕсли
