#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ИспользованиеВебКабинета(Знач Пользователь, Знач ИдентификаторСессии, Знач ИдентификаторВкладки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИспользованиеВебКабинетаСУ.Ссылка
		|ИЗ
		|	Документ.ИспользованиеВебКабинетаСУ КАК ИспользованиеВебКабинетаСУ
		|ГДЕ
		|	ИспользованиеВебКабинетаСУ.ПометкаУдаления = ЛОЖЬ
		|	И ИспользованиеВебКабинетаСУ.Пользователь = &Пользователь
		|	И ИспользованиеВебКабинетаСУ.ИдентификаторСессии = &ИдентификаторСессии
		|	И ИспользованиеВебКабинетаСУ.ИдентификаторВкладки = &ИдентификаторВкладки";
	
	Запрос.УстановитьПараметр("ИдентификаторВкладки", ИдентификаторВкладки);
	Запрос.УстановитьПараметр("ИдентификаторСессии", ИдентификаторСессии);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	ВыборкаДетальныеЗаписи.Следующий();

	Возврат ВыборкаДетальныеЗаписи.Ссылка;
	
КонецФункции

Процедура НачатьИспользование(Знач Пользователь, Знач ИдентификаторСессии, Знач ИдентификаторВкладки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущиеИспользование = ИспользованиеВебКабинета(Пользователь, ИдентификаторСессии, ИдентификаторВкладки);  
	
	Если ЗначениеЗаполнено(ТекущиеИспользование) Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОбъект = Документы.ИспользованиеВебКабинетаСУ.СоздатьДокумент();
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	ДокументОбъект.Пользователь = Пользователь;
	ДокументОбъект.ИдентификаторСессии = ИдентификаторСессии;
	ДокументОбъект.ИдентификаторВкладки = ИдентификаторВкладки;
	ДокументОбъект.ДатаНачала = ДокументОбъект.Дата;
	ДокументОбъект.ДатаПоследнейАктивности = ДокументОбъект.Дата;
	
	ДобавитьПериодДетекции(ДокументОбъект, ДокументОбъект.ДатаПоследнейАктивности);
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	
КонецПроцедуры

Процедура ЗаписатьДатуПоследнейАктивности(Знач Пользователь, Знач ИдентификаторСессии, Знач ИдентификаторВкладки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущиеИспользование = ИспользованиеВебКабинета(Пользователь, ИдентификаторСессии, ИдентификаторВкладки);  
	
	Если НЕ ЗначениеЗаполнено(ТекущиеИспользование) Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.ИспользованиеВебКабинетаСУ");
		ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", ТекущиеИспользование);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ДокументыТребующиеПерепроведенияСУО");
		ЭлементБлокировкиДанных.УстановитьЗначение("Документ", ТекущиеИспользование);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		
		БлокировкаДанных.Заблокировать();
			
		
		ДокументОбъект = ТекущиеИспользование.ПолучитьОбъект();
		
		Если ДокументОбъект.Окончено Тогда
			Возврат;
		КонецЕсли;
		
		ДобавитьПериодДетекции(ДокументОбъект, ТекущаяДатаСеанса());
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(ТекущиеИспользование, РежимЗаписиДокумента.Проведение,,,0);
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	
КонецПроцедуры

Процедура ЗавершитьИспользование(Знач Пользователь, Знач ИдентификаторСессии, Знач ИдентификаторВкладки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущиеИспользование = ИспользованиеВебКабинета(Пользователь, ИдентификаторСессии, ИдентификаторВкладки);  
	
	Если НЕ ЗначениеЗаполнено(ТекущиеИспользование) Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
			
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.ИспользованиеВебКабинетаСУ");
		ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", ТекущиеИспользование);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ДокументыТребующиеПерепроведенияСУО");
		ЭлементБлокировкиДанных.УстановитьЗначение("Документ", ТекущиеИспользование);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		
		БлокировкаДанных.Заблокировать();
		
		
		ДокументОбъект = ТекущиеИспользование.ПолучитьОбъект();	
		
		Если ДокументОбъект.Окончено Тогда
			Возврат;
		КонецЕсли;	
		
		ДокументОбъект.ДатаОкончания = ТекущаяДатаСеанса();
		ДокументОбъект.Окончено = Истина;
		
		ДобавитьПериодДетекции(ДокументОбъект, ДокументОбъект.ДатаОкончания);
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(ТекущиеИспользование, РежимЗаписиДокумента.Проведение,,,0);
		
		
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	
КонецПроцедуры

Процедура ДобавитьПериодДетекции(ДокументОбъект, ДатаПоследнейАктивности)
	
	ДокументОбъект.ДатаПоследнейАктивности = ДатаПоследнейАктивности;
	
	НоваяСтрока = ДокументОбъект.ПериодыДетекции.Добавить();
	НоваяСтрока.ДатаАктивности = ДатаПоследнейАктивности;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли