#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ИспользованиеВебКабинетаСУ.Записывать = Истина;
	
	Если ДатаНачала = ДатаПоследнейАктивности Тогда
		Возврат;
	КонецЕсли;
	
	Движение = Движения.ИспользованиеВебКабинетаСУ.Добавить();
	Движение.Период = Дата;
	Движение.Пользователь = Пользователь;
	Движение.ДатаНачала = ДатаНачала;
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		Движение.ДатаОкончания = ДатаОкончания;
	Иначе
		Движение.ДатаОкончания = ДатаПоследнейАктивности;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти


#КонецЕсли
