#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ОтложитьЗадание(Знач ПопыткаВыполнения, Знач Преподаватель, Знач ПрохождениеОбучения) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОтложенныеЗаданияНаПроверкуСУО");
		ЭлементБлокировки.УстановитьЗначение("ПопыткаВыполнения", ПопыткаВыполнения);	
		ЭлементБлокировки.УстановитьЗначение("Преподаватель", Преподаватель);	
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		Блокировка.Заблокировать();
		
		
		МенеджерЗаписи = РегистрыСведений.ОтложенныеЗаданияНаПроверкуСУО.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.ПопыткаВыполнения = ПопыткаВыполнения;
		МенеджерЗаписи.Преподаватель = Преподаватель;		
		МенеджерЗаписи.ПрохождениеОбучения = ПрохождениеОбучения;	
		МенеджерЗаписи.ДатаИзменения = ТекущаяДатаСеанса();
		
		МенеджерЗаписи.Записать(Истина);			
		
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
