
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЕстьПоддержкаСотрудников = УправлениеОбучениемСУОВызовСервера.ЕстьПоддержкаСотрудников();
	ЕстьПоддержкаСтудентов = УправлениеОбучениемСУОВызовСервера.ЕстьПоддержкаСтудентов();
	КлючВарианта = Неопределено;
	
	Если ЕстьПоддержкаСотрудников И НЕ ЕстьПоддержкаСтудентов Тогда
		ИмяФормыОтчета = "Отчет.РезультатыОбученияСУО.Форма";
		КлючВарианта = "ОбучениеПользователей";
	ИначеЕсли ЕстьПоддержкаСтудентов И НЕ ЕстьПоддержкаСотрудников Тогда
		ИмяФормыОтчета = "Отчет.РезультатыОбученияОО.Форма";
		КлючВарианта = "ОбучениеСтудентов";
	Иначе
		ИмяФормыОтчета = "Отчет.РезультатыОбученияСУ.Форма";
		КлючВарианта = "ОбучениеПользователей";
	КонецЕсли;		
	
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии, КлючВарианта", Новый Структура("ПроведениеОбучения", ПараметрКоманды), Истина, КлючВарианта);
	ОткрытьФорму(ИмяФормыОтчета, ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
