
#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Устанавливаем переменные
	
	Если Объект.Ссылка.Пустая() Тогда		
		
		Объект.Дата          = ТекущаяДата();
		Объект.Статус        = Перечисления.СтатусыЗаявокНаОбучениеСУО.НаРассмотрении;		
		Объект.ПредметЗаявки = Параметры.ПредметЗаявки;
		Объект.Пользователь  = Пользователи.ТекущийПользователь();
		
		Если ТипЗнч(Объект.ПредметЗаявки) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
			Объект.ОбъектЗаявки = Документы.ПроведениеОбученияСУО.СценарийОбучения(Объект.ПредметЗаявки);
		КонецЕсли;
		
		Если ТипЗнч(Объект.ПредметЗаявки) = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО") Тогда
			Объект.ОбъектЗаявки = Документы.ПроведениеПрограммыОбученияСУО.ПрограммаОбучения(Объект.ПредметЗаявки);
		КонецЕсли;
		
	КонецЕсли;
	
	// Делаем проверки
	
	Если НЕ ЗначениеЗаполнено(Объект.ПредметЗаявки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Предмет заявки не задан'"),,,,Отказ);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ОбъектЗаявки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Объект заявки не задан'"),,,,Отказ);
		Возврат;
	КонецЕсли;	
	
	// Получаем реквизиты формы
	
	ТребуемыеРеквизиты = Новый Структура;
	ТребуемыеРеквизиты.Вставить("ДатаОткрытияЗаписи", "ДатаОткрытияЗаписи");
	ТребуемыеРеквизиты.Вставить("ДатаЗакрытияЗаписи", "ДатаЗакрытияЗаписи");
	
	Если ТипЗнч(Объект.ПредметЗаявки) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		ТребуемыеРеквизиты.Вставить("Описание", "КомментарийОткрытогоМероприятияДляУчастника");
	КонецЕсли;	
	
	Если ТипЗнч(Объект.ПредметЗаявки) = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО") Тогда
		ТребуемыеРеквизиты.Вставить("Описание", "КомментарийОткрытойПрограммыДляУчастника");
	КонецЕсли;	
	
	ОбщиеДанныеПредметаЗаявки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ПредметЗаявки, ТребуемыеРеквизиты);
	
	ДатаОткрытияЗаписи = ОбщиеДанныеПредметаЗаявки.ДатаОткрытияЗаписи;
	ДатаЗакрытияЗаписи = ОбщиеДанныеПредметаЗаявки.ДатаЗакрытияЗаписи;
	
	Если ТипЗнч(ОбщиеДанныеПредметаЗаявки.Описание) = Тип("ХранилищеЗначения") Тогда
		Описание = ОбщиеДанныеПредметаЗаявки.Описание.Получить();
	КонецЕсли;	
	
	// Устанавливаем видимость элементов
	
	Если ЗначениеЗаполнено(Объект.ПредметЗаявки)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ПредметЗаявки, "ОткрытоДляРуководителей") Тогда
		
		Элементы.Участники.Видимость = Истина;
		
	Иначе
		
		Элементы.Участники.Видимость = Ложь;
		
	КонецЕсли;
	
	Элементы.Участники.ТолькоПросмотр = ?(Объект.Статус = Перечисления.СтатусыЗаявокНаОбучениеСУО.НаРассмотрении, Ложь, Истина);
	Элементы.Статус.Видимость         = НЕ Объект.Ссылка.Пустая();
	
	Элементы.Комментарий.Видимость = ЗначениеЗаполнено(Объект.Комментарий);	
	Элементы.Информация.ТолькоПросмотр = ?(Объект.Статус = Перечисления.СтатусыЗаявокНаОбучениеСУО.НаРассмотрении, Ложь, Истина);
	Элементы.ГруппаДополнительныеРеквизиты.ТолькоПросмотр = ?(Объект.Статус = Перечисления.СтатусыЗаявокНаОбучениеСУО.НаРассмотрении, Ложь, Истина);
	
	Элементы.ПровестиИЗакрыть.Доступность = ?(Объект.Статус = Перечисления.СтатусыЗаявокНаОбучениеСУО.НаРассмотрении, Истина, Ложь);
	
	Элементы.СоздатьНовуюЗаявку.Видимость = ?(Объект.Статус = Перечисления.СтатусыЗаявокНаОбучениеСУО.Отменена, Истина, Ложь);
	
	Элементы.ГруппаПериодЗаписи.Видимость = ?(ЗначениеЗаполнено(ДатаОткрытияЗаписи) ИЛИ ЗначениеЗаполнено(ДатаЗакрытияЗаписи), Истина, Ложь);
	Элементы.ДатаОткрытияЗаписи.Видимость = ?(ЗначениеЗаполнено(ДатаОткрытияЗаписи), Истина, Ложь);
	Элементы.ДатаЗакрытияЗаписи.Видимость = ?(ЗначениеЗаполнено(ДатаЗакрытияЗаписи), Истина, Ложь);

	Если ТипЗнч(Описание) = Тип("ФорматированныйДокумент") Тогда
		
		ТекстОписания = Описание.ПолучитьТекст();
		
		Элементы.Описание.Видимость = ?(ЗначениеЗаполнено(ТекстОписания), Истина, Ложь);
		
	Иначе
		
		Элементы.Описание.Видимость = Ложь;
		
	КонецЕсли;
	
	
	// Другое
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьМоеОбучение",,ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУчастники

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Участники

&НаКлиенте
Процедура УчастникиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	АдресСпискаВХранилище = ПоместитьСписокПользователейВХранилище();
	
	ПараметрыФормы = Новый Структура("ПараметрыРасширеннойФормыПодбора, РасширенныйПодбор, ВариантПодбора", АдресСпискаВХранилище, Истина, "Подчиненные");
	ОткрытьФорму("ОбщаяФорма.ПодборПользователейСУО", ПараметрыФормы, Элементы.Участники,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура УчастникиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда		
		Возврат;		
	КонецЕсли;
	
	Объект.Участники.Очистить();
	
	Для каждого ВыбранныйПользователь Из ВыбранноеЗначение Цикл
		
		НоваяСтрока = Объект.Участники.Добавить();
		НоваяСтрока.Пользователь = ВыбранныйПользователь; 
		
	КонецЦикла;

КонецПроцедуры


#КонецОбласти




#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура СоздатьНовуюЗаявку(Команда)
	Закрыть();
	ОбучениеСУОКлиент.ОткрытьЗаявку(Объект.ПредметЗаявки, Объект.Пользователь, Истина);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ПоместитьСписокПользователейВХранилище()
	
	ВременнаяТаблицаПользователей = Новый ТаблицаЗначений();
	ВременнаяТаблицаПользователей.Колонки.Добавить("Пользователь");
	ВременнаяТаблицаПользователей.Колонки.Добавить("Наименование");
	
	Для каждого Строка Из Объект.Участники Цикл
	
		НоваяСтрока = ВременнаяТаблицаПользователей.Добавить();
		НоваяСтрока.Пользователь = Строка.Пользователь;
		НоваяСтрока.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Пользователь, "Наименование");
	
	КонецЦикла;
	
	ЗаголовокФормыПодбора = НСтр("ru = 'Подбор пользователей'");
	ПараметрыРасширеннойФормыПодбора = 
		Новый Структура("ЗаголовокФормыПодбора, ВыбранныеПользователи, ПодборГруппНевозможен",
		                 ЗаголовокФормыПодбора, ВременнаяТаблицаПользователей, Истина);
	АдресХранилища = ПоместитьВоВременноеХранилище(ПараметрыРасширеннойФормыПодбора, УникальныйИдентификатор);
	Возврат АдресХранилища;	
	
КонецФункции

// СтандартныеПодсистемы.Свойства

&НаКлиенте

Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти
