
Процедура ПередНачаломРаботыСистемы() Экспорт
	
	// Примечание: важно параметры сеанса установить в обработчике ПередНачаломРаботыСистемы, так как
	// они используют информацию клиента.
	
	ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиентаПриЗапуске();	
	
	#Если ВебКлиент Тогда
	
	СтруктураПараметров = Новый Структура("ИспользуетсяЛокальныйКэшНаКлиентеСУЗ", Ложь);
	ОбщегоНазначенияСУВызовСервера.УстановитьПараметрыСеанса(СтруктураПараметров);
		
	#Иначе		
		
	Если ПараметрыРаботыКлиента.ЭлектронныеРесурсы.ИспользоватьОбщийКаталогВТонкомКлиенте Тогда
		
		СтруктураПараметров = Новый Структура("ИспользуетсяЛокальныйКэшНаКлиентеСУЗ", Ложь);
		ОбщегоНазначенияСУВызовСервера.УстановитьПараметрыСеанса(СтруктураПараметров);
	
	Иначе
		
		ОсновнойКаталогФайлов = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(КаталогВременныхФайлов());
		
		СтруктураПараметров = Новый Структура("ПутьКРабочемуКаталогуСУ, АдресРабочегоКаталогаСУ, ИспользуетсяЛокальныйКэшНаКлиентеСУЗ", ОсновнойКаталогФайлов, ОсновнойКаталогФайлов, Истина);
		ОбщегоНазначенияСУВызовСервера.УстановитьПараметрыСеанса(СтруктураПараметров); // Переопределяем с учетом данных клиента
		
		ПутьКаталогуОбъектов = ОбъектыСУЗПовтИсп.ПутьКаталогуОбъектов();
		
		КаталогОбъектов = Новый Файл(ПутьКаталогуОбъектов);
	
		Если НЕ КаталогОбъектов.Существует() Тогда
			Попытка
				СоздатьКаталог(ПутьКаталогуОбъектов);
			Исключение
				Текст = НСтр("ru = 'Невозможно создать каталог: "+ПутьКаталогуОбъектов+"'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
			КонецПопытки;
		КонецЕсли;		
		
	КонецЕсли;
		
	#КонецЕсли
	
	
КонецПроцедуры



