

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.ИнформацияОПрикрепленныхФайлах) = Тип("ФиксированныйМассив") Тогда
		
		Для каждого ИнформацияОПрикрепленномФайле Из Параметры.ИнформацияОПрикрепленныхФайлах Цикл
		
			НоваяСтрока = ТаблицаФайлов.Добавить();
			НоваяСтрока.АдресВХранилище = ИнформацияОПрикрепленномФайле.Адрес;
			НоваяСтрока.ПолноеИмя = ИнформацияОПрикрепленномФайле.ПолноеИмя;
			НоваяСтрока.Имя = ИнформацияОПрикрепленномФайле.Имя;
		
		КонецЦикла;			
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаФайлов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолучитьФайл(ТекущиеДанные.АдресВХранилище, ТекущиеДанные.Имя, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	Закрыть(ТаблицаФайлов);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ ТаблицаФайлов

&НаКлиенте
Процедура ТаблицаФайловПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоместитьВыбранныеФайлыВХранилищеВебЗавершение", ЭтотОбъект);
	НачатьПомещениеФайла(ОписаниеОповещения, , ,Истина, Параметры.УникальныйИдентификаторФормыВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьВыбранныеФайлыВХранилищеВебЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	         
	Если НЕ Результат Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = ТаблицаФайлов.Добавить();
	НоваяСтрока.АдресВХранилище = Адрес;
	НоваяСтрока.ПолноеИмя = ВыбранноеИмяФайла;
	НоваяСтрока.Имя = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ВыбранноеИмяФайла).Имя;
	
КонецПроцедуры




