#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ТестыНаПроверкуПрохожденияОбучения(Пользователь, ПрохождениеОбучения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТестыНаПроверкуСУЗ.ЭлектронныйРесурс КАК ЭлектронныйРесурс,
		|	ТестыНаПроверкуСУЗ.ЭлементСодержания КАК ЭлементСодержания,
		|	ТестыНаПроверкуСУЗ.ПрохождениеОбучения КАК ПрохождениеОбучения,
		|	ТестыНаПроверкуСУЗ.Задание КАК Задание,
		|	ТестыНаПроверкуСУЗ.Пользователь КАК Пользователь,
		|	ТестыНаПроверкуСУЗ.Период КАК Дата,
		|	ТестыНаПроверкуСУЗ.ЭлектронныйРесурс.Наименование КАК НаименованиеЗадания,
		|	ТестыНаПроверкуСУЗ.Регистратор КАК Регистратор,
		|	ТестыНаПроверкуСУЗ.ПрохождениеОбучения.ПроведениеОбучения КАК ПроведениеОбучения
		|ИЗ
		|	РегистрСведений.ТестыНаПроверкуСУЗ КАК ТестыНаПроверкуСУЗ
		|ГДЕ
		|	ТестыНаПроверкуСУЗ.Проверен = ЛОЖЬ
		|	И ТестыНаПроверкуСУЗ.ПрохождениеОбучения = &ПрохождениеОбучения
		|	И ТестыНаПроверкуСУЗ.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли

