

#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатыДоступа = РегистрыСведений.ВремяДоступаПользователейСУО.ДатыДоступа(Параметры.Пользователь);
	
	Если ДатыДоступа = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ДатаНачалаДоступа = ДатыДоступа.ДатаНачалаДоступа;
	ДатаОкончанияДоступа = ДатыДоступа.ДатаОкончанияДоступа;

	Если ЗначениеЗаполнено(ДатаНачалаДоступа)
		И ЗначениеЗаполнено(ДатаОкончанияДоступа) Тогда
		
		Элементы.ГруппаДвеДаты.Видимость = Истина;
		Элементы.ГруппаДатаНачала.Видимость = Ложь;
		Элементы.ГруппаДатаОкончания.Видимость = Ложь;
		
	Иначе
		
		Элементы.ГруппаДвеДаты.Видимость = Ложь;
		Элементы.ГруппаДатаНачала.Видимость = ?(ЗначениеЗаполнено(ДатаНачалаДоступа), Истина, Ложь);
		Элементы.ГруппаДатаОкончания.Видимость = ?(ЗначениеЗаполнено(ДатаОкончанияДоступа), Истина, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти