
Функция ПолучитьДанныеИзученияGET(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//	
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;	
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Ложь);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные запроса
	//	
	
	ИдентификаторАктивности = Новый УникальныйИдентификатор(
		Запрос.ПараметрыURL.Получить("ИдентификаторАктивности"));	
		
	ЭлектронныйКурс = Справочники.ЭлектронныеКурсы.ПолучитьСсылку(
		Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("ЭлектронныйКурс")));	
	
	// Получаем данные из БД
	//
	
	ДанныеИзученияСтруктура = РегистрыСведений.ДанныеИзученияЭлектронныхКурсовВебКабинетаСУО.ВсеДанныеИзучения(ИдентификаторАктивности, ЭлектронныйКурс);
	
	// Отдаем клиенту
	//
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеИзученияСтруктура);					
	
	ДанныеИзученияСтрока = ЗаписьJSON.Закрыть();
	
	Возврат ОтветКлиентуСтрокаJSON(ДанныеИзученияСтрока);	
	
КонецФункции

Функция СохранитьДанныеИзученияPOST(Запрос)
	
		
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//	
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;	
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Ложь);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные запроса
	//	
	
	ИдентификаторАктивности = Новый УникальныйИдентификатор(
		Запрос.ПараметрыURL.Получить("ИдентификаторАктивности"));	
		
	ЭлектронныйКурс = Справочники.ЭлектронныеКурсы.ПолучитьСсылку(
		Новый УникальныйИдентификатор(Запрос.ПараметрыURL.Получить("ЭлектронныйКурс")));		
	
	ДанныеИзученияСтруктура = ИзучениеЭлектронныхКурсовСлужебный.ДанныеИзученияСтруктураИзСтроки(Запрос.ПолучитьТелоКакСтроку());
	
	Для каждого ЭлементСтруктуры Из ДанныеИзученияСтруктура Цикл
		
		НаборЗаписей = РегистрыСведений.ДанныеИзученияЭлектронныхКурсовВебКабинетаСУО.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторАктивности.Установить(ИдентификаторАктивности);
		НаборЗаписей.Отбор.ЭлектронныйКурс.Установить(ЭлектронныйКурс);
		НаборЗаписей.Отбор.ИмяДанных.Установить(ЭлементСтруктуры.Ключ);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ИдентификаторАктивности = НаборЗаписей.Отбор.ИдентификаторАктивности.Значение; 
		НоваяЗапись.ЭлектронныйКурс = НаборЗаписей.Отбор.ЭлектронныйКурс.Значение;
		НоваяЗапись.ИмяДанных = НаборЗаписей.Отбор.ИмяДанных.Значение;
		
		НоваяЗапись.Данные = Новый ХранилищеЗначения(ЭлементСтруктуры.Значение);
		НоваяЗапись.Пользователь = ДанныеСессии.Пользователь;

		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	ЭтоЗавершениеИзучения = ЭлектронноеОбучениеСлужебныйКлиентСервер.СтрокаВБулево(Запрос.ПараметрыЗапроса.Получить("terminate"));
	
	Если ЭтоЗавершениеИзучения Тогда		
		
		// Формируем данные изучения для помещения в документ изучения
		
		ВсеДанныеИзучения = РегистрыСведений.ДанныеИзученияЭлектронныхКурсовВебКабинетаСУО.ВсеДанныеИзучения(ИдентификаторАктивности, ЭлектронныйКурс);
		
		ДанныеИзученияСтруктура = Новый Структура;
		ДанныеИзученияСтруктура.Вставить("activities", Новый Массив);
		
		Для каждого ЭлементДанных Из ВсеДанныеИзучения Цикл
			
			Если СтрНачинаетсяС(ЭлементДанных.Ключ, "activity_") Тогда
				ДанныеИзученияСтруктура.activities.Добавить(ЭлементДанных.Значение);
			Иначе
				ДанныеИзученияСтруктура.Вставить(ЭлементДанных.Ключ, ЭлементДанных.Значение);
			КонецЕсли;
			
		КонецЦикла;
		
		// Сохраняем документ изучения
		ПрохождениеОбучения = Документы.ПрохождениеОбученияСУО.ПолучитьСсылку(ИдентификаторАктивности);
		ПроведениеОбучения = Документы.ПрохождениеОбученияСУО.ПроведениеОбучения(ПрохождениеОбучения);		
		Контекст = ПроведениеОбучения; 
		ИзучениеЭлектронногоКурса = Документы.ИзучениеЭлектронногоКурса.НайтиПоКонтексту(ЭлектронныйКурс, Контекст, ДанныеСессии.Пользователь);
				
		Если НЕ ЗначениеЗаполнено(ИзучениеЭлектронногоКурса) Тогда
			
			ИзучениеЭлектронногоКурсаОбъект = Документы.ИзучениеЭлектронногоКурса.СоздатьДокумент();
			ИзучениеЭлектронногоКурсаОбъект.Заполнить(Неопределено);
			ИзучениеЭлектронногоКурсаОбъект.Дата = ТекущаяДатаСеанса();
			ИзучениеЭлектронногоКурсаОбъект.Контекст = Контекст;
			ИзучениеЭлектронногоКурсаОбъект.Учащийся = ДанныеСессии.Пользователь;
			ИзучениеЭлектронногоКурсаОбъект.ЭлектронныйКурс = ЭлектронныйКурс;
			
			ИзучениеЭлектронногоКурсаОбъект.Записать(РежимЗаписиДокумента.Запись);
			
			ИзучениеЭлектронногоКурса = ИзучениеЭлектронногоКурсаОбъект.Ссылка;
			
		КонецЕсли;		
		
		ИзучениеЭлектронныхКурсовСлужебный.СохранитьВБазуДанныеИзучения(ИзучениеЭлектронногоКурса, ДанныеИзученияСтруктура, ТекущаяДатаСеанса(), Истина);
		
	КонецЕсли;
	
	Возврат ОтветКлиентуСтрокаJSON("{}");
	
	
КонецФункции


Функция ОтветКлиентуJSON(КодОшибки = "", Данные = NULL)
	
	ТекстСообщенияСтруктура = Новый Структура("error, data", КодОшибки, Данные);
	
	ТекстСообщения = ЭлектронноеОбучениеСлужебный.ДанныеВJSON(ТекстСообщенияСтруктура);

	Если ЗначениеЗаполнено(КодОшибки) Тогда
		Ответ = Новый HTTPСервисОтвет(400);
	Иначе
		Ответ = Новый HTTPСервисОтвет(200);
	КонецЕсли;
		
	Ответ.УстановитьТелоИзСтроки(ТекстСообщения);
	
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	ДобавитьЗаголовкиМежсайтовогоЗапроса(Ответ);

	Возврат Ответ;

	
КонецФункции

Функция ОтветКлиентуСтрокаJSON(СтрокаJSON)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	ДобавитьЗаголовкиМежсайтовогоЗапроса(Ответ);
	
	Возврат Ответ;
	
КонецФункции

Функция РазрешитьМежсайтовыеЗапросыOPTIONS(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	ДобавитьЗаголовкиМежсайтовогоЗапроса(Ответ, Истина);
	Возврат Ответ;
	
КонецФункции

Процедура ДобавитьЗаголовкиМежсайтовогоЗапроса(Ответ, ПроверитьРазрешение = Ложь)
	Если НЕ ПроверитьРазрешение ИЛИ Константы.РазрешитьЗапросыКСервисамСДругихДоменовСУ.Получить() = Истина Тогда
		Ответ.Заголовки.Вставить("Access-Control-Allow-Origin", "*");
	    Ответ.Заголовки.Вставить("Access-Control-Allow-Methods", "GET, PUT, POST, DELETE, HEAD, OPTIONS");
	    Ответ.Заголовки.Вставить("Access-Control-Allow-Credentials", "true");
	    Ответ.Заголовки.Вставить("Access-Control-Allow-Headers", "X-Requested-With, origin, content-type, accept");
	КонецЕсли;
КонецПроцедуры

