
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИспользоватьЭлектронноеОбучение = ЭлектронноеОбучение.ИспользоватьЭлектронноеОбучение();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗаданиеНаПроверкуЗаписано"
		ИЛИ ИмяСобытия = "ЭлектронныйКурсЗаписан"
		ИЛИ ИмяСобытия = "ЭлектронныйРесурсЗаписан" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Список

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Группа Тогда
		Возврат;
	КонецЕсли;
	Если Копирование И Элемент.ТекущиеДанные <> Неопределено Тогда
		Если Элемент.ТекущиеДанные.ЭтоГруппа Тогда
			Возврат;
		КонецЕсли;
		Отказ = Истина;
		Если Элемент.ТекущиеДанные.Размещение = ПредопределенноеЗначение("Перечисление.РазмещениеУчебныхМатериаловСУО.БиблиотекаЭлектронногоОбучения") Тогда
			КонтекстРедактирования = ПолучитьКонтекстРедактирования();
			РазработкаЭлектронныхКурсовКлиент.СкопироватьЭлектронныйКурс(Элемент.ТекущиеДанные.Хранение, Элементы.Список, КонтекстРедактирования);  
		КонецЕсли;
	Иначе		
		Отказ = Истина;
		ПараметрыФормы = Новый Структура("СозданиеНового", Истина);
		ОткрытьФорму("Перечисление.ТипыУчебныхМатериаловСУО.ФормаВыбора", ПараметрыФормы, Элементы.Список);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если НЕ ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;	
	КонтекстРедактирования = ПолучитьКонтекстРедактирования();	
	Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ТипыУчебныхМатериаловСУО.ЗаданиеНаПроверку") Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("Владелец", ПредопределенноеЗначение("Справочник.СхемыМероприятийСУО.Общая")));
		ПараметрыФормы.Вставить("КонтекстРедактирования", КонтекстРедактирования);
		ОткрытьФорму("Справочник.ЗаданияСУО.ФормаОбъекта", ПараметрыФормы, Элементы.Список); 
	КонецЕсли;
	Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ТипыУчебныхМатериаловСУО.Другое") Тогда
		ВызватьИсключение НСтр("ru = 'Невозможно создать учебный материал вида ""Другое""'");
	КонецЕсли;
	Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ТипыУчебныхМатериаловСУО.СлайдовыйКурс") Тогда
		Если ИспользоватьЭлектронноеОбучение Тогда 
			РазработкаЭлектронныхКурсовКлиент.СоздатьЭлектронныйКурс(
				ПредопределенноеЗначение("Перечисление.ТипыЭлектронныхКурсов.Слайдовый"),
				Элементы.Список,
				КонтекстРедактирования);
		Иначе
			ВызватьИсключение НСтр("ru = 'Невозможно создать учебный материал вида ""Слайдовый курс"", так как не подключена подсистема ""Электронное обучение""'");
		КонецЕсли;
	КонецЕсли;
	Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ТипыУчебныхМатериаловСУО.Тест") Тогда
		Если ИспользоватьЭлектронноеОбучение Тогда
			ВызватьИсключение НСтр("ru = 'Невозможно создать учебный материал вида ""Тест"" в подсистеме ""Электронное обучение""'");
		Иначе
			ПараметрыФормы = Новый Структура; 
			ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("Тип", ПредопределенноеЗначение("Перечисление.ТипыЭлектронныхРесурсовСУЗ.Тест")));
			ПараметрыФормы.Вставить("КонтекстРедактирования", КонтекстРедактирования);
			ОткрытьФорму("Справочник.СводыЗнанийСУЗ.ФормаОбъекта", ПараметрыФормы);
		КонецЕсли;
	КонецЕсли;
	Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ТипыУчебныхМатериаловСУО.ЭлектронныйУчебник") Тогда
		Если ИспользоватьЭлектронноеОбучение Тогда
			РазработкаЭлектронныхКурсовКлиент.СоздатьЭлектронныйКурс(
				ПредопределенноеЗначение("Перечисление.ТипыЭлектронныхКурсов.Учебник"),
				Элементы.Список,
				КонтекстРедактирования);
		Иначе
			ПараметрыФормы = Новый Структура; 
			ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("Тип", ПредопределенноеЗначение("Перечисление.ТипыЭлектронныхРесурсовСУЗ.ЭлектронныйКурс")));
			ПараметрыФормы.Вставить("КонтекстРедактирования", КонтекстРедактирования);
			ОткрытьФорму("Справочник.СводыЗнанийСУЗ.ФормаОбъекта", ПараметрыФормы);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные = Неопределено ИЛИ Элемент.ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПоказатьЗначение(,Элемент.ТекущиеДанные.Хранение);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Функция ПолучитьКонтекстРедактирования()	
	КонтекстРедактирования = Новый Структура("Родитель", Неопределено);	
	ТекущийРодитель = Неопределено;
	Если Элементы.Список.ТекущиеДанные <> Неопределено
		И Элементы.Список.ТекущиеДанные.ЭтоГруппа Тогда
		ТекущийРодитель = Элементы.Список.ТекущиеДанные.Ссылка;
	КонецЕсли;
	Если Элементы.Список.ТекущиеДанные <> Неопределено
		И НЕ Элементы.Список.ТекущиеДанные.ЭтоГруппа Тогда
		ТекущийРодитель = Элементы.Список.ТекущиеДанные.Родитель;
	КонецЕсли;		
	КонтекстРедактирования.Родитель = ТекущийРодитель;
	Возврат КонтекстРедактирования;
КонецФункции

#КонецОбласти

