
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		ЭлектронныйРесурс = Параметры.Отбор.Владелец;
		Элементы.ЭлектронныйРесурс.ТолькоПросмотр = Истина;
	ИначеЕсли ЗначениеЗаполнено(Параметры.ТекущаяСтрока) Тогда
		ЭлектронныйРесурс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ТекущаяСтрока, "Владелец");
	КонецЕсли;

	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Список, ЭлектронныйРесурс);	
	
	Если Параметры.ВыборТестов Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "СсылкаНаЭлемент.ЭтоТест", Истина);
	КонецЕсли;
	
	Если Параметры.ВыборТеории Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "СсылкаНаЭлемент.ЭтоТест", Ложь);
	КонецЕсли;
	
	Если Параметры.ВыборГлоссариев Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ЭтоГлоссарий", Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлектронныйРесурсПриИзменении(Элемент)
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Список, ЭлектронныйРесурс);
КонецПроцедуры
