
Процедура Перезаписать(ЭлементПодборки, ВесВопроса=Неопределено) Экспорт

	ОбъектЭлементПодборки =  ЭлементПодборки.ПолучитьОбъект();
	
	Если ВесВопроса <> Неопределено Тогда
		ОбъектЭлементПодборки.ВесВопроса = ВесВопроса;
	КонецЕсли;
	
	// Наименование будет обновлено в обработчике ПередЗаписью модуля объекта
	ОбъектЭлементПодборки.Записать();
			
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		
		Если Параметры.Свойство("ЗначениеКопирования") Тогда
			Возврат;
		КонецЕсли;			
		
		Ключ                 = Неопределено;
		ЗначенияЗаполнения   = Неопределено;
		Подборка             = Неопределено;
		СоздатьПустойЭлемент = Неопределено;
		
		Параметры.Свойство("ЗначенияЗаполнения", ЗначенияЗаполнения);
		Параметры.Свойство("Ключ", Ключ);
		Параметры.Свойство("СоздатьПустойЭлемент", СоздатьПустойЭлемент);
		
		Если ЗначенияЗаполнения <> Неопределено Тогда
			ЗначенияЗаполнения.Свойство("Владелец", Подборка);	
		КонецЕсли;
		
		Если Ключ = Неопределено И ЗначениеЗаполнено(Подборка) И СоздатьПустойЭлемент = Неопределено Тогда
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "ФормаСоздания";	
		КонецЕсли;
		
		
	КонецЕсли;
	
КонецПроцедуры
