#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ)
	
	Если ЭтоГруппа ИЛИ ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;
	
	Если ВесВопроса < 0 Тогда
		ВесВопроса = 0;
	КонецЕсли;
	
	Если ВесВопроса > 100 Тогда
		ВесВопроса = 100;
	КонецЕсли;	
	
	Если НЕ РазрешитьРедактироватьНаименование И ЗначениеЗаполнено(СсылкаНаОбъектСУЗ) Тогда
		Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъектСУЗ, "Наименование");
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
