

#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьДоступностьЭлементовФормы();
	
	//////////////////////////////////////////////////////////////////
	
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Объект);
	
	// Устанавливаем доступность данных от поставщика
	
	ТаблицаДоступностиДанныхПоставщика = РазработкаСУЗ.ПолучитьТаблицуДоступностиДанныхПоставщика();

	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.ЭлементыРубрикатора;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	РазработкаСУЗ.УстановитьДоступностьДанныхОтПоставщика(ЭтотОбъект, ТаблицаДоступностиДанныхПоставщика);
	
	//////////////////////////////////////////////////////////////////
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.Источники = Новый Массив;
	ПараметрыРазмещения.Источники.Добавить(Метаданные.Справочники.ЭлементыРубрикатораСУЗ);
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ЭлементыРубрикатораПодключаемыеКоманды;
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВопросЗаписан" Тогда
		Элементы.ОбъектыРубрик.Обновить();
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыЭлементыРубрикатора

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ЭлементыРубрикатора

&НаКлиенте
Процедура ЭлементыРубрикатораПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыРубрикатораПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(ОбъектыРубрик, Неопределено, "ЭлементРубрикатора");
	Иначе
		ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(ОбъектыРубрик, ТекущиеДанные.Ссылка, "ЭлементРубрикатора");
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбъектыРубрик

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ОбъектыРубрик

&НаКлиенте
Процедура ОбъектыРубрикВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьЭлементРубрики();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ДобавитьЭлементВРубрику(Команда)
	
	ТекущиеДанные = Элементы.ЭлементыРубрикатора.ТекущиеДанные;
	
	Если НЕ ОбщегоНазначенияСУКлиент.ТекущиеДанныеТаблицыДоступны(ТекущиеДанные) Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Тема не выбрана'"));
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьЭлементВРубрикуПродолжение", ЭтотОбъект, ТекущиеДанные);
	
	ОткрытьФорму("Справочник.ВопросыСУЗ.ФормаВыбора",, ЭтотОбъект,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭлементВРубрикуПродолжение(ВыбранныйЭлемент, ТекущиеДанные) Экспорт

	Если НЕ ЗначениеЗаполнено(ВыбранныйЭлемент) Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьВБазуЭлементРубрики(ТекущиеДанные.Владелец, ТекущиеДанные.Ссылка, ВыбранныйЭлемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборЭлементовВРубрику(Команда)
	
	ТекущиеДанные = Элементы.ЭлементыРубрикатора.ТекущиеДанные;
	
	Если НЕ ОбщегоНазначенияСУКлиент.ТекущиеДанныеТаблицыДоступны(ТекущиеДанные) Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Тема не выбрана'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("РежимПодбора, МножественныйВыбор", Истина, Истина);
	ОткрытьФорму("Справочник.ВопросыСУЗ.ФормаВыбора", ПараметрыФормы, ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура УдалитьЭлементРубрики(Команда)

	ТекущиеДанные = Элементы.ОбъектыРубрик.ТекущиеДанные;
	
	Если НЕ ОбщегоНазначенияСУКлиент.ТекущиеДанныеТаблицыДоступны(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьЭлементРубрикиПродолжение", ЭтотОбъект, ТекущиеДанные);		
	
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Удалить запись?'"), РежимДиалогаВопрос.ДаНет, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЭлементРубрикиПродолжение(Ответ, ТекущиеДанные) Экспорт

	Если Ответ = КодВозвратаДиалога.Нет Тогда
	    Возврат;
	КонецЕсли;
	
	УдалитьИзБазыЭлементРубрики(ТекущиеДанные.Рубрикатор, ТекущиеДанные.ЭлементРубрикатора, ТекущиеДанные.Поставщик, ТекущиеДанные.СсылкаНаОбъектСУЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЭлементРубрики(Команда=Неопределено)
	
	ТекущиеДанные = Элементы.ОбъектыРубрик.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ТекущиеДанные.СсылкаНаОбъектСУЗ) = Тип("СправочникСсылка.ВопросыСУЗ") Тогда
		
		ПараметрыФормы = Новый Структура("Ключ, ЭлементРубрикатора, ПоставщикРубрики", ТекущиеДанные.СсылкаНаОбъектСУЗ, ТекущиеДанные.ЭлементРубрикатора, ТекущиеДанные.Поставщик);
		ОткрытьФорму("Справочник.ВопросыСУЗ.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
		
	Иначе
		
		ПоказатьЗначение(,ТекущиеДанные.СсылкаНаОбъектСУЗ);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ОбработатьПодбор(СсылкаНаОбъектИлиМассив) Экспорт
	
	ТекущиеДанные = Элементы.ЭлементыРубрикатора.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьВБазуЭлементРубрики(ТекущиеДанные.Владелец, ТекущиеДанные.Ссылка, СсылкаНаОбъектИлиМассив);

КонецПроцедуры

// Установить доступность элементов формы
//
&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(ЭлементыРубрикатора, Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьИзБазыЭлементРубрики(Рубрикатор, ЭлементРубрикатора, Поставщик, СсылкаНаОбъектСУЗ)
	
	РегистрыСведений.РубрикиОбъектовСУЗ.УдалитьЭлемент(Рубрикатор, ЭлементРубрикатора, СсылкаНаОбъектСУЗ, Поставщик);	
	Элементы.ОбъектыРубрик.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВБазуЭлементРубрики(Рубрикатор, ЭлементРубрикатора, СсылкаНаОбъектИлиМассив)
	
	Поставщик = РазработкаСУЗ.ПолучитьПредпочитаемогоПоставщика();
	
	МассивВопросов = Новый Массив;
	Если ТипЗнч(СсылкаНаОбъектИлиМассив) = Тип("СправочникСсылка.ВопросыСУЗ") Тогда
		МассивВопросов.Добавить(СсылкаНаОбъектИлиМассив);
	КонецЕсли;
	Если ТипЗнч(СсылкаНаОбъектИлиМассив) = Тип("Массив") Тогда
		МассивВопросов = СсылкаНаОбъектИлиМассив;
	КонецЕсли;
		
	РегистрыСведений.РубрикиОбъектовСУЗ.ДобавитьЭлементы(Рубрикатор, ЭлементРубрикатора, МассивВопросов, Поставщик); 
	
	Элементы.ОбъектыРубрик.Обновить();
	Элементы.ЭлементыРубрикатора.Обновить();
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.ЭлементыРубрикатора);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.ЭлементыРубрикатора, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.ЭлементыРубрикатора);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


#КонецОбласти

