////////////////////////////////////////////////////////////////////////////////
// СИСТЕМА

Функция ИнформационнаяБазаФайловая() Экспорт
	
	Возврат ОбщегоНазначения.ИнформационнаяБазаФайловая();
	
КонецФункции

// Устанавливает параметр сеанса.
//
Процедура УстановитьПараметрыСеанса(СтруктураПараметров) Экспорт
	
	ОбщегоНазначенияСУ.УстановитьПараметрыСеанса(СтруктураПараметров);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СПРАВОЧНИКИ

// Возвращает ссылку на элемент справочника по его идентификатору.
//
Функция ПолучитьЭлементСправочникаПоИдентификатору(Знач ИмяСправочника, Знач УникальныйИдентификатор) Экспорт
	
	Возврат ОбщегоНазначенияСУ.ЭлементСправочникаПоИдентификатору(ИмяСправочника, УникальныйИдентификатор);
	
КонецФункции

// Помечает на удаление элемент справочника.
//
Процедура УдалитьЭлементСправочника(СсылкаНаЭлемент) Экспорт
	
	ОбщегоНазначенияСУ.УдалитьЭлементСправочника(СсылкаНаЭлемент);
	  	
КонецПроцедуры

Функция ИмяТаблицыПоСсылке(Знач Ссылка) Экспорт
	
	Возврат ОбщегоНазначения.ИмяТаблицыПоСсылке(Ссылка);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// КЭШ НА СЕРВЕРЕ

// Выгружает предопределенный элемент "Общий"
// справочника РесурсыСУЗ в локальный кэш.
Функция ВыгрузитьОбщийРесурсВКэшНаСервере() Экспорт
	
	ПутьКОбщемуКаталогу = ОбъектыСУЗПовтИсп.ПутьКаталогуОбъектов();
	
	Если ЗначениеЗаполнено(ПутьКОбщемуКаталогу) Тогда
		ОбщегоНазначенияСУКлиентСервер.ВыгрузитьОбщийРесурсВКэш(ПутьКОбщемуКаталогу);
		Возврат Истина;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОбщегоНазначенияСУПовтИсп.ТекстОНеобходимостиНастроитьОбщийКаталог());
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Функция возвращает массив файлов с двоичными данными
// для последующей выгрузки в кэш на клиенте или сервере.
//
Функция ПолучитьДанныеРесурсовДляВыгрузкиВКэш(МассивРесурсов, ЭлектронныйРесурс, ПредпочитаемыйПоставщик = Неопределено, ПараметрыЭкспорта = Неопределено, Знач КонтекстВыполнения = Неопределено) Экспорт
	
	// МассивРесурсов - массив содержащий структуры,
	// Свойства которых задаются в функции
	// ОбъектыСУЗ.ПолучитьСтруктуруРесурса().
	
	МассивФайлов = Новый Массив();
	
	// Примечание: потенциально узкое место - получение файлов в цикле.
	//
	
	Для каждого Ресурс Из МассивРесурсов Цикл
				
		Если ТипЗнч(Ресурс.Ссылка) = Тип("СправочникСсылка.РесурсыСУЗ") Тогда // Ресурс СУЗ
			
			ДеревоФайлов        = Справочники.РесурсыСУЗ.ДеревоФайлов(Ресурс.Ссылка,,ПараметрыЭкспорта);
			МассивФайловРесурса = Справочники.РесурсыСУЗ.СтруктураФайловРесурса(Ресурс.Ссылка, ДеревоФайлов.Строки, 1, ЭлектронныйРесурс, ПредпочитаемыйПоставщик, ПараметрыЭкспорта, КонтекстВыполнения);
			
		Иначе
			
			Если ТипЗнч(Ресурс.Ссылка) = Тип("СправочникСсылка.СтраницыСУЗ") Тогда // Страница как ресурс
			
				ФорматированныйДокумент = ОбъектыСУЗ.ПолучитьДанные(Ресурс.Ссылка, "ТекстСтраницы", Истина, "ФорматированныйДокумент", ПредпочитаемыйПоставщик);
				
			ИначеЕсли ТипЗнч(Ресурс.Ссылка) = Тип("СправочникСсылка.ВопросыСУЗ") Тогда
				
				ФорматированныйДокумент = ОбъектыСУЗ.ПолучитьДанные(Ресурс.Ссылка, Ресурс.КодДанных, Истина, "ФорматированныйДокумент", ПредпочитаемыйПоставщик);
				
			//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
				
			ИначеЕсли ТипЗнч(Ресурс.Ссылка) = Тип("ДокументСсылка.СообщениеСУО") Тогда
				
				Если ЗначениеЗаполнено(Ресурс.Ссылка.Шаблон) Тогда
					ФорматированныйДокумент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ресурс.Ссылка.Шаблон, "ФорматированныйДокумент");
				Иначе
					ФорматированныйДокумент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ресурс.Ссылка, "ФорматированныйДокумент");
				КонецЕсли;				
				
				ФорматированныйДокумент = ФорматированныйДокумент.Получить();
				
			//----------------------------------//
	
			
			Иначе // Форматированный документ
				
				Если ЗначениеЗаполнено(Ресурс.КодДанных) Тогда
					ФорматированныйДокумент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ресурс.Ссылка, Ресурс.КодДанных);
				Иначе
					ФорматированныйДокумент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ресурс.Ссылка, "ФорматированныйДокумент");
				КонецЕсли;
				
				ФорматированныйДокумент = ФорматированныйДокумент.Получить();
			
			КонецЕсли;
			
			ТекстHTML = Неопределено;
			Вложения  = Неопределено;
			
			ФорматированныйДокумент.ПолучитьHTML(ТекстHTML, Вложения);
			
			МассивФайловРесурса = Новый Массив;
			
			Для каждого Вложение Из Вложения Цикл
				
				// Находим имя файла. Имя файла - это ключ вложения,
				// Плюс расширение картинки если это картинка.
				
				Если ТипЗнч(Вложение.Значение) = Тип("Картинка") Тогда
					Расширение = ОбщегоНазначенияСУКлиентСервер.РасширениеКартинки(Вложение.Значение.Формат());
					ИмяФайлаВложения = Вложение.Ключ + Расширение;
				Иначе
					ИмяФайлаВложения = Вложение.Ключ;
				КонецЕсли;
				
				Файл = Новый Структура;
				
				Файл.Вставить("ИмяФайла", ИмяФайлаВложения);
				Файл.Вставить("ЭтоКаталог", Ложь);
				Файл.Вставить("ДвоичныеДанные", Вложение.Значение.ПолучитьДвоичныеДанные());
				Файл.Вставить("ТипФайла", Перечисления.ТипыФайловСУЗ.Image);
				Файл.Вставить("ПодчиненныеФайлы", Неопределено);
				
				МассивФайловРесурса.Добавить(Файл);
								
			КонецЦикла;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ресурс.Идентификатор) Тогда
			
			Каталог = Новый Структура;
			Каталог.Вставить("ИмяФайла", Ресурс.Идентификатор+Ресурс.ПостФикс);
			Каталог.Вставить("ЭтоКаталог", Истина);
			Каталог.Вставить("ДвоичныеДанные", Неопределено);
			Каталог.Вставить("ТипФайла", Неопределено);
			
			Каталог.Вставить("ПодчиненныеФайлы", МассивФайловРесурса); // Файлы ресурсы выгружается в кататалог ресурса
			
			МассивФайлов.Добавить(Каталог);
			
		Иначе
			
			Для каждого Элемент Из МассивФайловРесурса Цикл
				МассивФайлов.Добавить(Элемент); // Файлы ресурса выгружается в корень каталога ресурсов.
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивФайлов;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБЩЕЕ

Функция ЗначенияРеквизитовОбъекта(Ссылка, ИменаРеквизитов) Экспорт

	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, ИменаРеквизитов);
	
КонецФункции

Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
	
КонецФункции 

