////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

&НаКлиенте
Перем ТипОбъектаНаКлиенте; // Тип объекта метаданных в виде строки

&НаСервере
Перем ТипОбъектаНаСервере; // Тип объекта метаданных в виде строки

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Загружает данные текущей версии объекта для редактирования.
// Вызывается из общей формы "ВерсииОбъектаСУЗ" и после инициализации редактора.
//
&НаКлиенте
Процедура ЗагрузитьВерсию() Экспорт
	
	ЗагрузитьВерсиюНаСервере();
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	//////////////////////////////////////////////////////////////////
	
	// Устанавливаем доступность данных от поставщика
	
	ТаблицаДоступностиДанныхПоставщика = РазработкаСУЗ.ПолучитьТаблицуДоступностиДанныхПоставщика();

	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.ТекстовыйДокумент;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.ГруппаФорматированныйДокумент;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.Ссылки;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	РазработкаСУЗ.УстановитьДоступностьДанныхОтПоставщика(ЭтотОбъект, ТаблицаДоступностиДанныхПоставщика);
	
	//////////////////////////////////////////////////////////////////
	
	// Отборы
	
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Ссылки, Объект.Ссылка);
	
	РазработкаСУЗ.УстановитьДоступностьРедактора(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВерсиюНаСервере(ПерваяЗагрузка = Ложь)
	
	ИмяРедактируемыхДанных = "ТекстСтраницы";
	РазработкаСУЗ.УстановитьДанныеВерсииОбъекта(ЭтотОбъект, Объект, ТипОбъектаНаСервере, ПерваяЗагрузка);
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Подборка          = Параметры.Подборка;
	ЭлектронныйРесурс = Параметры.ЭлектронныйРесурс;
	ЭлементПодборки   = Параметры.ЭлементПодборки;
	ЭлементСодержания = Параметры.ЭлементСодержания;
	
	РазработкаСУЗ.УстановитьРодителяНовогоОбъекта(Объект, Параметры, "СправочникСсылка.СтраницыСУЗ");
	
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Объект);
	
	Если Объект.Ссылка.Пустая() Тогда
		// Если объект уже записан, то процедура
		// Будет вызвана при загрузки версии.
		ЗагрузитьВерсиюНаСервере(Истина);
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗагрузитьВерсиюНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РазработкаСУЗКлиент.УстановитьДоступностьЭлементовВерсииДанных(ЭтотОбъект);
	
	РазработкаСУЗКлиент.УстановитьКонтекстЭлектронногоРесурса(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	РазработкаСУЗКлиент.ИмяРедактируемыхДанныхПриЗаписи(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.ИспользуетсяФорматированныйДокумент Тогда
		
		Если ТипЗнч(ТекстСтраницы) <> Тип("ФорматированныйДокумент")  Тогда
			ТекстСтраницы = Новый ФорматированныйДокумент;
		КонецЕсли;
		
		Если ТипЗнч(Описание) <> Тип("ФорматированныйДокумент")  Тогда
			Описание = Новый ФорматированныйДокумент;
		КонецЕсли;
		
		РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ТекущийОбъект, ТекстСтраницы, "ТекстСтраницы", "ФорматированныйДокумент");
		РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ТекущийОбъект, Описание, "Описание", "ФорматированныйДокумент");
		
		Гиперссылки = ОбщегоНазначенияСУ.ГиперссылкиФорматированногоДокумента(ТекстСтраницы);
		
		РазработкаСУЗ.ОбновитьГиперссылкиОбъектаСУЗ(ТекущийОбъект.Ссылка, Гиперссылки, ТекущийОбъект.Поставщик);
		
	Иначе
		
		Если ТипЗнч(ТекстСтраницы) = Тип("ТекстовыйДокумент")  Тогда
			ТекстСтраницыДляСохранения = ТекстСтраницы.ПолучитьТекст();
		Иначе
			ТекстСтраницыДляСохранения = ТекстСтраницы;
		КонецЕсли;
		
		Если ТипЗнч(Описание) = Тип("ТекстовыйДокумент")  Тогда
			ОписаниеДляСохранения = Описание.ПолучитьТекст();
		Иначе
			ОписаниеДляСохранения = Описание;
		КонецЕсли;
		
		РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ТекущийОбъект, ТекстСтраницыДляСохранения, "ТекстСтраницы", "ТекстовыеДанные");
		РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ТекущийОбъект, ОписаниеДляСохранения, "Описание", "ТекстовыеДанные");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлементПодборки) Тогда
		Справочники.ЭлементыПодборкиСУЗ.Перезаписать(ЭлементПодборки);	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ЭлементСодержания) Тогда
		Справочники.СодержаниеСУЗ.Перезаписать(ЭлементСодержания);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РазработкаСУЗ.ПоказатьКоличествоВерсийОбъектаНаФорме(ЭтотОбъект, ТекущийОбъект);
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
		
	РазработкаСУЗКлиент.УстановитьДоступностьЭлементовВерсииДанных(ЭтотОбъект);
	
	Оповестить("ОбъектСУЗЗаписан", Объект.Ссылка, ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Подборка) Тогда
		Оповестить("ПодборкаОбновлена", Подборка, ЭтотОбъект);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		Оповестить("ЭлектронныйРесурсОбновлен", ЭлектронныйРесурс, ЭтотОбъект);
	КонецЕсли;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура АрхивВерсий(Команда)
	РазработкаСУЗКлиент.ОткрытьВерсииОбъекта(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВерсию(Команда)
	СтруктураНовойВерсии = РазработкаСУЗ.ПолучитьСтруктуруНовойВерсииОбъекта(Объект, ТипОбъектаНаКлиенте);
	РазработкаСУЗКлиент.СоздатьВерсиюОбъекта(ЭтотОбъект, СтруктураНовойВерсии);
КонецПроцедуры

&НаКлиенте
Процедура ИмяРедактируемыхДанныхПриИзменении(Элемент)
	РазработкаСУЗКлиент.ИмяРедактируемыхДанныхПриИзменении(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ВставитьСсылкуВФорматированныйДокумент(Команда)	
	РазработкаСУЗКлиент.ВставитьСсылкуВФорматированныйДокумент(ЭтотОбъект, Элементы.ФорматированныйДокумент, ФорматированныйДокумент);	
КонецПроцедуры

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ИспользуетсяФорматированныйДокументПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ Ссылки

&НаКлиенте
Процедура СсылкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

ТипОбъектаНаКлиенте = "СправочникОбъект.СтраницыСУЗ"; 
ТипОбъектаНаСервере = "СправочникОбъект.СтраницыСУЗ";