
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Если Объект.Ссылка = УзелЭтойБазы Тогда
		ЭтотОбъект.ТолькоПросмотр = Истина;
		Возврат;
	КонецЕсли;
	
	// Видимость закладок Экспорт, Импорт
	
	Элементы.СтраницаЭкспорт.Видимость  = Ложь;
	Элементы.СтраницаИмпорт.Видимость   = Ложь;
	
	Если Объект.ЭтоПакетДляЭкспорта Тогда
		Элементы.СтраницаЭкспорт.Видимость = Истина;
	КонецЕсли;
	
	Если Объект.ЭтоИмпортированныйПакет Тогда
		Элементы.СтраницаИмпорт.Видимость = Истина;
	КонецЕсли;
	
	// Видимость закладок импорта
	
	Если Объект.ТипПакетаДанных = ПредопределенноеЗначение("Перечисление.ТипыПакетовДанныхСУЗ.XML_V8") Тогда
		Элементы.SCORM.Видимость = Ложь;	
		Элементы.XML.Видимость   = Истина;
	ИначеЕсли Объект.ТипПакетаДанных = ПредопределенноеЗначение("Перечисление.ТипыПакетовДанныхСУЗ.SCORM_2004") Тогда
		Элементы.SCORM.Видимость = Истина;	
		Элементы.XML.Видимость   = Ложь;
	Иначе
		Элементы.SCORM.Видимость = Ложь;	
		Элементы.XML.Видимость   = Ложь;
	КонецЕсли;
	
	// Доступность формы
	
	Если Объект.ЭтоИмпортированныйПакет
		И НЕ Объект.ЭтоПакетДляЭкспорта Тогда
		
		ТолькоПросмотр = Истина;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормыНаКлиенте()
	
	// Доступность настроек поставщика
	
	Если Объект.ЭкспортироватьПоследнююВерсию Тогда
		Элементы.ПредпочитатьПоставщика.Доступность   = Истина;
		Элементы.СохранитьПоследнююВерсию.Доступность = Истина;
	Иначе
		Элементы.ПредпочитатьПоставщика.Доступность   = Ложь;
		Элементы.СохранитьПоследнююВерсию.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТипыЭлементовДляЭкспорта()
	
	Для каждого Элемент Из Объект.ЭлементыДляЭкспорта Цикл
		Если ЗначениеЗаполнено(Элемент.СсылкаНаЭлемент) Тогда
			Элемент.Тип = Строка(ТипЗнч(Элемент.СсылкаНаЭлемент));
		Иначе
			Элемент.Тип = "";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УзелЭтойБазы = ПланыОбмена.ОбменМатериаламиСУЗ.ЭтотУзел();
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Код = Новый УникальныйИдентификатор();
	КонецЕсли;
	
	// Получаем ИдентификаторИмпортированногоПакетаSCORM
	
	Если Объект.ЭтоИмпортированныйПакет И Объект.ТипПакетаДанных = Перечисления.ТипыПакетовДанныхСУЗ.SCORM_2004 Тогда
		
		НаборЗаписей = РегистрыСведений.ИмпортированныеЭлементыПакетаSCORM.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СсылкаНаЭлемент.Установить(Объект.Ссылка);

		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0 Тогда
			ИдентификаторИмпортированногоПакетаSCORM = НаборЗаписей[0].ИдентификаторПакета;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьЭлементовФормыНаКлиенте();
	УстановитьТипыЭлементовДляЭкспорта();
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортироватьПоследнююВерсиюПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормыНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЭлементовДляЭкспортаПриИзменении(Элемент)
	УстановитьТипыЭлементовДляЭкспорта();
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ЭлементыДляЭкспортаСсылкаНаЭлементОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбъектыСУЗКлиент.РедактироватьЭлектронныйРесурс(Элементы.ТаблицаЭлементовДляЭкспорта.ТекущиеДанные.СсылкаНаЭлемент);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ <Наименование>
