#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ВсеДанныеИзучения(ИдентификаторАктивности, ЭлектронныйКурс) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеИзучения.Данные КАК Данные,
		|	ДанныеИзучения.ИмяДанных КАК ИмяДанных
		|ИЗ
		|	РегистрСведений.ДанныеИзученияЭлектронныхКурсовВебКабинетаСУО КАК ДанныеИзучения
		|ГДЕ
		|	ДанныеИзучения.ИдентификаторАктивности = &ИдентификаторАктивности
		|	И ДанныеИзучения.ЭлектронныйКурс = &ЭлектронныйКурс";
	
	Запрос.УстановитьПараметр("ИдентификаторАктивности", ИдентификаторАктивности);
	Запрос.УстановитьПараметр("ЭлектронныйКурс", ЭлектронныйКурс);
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ДанныеИзученияСтруктура = Новый Структура;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДанныеИзученияСтруктура.Вставить(ВыборкаДетальныеЗаписи.ИмяДанных, ВыборкаДетальныеЗаписи.Данные.Получить());
	КонецЦикла;
	
	Возврат ДанныеИзученияСтруктура;
	
КонецФункции

Процедура ЗаписатьДанныеИзучения(ИдентификаторАктивности, ЭлектронныйКурс, ИмяДанных, ДанныеДляЗаписи, Пользователь) Экспорт
	
	НаборЗаписей = РегистрыСведений.ДанныеИзученияЭлектронныхКурсовВебКабинетаСУО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторАктивности.Установить(ИдентификаторАктивности);
	НаборЗаписей.Отбор.ЭлектронныйКурс.Установить(ЭлектронныйКурс);
	НаборЗаписей.Отбор.ИмяДанных.Установить(ИмяДанных);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.ИдентификаторАктивности = НаборЗаписей.Отбор.ИдентификаторАктивности.Значение; 
	НоваяЗапись.ЭлектронныйКурс = НаборЗаписей.Отбор.ЭлектронныйКурс.Значение;
	НоваяЗапись.ИмяДанных = НаборЗаписей.Отбор.ИмяДанных.Значение;
	
	НоваяЗапись.Данные = Новый ХранилищеЗначения(ДанныеДляЗаписи);
	НоваяЗапись.Пользователь = Пользователь;

	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли


