
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Устанавливаем реквизиты
	//
	
	ЭтоПолныйИнтерфейс = ПолучитьФункциональнуюОпцию("ПолныйИнтерфейсСУО");
	ЭтоОбразовательнаяОрганизация = ПолучитьФункциональнуюОпцию("ОбразовательнаяОрганизацияОО");
	ИспользуютсяСлушатели = ПолучитьФункциональнуюОпцию("ИспользоватьСлушателейСУО");
	
	// Список группировок
	//
	
	Элементы.ГруппировкаСписка.СписокВыбора.Добавить("", НСтр("ru = 'Без группировки'"));
	
	Если ЭтоПолныйИнтерфейс Тогда
		
		Элементы.ГруппировкаСписка.СписокВыбора.Добавить("ГодПроведения", НСтр("ru = 'Год'"));
		ЭлементГруппировки = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ЭлементГруппировки.Использование = Ложь;
		ЭлементГруппировки.Поле = Новый ПолеКомпоновкиДанных("ГодПроведения");
		
		Элементы.ГруппировкаСписка.СписокВыбора.Добавить("МесяцПроведения", НСтр("ru = 'Месяц'"));
		ЭлементГруппировки = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ЭлементГруппировки.Использование = Ложь;
		ЭлементГруппировки.Поле = Новый ПолеКомпоновкиДанных("МесяцПроведения");
		
		Элементы.ГруппировкаСписка.СписокВыбора.Добавить("Вид", НСтр("ru = 'Вид'"));
		ЭлементГруппировки = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ЭлементГруппировки.Использование = Ложь;
		ЭлементГруппировки.Поле = Новый ПолеКомпоновкиДанных("Вид");
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьКаталогОбученийСУО") Тогда
		
			Элементы.ГруппировкаСписка.СписокВыбора.Добавить("Сценарий", НСтр("ru = 'Обучение'"));
			ЭлементГруппировки = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			ЭлементГруппировки.Использование = Ложь;
			ЭлементГруппировки.Поле = Новый ПолеКомпоновкиДанных("Сценарий");		
			
		КонецЕсли;
			
		Если НЕ ИспользуютсяСлушатели Тогда
		
			Элементы.ГруппировкаСписка.СписокВыбора.Добавить("ПроведениеПрограммыОбучения", НСтр("ru = 'Программа'"));
			ЭлементГруппировки = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			ЭлементГруппировки.Использование = Ложь;
			ЭлементГруппировки.Поле = Новый ПолеКомпоновкиДанных("ПроведениеПрограммыОбучения");			
			
		КонецЕсли;
		
		Если ИспользуютсяСлушатели Тогда
		
			Элементы.ГруппировкаСписка.СписокВыбора.Добавить("ПрограммаОбучения", НСтр("ru = 'Программа обучения УУЦ'"));
			ЭлементГруппировки = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			ЭлементГруппировки.Использование = Ложь;
			ЭлементГруппировки.Поле = Новый ПолеКомпоновкиДанных("ПрограммаОбучения");			
			
		КонецЕсли;
		
	Иначе		
		
		Элементы.ГруппировкаСписка.СписокВыбора.Добавить("Сценарий", НСтр("ru = 'Обучение'")); // Группировка по сценарию, но с другим названием.
		ЭлементГруппировки = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ЭлементГруппировки.Использование = Ложь;
		ЭлементГруппировки.Поле = Новый ПолеКомпоновкиДанных("Сценарий");		
		
	КонецЕсли;
	
	// Восстанавливаем настройки
	//
	
	ДанныеНастроек = ХранилищеСистемныхНастроек.Загрузить(ИмяФормы+"/ТекущиеДанные");
	
	Если ДанныеНастроек <> Неопределено Тогда
		
		ГруппировкаСписка = ДанныеНастроек.Получить("ГруппировкаСписка");
		
		УстановитьГруппировкуСписка();
		
		ОтборВид = ДанныеНастроек.Получить("ОтборВид");
		
		УстановитьБыстрыйОтборСписка("Вид", ОтборВид);
		
		ОтборПериод = ДанныеНастроек.Получить("ОтборПериод");
		
		УстановитьБыстрыйОтборСписка("Период", ОтборПериод);
		
		ОтборСтатус = ДанныеНастроек.Получить("ОтборСтатус");
		
		УстановитьБыстрыйОтборСписка("Статус", ОтборСтатус);
		
	КонецЕсли;
	
	// Начальные параметры списка
	
	Список.Параметры.УстановитьЗначениеПараметра("ГруппаПроведенийОбучения", Неопределено);
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьВсеПроведения", Истина);
	Список.Параметры.УстановитьЗначениеПараметра("ЭтотДень", ТекущаяДатаСеанса());
	
	УстановитьПараметрыГрупп();
	
	// Изменяем наименования элементов согласно функциональному профилю
	//
	
	Если ЭтоПолныйИнтерфейс Тогда
		
		Элементы.Дисциплина.Видимость = Ложь;
		Элементы.Вид.Видимость = Истина;
		
		Элементы.ГруппаСлушателей.Видимость = ИспользуютсяСлушатели;
		Элементы.ПрограммаОбучения.Видимость = ИспользуютсяСлушатели;
		
		Если ИспользуютсяСлушатели Тогда
			Элементы.ГруппаСлушателей.Заголовок = НСтр("ru = 'Группа слушателей УУЦ'");
			Элементы.ПрограммаОбучения.Заголовок = НСтр("ru = 'Программа обучения УУЦ'");
		КонецЕсли;
		
	Иначе
		
		Элементы.Дисциплина.Видимость = ЭтоОбразовательнаяОрганизация;				
		Элементы.ГруппаСлушателей.Видимость = Ложь;
		Элементы.ПрограммаОбучения.Видимость = Ложь;
		Элементы.Вид.Видимость = Ложь;
		Элементы.ГодПроведения.Видимость = Ложь;
		Элементы.МесяцПроведения.Видимость = Ложь;
		Элементы.ДоступноВнешнимПользователям.Видимость = Ложь;
		Элементы.Открытое.Видимость = Ложь;
        Элементы.Автозачисление.Видимость = Ложь;
		Элементы.ТребуетсяЗаявка.Видимость = Ложь;
		Элементы.ДатаОткрытияЗаписи.Видимость = Ложь;
		Элементы.ДатаЗакрытияЗаписи.Видимость = Ложь;
		Элементы.ПроведениеПрограммыОбучения.Видимость = Ложь;
		Элементы.Сценарий.Видимость = Ложь;
		Элементы.ОткрытоДляВсех.Видимость = Ложь;
		Элементы.СхемаПроведения.Видимость = Ложь;
		Элементы.НаОсновеМероприятия.Видимость = Ложь;
		Элементы.НаОсновеЭлектронногоРесурса.Видимость = Ложь;		
		Элементы.МаксимальноеКоличествоУчастников.Видимость = Ложь;		
		
		
	КонецЕсли;
			
	// Формируем команды
	
	СформироватьКомандыСозданияПроведенийПоВиду();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПараметрыСписка();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписокМероприятий" Тогда
		ОбновитьСписокИГруппыНаКлиенте();
	КонецЕсли;
	
	Если ИмяСобытия = "ОбновленыВидыОбучения"
		ИЛИ ИмяСобытия = "ЗаписьМероприятия" Тогда
		
		СформироватьКомандыСозданияПроведенийПоВиду();
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОтборСтатусПриИзменении(Элемент)
	УстановитьБыстрыйОтборСписка("Статус", ОтборСтатус);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодПриИзменении(Элемент)
	УстановитьБыстрыйОтборСписка("Период", ОтборПериод);
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидМероприятияПриИзменении(Элемент)
	УстановитьБыстрыйОтборСписка("Вид", ОтборВид);
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаСпискаПриИзменении(Элемент)
	УстановитьГруппировкуСписка();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Статус мероприятия

&НаКлиенте
Процедура УстановитьСтатусАктивно(Команда)
	УстановитьСтатус("Активно");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусЗавершено(Команда)
	УстановитьСтатус("Завершено");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусЗапланировано(Команда)
	УстановитьСтатус("Запланировано");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусОтменено(Команда)
	УстановитьСтатус("Отменено");
КонецПроцедуры

// Создание нового обучения

&НаКлиенте
Процедура Подключаемый_СоздатьОбучениеПоВиду(Команда)
	
	Если Команда = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	ВыполнитьПроверкуПередСозданиемНовогоОбучения(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваВидаОбучения = ВидыОбучения.Получить(Число(СтрЗаменить(Команда.Имя, "ВидОбучения_", "")));
	ВидОбучения = СвойстваВидаОбучения.Ссылка;	
	
	УправлениеОбучениемСУОКлиент.СоздатьОбучениеПоВиду(ВидОбучения, СвойстваВидаОбучения.ЕстьМероприятие, НЕ СвойстваВидаОбучения.НельзяСоздатьБезМероприятия, СвойстваВидаОбучения.ЕдинственноеМероприятие,,Элементы.Список);
		
КонецПроцедуры

// Группы

&НаКлиенте
Процедура ПоместитьВГруппу(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоместитьВГруппуПродолжение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ГруппыПроведенийОбученияСУО.ФормаВыбора",,Элементы.Список,,,,ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьВГруппуПродолжение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(РезультатЗакрытия) = Тип("СправочникСсылка.ГруппыПроведенийОбученияСУО")
		И ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		УстановитьИлиУдалитьГруппу(Элементы.Список.ВыделенныеСтроки, РезультатЗакрытия);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИзГруппы(Команда)
	УстановитьИлиУдалитьГруппу(Элементы.Список.ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьГруппу(Команда)
	СкопироватьГруппуНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРассылкуГруппы(Команда)
	
	Если Элементы.Группы.ТекущиеДанные = Неопределено
		ИЛИ НЕ ЗначениеЗаполнено(Элементы.Группы.ТекущиеДанные.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения, Идентификатор, ГруппаПроведенийОбучения",
		Новый Структура("БезШаблона", Истина), Новый УникальныйИдентификатор(), Элементы.Группы.ТекущиеДанные.Ссылка);
	
	ОткрытьФорму("Документ.РассылкаСообщенийСУО.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
		
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыГруппы

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Группы

&НаКлиенте
Процедура ГруппыПриАктивизацииСтроки(Элемент)
	УстановитьПараметрыСписка();
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив")
		И ПараметрыПеретаскивания.Значение.Количество() > 0
		И ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		
		СтандартнаяОбработка = Ложь;
		УстановитьИлиУдалитьГруппу(ПараметрыПеретаскивания.Значение, Строка);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Список

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ВыполнитьПроверкуПередСозданиемНовогоОбучения(Отказ);
		
	Если НЕ Отказ 
		И ЭтоПолныйИнтерфейс 
		И ВидыОбучения.Количество() = 1 Тогда
		
		Отказ = Истина;		
		Подключаемый_СоздатьОбучениеПоВиду(Команды.Найти("ВидОбучения_0"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкуПередСозданиемНовогоОбучения(Отказ)
	
	Если Элементы.Группы.ТекущиеДанные <> Неопределено
		И Элементы.Группы.ТекущиеДанные.Предопределенный Тогда
		
		Отказ = Истина;
		ПоказатьПредупреждение(,НСтр("ru = 'Для создания нового обучения выберите не предопределенную папку'"));
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если Элементы.Группы.ТекущиеДанные = Неопределено Тогда
		ВыделеннаяГруппа = Неопределено;
	Иначе
		ВыделеннаяГруппа = Элементы.Группы.ТекущиеДанные.Ссылка;
	КонецЕсли;	
	
	Если ТипЗнч(НовыйОбъект) = Тип("ДокументСсылка.ПроведениеОбученияСУО")
		И ЗначениеЗаполнено(НовыйОбъект)
		И ЗначениеЗаполнено(ВыделеннаяГруппа) Тогда
		
		СтандартнаяОбработка = Ложь;
		МассивПроведенийОбучения = Новый Массив;
		МассивПроведенийОбучения.Добавить(НовыйОбъект);
		
		УстановитьИлиУдалитьГруппу(МассивПроведенийОбучения, ВыделеннаяГруппа);
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ОбновитьСписокИГруппыНаКлиенте()
	УстановитьПараметрыГрупп();
	Элементы.Группы.Обновить();
	Элементы.Список.Обновить();	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокИГруппыНаСервере()	
	Элементы.Список.Обновить();	
	УстановитьПараметрыГрупп();
	Элементы.Группы.Обновить();
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыГрупп()
	
	Группы.Параметры.УстановитьЗначениеПараметра("ЕстьЭлементыПораСделатьАктивным", Документы.ПроведениеОбученияСУО.ЕстьЭлементыВГруппеПораСделатьАктивным());
	Группы.Параметры.УстановитьЗначениеПараметра("ЕстьЭлементыПораЗавершить", Документы.ПроведениеОбученияСУО.ЕстьЭлементыВГруппеПораЗавершить());
	Группы.Параметры.УстановитьЗначениеПараметра("ПредопределенныеПостфикс", НСтр("ru = ' (есть элементы)'"));
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьГруппуНаКлиенте()
	
	Если Элементы.Группы.ТекущиеДанные = Неопределено
		ИЛИ НЕ ЗначениеЗаполнено(Элементы.Группы.ТекущиеДанные.Ссылка) Тогда
		Возврат;
	КонецЕсли;
		
	ДополнительныеПараметры = Новый Структура("КопируемаяГруппа", Элементы.Группы.ТекущиеДанные.Ссылка);
	ПараметрыФормы = Новый Структура("ГруппаПроведенийОбучения", Элементы.Группы.ТекущиеДанные.Ссылка);
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("СкопироватьГруппуНаКлиентеПродолжение", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("Документ.ПроведениеОбученияСУО.Форма.ФормаВыбораНастроекКопирования", ПараметрыФормы, ЭтотОбъект,,,,ОписаниеОповещенияОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьГруппуНаКлиентеПродолжение(НастройкиКопирования, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(НастройкиКопирования) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	НоваяГруппаСсылка = СкопироватьГруппуНаСервере(ДополнительныеПараметры.КопируемаяГруппа, НастройкиКопирования);
	ОбновитьСписокИГруппыНаКлиенте();
	Элементы.Группы.ТекущаяСтрока = НоваяГруппаСсылка;
		
КонецПроцедуры

&НаСервере
Функция СкопироватьГруппуНаСервере(КопируемаяГруппа, НастройкиКопирования)
	
	НачатьТранзакцию();
	
	Попытка
		
		// Копируем группу
		
		НоваяГруппаОбъект = КопируемаяГруппа.Скопировать();
		НоваяГруппаОбъект.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1 (копия)'"), НоваяГруппаОбъект.Наименование);
		НоваяГруппаОбъект.Записать();
		
		// Копируем проведения обучения
		
		ПроведенияОбученияГруппы = РегистрыСведений.СоставыГруппПроведенийОбученияСУО.ПроведенияОбученияГруппы(КопируемаяГруппа);
		
		Для каждого ДокументКопирования Из ПроведенияОбученияГруппы Цикл
			
			// Копируем проведение обучения
			
			НовоеПроведениеОбучения = Документы.ПроведениеОбученияСУО.СкопироватьПроведениеОбучения(ДокументКопирования, НастройкиКопирования);
			
			// Помещаем в группу новое проведение обучения
			
			Если ЗначениеЗаполнено(НовоеПроведениеОбучения) Тогда			
				РегистрыСведений.СоставыГруппПроведенийОбученияСУО.ПоместитьВГруппу(НовоеПроведениеОбучения, НоваяГруппаОбъект.Ссылка);
			КонецЕсли;
			
		КонецЦикла;		
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;	 
	
	Возврат НоваяГруппаОбъект.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура УстановитьИлиУдалитьГруппу(МассивПроведенийОбучения, ГруппаКудаПомещаем = Неопределено)
	Если Элементы.Группы.ТекущиеДанные = Неопределено Тогда
		ВыделеннаяГруппа = Неопределено;
	Иначе
		ВыделеннаяГруппа = Элементы.Группы.ТекущиеДанные.Ссылка;
	КонецЕсли;		
	УстановитьИлиУдалитьГруппуСервер(МассивПроведенийОбучения, ГруппаКудаПомещаем, ВыделеннаяГруппа);
КонецПроцедуры

&НаСервере
Процедура УстановитьИлиУдалитьГруппуСервер(Знач МассивПроведенийОбучения, Знач ГруппаКудаПомещаем, Знач ВыделеннаяГруппа)
		
	НачатьТранзакцию();

	Попытка

		Для каждого ТекущееПроведениеОбучения Из МассивПроведенийОбучения Цикл
			Если ЗначениеЗаполнено(ГруппаКудаПомещаем) Тогда
				РегистрыСведений.СоставыГруппПроведенийОбученияСУО.ПоместитьВГруппу(ТекущееПроведениеОбучения, ГруппаКудаПомещаем);
			Иначе
				РегистрыСведений.СоставыГруппПроведенийОбученияСУО.УдалитьИзГруппы(ТекущееПроведениеОбучения, ВыделеннаяГруппа);
			КонецЕсли;
		КонецЦикла;		
		
		ЗафиксироватьТранзакцию();

	Исключение

	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;	
	
	ОбновитьСписокИГруппыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыСписка()
	
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьТребуетсяСменитьСтатусЗапланировано", Ложь);
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьТребуетсяСменитьСтатусАктивно", Ложь);
	Список.Параметры.УстановитьЗначениеПараметра("ГруппаПроведенийОбучения", Неопределено);
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьВсеПроведения", Истина);
	Элементы.СписокКонтекстноеМенюУдалитьИзГруппы.Доступность = Ложь;		
		
	Если Элементы.Группы.ТекущиеДанные <> Неопределено
		И ЗначениеЗаполнено(Элементы.Группы.ТекущиеДанные.Ссылка) Тогда		
		
		Список.Параметры.УстановитьЗначениеПараметра("ПоказатьВсеПроведения", Ложь);
		
		Если Элементы.Группы.ТекущиеДанные.Предопределенный Тогда
			Если Элементы.Группы.ТекущиеДанные.Ссылка = ПредопределенноеЗначение("Справочник.ГруппыПроведенийОбученияСУО.ПораСделатьАктивным") Тогда
				Список.Параметры.УстановитьЗначениеПараметра("ПоказатьТребуетсяСменитьСтатусЗапланировано", Истина);
			КонецЕсли;
			Если Элементы.Группы.ТекущиеДанные.Ссылка = ПредопределенноеЗначение("Справочник.ГруппыПроведенийОбученияСУО.ПораЗавершить") Тогда
				Список.Параметры.УстановитьЗначениеПараметра("ПоказатьТребуетсяСменитьСтатусАктивно", Истина);
			КонецЕсли;						
		Иначе
			Список.Параметры.УстановитьЗначениеПараметра("ГруппаПроведенийОбучения", Элементы.Группы.ТекущиеДанные.Ссылка);	
			Элементы.СписокКонтекстноеМенюУдалитьИзГруппы.Доступность = Истина;			
		КонецЕсли;
		
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Процедура УстановитьБыстрыйОтборСписка(ИмяОтбора, Значение)
	
	Если ИмяОтбора = "Период" Тогда
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, "ДатаПроведения");
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Список.Отбор, "ДатаПроведения", ВидСравненияКомпоновкиДанных.БольшеИлиРавно, Значение.ДатаНачала, "ДатаНачала", ЗначениеЗаполнено(Значение.ДатаНачала));	
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Список.Отбор, "ДатаПроведения", ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, Значение.ДатаОкончания, "ДатаОкончания", ЗначениеЗаполнено(Значение.ДатаОкончания));
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, ИмяОтбора, Значение,,, ЗначениеЗаполнено(Значение));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьГруппировкуСписка()
	
	ОбщегоНазначенияСУКлиентСервер.ИзменитьИспользованиеГруппировкиДинамическогоСписка(Список, "", Ложь); // Очищаем все группировки
		
	Если ГруппировкаСписка = "МесяцПроведения" Тогда
		ОбщегоНазначенияСУКлиентСервер.ИзменитьИспользованиеГруппировкиДинамическогоСписка(Список, "ГодПроведения", Истина);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГруппировкаСписка) Тогда
		ОбщегоНазначенияСУКлиентСервер.ИзменитьИспользованиеГруппировкиДинамическогоСписка(Список, ГруппировкаСписка, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатус(ИмяСтатуса)
	
	Если ТипЗнч(Элементы.Список.ВыделенныеСтроки) = Тип("Массив")
		И Элементы.Список.ВыделенныеСтроки.Количество() = 1
		И Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		
		ТекстВопроса = "";
		Отказ = Ложь;
		
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		НовыйСтатус = ПредопределенноеЗначение("Перечисление.СтатусыПроведенияОбъектовСУО."+ИмяСтатуса);
		
		УправлениеОбучениемСУОКлиент.ВыполнитьПроверкуКорректностиДатПроведенияОбучения(
		ТекстВопроса, Отказ, НовыйСтатус, ТекущиеДанные.ДатаОкончанияПроведения, ТекущиеДанные.ДатаКонтроля, ТекущиеДанные.ДатаНачалаДоступа, ТекущиеДанные.ДатаНачалаПроведения);
		
		Если Отказ Тогда			
			ПараметрыВопросаПродолжение = Новый Структура;
			ПараметрыВопросаПродолжение.Вставить("ИмяСтатуса", ИмяСтатуса);
			Оповещение = Новый ОписаниеОповещения("УстановитьСтатусПродолжение", ЭтотОбъект, ПараметрыВопросаПродолжение);
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьСтатусНаСервере(ИмяСтатуса);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусПродолжение(Результат, ПараметрыВопросаПродолжение) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		УстановитьСтатусНаСервере(ПараметрыВопросаПродолжение.ИмяСтатуса);
    КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусНаСервере(ИмяСтатуса)
	
	Если ТипЗнч(Элементы.Список.ВыделенныеСтроки) = Тип("Массив")
		И Элементы.Список.ВыделенныеСтроки.Количество() > 0 Тогда
		
		НовыйСтатус = Перечисления.СтатусыПроведенияОбъектовСУО[ИмяСтатуса];
		
		НачатьТранзакцию();
		
		Для каждого Строка Из Элементы.Список.ВыделенныеСтроки Цикл
			
			Если ТипЗнч(Строка) <> Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
				Продолжить;
			КонецЕсли;
			
			ПроведениеОбученияОбъект = Строка.ПолучитьОбъект();
			ПроведениеОбученияОбъект.Статус = НовыйСтатус;
			
			Если ПроведениеОбученияОбъект.Проведен Тогда
				РежимЗаписи = РежимЗаписиДокумента.Проведение;
			Иначе
				РежимЗаписи = РежимЗаписиДокумента.Запись;
			КонецЕсли;
			
			Попытка 
				ПроведениеОбученияОбъект.Заблокировать();
			Исключение
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСТР("ru = 'Не удалось заблокировать объект %1'"),
					Строка(ПроведениеОбученияОбъект));
			КонецПопытки;
				
			ПроведениеОбученияОбъект.Записать(РежимЗаписи);
			ПроведениеОбученияОбъект.Разблокировать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	КонецЕсли;
	
	ОбновитьСписокИГруппыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьКомандыСозданияПроведенийПоВиду()	
	
	// Удаляем старые команды
	
	Для каждого Строка Из ВидыОбучения Цикл
		
		ИмяЭлемента = "ВидОбучения_" + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(ВидыОбучения.Индекс(Строка));
		
		Команда = Команды.Найти(ИмяЭлемента);
		
		Если Команда <> Неопределено Тогда
			Команды.Удалить(Команда);
		КонецЕсли;
		
		ЭлементКоманды = Элементы.Найти(ИмяЭлемента);
		
		Если ЭлементКоманды <> Неопределено Тогда
			Элементы.Удалить(ЭлементКоманды);
		КонецЕсли;
		
	КонецЦикла;
	
	ВидыОбучения.Очистить();
	
	Если ИспользуютсяСлушатели Тогда
		Возврат;
	КонецЕсли;
	
	// Формируем команды создания
	
	ТаблицаВидовОбучения = Справочники.ВидыМероприятийСУО.ВидыОбученияДляСозданияПроведенияОбучения();
	
	ЗначениеВРеквизитФормы(ТаблицаВидовОбучения, "ВидыОбучения");		
	
	Для каждого Строка Из ВидыОбучения Цикл
	
		ИмяЭлемента = "ВидОбучения_" + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(ВидыОбучения.Индекс(Строка));
		
		Команда = Команды.Добавить(ИмяЭлемента);
		Команда.Действие  = "Подключаемый_СоздатьОбучениеПоВиду";
		Команда.Заголовок = Строка.Наименование;

		ЭлементФормы = Элементы.Добавить(ИмяЭлемента, Тип("КнопкаФормы"), Элементы.ФормаПодменюСоздатьПоВиду); 	
		ЭлементФормы.ИмяКоманды = ИмяЭлемента;			
	
	КонецЦикла;
	
	Если ВидыОбучения.Количество() = 1 Тогда
		
		Элементы.ФормаПодменюСоздатьПоВиду.Вид = ВидГруппыФормы.ГруппаКнопок;
		
		ЕдинственнаяКоманда = Команды.ВидОбучения_0;
		
		НаименованиеВида = ЕдинственнаяКоманда.Заголовок;			
		
		ЕдинственнаяКоманда.Заголовок = НСтр("ru = 'Создать'");
		ЕдинственнаяКоманда.Картинка = БиблиотекаКартинок.СоздатьЭлементСписка;
		ЕдинственнаяКоманда.Отображение = ОтображениеКнопки.КартинкаИТекст;
		ЕдинственнаяКоманда.Подсказка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Создать новое проведение обучения вида ""%1""'"), НаименованиеВида);
		
		Элементы.ВидОбучения_0.КнопкаПоУмолчанию = Истина;
		
	Иначе
		
		Элементы.ФормаПодменюСоздатьПоВиду.Вид = ВидГруппыФормы.Подменю;
		Элементы.ФормаПодменюСоздатьПоВиду.Картинка = БиблиотекаКартинок.СоздатьЭлементСписка;		
		
	КонецЕсли;
	
	
КонецПроцедуры


#КонецОбласти
