&НаКлиенте
Перем ОбновитьИнтерфейс;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоПолныйИнтерфейс = ПолучитьФункциональнуюОпцию("ПолныйИнтерфейсСУО");
	ЭтоЭкзаменатор = ПолучитьФункциональнуюОпцию("ЭкзаменаторЭР");
			
	Элементы.ГруппаУУЦ.Видимость = ЭтоПолныйИнтерфейс;
	Элементы.ГруппаПредприятие.Видимость = ЭтоПолныйИнтерфейс ИЛИ ЭтоЭкзаменатор;
	Элементы.ГруппаОбразовательнаяОрганизация.Видимость = ЭтоПолныйИнтерфейс ИЛИ ЭтоЭкзаменатор;
	Элементы.ДекорацияПричиныВозвратаЗаданий.Видимость = ЭтоПолныйИнтерфейс;
	Элементы.КакПрименитьНастройки.Видимость = Ложь;
	Элементы.ГруппаОграничениеВремени.Видимость = ЭтоПолныйИнтерфейс;
	
	// Обновление состояния элементов.
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	#Если Не ВебКлиент Тогда
	ОбновитьИнтерфейсПрограммы();
	#КонецЕсли
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьСтудентовСУОПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСотрудниковСУОПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЛичныйКабинетСУОПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ШкалаОценокПоУмолчаниюСУОПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьВебКабинетСУПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент);
	
	Если НаборКонстант.ИспользоватьВебКабинетСУ Тогда
		НаборКонстант.ИспользоватьЛичныйКабинетСУО = Ложь;
	Иначе
		НаборКонстант.ИспользоватьЛичныйКабинетСУО = Истина;
	КонецЕсли;
	Подключаемый_ПриИзмененииРеквизита(Элементы.ИспользоватьЛичныйКабинетСУО);
	
	Если НаборКонстант.ИспользоватьВебКабинетСУ
		И НЕ ЗначениеЗаполнено(НаборКонстант.РедакцияВебКабинетаСУ) Тогда
		НаборКонстант.РедакцияВебКабинетаСУ = ПредопределенноеЗначение("Перечисление.РедакцииВебКабинетаСУ.Редакция30");
		Подключаемый_ПриИзмененииРеквизита(Элементы.РедакцияВебКабинетаСУ);
	КонецЕсли;	
	
	Оповестить("НастройкиЭлектронныхРесурсовИзменены",,ЭтотОбъект);	
	
КонецПроцедуры

&НаКлиенте
Процедура РедакцияВебКабинетаСУПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСлушателейСУОПриИзменении(Элемент)
	Если НаборКонстант.ИспользоватьСлушателейСУО Тогда
		НаборКонстант.ИспользоватьСотрудниковСУО = Ложь;
		Подключаемый_ПриИзмененииРеквизита(Элементы.ИспользоватьСотрудниковСУО, Ложь);
		НаборКонстант.ИспользоватьСтудентовСУО = Ложь;
		Подключаемый_ПриИзмененииРеквизита(Элементы.ИспользоватьСтудентовСУО, Ложь);
		НаборКонстант.ШкалаОценокПоУмолчаниюСУО = ПредопределенноеЗначение("Справочник.ШкалыОценокСУО.Двухбалльная");
		Подключаемый_ПриИзмененииРеквизита(Элементы.ШкалаОценокПоУмолчаниюСУО, Ложь);
	КонецЕсли;
	Подключаемый_ПриИзмененииРеквизита(Элемент, Истина);
	Если НаборКонстант.ИспользоватьСлушателейСУО
		И ПредложитьЗаполнитьОбязательныеСвойстваСлушателяУЦ() Тогда		
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("УстановитьОбязательныеРеквизитыСлушателей", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Рекомендуется для пользователей добавить обязательные реквизиты СНИЛС, Дата рождения, Пол.
                  |Добавить их сейчас автоматически?'");
		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбязательныеРеквизитыСлушателей(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	УстановитьОбязательныеРеквизитыСлушателейНаСервере();
	
	ПоказатьПредупреждение(,НСтр("ru = 'Дополнительные реквизиты установлены'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЛичныеСообщенияПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьФорумыПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура АвторАвтоматическихРассылокПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
	Оповестить("ПриИзмененииНастроекРассылок");
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОграниченияВремениДоступаКПрограммеСУОПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ГруппаДоступаДляНовыхПользователейСУОПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ШкалыОценок(Команда)
	ОткрытьФорму("Справочник.ШкалыОценокСУО.ФормаСписка",,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиВебСервера(Команда)
	ОткрытьФорму("ОбщаяФорма.НастройкиВебСервераСУ");
КонецПроцедуры

&НаКлиенте
Процедура ПричиныВозвратаЗаданияНаДоработку(Команда)
	ОткрытьФорму("Справочник.ПричиныВозвратаЗаданияНаДоработкуСУО.ФормаСписка",,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Клиент

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизита(Элемент, ОбновлятьИнтерфейс = Истина)
	
	Результат = ПриИзмененииРеквизитаСервер(Элемент.Имя);
	
	Если ОбновлятьИнтерфейс Тогда
		ОбновитьИнтерфейс = Истина;
		#Если Не ВебКлиент Тогда
		ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 1, Истина);
		#КонецЕсли
	КонецЕсли;
	
	Элементы.КакПрименитьНастройки.Видимость = Истина;
	Элементы.ОписаниеРаздела.Видимость = Ложь;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	
	Если ОбновитьИнтерфейс = Истина Тогда
		ОбновитьИнтерфейс = Ложь;
		ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Вызов сервера

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	Результат = Новый Структура;
	
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;	
	СохранитьЗначениеРеквизита(РеквизитПутьКДанным, Результат);	
	УстановитьДоступность();	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПредложитьЗаполнитьОбязательныеСвойстваСлушателяУЦ()
	
	Если УправлениеОбучениемСУО.ОбязательныеРеквизитыСлушателяУЦ().НайтиСтроки(
		Новый Структура("Существует", Ложь)).Количество() > 0 Тогда		
		
		Возврат Истина;		
	
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
Функция УстановитьОбязательныеРеквизитыСлушателейНаСервере()
	УправлениеОбучениемСУО.УстановитьОбязательныеРеквизитыСлушателяУЦ();
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Сервер

&НаСервере
Процедура СохранитьЗначениеРеквизита(РеквизитПутьКДанным, Результат)
	
		// Определение имени константы.
	КонстантаИмя = "";
	Если НРег(Лев(РеквизитПутьКДанным, 14)) = НРег("НаборКонстант.") Тогда
		// Если путь к данным реквизита указан через "НаборКонстант".
		КонстантаИмя = Сред(РеквизитПутьКДанным, 15);
	Иначе
		// Определение имени и запись значения реквизита в соответствующей константе из "НаборКонстант".
		// Используется для тех реквизитов формы, которые связаны с константами напрямую (в отношении один-к-одному).
	КонецЕсли;
	
	// Сохранения значения константы.
	Если КонстантаИмя <> "" Тогда
		КонстантаМенеджер = Константы[КонстантаИмя];
		КонстантаЗначение = НаборКонстант[КонстантаИмя];
		
		Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
			КонстантаМенеджер.Установить(КонстантаЗначение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступность()
		
	ВебКабинетИспользуется = ВебКабинетСУ.Используется();
	ЭтоПолныйИнтерфейс = ПолучитьФункциональнуюОпцию("ПолныйИнтерфейсСУО");
	
	Элементы.ГруппаИспользованиеВебКабинетаВложенная.Видимость = ВебКабинетИспользуется;
	Элементы.ГруппаМониторингВебКабинета.Видимость = ВебКабинетИспользуется;
	Элементы.ГруппаРедакцияВебКабинета.Видимость = ВебКабинетИспользуется;
	Элементы.ГруппаУстановкаВебКабинета.Видимость = ВебКабинетИспользуется;
	
	Если ВебКабинетИспользуется Тогда
		ИспользуетсяАвтоматическаяНастройкаВебКабинета = ВебКабинетСУ.ИспользуетсяАвтоматическаяНастройка();
		Элементы.СправочникПубликацииВебКабинетаСУАвтоматическаяНастройка.Видимость = ИспользуетсяАвтоматическаяНастройкаВебКабинета;
		Элементы.СправочникПубликацииВебКабинетаСУПубликации.Видимость = НЕ ИспользуетсяАвтоматическаяНастройкаВебКабинета;
		Элементы.ДекорацияНастроитьВебКабинет.Видимость = ИспользуетсяАвтоматическаяНастройкаВебКабинета;
		Элементы.ДекорацияРучнойРежимВебКабинета.Видимость = НЕ ИспользуетсяАвтоматическаяНастройкаВебКабинета;
	КонецЕсли;
	
	Элементы.ИспользоватьСтудентовСУО.Доступность = НЕ НаборКонстант.ИспользоватьСлушателейСУО;
	Элементы.ИспользоватьСотрудниковСУО.Доступность = НЕ НаборКонстант.ИспользоватьСлушателейСУО;
	
	Элементы.ШкалыОценок.Видимость = НЕ НаборКонстант.ИспользоватьСлушателейСУО;
	Элементы.ШкалаОценокПоУмолчаниюСУО.ТолькоПросмотр = НаборКонстант.ИспользоватьСлушателейСУО;
	
	Элементы.ПредупреждениеИспользоватьЛичныйКабинет.Видимость = НаборКонстант.ИспользоватьВебКабинетСУ И НаборКонстант.ИспользоватьЛичныйКабинетСУО;
	Элементы.ИспользоватьЛичныйКабинетСУО.Доступность = НаборКонстант.ИспользоватьВебКабинетСУ;
	Элементы.ГруппаИспользоватьФорумы.Видимость = ЭтоПолныйИнтерфейс;
	Элементы.ГруппаПричиныВозвратаЗаданий.Видимость = ЭтоПолныйИнтерфейс;
	
КонецПроцедуры


#КонецОбласти

