
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеНовости = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.Новость, "Заголовок, ДатаПубликации, ФорматированныйДокумент");
	
	Заголовок     = Формат(ДанныеНовости.ДатаПубликации, "ДЛФ=D") + ": " + ДанныеНовости.Заголовок;
	Представление = ДанныеНовости.ФорматированныйДокумент.Получить();
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ
