/////////////////////////////////////////////////////////////////
// РАБОТА С ЭЛЕКТРОННЫМИ РЕСУРСАМИ НА КЛИЕНТЕ И СЕРВЕРЕ

Функция ИмяКаталогаЭлектронныхРесурсов() Экспорт
	
	Возврат "v8res";
	
КонецФункции

Функция ПутьККаталогуЭлектронныхРесурсов(Знач ПутьККаталогуДляВыгрузки, Знач ИмяКаталогаЭлектронныхРесурсов=Неопределено) Экспорт
	
	Если ИмяКаталогаЭлектронныхРесурсов = Неопределено Тогда
		ИмяКаталогаЭлектронныхРесурсов = ИмяКаталогаЭлектронныхРесурсов();
	КонецЕсли;
	
	Возврат ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуДляВыгрузки) + ИмяКаталогаЭлектронныхРесурсов);
	
КонецФункции

Функция ПутьККаталогуПубликацийЭлектронногоРесурса(Знач ЭлектронныйРесурс, Знач ПутьККаталогуДляВыгрузки, Знач ИмяКаталогаЭлектронныхРесурсов=Неопределено) Экспорт
	
	Возврат ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуЭлектронныхРесурсов(ПутьККаталогуДляВыгрузки, ИмяКаталогаЭлектронныхРесурсов) + Строка(ЭлектронныйРесурс.УникальныйИдентификатор())); 
	
КонецФункции

Функция ПутьККаталогуПубликацииЭлектронногоРесурса(Знач ЭлектронныйРесурс, Знач КонтрольнаяСумма, Знач ПутьККаталогуДляВыгрузки, Знач ИмяКаталогаЭлектронныхРесурсов=Неопределено) Экспорт
	
	Возврат ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуПубликацийЭлектронногоРесурса(ЭлектронныйРесурс, ПутьККаталогуДляВыгрузки, ИмяКаталогаЭлектронныхРесурсов) + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(КонтрольнаяСумма));
	
КонецФункции


Функция СтрокаПоискаОбозревателя(ЭлектронныйРесурс, ЭлементСодержания=Неопределено, ПрохождениеОбучения=Неопределено, Задание=Неопределено, Вариант=Неопределено, Пользователь=Неопределено, РежимПросмотра=Неопределено, КонтрольнаяСумма=0) Экспорт
	
	СтруктураСсылки = Новый Структура();
	
	Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		СтруктураСсылки.Вставить("res", Строка(ЭлектронныйРесурс.УникальныйИдентификатор()));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлементСодержания) Тогда
		СтруктураСсылки.Вставить("item", Строка(ЭлементСодержания.УникальныйИдентификатор()));	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
		СтруктураСсылки.Вставить("userActivity", Строка(ПрохождениеОбучения.УникальныйИдентификатор()));	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Задание) Тогда
		СтруктураСсылки.Вставить("task", Строка(Задание.УникальныйИдентификатор()));	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Вариант) Тогда
		СтруктураСсылки.Вставить("variant", Строка(Вариант.УникальныйИдентификатор()));	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Пользователь) Тогда
		СтруктураСсылки.Вставить("user", Строка(Пользователь.УникальныйИдентификатор()));	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РежимПросмотра) Тогда
		СтруктураСсылки.Вставить("readonly", ОбщегоНазначенияСУКлиентСервер.БулевоВJSСтроку(РежимПросмотра));
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(КонтрольнаяСумма) Тогда
		СтруктураСсылки.Вставить("checksum", Строка(КонтрольнаяСумма));	
	КонецЕсли;	
	
	Возврат ОбъектыСУЗКлиентСервер.ПолучитьАдресСсылкиИзСтруктуры(СтруктураСсылки);
	
КонецФункции
