

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура РазместитьЗначениеНастройки(Настройка)
	
	ОписаниеТипа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Настройка, "ОписаниеТипа").Получить();
	
	РазработкаСУЗ.РазметитьПолеРедактированияНастройкиИнтерактивногоРесурса(ЭтотОбъект, ОписаниеТипа);
	
КонецПроцедуры


&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//////////////////////////////////////////////////////////////////
	
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Запись);
	РазработкаСУЗ.УстановитьДоступностьДанныхОтПоставщика(ЭтотОбъект,,,"Запись");
	
	//////////////////////////////////////////////////////////////////
	


	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЗначенияНастроекИнтерактивныхРесурсовСУЗ.Номер КАК Номер
			|ИЗ
			|	РегистрСведений.ЗначенияНастроекИнтерактивныхРесурсовСУЗ КАК ЗначенияНастроекИнтерактивныхРесурсовСУЗ
			|ГДЕ
			|	ЗначенияНастроекИнтерактивныхРесурсовСУЗ.СсылкаНаОбъектСУЗ = &СсылкаНаОбъектСУЗ
			|	И ЗначенияНастроекИнтерактивныхРесурсовСУЗ.Настройка = &Настройка
			|
			|УПОРЯДОЧИТЬ ПО
			|	Номер УБЫВ";

		Запрос.УстановитьПараметр("Настройка", Запись.Настройка);
		Запрос.УстановитьПараметр("СсылкаНаОбъектСУЗ", Запись.СсылкаНаОбъектСУЗ);

		Результат = Запрос.Выполнить();

		Если Результат.Пустой() Тогда
			
			Запись.Номер = 1;
			
		Иначе
			
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			
			ВыборкаДетальныеЗаписи.Следующий();
			
			Запись.Номер = ВыборкаДетальныеЗаписи.Номер + 1;
			
		КонецЕсли;

		РазместитьЗначениеНастройки(Запись.Настройка);
		
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РазместитьЗначениеНастройки(ТекущийОбъект.Настройка);
	
	ЭтотОбъект["ЗначениеНастройки"] = ТекущийОбъект.Значение.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Значение      = Новый ХранилищеЗначения(ЭтотОбъект["ЗначениеНастройки"]);
	ТекущийОбъект.Представление = ЭтотОбъект["ЗначениеНастройки"];
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура НастройкаПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ <Наименование>
