Процедура ДобавитьДокументы(ВыборкаДетальныеЗаписи, Знач РежимЗаписи = Неопределено, Знач ОбновлятьПодчиненныеДокументы = Ложь, Важность = 5, Владелец = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДобавитьДокумент(ВыборкаДетальныеЗаписи.Ссылка, РежимЗаписи, ОбновлятьПодчиненныеДокументы,, Важность,Владелец);
	КонецЦикла;	

КонецПроцедуры

Процедура ДобавитьДокумент(СсылкаНаДокумент, РежимЗаписи = Неопределено, ОбновлятьПодчиненныеДокументы = Ложь, НомерПовтора = 0, Важность = 5, Владелец = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
		
	НаборЗаписей = РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Документ.Установить(СсылкаНаДокумент);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Документ = СсылкаНаДокумент;
	НоваяЗапись.РежимЗаписиДокумента = Новый ХранилищеЗначения(РежимЗаписи);
	НоваяЗапись.ДатаДобавления = ТекущаяДата();
	НоваяЗапись.ОбновлятьПодчиненныеДокументы = ОбновлятьПодчиненныеДокументы;
	НоваяЗапись.НомерПовтора = НомерПовтора;
	НоваяЗапись.Важность = Важность;
	НоваяЗапись.Владелец = Владелец;
	
	НаборЗаписей.Записать();

КонецПроцедуры

Функция ЗаданияДляПроведения() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 100
		|	ДокументыДляПерепроведения.Документ КАК Ссылка,
		|	ДокументыДляПерепроведения.РежимЗаписиДокумента,
		|	ДокументыДляПерепроведения.ОбновлятьПодчиненныеДокументы,
		|	ДокументыДляПерепроведения.НомерПовтора,
		|	ДокументыДляПерепроведения.Важность
		|ИЗ
		|	РегистрСведений.ДокументыТребующиеПерепроведенияСУО КАК ДокументыДляПерепроведения
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументыДляПерепроведения.Важность УБЫВ,
		|	ДокументыДляПерепроведения.ДатаДобавления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выбрать();	
	
КонецФункции

Функция ЕстьДокументыВладельца(Владелец) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Владелец) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДокументыТребующиеПерепроведенияСУО.Документ
		|ИЗ
		|	РегистрСведений.ДокументыТребующиеПерепроведенияСУО КАК ДокументыТребующиеПерепроведенияСУО
		|ГДЕ
		|	ДокументыТребующиеПерепроведенияСУО.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();

КонецФункции