
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//////////////////////////////////////////////////////////////////
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Объект);
	РазработкаСУЗ.УстановитьДоступностьДанныхОтПоставщика(ЭтотОбъект);
	//////////////////////////////////////////////////////////////////

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВремяВыполнения(Команда)
	
	ПараметрыФормы = Новый Структура();
	
	ВремяТестаВСекундах = ОбъектыSCORM.ПолучитьКоличествоСекундИзДаты(Объект.ВремяТеста);
	ПараметрыФормы.Вставить("НачальноеЗначение", ВремяТестаВСекундах);
	ПараметрыФормы.Вставить("ТолькоВремя", Истина);

	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьВремяВыполненияПродолжение", ЭтотОбъект);		
	
	ОткрытьФорму("ОбщаяФорма.ВводПериодаСУ", ПараметрыФормы,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВремяВыполненияПродолжение(НоваяСтруктураПериода, ДополнительныеПараметры) Экспорт
	
	Если НоваяСтруктураПериода <> Неопределено Тогда
		
		ПродолжительностьВСекундах = ОбъектыSCORM.ПолучитьКоличествоСекундИзСтруктурыВременногоИнтервала(НоваяСтруктураПериода);
		Объект.ВремяТеста =  ОбъектыSCORM.ПолучитьДатуИзКоличестваСекунд(ПродолжительностьВСекундах);
		
	КонецЕсли;
	
КонецПроцедуры
