#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Функция СписокВыбора() Экспорт
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.ТипыУчебныхМатериаловСУО.ЗаданиеНаПроверку);
	ДанныеВыбора.Добавить(Перечисления.ТипыУчебныхМатериаловСУО.ЭлектронныйУчебник);	
	
	Если ЭлектронноеОбучение.ИспользоватьЭлектронноеОбучение() Тогда
		ДанныеВыбора.Добавить(Перечисления.ТипыУчебныхМатериаловСУО.СлайдовыйКурс);				
	КонецЕсли;	
	
	Если НЕ ЭлектронноеОбучение.ИспользоватьЭлектронноеОбучение() Тогда
		ДанныеВыбора.Добавить(Перечисления.ТипыУчебныхМатериаловСУО.Тест);
	КонецЕсли;		
	
	Возврат ДанныеВыбора;
	
КонецФункции

#КонецОбласти

#КонецЕсли
